<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Nueva intervención manual necesaria en Chakra | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra"><span itemprop="headline">Nueva intervención manual necesaria en Chakra</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/11/nueva-intervencion-manual-necesaria-en.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-11-15T19:07" itemprop="dateModified">Actualizado el sábado, 15 de noviembre de 2014 a las 19:07 UTC</span></div><div><span>
Etiquetado como
tutorial, chakra</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Las distros para usuarios con ciertos conocimientos tienen estas cosas, que de cuando en cuando se precisa intervenir antes de una actualizaci&oacute;n para que el sistema no se vuelva inestable o, directamente, inutilizable. Como suele ocurrir con Chakra, la falta de una, digamos, portavoc&iacute;a en castellano hace que muchos usuarios se alarmen ante un aviso como el que nos ocupa por no entender del todo en qu&eacute; consiste. Callen las alarmas, que aqu&iacute; estamos para traducirlo y explicarlo. Veremos, no obstante, que el proceso no es tan sencillo y no est&aacute; exento de riesgos para nuestro sistema. Es lo que hay...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Sr_s1nPvhdY/VFtt5sZr3wI/AAAAAAAAFPM/B0WoQJ1Ztvo/s1600/instant%C3%A1nea1.png"><img src="http://1.bp.blogspot.com/-Sr_s1nPvhdY/VFtt5sZr3wI/AAAAAAAAFPM/B0WoQJ1Ztvo/s1600/instant%C3%A1nea1.png" height="320" width="400" /></a>
</div>
<br />
<b></b>
<br />
<a></a>
<b>Atenci&oacute;n - Intervenci&oacute;n manual necesaria en la pr&oacute;xima actualizaci&oacute;n masiva</b>
<br />
<b><br /></b>Este anuncio es para informar a los usuarios de Chakra de todos los cambios que vienen con el paso al repositorio estable de un grupo enorme de paquetes. &iexcl;
<b>Por favor, tengan en cuenta que para poder realizar esta actualizaci&oacute;n se necesita una intervenci&oacute;n manual!</b>
<br />
<b><br /></b>El cambio m&aacute;s importante en esta actualizaci&oacute;n se debe a la implementaci&oacute;n de la fusi&oacute;n de los directorios /usr en Chakra. La raz&oacute;n para esta fusi&oacute;n se puede consultar en 
<a href="http://www.freedesktop.org/wiki/Software/systemd/TheCaseForTheUsrMerge/">esta discusi&oacute;n</a> (en ingl&eacute;s), que en pocas palabras se explica como una implementaci&oacute;n necesaria para mejorar la compatibilidad con el desarrollo &quot;upstream&quot;.
<br />
<br />
<b>Los paquetes que incluyen estos cambios van a llegar al repositorio estable en los pr&oacute;ximos d&iacute;as. Se va a lanzar una segunda ISO de la serie Euler al mismo tiempo, </b>para que los usuarios que hagan una nueva instalaci&oacute;n no tengan que realizar el proceso y aquellos que lo encuentren complicado puedan realizar una instalaci&oacute;n limpia desde cero.
<br />
<br />Por desgracia, esta actualizaci&oacute;n no se puede realizar de forma autom&aacute;tica, de modo que para actualizar su sistema deber&aacute; 
<b>seguir cuidadosamente</b>&nbsp;la 
<a href="http://chakraos.org/wiki/index.php?title=Usr_Merge">gu&iacute;a de la wiki</a>, 
<b>paso por paso</b>. Si tiene alguna pregunta relacionada con esto o necesita ayuda, por favor, p&iacute;dala en el 
<a href="http://chakraos.org/forum/viewtopic.php?id=13429">hilo correspondiente</a> del foro.
<br />
<br />Estos son los directorios que cambiar&aacute;n tras la actualizaci&oacute;n:
<br />
<ul>
 <li>/bin pasa a /usr/bin</li>
 <li>/sbin pasa a /usr/sbin</li>
 <li>/lib pasa a /usr/lib</li>
 <li>/lib64 pasa a /usr/lib</li>
 <li>/usr/lib64 pasa /usr/lib</li>
</ul>Adem&aacute;s, la actualizaci&oacute;n incluye los siguientes cambios notables:
<br />
<ul>
 <li><b>Plataforma y aplicaciones KDE </b>4.14.2 y <b>kde-workspace</b>&nbsp;4.11.13. El objetivo de esta actualizaci&oacute;n de KDE es la correcci&oacute;n de errores, habiendo resuelto <a href="https://bugs.kde.org/buglist.cgi?bug_file_loc=&amp;bug_file_loc_type=allwordssubstr&amp;bug_id=&amp;bug_status=RESOLVED&amp;bug_status=VERIFIED&amp;bug_status=CLOSED&amp;bugidtype=include&amp;chfield=cf_versionfixedin&amp;chfieldfrom=2014-01-01&amp;chfieldto=Now&amp;chfieldvalue=4.14.2&amp;cmdtype=doit&amp;email1=&amp;email2=&amp;emailassigned_to2=1&amp;emailcc2=1&amp;emailreporter2=1&amp;emailtype1=substring&amp;emailtype2=substring&amp;field0-0-0=noop&amp;keywords=&amp;keywords_type=allwords&amp;longdesc=&amp;longdesc_type=substring&amp;order=Bug%20Number&amp;query_format=advanced&amp;short_desc=&amp;short_desc_type=allwordssubstr&amp;type0-0-0=noop&amp;value0-0-0=&amp;votes=">m&aacute;s de 35</a>. Para m&aacute;s informaci&oacute;n acerca de este lanzamiento pueden leer el <a href="https://bugs.kde.org/buglist.cgi?bug_file_loc=&amp;bug_file_loc_type=allwordssubstr&amp;bug_id=&amp;bug_status=RESOLVED&amp;bug_status=VERIFIED&amp;bug_status=CLOSED&amp;bugidtype=include&amp;chfield=cf_versionfixedin&amp;chfieldfrom=2014-01-01&amp;chfieldto=Now&amp;chfieldvalue=4.14.2&amp;cmdtype=doit&amp;email1=&amp;email2=&amp;emailassigned_to2=1&amp;emailcc2=1&amp;emailreporter2=1&amp;emailtype1=substring&amp;emailtype2=substring&amp;field0-0-0=noop&amp;keywords=&amp;keywords_type=allwords&amp;longdesc=&amp;longdesc_type=substring&amp;order=Bug%20Number&amp;query_format=advanced&amp;short_desc=&amp;short_desc_type=allwordssubstr&amp;type0-0-0=noop&amp;value0-0-0=&amp;votes=">anuncio oficial</a>.</li>
 <li><b>Kernel de Linux</b>&nbsp;3.16.4</li>
 <li><b>nvidia </b>343.22</li>
 <li>Disponible un paquete <b>nvidia-340xx</b></li>
 <li><b>gcc</b>&nbsp;4.9.1</li>
 <li><b>Libreoffice</b>&nbsp;4.3.2</li>
</ul>Como siempre, 
<b>aseg&uacute;rese de que su repositorio de elecci&oacute;n est&aacute; completamente sincronizado</b>&nbsp;antes de realizar la actualizaci&oacute;n. Para comprobarlo, ejecute mirror-check en Konsole o use la utilidad Mirror-Check, que se encuentra en el apartado &quot;Internet&quot; del men&uacute; de aplicaciones.
<br />
<br />Hasta aqu&iacute; el 
<a href="http://chakraos.org/news/index.php?/archives/134-Warning-Manual-intervention-needed-on-your-next-major-update.html">anuncio oficial</a> publicado en ingl&eacute;s por Neophytos Kolokotronis en la web de Chakra.
<br />El problema es que la p&aacute;gina de la wiki a la que hace referencia est&aacute;, igualmente, en ingl&eacute;s. Dada la importancia capital del asunto, vamos a reproducir aqu&iacute; los pasos a seguir durante la pr&oacute;xima actualizaci&oacute;n para que nuestro sistema siga tan perfecto como suele:
<br />
<br />
<b><u>Actualizaci&oacute;n de Chakra para la unificaci&oacute;n del directorio /usr</u></b>
<br />
<br />
<b>Paso 1: verificar si es necesario actualizar ya</b>
<br />En la actualizaci&oacute;n se incluye linux-3.16.4-1 y glibc-2.20-1. Si hacemos:
<br />
<br />pacman -Si linux
<br />
<br />y
<br />
<br />pacman -Si glibc
<br />
<br />y en la informaci&oacute;n obtenida vemos otras versiones inferiores a las se&ntilde;aladas arriba, eso significa que nuestro repositorio todav&iacute;a no est&aacute; sincronizado y no contiene los paquetes de la nueva actualizaci&oacute;n. Es decir, a&uacute;n no ser&iacute;a el momento de actualizar.
<br />
<br />En caso afirmativo hay una cosa muy importante a tener en cuenta: una vez iniciado el proceso hay que terminarlo por completo, o el sistema no podr&aacute; arrancar. De igual modo, no se debe, bajo ning&uacute;n concepto, forzar la actualizaci&oacute;n con el par&aacute;metro --force.
<br />
<br />
<b>Paso 2: preparar la actualizaci&oacute;n</b>
<br />En lugar de hacer, como solemos, &quot;sudo&quot; para actualizar con pacman, dadas las caracter&iacute;sticas un tanto especiales de esta actualizaci&oacute;n vamos a &quot;loguearnos&quot; como root, haciendo:
<br />
<br />su
<br />
<br />e introduciendo nuestra contrase&ntilde;a. Luego ya podemos continuar. Si hici&eacute;ramos en este momento un &quot;pacman -Syu&quot;, la consola, con toda probabilidad, nos arrojar&iacute;a mensajes sobre conflictos con /bin, /sbin, /lib, /lib64 y /usr/lib64. De modo que tenemos que hacer algunas cosillas antes.
<br />
<br />
<b>Paso 3: borrar archivos no necesarios</b>
<br />Tenemos que eliminar, por un lado, archivos en los directorios conflictivos que no pertenecen a ning&uacute;n paquete. La lista se obtiene as&iacute;:
<br />
<br />find /lib /lib64 /usr/lib64 /bin /sbin -exec pacman -Qoq -- {} + &gt; /dev/null
<br />
<br />El resultado m&aacute;s probable es alg&uacute;n error relacionado con la no existencia de alg&uacute;n archivo, o bien una salida vac&iacute;a (como en mi caso). Tambi&eacute;n pueden aparecer aqu&iacute; ficheros de virtualbox relacionados con el kernel. Si obtenemos mensajes del tipo &quot;error: no package owns [archivo]&quot;, dicho fichero se puede eliminar.
<br />
<br />Y, por otro lado, los archivos en dichos directorios que pertenecen a algunos paquetes no oficiales (mayoritariamente de CCR, o compilados por el propio usuario). En este caso, se averiguan:
<br />
<br />pacman -Qqo /bin /sbin /lib /lib64 /usr/lib64 | pacman -Qm -
<br />
<br />Aqu&iacute; tambi&eacute;n puede aparecer el error de no existencia de /usr/lib64. Podemos entonces obviarlo y hacer:
<br />
<br />pacman -Qqo /bin /sbin /lib /lib64 | pacman -Qm -
<br />
<br />que, en mi caso, da como resultado una l&iacute;nea vac&iacute;a. Si no es vuestro caso, deb&eacute;is borrar dichos paquetes y volverlos a instalar despu&eacute;s de la actualizaci&oacute;n. Para borrar, como siempre:
<br />
<br />pacman -R paquete en cuesti&oacute;n
<br />
<br />
<b>Paso 4: actualizaci&oacute;n</b>
<br />Es estrictamente necesario seguir los pasos siguientes en orden y de un modo continuado, esto es, sin que medie un reinicio, un cierre de la terminal o un &quot;logout&quot;. De lo contrario, adi&oacute;s Chakra. Si est&aacute;s en un port&aacute;til, muy importante recordar hacerlo con la fuente de alimentaci&oacute;n conectada a la corriente. 
<b>S&Iacute;, AS&Iacute; DE SERIA ES LA COSA.</b>
<br />
<br />Si no estamos como root, hacemos &quot;su&quot; o &quot;sudo su&quot;, tanto monta, monta tanto, para &quot;loguearnos&quot; como super-usuario. Y all&aacute; vamos:
<br />
<br />pacman -Sy
<br />
<br />pacman -Su --ignore glibc,lib32-gcc-libs,filesystem,bash
<br />
<br />pacman -Su --ignore filesystem,bash
<br />
<br />pacman -Su --ignore filesystem
<br />
<br />pacman -Su
<br />
<br />Los mensajes que aparezcan del tipo &quot;dependencias no resolubles&quot; (&quot;unresolvable dependencies&quot;) deben ser contestados con un S&iacute; o Yes.
<br />
<br />Aunque tambi&eacute;n se actualizar&aacute; el kernel, depmod y mkinitcpio van a arrojar algunos errores por no estar los enlaces simb&oacute;licos a&uacute;n apuntando al lugar correcto. Es seguro ignorar estos errores, 
<b>PERO NO REINICIES EL SISTEMA</b>&nbsp;ya que el kernel no va a funcionar todav&iacute;a. Si durante la &uacute;ltima operaci&oacute;n de actualizaci&oacute;n pacman arroja errores por conflicto de archivos significar&iacute;a que todav&iacute;a quedan ficheros en /lib que eliminar, por lo que deber&iacute;as volver al paso 3.
<br />
<br />
<b>Paso 5: vamos acabando</b>
<br />Uff, esto se est&aacute; haciendo largo. Nos queda comprobar que nada queda en /lib, con:
<br />
<br />ls -l /lib*
<br />
<br />lo cual debe arrojar algo como esto, con la fecha y hora variable en cada sistema:
<br />
<br />lrwxrwxrwx 1 root root 7 Sep 15 16:53 /lib -&gt; usr/lib
<br />lrwxrwxrwx 1 root root 7 Sep 15 16:53 /lib64 -&gt; usr/lib
<br />
<br />Solo resta reconstruir la imagen del kernel, reinstalando el paquete:
<br />
<br />pacman -S linux
<br />
<br />&oacute; bien, si usas el kernel de soporte extendido:
<br />
<br />pacman -S linux-lts
<br />
<br />En esta oportunidad, no habr&aacute; mensajes de error de depmod. Y ya, ahora s&iacute; que s&iacute;, podemos reiniciar el sistema y respirar profundamente. Como en esta actualizaci&oacute;n tambi&eacute;n se incluye un nuevo Grub, para evitarnos males mayores conviene reinstalarlo tambi&eacute;n con:
<br />
<br />grub-install /dev/sdX (donde X es la unidad donde tenemos el Grub, generalmente la a)
<br />
<br />update-grub
<br />
<br />Y listo. Veamos ahora soluciones a los posibles errores.
<br />
<br />
<b>Error 1: no usar &quot;root&quot; para actualizar</b>
<br />Si se nos ha pasado hacer todo el proceso anterior como super-usuario, y hemos empleado sudo en su lugar, puede que tengamos problemas tras actualizar el paquete bash. En la wiki aconsejan hacer:
<br />
<br />sudo -s /usr/bin/bash -
<br />
<br />
<b>Error 2: olvidarse de reconstruir el kernel tras actualizar</b>
<br />Mira que lo advertimos, pero a&uacute;n as&iacute;, si se te ha pasado... no vas a poder entrar a tu sistema. Debes localizar el disco de Chakra y entrar al entorno en vivo. Desde all&iacute;, con Konsole por ejemplo, pasa a ser super-usuario con:
<br />
<br />su
<br />
<br />La contrase&ntilde;a es root. Ahora deber&aacute;s montar tu partici&oacute;n con Chakra y hacer &quot;chroot&quot; para reconstruir la imagen del kernel. Siendo X la partici&oacute;n de Chakra:
<br />
<br />mkdir /chakra_root
<br />
<br />mount /dev/sdX /chakra_root
<br />
<br />mount -o bind /dev /chakra_root/dev
<br />
<br />mount -o bind /tmp /chakra_root/tmp
<br />
<br />mount -o bind /sys /chakra_root/sys
<br />
<br />mount -o bind /proc /chakra_root/proc
<br />
<br />Si usas un partici&oacute;n separada para /boot, tambi&eacute;n deber&aacute;s montarla, aunque no es el caso habitual en usuarios menos avanzados. Finalmente hacemos:
<br />
<br />chroot /chakra_root
<br />
<br />Y ya estamos dentro de nuestra partici&oacute;n ra&iacute;z. Solo queda reconstruir la imagen del kernel, como indicamos m&aacute;s arriba, instalando bien el paquete linux o el linux-lts.
<br />
<br />Pues... &iexcl;ya est&aacute;! &iquest;A que ha sido f&aacute;cil? Por las &quot;
<a href="http://sevillapedia.wikanda.es/wiki/Expresiones_de_Tocina#P">quejilas</a>&quot;, que decimos por mi tierra... Es por cosillas como esta que vemos hoy que Chakra no es, ni jam&aacute;s podr&aacute; ser, apta para usuarios noveles. Lo escribo como lo siento despu&eacute;s de pegarme una ma&ntilde;ana entera tratando de ayudar a los usuarios no angloparlantes de la distro. Espero, al menos, que llegado el d&iacute;a &quot;D&quot; de la actualizaci&oacute;n, no tengamos crujir de dientes y llantos a mansalva. Yo m&aacute;s no puedo hacer, que haya suerte.
<br />
<br />Salud
<br />
<br />P.D.: si llevas tiempo pensando en hacer una nueva instalaci&oacute;n de Chakra, el momento ha llegado. Espera a que salga la nueva ISO de Euler (la que ya contiene la actualizaci&oacute;n dichosa) y ah&oacute;rrate todo este suplicio.</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" st_title="Nueva intervención manual necesaria en Chakra | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1096,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>