<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2015-01-12T00:13:20Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2015-01-12T00:13:20Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Como mostrar los acentos y las ñ en HTML</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-mostrar-los-acentos-y-las-n-en-html" />
    <category term="html" />
    <category term="acentos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-15T08:12:31Z</updated>
    <published>2014-10-15T08:12:31Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Este articulo va especialmente dirigido a Victor y Petrus, dos usuarios que est&amp;aacute;n siguiendo el curso de HTML que tengo en este blog, aunque los dem&amp;aacute;s tambi&amp;eacute;n pod&amp;eacute;is leerlo ;D. La raz&amp;oacute;n es que han empezado a seguir el curso de &lt;strong&gt;HTML&lt;/strong&gt; que hice y los dos se han encontrado con un problema, yo tambi&amp;eacute;n lo tuve al principio y es que al escribir texto para mostrar en el navegador los &lt;strong&gt;acentos&lt;/strong&gt; y las “&lt;strong&gt;&amp;ntilde;&lt;/strong&gt;” no aparecen correctamente, en su lugar aparecen caracteres extra&amp;ntilde;os, esto tiene muy f&amp;aacute;cil soluci&amp;oacute;n.&lt;/p&gt; 
&lt;p&gt;Este problema viene ya que no hemos definido el juego de caracteres que va a manejar la web, normalmente en un servidor esta definido por defecto uno que nos permitir&amp;aacute; que la web se vea correctamente, pero tampoco esta de mas incluir la linea de c&amp;oacute;digo, por si acaso. Os voy a poner un c&amp;oacute;digo de ejemplo de una web muy sencilla que tiene los caracteres “conflictivos”:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-mostrar-los-acentos-y-las-n-en-html"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-15T08:12:31Z</dc:date>
  </entry>
  <entry>
    <title>Acelerar tu página web retardando la carga de ciertos contenidos secundarios</title>
    <link rel="alternate" href="http://www.blogstack.info/post/placerdigital/2014/06/acelerar-tu-pagina-web-retardando-la-carga-de-ciertos-contenidos-secundarios" />
    <category term="blog-stack" />
    <category term="programacion" />
    <category term="html" />
    <category term="javascript" />
    <category term="tutoriales" />
    <author>
      <name>Ricardo Barra</name>
    </author>
    <updated>2014-06-17T17:10:26Z</updated>
    <published>2014-06-17T17:10:26Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Cuando en una p&amp;aacute;gina web o blog hay muchos comentarios, cada uno de ellos tiene un avatar asociado. Cada avatar es una imagen distinta y si el post o art&amp;iacute;culo es popular, podemos tener decenas de im&amp;aacute;genes al final de la p&amp;aacute;gina que &lt;strong&gt;retrasar&amp;aacute;n la velocidad de carga de &amp;eacute;sta&lt;/strong&gt;. Peor a&amp;uacute;n, como en esos casos hay que hacer muchas solicitudes al servidor (HTTP requests) para que cargue cada imagen por separado, eso puede impedir que se carguen antes otros elementos importantes para el aspecto de la p&amp;aacute;gina, tales como estilos CSS u otras im&amp;aacute;genes.&lt;/p&gt; 
&lt;p&gt;Para acelerar la velocidad de carga de una p&amp;aacute;gina web y as&amp;iacute; ofrecer una mejor experiencia al usuario, &lt;strong&gt;existen formas de lograr que los avatares u otros elementos sean los &amp;uacute;ltimos en cargar&lt;/strong&gt;. Muchas veces no necesitamos que las im&amp;aacute;genes de perfil de los comentaristas se muestren inmediatamente, ya que primero nos interesa leer el contenido principal. Puede incluso que ni siquiera necesitemos ver los comentarios.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/placerdigital/2014/06/acelerar-tu-pagina-web-retardando-la-carga-de-ciertos-contenidos-secundarios"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Ricardo Barra</dc:creator>
    <dc:date>2014-06-17T17:10:26Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Bluefish en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/que-es-y-como-instalar-bluefish-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="css" />
    <category term="bluefish" />
    <category term="html" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-08T13:16:03Z</updated>
    <published>2014-05-08T13:16:03Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Cuando queremos hacer paginas web es recomendable contar con un editor de texto avanzado y que ese editor de texto tenga herramientas y utilidades que nos puedan hacer la vida mas f&amp;aacute;cil a la hora de escribir c&amp;oacute;digo. Este es el caso de &lt;strong&gt;Bluefish&lt;/strong&gt;, un potente editor de texto avanzado para programadores web, en este articulo os voy a hablar un poco sobre el y &lt;strong&gt;como instalarlo en Ubuntu mediante PPA&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;Como la mayor&amp;iacute;a de los entornos de programaci&amp;oacute;n de hoy en d&amp;iacute;a &lt;strong&gt;Bluefish&lt;/strong&gt; soporta una gran variedad de lenguajes, pero &lt;strong&gt;esta especializado&lt;/strong&gt; en lenguajes orientados al dise&amp;ntilde;o de paginas &lt;strong&gt;web&lt;/strong&gt;. Es un programa bastante ligero, mas incluso que Geany. Como ya he dicho esta especializado en el dise&amp;ntilde;o de paginas web y nos damos cuenta de ello seg&amp;uacute;n abrimos el programa una vez instalado. Cuando abrimos el programa podemos ver lo siguiente:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/que-es-y-como-instalar-bluefish-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-08T13:16:03Z</dc:date>
  </entry>
  <entry>
    <title>BlueFish, un potente editor para desarrollo web.</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/03/bluefish-un-potente-editor-para-desarrollo-web" />
    <category term="web" />
    <category term="programacion" />
    <category term="gnu-linux" />
    <category term="css" />
    <category term="c" />
    <category term="bluefish" />
    <category term="php" />
    <category term="desarrollo" />
    <category term="python" />
    <category term="html" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-03-10T13:21:25Z</updated>
    <published>2014-03-10T13:17:15Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/03/bluefish.png"&gt;&lt;img alt="bluefish" src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/03/bluefish-150x150.png" width="150" height="150" /&gt;&lt;/a&gt;En castellano usamos frecuentemente la frase “Hay muchos peces en el mar”, seg&amp;uacute;n la circunstancia. Hoy hablaremos de un jugoso pez azul, que nos puede facilitar mucho las cosas, sobre todo para los desarrolladores web.&lt;/p&gt; 
&lt;p&gt;En &lt;a title="GNU/Linux art&amp;iacute;culo" href="http://www.ochobitshacenunbyte.com/?p=31"&gt;GNU/Linux &lt;/a&gt;tenemos un sin fin de editores. Bluefish es un potente editor de texto enfocado al desarrollador.&amp;nbsp; C&amp;oacute;mo caracter&amp;iacute;sticas principales tenemos el resaltado de sintaxis, el apoyo a los proyectos, la sangr&amp;iacute;a, la auto-realizaci&amp;oacute;n, etc&amp;eacute;tera.&amp;nbsp; &amp;iquest;Qu&amp;eacute; diferencia Bluefish de otros editores con funciones similares?&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Partimos de la base que puede editar c&amp;oacute;digo para lenguajes como C, C++, Python entre otros. Pero d&amp;oacute;nde desmarca claramente es para el desarrollo web, ya que tiene soporte para HTML, CSS y PHP, adem&amp;aacute;s proporciona una lista todas las etiquetas HTML, y eso facilita mucha las cosas.&amp;nbsp; &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/03/bluefish-un-potente-editor-para-desarrollo-web"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-03-10T13:17:15Z</dc:date>
  </entry>
</feed>

