<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Conferencia BilboStack 2015 | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2015/01/conferencia-bilbostack-2-15"><span itemprop="headline">Conferencia BilboStack 2015</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2015/01/conferencia-bilbostack-2015/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-01-18T15:00" itemprop="dateModified">Actualizado el domingo, 18 de enero de 2015 a las 15:00 UTC</span></div><div><span>
Etiquetado como
blog-stack, planeta-linux, planeta-codigo</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right; text-align: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/bilbostack.png" alt="BilboStack" title="BilboStack" /> 
</div> 
<p>Un a&ntilde;o m&aacute;s una de las primeras conferencias del a&ntilde;o se ha celebrado en Bilbao, la <a href="http://bilbostack.com/">BilboStack</a> 2015. Esta edici&oacute;n del 2015 ha sido la cuarta entrega donde varios profesionales del sector de las tecnolog&iacute;as han hablado de diversos temas, desde programaci&oacute;n hasta metodolog&iacute;as de desarrollo y algunas otras cosas relacionadas con la tecnolog&iacute;a y el desarrollo. Cada a&ntilde;o la BilboStack acoge a m&aacute;s asistentes en la <a href="http://www.deusto.es">Universidad de Deusto</a> dando lugar este a&ntilde;o a un cambio de ubicaci&oacute;n dentro de la propia universidad para poder dar cabida a todos de forma m&aacute;s c&oacute;moda. Como en ediciones anteriores este a&ntilde;o ha seguido manteni&eacute;ndose gratuita, lo &uacute;nico necesario ha sido el registro para adquirir la entrada.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/universidad.jpg" title="Universidad de Deusto"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/universidad-thumb.jpg" /></a> 
</div> 
<p>Hasta el momento el formato de la conferencia ha sido presentaciones de 45 minutos en dos tracks simult&aacute;neos en horario &uacute;nicamente de ma&ntilde;ana y durante un d&iacute;a, siendo la agenda de este 2015 la siguiente:</p> 
<table> 
 <thead> 
  <tr>
   <th width="140px">Hora</th> 
   <th>Track 1</th> 
  </tr>
 </thead> 
 <tbody> 
  <tr> 
   <td>9:00 - 9:45</td> 
   <td>Desarrollo de aplicaciones web con .NET en MAC: open source, multiplataforma e incluso gratuito <em>por Ibon Landa</em></td> 
  </tr> 
  <tr> 
   <td>10:00 - 10:45</td> 
   <td>Google es ciego <em>por Oihana Alberdi</em></td> 
  </tr> 
  <tr> 
   <td>11:15 - 12:00</td> 
   <td>Descubriendo los Beacons <em>por Borja Reinares</em></td> 
  </tr> 
  <tr> 
   <td>12:15 - 13:00</td> 
   <td>&iquest;Qu&eacute; es eso de IoT? <em>por Quique Martinez</em></td> 
  </tr> 
  <tr> 
   <td>13:15 - 14:00</td> 
   <td>Bomberos pir&oacute;manos <em>por Ujue Agudo y Aritz Suescun</em></td> 
  </tr> 
 </tbody> 
</table> 
<table> 
 <thead> 
  <tr>
   <th width="140px">Hora</th> 
   <th>Track 2</th> 
  </tr>
 </thead> 
 <tbody> 
  <tr> 
   <td>9:00 - 9:45</td> 
   <td>Errores comunes en la visualizaci&oacute;n de datos y algunas soluciones <em>por Pablo Garaizar</em></td> 
  </tr> 
  <tr> 
   <td>10:00 - 10:45</td> 
   <td>ReactJS: un enfoque distinto a la UI en JavaScript <em>por Eduard Tom&aacute;s</em></td> 
  </tr> 
  <tr> 
   <td>11:15 - 12:00</td> 
   <td>Creando directivas para AngularJs <em>por Hugo Biarge</em></td> 
  </tr> 
  <tr> 
   <td>12:15 - 13:00</td> 
   <td>WordPress al limite <em>por Asier Marqu&eacute;s</em></td> 
  </tr> 
  <tr> 
   <td>13:15 - 14:00</td> 
   <td>Arquitectura frontend de CartoDB <em>por Javi Santana</em></td> 
  </tr> 
 </tbody> 
</table> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/track1.jpg" title="Sala track 1"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/track1-thumb.jpg" /></a> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/track2.jpg" title="Sala track 2"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/track2-thumb.jpg" /></a> 
</div> 
<p>Como cada a&ntilde;o no puede faltar alguna presentaci&oacute;n del ubicuo Javascript y en <a href="https://www.youtube.com/user/elComiteOrg/playlists">las presentaciones de a&ntilde;os anteriores</a> ha habido de PHP, Python, Groovy y .NET pero a&uacute;n no ha habido ninguna de Java (a pesar de que ser&aacute; uno de los m&aacute;s usados por los asistentes). Despu&eacute;s de revisar la agenda de este a&ntilde;o he asistido &uacute;nicamente y a todas a las presentaciones del track 1. Del track 2 me llamaban la atenci&oacute;n la de ReactJS, pero es una herramienta que ya conozco y que me parece de lo mejor para su prop&oacute;sito a&uacute;n as&iacute; intu&iacute;a que iba a conocer poco nuevo despu&eacute;s de escribir el art&iacute;culo <a href="http://picodotdev.github.io/blog-bitix/2014/04/ejemplo-lista-de-tareas-con-backbone-y-react/">Ejemplo lista de tareas con Backbone y React</a> y usarlo en el ejemplo simple pero ilustrativo mostrado. Tambi&eacute;n me llamaba la atenci&oacute;n Wordpress al l&iacute;mite y Arquitectura frontend de CartoDB. A continuaci&oacute;n un resumen breve de cada una de las presentaciones a las que he asistido.</p>  
<h3>Desarrollo de aplicaciones web con .NET en MAC: open source, multiplataforma e incluso gratuito <em>por Ibon Landa</em></h3> 
<p>Yo me muevo alrededor de la plataforma <a href="http://www.oracle.com/technetwork/es/java/javase/downloads/index.html">Java</a> en vez de <a href="http://www.microsoft.com/net">.NET</a> pero parece que Microsoft est&aacute; dando un giro a su plataforma para dar cabida a opciones como <a href="http://linux.com/">Linux</a> o <a href="http://store.apple.com/es/mac">Mac</a> y hacerla un poco m&aacute;s abierta tanto en su desarrollo como en su comunidad. Creo que m&aacute;s bien por necesidad que por ser buenos, en el &aacute;mbito empresarial y de servidores Java est&aacute; mucho m&aacute;s establecido y tiene algunas comunidades y projectos m&aacute;s cerca del software libre y del c&oacute;digo abierto como <a href="http://httpd.apache.org/">Apache</a>, <a href="https://spring.io/">Spring</a> o <a href="http://jboss.org/">JBoss</a> que adem&aacute;s proporcionan proyectos de gran calidad y utilidad sin costes de licencias. El software libre, el c&oacute;digo abierto y el coste de las licencias son argumentos de venta y se toman en consideraci&oacute;n, si Microsoft no quiere dejar aislado a .NET en su propia plataforma Windows que a&uacute;n con una gran cuota en el escritorio, en un futuro probablemente disminuya y mucha menos cuota en los servidores, no le queda m&aacute;s remedio que abrirse. Pero esta solo es mi opini&oacute;n, en cualquier caso me parece un buen paso y bienvenido es.</p> 
<p>La nueva plataforma de .NET comentada en la presentaci&oacute;n aparte de ser agn&oacute;stico en el sistema operativo trata de ser agn&oacute;stico y quiz&aacute; por facilidad de implementaci&oacute;n cualquiera de ellos en las herramientas de desarrollo, de este modo, en esta nueva versi&oacute;n para el desarrollo no ser&aacute; necesario <a href="http://www.visualstudio.com/">Microsoft Visual Studio</a> y podr&aacute; hacerse con cualquier editor de texto (<a href="http://www.sublimetext.com/">Sublime</a>, <a href="http://www.vim.org/">vim</a>, <a href="http://www.gnu.org/software/emacs/">emacs</a> o notepad) y desde la terminal. Esta nueva visi&oacute;n agn&oacute;stica de las herramientas hace que puedan ser utilizadas las que m&aacute;s adecuadas consideremos para una tarea aparte de las que ofrezca la propia Microsoft como <a href="http://gruntjs.com/">Grunt</a>, <a href="http://bower.io/">Bower</a>, <a href="http://karma-runner.github.io/">Karma</a>, <a href="http://jasmine.github.io/">Jasmine</a>.</p> 
<p>Despu&eacute;s de la presentaci&oacute;n me planteo aprender algo de .NET porque siendo pragm&aacute;tico hay una buena cantidad de ofertas de trabajo solicitando conocimientos en esta plataforma y algunas aparentemente interesantes.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/dotnet.jpg" title="Desarrollo de aplicaciones web con .NET en MAC o Linux"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/dotnet-thumb.jpg" /></a> 
</div> 
<h3>Google es ciego <em>por Oihana Alberdi</em></h3> 
<p>El t&iacute;tulo de la presentaci&oacute;n viene motivado porque Google procesa el contenido no como lo vemos nosotros en el navegador sino por ejemplo sin estilos, de modo que dando importancia como est&aacute; definido el contenido en el html de una p&aacute;gina y haciendo que sea accesible mejoraremos como es indexada la p&aacute;gina por Google y por tanto su posicionamiento en el buscador, pero tambi&eacute;n mejorando la accesibilidad de una p&aacute;gina ayudaremos a que las personas con alg&uacute;n tipo de impedimento pueda acceder el contenido de forma m&aacute;s c&oacute;moda.</p> 
<p>En la mejora de la accesibilidad de una p&aacute;gina intervienen tanto dise&ntilde;adores (tipograf&iacute;a, colores, estilos externalizados) como desarrolladores (c&oacute;digo html limpio, javascript no intrusivo) y pueden ayudarse de herramientas como <a href="http://validator.w3.org/">validadores de HTML</a>, <a href="http://jigsaw.w3.org/css-validator/">validadores de CSS</a>, <a href="http://www.tawdis.net/">validadores de accesibilidad</a>. Tambi&eacute;n podemos comprobar como se ve una p&aacute;gina sin estilos (como es accedida por google), con javascript deshabilitado, a&ntilde;adiendo atributos alt (como a im&aacute;genes), a&ntilde;adiendo teclas de acceso, … algunas de estas cosas pueden probarse r&aacute;pidamente con el <a href="https://addons.mozilla.org/es/firefox/addon/web-developer/">plugin web developer de Firefox</a>.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/google-es-ciego.jpg" title="Google es ciego"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/google-es-ciego-thumb.jpg" /></a> 
</div> 
<h3>Descubriendo los Beacons <em>por Borja Reinares</em></h3> 
<p>La verdad es que no conoc&iacute;a de nada que eran en el mundo tecnol&oacute;gico los <em>beacons</em> salvo por lo poco que puede proporcionar su nombre, en la descripci&oacute;n de la charla no aparec&iacute;a ning&uacute;n texto de descripci&oacute;n. Mediante alg&uacute;n <a href="http://www.20minutos.es/noticia/2052004/0/beacons/mejor-que-gps/geolocalizacion/">art&iacute;culo</a> he podido conocer algo sobre ellos y por donde pod&iacute;a ir la charla. La alternativa era la presentaci&oacute;n de <a href="https://angularjs.org/">AngularJS</a> y personalmente estando m&aacute;s convencido de la opci&oacute;n <a href="http://backbonejs.org/">Backbone</a> y <a href="http://facebook.github.io/react/">ReactJS</a> prefer&iacute;a conocer algo de los <em>beacons</em>.</p> 
<p>Como su nombre indica un <em>beacon</em> o baliza es un dispositivo que emite una se&ntilde;al identificable, por bluethooth (<a href="http://en.wikipedia.org/wiki/Bluetooth_low_energy">Bluethooth Low Energy</a>, BLE). Posteriormente, un dispositivo como un tel&eacute;fono inteligente (Android, iPhone o Windows Phone) con una aplicaci&oacute;n instalada permite procesar esa se&ntilde;al para ofrecer alguna funci&oacute;n &uacute;til para el usuario en base a la distancia hasta la baliza (0,5 metros, 2m, 30m), estas sol algunas <a href="http://en.wikipedia.org/wiki/Bluetooth_low_energy#Applications">aplicaciones de los <em>beacons</em> con BLE</a>. Algunos usos que se est&aacute;n dando a esta tecnolog&iacute;a es en las Apple Store o en algunas tienda de ropa de EEUU.</p> 
<p>BLE es distinto de NFC, BLE es una comunicaci&oacute;n de 1:N, consume bater&iacute;a y el usuario no tiene que hacer nada, por el contrario, NFC es una comunicaci&oacute;n 1:1, no consume energ&iacute;a (considerable) y necesita la intervenci&oacute;n del usuario. Entre los retos de los <em>beacons</em> que debe resolver es el consumo de energ&iacute;a, necesita una aplicaci&oacute;n instalada en el dispositivo, la reticencia del usuario a perder privacidad o problemas legales de protecci&oacute;n de datos.</p> 
<p>Los <em>beacons</em> y BLE puede ser un nuevo campo tecnol&oacute;gico, veremos si realmente se convierte en &uacute;til y se implanta su uso o si finalmente desaparece y posteriormente resurge como un nuevo concepto basado en el anterior que finalmente sea usado.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/beacons.jpg" title="Descubriendo los Beacons"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/beacons-thumb.jpg" /></a> 
</div> 
<h3>&iquest;Qu&eacute; es eso de IoT? <em>por Quique Martinez</em></h3> 
<p>El <a href="http://es.wikipedia.org/wiki/Internet_de_las_cosas">internet de las cosas</a> (IoT) es otro palabro que aprender, salvo que ahora tiene un nombre mol&oacute;n es la consecuencia de la evoluci&oacute;n de la tecnolog&iacute;a, no es m&aacute;s que encontrar una aplicaci&oacute;n &uacute;til a los dispositivos que tienen tendencia a ser cada vez m&aacute;s peque&ntilde;os, baratos, que pueden usar m&uacute;ltiples sensores y con la posibilidad de estar conectados a internet.</p> 
<p>El n&uacute;mero de estos dispositivos aumentar&aacute; r&aacute;pidamente en los pr&oacute;ximos a&ntilde;os tratando de ofrecer funciones &uacute;tiles tanto para las empresas como para las personas. Por ejemplo, quiz&aacute; en un futuro un seguro requiera que el veh&iacute;culo asegurado disponga un dispositivo de estos con sensores como aceler&oacute;metro, veloc&iacute;metro u otros datos cuantificables que puedan ser utilizados para determinar sin en un accidente se circulaba a m&aacute;s de 120 km/h o hacer una llamada de emergencia en su caso.</p> 
<p>Otro nuevo &aacute;rea tecnol&oacute;gico en el que descubrir aplicaciones &uacute;tiles y con gran potencial.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/iot.jpg" title="Internet de las cosas (IoT)"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/iot-thumb.jpg" /></a> 
</div> 
<h3>Bomberos pir&oacute;manos <em>por Ujue Agudo y Aritz Suescun</em></h3> 
<p>Durante el desarrollo de un proyecto de software en alg&uacute;n momento alguien (cliente, usuario, desarrollador, consultor, jefe de proyecto, dise&ntilde;ador, …) involucrado puede tener la sensaci&oacute;n o certeza de que el producto que se est&aacute; desarrollando no resuelve en alguna medida las necesidades del cliente y los usuarios y/o no es motivo de orgullo de los que lo realizan. El concepto de bombero pir&oacute;mano trata de identificar estos problemas y hacerlos visibles para todos los involucrados y “prender un fuego” con ellos como har&iacute;a un pir&oacute;mano. Sin embargo, estos fuegos pueden presentar peligros para el proyecto en el momento que no son tomadas medidas para apagarlos o resolverlos como har&iacute;a un bombero. De esta forma se presenta el concepto de bombero pir&oacute;mano formado por estos dos opuestos.</p> 
<p>En <a href="http://www.biko2.com/">Biko</a> siguen tres ideas para mantener estos fuegos controlados:</p> 
<ol> 
 <li>Quemar cuanto antes. Cuanto antes se prenda el fuego m&aacute;s margen de maniobra habr&aacute; en el proyecto haciendo con m&aacute;s garant&iacute;as de que cumpla su objetivo y evitar&aacute; malgastar tiempo, dinero y esfuerzo en el desarrollo.</li> 
 <li>Todo el equipo comparte la misma visi&oacute;n del proyecto. El esfuerzo es compartido por todos los involucrados evitando sorpresas cuando un fuego obliga a cambiar las funcionalidades seg&uacute;n las restricciones que presenten los involucrados como prioridades o el mismo proyecto en tiempo o coste.</li> 
 <li>Mantener equilibrio constante. En el momento que aparece un fuego hay que tomar medidas para apagarlo evitando as&iacute; perder el control del proyecto.</li> 
</ol> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/bomberos-piromanos.jpg" title="Bombero pir&oacute;mano"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/62/bomberos-piromanos-thumb.jpg" /></a> 
</div>  
<p>Por desgracia este a&ntilde;o no ha sido posible grabar en v&iacute;deo las presentaciones pero pasados unos d&iacute;as seguro que se publican las diapositivas, sin embargo, con &uacute;nicamente las diapositivas pierde mucho del contenido respecto a la presentaci&oacute;n dada en vivo. En algunas presentaciones al menos se ha recogido el audio:</p> 
<ul> 
 <li>Desarrollo de aplicaciones web con .NET en MAC: open source, multiplataforma e incluso gratuito <em>por Ibon Landa</em> <a href="http://www.slideshare.net/ibonilm/open-source-and-cross-platform-net">Diapositivas</a></li> 
 <li>Errores comunes en la visualizaci&oacute;n de datos y algunas soluciones <em>por Pablo Garaizar</em> <a href="http://www.slideshare.net/txipi/bilbostack2015-garaizar">Diapositivas</a> <a href="http://www.goear.com/listen/b120854/errores-comunes-visualizacion-datos-algunas-soluciones-pgaraizar">Audio</a></li> 
 <li>Wordpress al l&iacute;mite <em>por Asier Marqu&eacute;s</em> <a href="http://www.goear.com/listen/98b0c09/wordpress-al-limite-asier-marques">Audio</a></li> 
 <li>Arquitectura de CartoDB <em>por Javi Santana</em> <a href="http://www.goear.com/listen/f1cd19b/arquitectura-cartodb-javi-santana">Audio</a></li> 
</ul> 
<p>Tambi&eacute;n en una <a href="https://www.youtube.com/user/elComiteOrg/playlists">lista de reproducci&oacute;n</a> de YouTube de <a href="http://elcomite.org/">elComite</a> est&aacute;n disponibles casi todas las presentaciones de las ediciones 2012, 2013 y 2014 con las que saciar tu curiosidad. Para el a&ntilde;o que viene si tienes posibilidad de ofrecerte para grabar las presentaciones con una c&aacute;mara para poder publicarlas m&aacute;s tarde casi seguro que los organizadores estar&iacute;an agradecidos y dispuestos a darte facilidades para ello.</p> 
<p>Nuevamente esta edici&oacute;n de la BilbaoStack ha sido excelente gracias a sus organizadores, ponentes, Universidad de Deusto y asistentes, esperemos que en el 2016 continuemos disfrutando de esta gran conferencia.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15" st_title="Conferencia BilboStack 2015 | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "Conferencia BilboStack 2015";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2015/01/conferencia-bilbostack-2015/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1348,
      "url" : "http://www.blogstack.info/post/blogbitix/2015/01/conferencia-bilbostack-2-15"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>