<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud"><span itemprop="headline">Camino a la libertad: openmailbox y ownCloud</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/04/camino-la-libertad-openmailbox-y.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-04-21T10:57" itemprop="dateModified">Actualizado el lunes, 21 de abril de 2014 a las 10:57 UTC</span></div><div><span>
Etiquetado como
tutorial, openmailbox, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, owncloud</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><i>Un lobo flaco y hambriento se encontr&oacute; en su camino con un perro gordo y bien cuidado.<br />- &iquest;Por qu&eacute; ser&aacute; - le dijo - que, siendo yo m&aacute;s fuerte que t&uacute;, no encuentre qu&eacute; comer?<br />- Se debe a que mi amo me cuida y me alimenta - dijo el can. - A cambio, yo vigilo su casa. Si quieres, puedes disfrutar de lo m&iacute;o, cumpliendo las mismas obligaciones.<br />- De acuerdo. Estoy cansado de pasar hambre. Pero, oye, &iquest;qu&eacute; tienes en el cuello?<br />- Es el collar de la cadena con la que me atan a la perrera durante el d&iacute;a. Por la noche me dejan libre y puedo correr.<br />- Pues si no eres libre - replic&oacute; el lobo - goza de tus bienes, que yo no los cambio por mi libertad.<br /><br />Moraleja: es mejor la libertad que el lujo y la comodidad.<br /><br /><a href="https://es.wikipedia.org/wiki/Esopo">Esopo</a></i>
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-CQa-gZJE-Qc/U1E8teU34zI/AAAAAAAAEbA/Ue4ZxHP2VpE/s1600/lo+siento.png"><img src="http://3.bp.blogspot.com/-CQa-gZJE-Qc/U1E8teU34zI/AAAAAAAAEbA/Ue4ZxHP2VpE/s1600/lo+siento.png" height="400" width="298" /></a>
</div>
<br />
<br />
<a></a>A ra&iacute;z de un 
<a href="http://www.etccrond.es/2014/04/consejos-para-recuperar-la-privacidad.html">interesant&iacute;simo art&iacute;culo</a> publicado por Eugenio M. Vigo en su excelente blog sobre software libre me plante&eacute;, de nuevo, pues llueve sobre mojado, mis h&aacute;bitos de navegaci&oacute;n y programas favoritos para el desempe&ntilde;o inform&aacute;tico diario. Ya hace tiempo que conclu&iacute; que 
<a href="https://es.wikipedia.org/wiki/Richard_Stallman">Richard Matthew Stallman</a> ten&iacute;a raz&oacute;n, algo que, a poco que se hayan seguido las revelaciones de 
<a href="https://es.wikipedia.org/wiki/Edward_Snowden">Edward Snowden</a> y el esc&aacute;ndalo de la 
<a href="https://es.wikipedia.org/wiki/NSA">NSA</a>, cualquiera con ciertas luces puede llegar a comprender. El comportamiento de Stallman se suele situar en un extremo cercano a la enfermedad mental o la paranoia por aquellos que solamente saben recurrir al 
<a href="https://es.wikipedia.org/wiki/Ad_hominem"><i>ad hominem</i></a> a la hora de rebatir argumentos dif&iacute;cilmente discutibles. Para este tipo de gente debe haber sido un golpe muy duro descubrir que el manido &quot;no tengo nada que ocultar&quot; no es suficiente para hacer o&iacute;dos sordos a la tremenda coerci&oacute;n de la libertad que suponen las informaciones reveladas en los &uacute;ltimos meses.
<br />
<br />Navegar por la red, mantener conversaciones por Whatsapp, comprar en Amazon, y un largo etc&eacute;tera de acciones normales y corrientes se han convertido, hoy d&iacute;a, en una forma sencilla de rastrear al usuario y usar sus datos personales con fines que casi nunca est&aacute;n del todo claros. No me voy a ir al extremo de dejar de usar la tecnolog&iacute;a, &uacute;nico modo que garantiza la privacidad absoluta (o no), pero ya va siendo hora de arrimar un poco el hombro en la concienciaci&oacute;n, mediante el uso propio, de que toda esta gran red de espionaje montada a nuestro alrededor sin un &aacute;pice de &eacute;tica que la fundamente se puede desmontar. Hay que ir, como suele ser habitual, paso a paso, y todo comienza con una correcta elecci&oacute;n de las aplicaciones que uno mismo utiliza y recomienda a sus conocidos.
<br />
<br />En su art&iacute;culo, Eugenio da unas pautas y menciona programas y extensiones para el navegador que puedo constatar que no interfieren en el normal desarrollo de mis actividades. Hablando claro: no noto lentitud ni p&eacute;rdida de funcionalidad en Firefox desde que uso las susodichas extensiones.
<br />
<br />Adem&aacute;s de lo apuntado por el art&iacute;culo de Eugenio, tuve hace unos d&iacute;as una desagradable experiencia personal que sirve como ejemplo de por qu&eacute; no se pueden confiar datos personales a &quot;La gran G&quot; y olvidarse del tema. Mi hijo recibi&oacute; como regalo de Reyes el pasado mes de Enero una tablet 
<a href="http://www.bqreaders.com/productos/maxwell-2-plus.html">Bq Maxwell 2 Plus</a>. Las tablets, regalo estrella en los &uacute;ltimos a&ntilde;os para los ni&ntilde;os, no son un juguete, y nos corresponde a los padres establecer l&iacute;mites en su uso si no queremos convertir a nuestros hijos en zombis desde temprana edad. Fin del consejo, seguimos con la an&eacute;cdota.
<br />
<br />Desde la primera vez que se inicia un dispositivo con Android uno ya se ve en la tesitura de tener que conectarlo a su dichosa cuenta de Google. Las prisas no son buenas consejeras, y el tener que configurar el dispositivo a escondidas para preservar la feliz inocencia infantil tampoco ayuda demasiado. Resumiendo, que comet&iacute; el error de vincular la tablet a mi cuenta de correo personal. A&ntilde;adan a este imperdonable descuido la 
<a href="https://en.wikipedia.org/wiki/Google_Wallet">Google Wallet</a>, un juego donde se puede comprar contenido a trav&eacute;s de dicha cartera virtual y un ni&ntilde;o de 6 a&ntilde;os y medio. Tremenda combinaci&oacute;n que hace muy probable la ocurrencia de alg&uacute;n desastre.
<br />
<br />La cosa no pas&oacute; a mayores gracias a que los &quot;amigos&quot; de Google tuvieron a bien informarme, correo mediante, de que se hab&iacute;an comprado productos por valor de unos 4 euros para mi dispositivo Bq. R&aacute;pidamente corr&iacute; a anular la pu&ntilde;etera &quot;wallet&quot; y me dediqu&eacute; a aleccionar a mi hijo de por qu&eacute; eso no se puede hacer, lo que cuesta ganar el dinero, etc. Pero, en el fondo (y en la superficie, qu&eacute; demonios) no es culpa suya, sino de su padre y de unos se&ntilde;ores de Mountain View, estado de California... Repartamos las culpas, en un 80-20, para el padre.
<br />
<br />Este desafortunado incidente que pudo ser mucho peor (en el jueguecito de marras puedes comprar cosas por valor de m&aacute;s de cien euros, sudores fr&iacute;os solo de pensarlo) me llev&oacute; a terminar de decidirme por prescindir de ciertos servicios. Ser&aacute; duro cortar con Google, probablemente no pueda hacerlo del todo, pero poco a poco lo voy a intentar. Entre tanto lo consigo, se me ha ocurrido haceros part&iacute;cipes de la experiencia de pasar la mayor&iacute;a de mis aplicaciones y utilidades a opciones cien por cien software libre. Comenzamos hoy este particular camino a la libertad con la combinaci&oacute;n de una cuenta de correo libre con 
<a href="https://www.openmailbox.org/index.php">openmailbox</a> y una nube personal de 1 Gb alojada en los mismos servidores de dicha cuenta, usando para ello la soluci&oacute;n, tambi&eacute;n libre, que propone 
<a href="http://owncloud.org/">ownCloud</a>. Al l&iacute;o.
<br />
<br />
<b>Abrir una cuenta de correo openmailbox</b>
<br />Para documentar gr&aacute;ficamente el proceso voy a emplear capturas de pantalla realizadas en una m&aacute;quina virtual corriendo Arch Linux con KDE bajo Chakra.
<br />
<br />1&ordm; Entramos en la web de 
<a href="https://www.openmailbox.org/index.php">openmailbox</a>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-NVGoI-jCU7s/U1E9TyJlaVI/AAAAAAAAEbI/reXdjROqy5w/s1600/instant%C3%A1nea1.png"><img src="http://1.bp.blogspot.com/-NVGoI-jCU7s/U1E9TyJlaVI/AAAAAAAAEbI/reXdjROqy5w/s1600/instant%C3%A1nea1.png" height="320" width="400" /></a>
</div>
<br />2&ordm; Pulsamos en &quot;Registro&quot; y completamos los datos. Pod&eacute;is elegir cualquier nombre de usuario que no est&eacute; ya en uso, excepto &quot;sombra&quot; que &eacute;se ya lo tengo yo :)
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-wUeaf543ORw/U1E9ZyuK6-I/AAAAAAAAEbQ/aMl4zitfeNc/s1600/instant%C3%A1nea2.png"><img src="http://4.bp.blogspot.com/-wUeaf543ORw/U1E9ZyuK6-I/AAAAAAAAEbQ/aMl4zitfeNc/s1600/instant%C3%A1nea2.png" height="320" width="400" /></a>
</div>
<br />3&ordm; Si todo ha ido bien, que ir&aacute;, ya estamos registrados y tenemos 250 Mb de espacio en nuestra nueva cuenta de correo. S&eacute; que no es mucho, m&aacute;s bien todo lo contrario, pero no hemos llegado hasta aqu&iacute; por la comodidad, sino por algo bien distinto, cercano a los ideales (ver f&aacute;bula que encabeza el art&iacute;culo). En cualquier caso, se est&aacute; trabajando en la posibilidad de ampliar dicho espacio por un m&oacute;dico precio.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-dkOseIp9e0c/U1E9ftdvHWI/AAAAAAAAEbY/-2n0HZRGTtg/s1600/instant%C3%A1nea3.png"><img src="http://2.bp.blogspot.com/-dkOseIp9e0c/U1E9ftdvHWI/AAAAAAAAEbY/-2n0HZRGTtg/s1600/instant%C3%A1nea3.png" height="320" width="400" /></a>
</div>
<br />4&ordm; Pulsamos en &quot;Conectar&quot; y nos aparece la pantalla de inicio de sesi&oacute;n.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-L41MMBZdGxc/U1E9kuiJfQI/AAAAAAAAEbg/U7f9-CmHXVY/s1600/instant%C3%A1nea4.png"><img src="http://3.bp.blogspot.com/-L41MMBZdGxc/U1E9kuiJfQI/AAAAAAAAEbg/U7f9-CmHXVY/s1600/instant%C3%A1nea4.png" height="320" width="400" /></a>
</div>
<br />5&ordm; Y ya estamos en la interfaz web. Como se puede apreciar, est&aacute; en ingl&eacute;s, algo muy f&aacute;cil de remediar pulsando en &quot;Settings&quot;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-xJ3EDaGSyzw/U1E9qP-6H4I/AAAAAAAAEbo/zyeUSoW4TaU/s1600/instant%C3%A1nea5.png"><img src="http://4.bp.blogspot.com/-xJ3EDaGSyzw/U1E9qP-6H4I/AAAAAAAAEbo/zyeUSoW4TaU/s1600/instant%C3%A1nea5.png" height="320" width="400" /></a>
</div>
<br />6&ordm; Desde la pantalla de &quot;Ajustes&quot;, podremos cambiar muchas cosas, entre ellas el idioma de la aplicaci&oacute;n y el intervalo de tiempo entre comprobaciones de la llegada de nuevos correos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-T5q1JzJR4m4/U1E9vbkqmNI/AAAAAAAAEbw/EnI_6KM7AU8/s1600/instant%C3%A1nea6.png"><img src="http://4.bp.blogspot.com/-T5q1JzJR4m4/U1E9vbkqmNI/AAAAAAAAEbw/EnI_6KM7AU8/s1600/instant%C3%A1nea6.png" height="320" width="400" /></a>
</div>
<br />Tras el cambio, ya tenemos todo en nuestro idioma. El manejo de la cuenta de correo es similar a los ya conocidos servicios que ofrecen las empresas, intuitivo y muy sencillo. De igual modo, para los que prefieren acceder a su correo a trav&eacute;s de programas gestores, como Thunderbird, Evolution o Kmail, existe la posibilidad de hacerlo. En la p&aacute;gina principal de 
<a href="http://openmailbox.org/">openmailbox.org</a> est&aacute;n los protocolos de conexi&oacute;n correspondientes para configurar los clientes de correo. Desde dicha p&aacute;gina tambi&eacute;n se puede acceder a opentrashbox, una utilidad para crear direcciones de correo temporales que podemos emplear para registrarnos en sitios sin dar nuestro correo personal.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-9G4sRpp6hl0/U1E92KhYyuI/AAAAAAAAEb4/pu01hqTtq6M/s1600/instant%C3%A1nea7.png"><img src="http://2.bp.blogspot.com/-9G4sRpp6hl0/U1E92KhYyuI/AAAAAAAAEb4/pu01hqTtq6M/s1600/instant%C3%A1nea7.png" height="320" width="400" /></a>
</div>
<br />
<b>ownCloud: nuestro espacio gratuito en la nube</b>
<br />Como funcionalidad a&ntilde;adida a openmailbox, dispondremos de 1 Gb de espacio en la nube gestionado a trav&eacute;s del servicio gratuito y de c&oacute;digo abierto de 
<a href="http://owncloud.org/">ownCloud</a>. Desde este espacio en la nube podremos sincronizar y compartir archivos como lo har&iacute;amos con Dropbox, Copy y la ya extinta Ubuntu One.
<br />
<br />1&ordm; Accedemos a nuestro 
<a href="https://cloud.openmailbox.org/">espacio en ownCloud</a>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Qsp3FSFXps4/U1E97eoOwkI/AAAAAAAAEcA/57XNwAsNN_U/s1600/instant%C3%A1nea8.png"><img src="http://4.bp.blogspot.com/-Qsp3FSFXps4/U1E97eoOwkI/AAAAAAAAEcA/57XNwAsNN_U/s1600/instant%C3%A1nea8.png" height="320" width="400" /></a>
</div>
<br />2&ordm; Entramos con nuestra direcci&oacute;n de correo completa y nuestra contrase&ntilde;a de acceso a dicho correo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-6I3_vRl5UOw/U1E-AWgDobI/AAAAAAAAEcI/EITzW98qSSc/s1600/instant%C3%A1nea9.png"><img src="http://3.bp.blogspot.com/-6I3_vRl5UOw/U1E-AWgDobI/AAAAAAAAEcI/EITzW98qSSc/s1600/instant%C3%A1nea9.png" height="320" width="400" /></a>
</div>
<br />3&ordm; Tendremos la pantalla de bienvenida, donde se nos informa de las distintas aplicaciones con las que extender las posibilidades de nuestro nuevo espacio en la nube. Tambi&eacute;n encontraremos informaci&oacute;n sobre el modo de sincronizar nuestros contactos, libretas de direcciones, e incluso calendarios y agendas. Un servicio muy completo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-h1CBdYe9jW4/U1E-GgdqhwI/AAAAAAAAEcQ/65Ykx9fcuTs/s1600/instant%C3%A1nea10.png"><img src="http://3.bp.blogspot.com/-h1CBdYe9jW4/U1E-GgdqhwI/AAAAAAAAEcQ/65Ykx9fcuTs/s1600/instant%C3%A1nea10.png" height="320" width="400" /></a>
</div>
<br />4&ordm; Finalmente, nuestra pantalla con los directorios predeterminados y archivos de muestra.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-wIBIZBTX_Zk/U1E-Ld6WoGI/AAAAAAAAEcY/f4m2gGZzJGo/s1600/instant%C3%A1nea11.png"><img src="http://1.bp.blogspot.com/-wIBIZBTX_Zk/U1E-Ld6WoGI/AAAAAAAAEcY/f4m2gGZzJGo/s1600/instant%C3%A1nea11.png" height="320" width="400" /></a>
</div>
<br />Si bien es muy sencillo gestionar nuestra nube ownCloud desde aqu&iacute;, lo es m&aacute;s a&uacute;n si utilizamos las herramientas correspondientes para el escritorio y el m&oacute;vil o tablet. Respecto a estos &uacute;ltimos, se encuentra disponible una 
<a href="https://play.google.com/store/apps/details?id=com.owncloud.android&amp;hl=es">aplicaci&oacute;n</a> en la tienda Google Play, por tan solo 0'78 euros, con los que contribuimos al esfuerzo de los desarrolladores. Pero claro, no todo el mundo se siente c&oacute;modo dando los datos de su tarjeta de cr&eacute;dito o d&eacute;bito a Google (huelga reincidir en lo que puede pasar). En este caso, podemos descargar su correspondiente 
<a href="https://f-droid.org/repository/browse/?fdfilter=owncloud&amp;fdid=com.owncloud.android">alternativa gratuita</a> en F-droid.
<br />
<br />
<b>Instalar la aplicaci&oacute;n de escritorio ownCloud</b>
<br />Para tener nuestro ownCloud completamente operativo e interconectado con nuestro escritorio, podemos instalar el cliente correspondiente.
<br />
<br />1&ordm; En Arch est&aacute; en AUR, de modo que se instala con yaourt, pacaur, o el script preferido de cada cual. En Chakra lo tenemos en CCR, y se instala con ccr -S owncloud-client. Para otras distribuciones, los paquetes pre-compilados se alojan en el &quot;
<a href="https://build.opensuse.org/package/repositories/isv:ownCloud:desktop/owncloud-client">Build service</a>&quot; de openSUSE.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-3cQbUBWlFBY/U1E-TOyfSjI/AAAAAAAAEcg/jgCEagGRt64/s1600/instant%C3%A1nea12.png"><img src="http://4.bp.blogspot.com/-3cQbUBWlFBY/U1E-TOyfSjI/AAAAAAAAEcg/jgCEagGRt64/s1600/instant%C3%A1nea12.png" height="320" width="400" /></a>
</div>
<br />2&ordm; El paquete se compila e instala para nuestro sistema, gracias a yaourt, pacaur, ccr o lo que sea que usemos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-lzRRpmINMnw/U1E-aQPsg7I/AAAAAAAAEco/vlt2S_PsCkg/s1600/instant%C3%A1nea13.png"><img src="http://1.bp.blogspot.com/-lzRRpmINMnw/U1E-aQPsg7I/AAAAAAAAEco/vlt2S_PsCkg/s1600/instant%C3%A1nea13.png" height="320" width="400" /></a>
</div>
<br />3&ordm; Y ya est&aacute; disponible entre nuestras aplicaciones de escritorio. Procedemos a iniciarlo por primera vez.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-ufnbaAfo_-Y/U1E-hDq1TlI/AAAAAAAAEcw/9Yt50bst9aQ/s1600/instant%C3%A1nea14.png"><img src="http://3.bp.blogspot.com/-ufnbaAfo_-Y/U1E-hDq1TlI/AAAAAAAAEcw/9Yt50bst9aQ/s1600/instant%C3%A1nea14.png" height="320" width="400" /></a>
</div>
<br />4&ordm; La direcci&oacute;n del servidor en la nube es https://cloud.openmailbox.org.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-4HPk_AXuegY/U1E-oQU-HnI/AAAAAAAAEc4/eFE_4_NxU84/s1600/instant%C3%A1nea15.png"><img src="http://1.bp.blogspot.com/-4HPk_AXuegY/U1E-oQU-HnI/AAAAAAAAEc4/eFE_4_NxU84/s1600/instant%C3%A1nea15.png" height="320" width="400" /></a>
</div>
<br />5&ordm; De nuevo, los datos de acceso son los mismos que para nuestra cuenta de correo de openmailbox.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-JNZw3Cxd_K0/U1E-wHPIyRI/AAAAAAAAEdA/9OhJ6AqlYbs/s1600/instant%C3%A1nea16.png"><img src="http://1.bp.blogspot.com/-JNZw3Cxd_K0/U1E-wHPIyRI/AAAAAAAAEdA/9OhJ6AqlYbs/s1600/instant%C3%A1nea16.png" height="320" width="400" /></a>
</div>
<br />6&ordm; A continuaci&oacute;n, podemos escoger la carpeta de nuestro disco donde se alojar&aacute;n los archivos. Esta ser&aacute; la carpeta sincronizada con el contenido de nuestra nube personal.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-hELF4W9viHk/U1E-23UEqlI/AAAAAAAAEdI/waDrKhmPzgs/s1600/instant%C3%A1nea17.png"><img src="http://2.bp.blogspot.com/-hELF4W9viHk/U1E-23UEqlI/AAAAAAAAEdI/waDrKhmPzgs/s1600/instant%C3%A1nea17.png" height="320" width="400" /></a>
</div>
<br />7&ordm; Todo listo, todo perfecto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-6WFIoRTBEI4/U1E_AMvfXCI/AAAAAAAAEdQ/xWSsgke3qAk/s1600/instant%C3%A1nea18.png"><img src="http://2.bp.blogspot.com/-6WFIoRTBEI4/U1E_AMvfXCI/AAAAAAAAEdQ/xWSsgke3qAk/s1600/instant%C3%A1nea18.png" height="320" width="400" /></a>
</div>
<br />8&ordm; Si abrimos nuestra carpeta, nos encontramos ya con nuestros archivos sincronizados.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-McYSk0zGNgI/U1E_FAufV9I/AAAAAAAAEdY/V9wuMBbYAUM/s1600/instant%C3%A1nea19.png"><img src="http://2.bp.blogspot.com/-McYSk0zGNgI/U1E_FAufV9I/AAAAAAAAEdY/V9wuMBbYAUM/s1600/instant%C3%A1nea19.png" height="320" width="400" /></a>
</div>
<br />9&ordm; Finalmente, una vista de la ventana que se abre al hacer clic sobre la peque&ntilde;a nube que nos aparece en la barra de tareas, desde donde podemos configurar las opciones del cliente de escritorio, incluyendo las velocidades de subida y descarga de archivos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-ZM11I64q3iQ/U1E_MRrO8kI/AAAAAAAAEdg/uGAu4M9Wl2w/s1600/instant%C3%A1nea20.png"><img src="http://4.bp.blogspot.com/-ZM11I64q3iQ/U1E_MRrO8kI/AAAAAAAAEdg/uGAu4M9Wl2w/s1600/instant%C3%A1nea20.png" height="320" width="400" /></a>
</div>
<br />Como veis, poco o nada que envidiar a otro tipo de soluciones privativas, por mucho que sean gratuitas tambi&eacute;n. Facilidad de instalaci&oacute;n y uso por doquier en una excelente opci&oacute;n con software libre. El camino a la libertad es pedregoso y dif&iacute;cil (a los carceleros les conviene que lo sea) pero muy satisfactorio a la postre. Los que somos asiduos del mundillo GNU/Linux lo sabemos bien, 
<a href="http://www.lasombradelhelicoptero.com/2014/03/desmontando-shadow.html">traiciones e &quot;idas de olla&quot;</a> temporales aparte. Espero continuar esta serie de art&iacute;culos con nuevos pasitos hacia la completa libertad inform&aacute;tica, o al menos, algo parecido (
<a href="http://www.lasombradelhelicoptero.com/2013/04/trisquel-60-toutatis-para-la-libertad.html">Trisquel</a> ya ser&iacute;a demasiado pedir para un usuario de ATI/AMD, en su momento lo intent&eacute; pero...uff).
<br />
<br />Y termino con un peque&ntilde;o homenaje al reci&eacute;n desaparecido 
<a href="https://es.wikipedia.org/wiki/Gabriel_Garc%C3%ADa_M%C3%A1rquez">Gabo</a> que bien podr&iacute;a aplicarse a aquello de lo que pretende tratar este art&iacute;culo. &quot;He aprendido que el mundo quiere vivir en la cima de la monta&ntilde;a, sin saber que la verdadera felicidad est&aacute; en la forma de subir la escarpada&quot; - Gabriel Garc&iacute;a M&aacute;rquez (1927-2014).
<br />
<div style="left: 9px; top: 612px;">
 <br />
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud" st_title="Camino a la libertad: openmailbox y ownCloud | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 315,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/camino-a-la-libertad-openmailbox-y-owncloud"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>