<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-06T19:46:10Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-06T19:46:10Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>¡Adios viejo mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/12/$003fadios-viejo-mundo" />
    <category term="planeta-codigo" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-05T12:59:16Z</updated>
    <published>2013-12-05T12:59:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Blogger" src="http://2.bp.blogspot.com/-P5IpdthiWSc/UPmd-a_-UwI/AAAAAAAACOI/2287mjoueEU/s1600/blogger.png" title="Blogger" /&gt; 
&lt;/div&gt;Esta es la &amp;uacute;ltima entrada que publicar&amp;eacute; en el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/"&gt;elblogdepicodev.blogspot.com.es&lt;/a&gt; o la primera de 
&lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt; dependiendo del blog al que hayas accedido, es decir, seguir&amp;eacute; teniendo un blog y escribiendo sobre la tem&amp;aacute;tica alrededor de la tecnolog&amp;iacute;a como hasta ahora pero a partir de este momento todo el nuevo contenido que publique lo har&amp;eacute; en el nuevo blog 
&lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt;, por lo que si est&amp;aacute;s suscrito al feed de elblogdepicodev te recomiendo que te suscribas al 
&lt;a href="http://feeds.feedburner.com/blog-bitix/"&gt;feed de bitix&lt;/a&gt; para no perderte ninguna de las nuevas entradas que publique. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;h3&gt;Que est&amp;aacute; por venir en Bitix&lt;/h3&gt;Tengo bastante cotenido por publicar en el futuro m&amp;aacute;s o menos inmediato empezando por continuar con la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;serie de art&amp;iacute;culos sobre criptograf&amp;iacute;a, GPG y DNI electr&amp;oacute;nico&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/12/$003fadios-viejo-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-12-05T12:59:00Z</dc:date>
  </entry>
  <entry>
    <title>Karmacracy y como integrarlo en Blogger</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger" />
    <category term="planeta-codigo" />
    <category term="blogger" />
    <category term="planeta-linux" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-11-22T21:25:02Z</updated>
    <published>2012-03-29T19:18:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Karmacracy" height="106" src="http://3.bp.blogspot.com/-ZRqkujvZc0g/T3Sw_BV4nuI/AAAAAAAABFc/ZM9R9VsOpLw/s320/karmacracy.png" title="Karmacracy" width="320" /&gt; 
&lt;/div&gt;Hoy en d&amp;iacute;a los que tienen un medio en el cual publican contenido ya se un blog, un peri&amp;oacute;dico, agregador de noticias, foro u otra forma saben que a&amp;ntilde;adir una barra de botones para que los usuarios puedan compartirlo es una buena idea ya que son los propios usuarios, a los que les parece interesante el contenido tanto como para compartirlo en alguna de sus redes sociales, los que ayudan a difundirlo. Esto es bueno para los medios ya que ayuda a atraer m&amp;aacute;s visitas hacia ese contenido pero hasta el momento para los usuarios el hecho de compartirlo no tiene ning&amp;uacute;n aliciente adicional, lo m&amp;aacute;s, formar parte de un n&amp;uacute;mero de usuarios que han compartido anteriormente. 
&lt;br /&gt; 
&lt;br /&gt;Si hab&amp;eacute;is visitado este blog alguna otra vez tal vez os hay&amp;aacute;is dado cuenta que debajo de cada entrada y de los tradicionales botones que ofrece blogger para compartir ha aparecido un bloque a trav&amp;eacute;s del cual tambi&amp;eacute;n se puede compartir las entradas de una forma muy sencilla y en un par de clics en tus redes sociales como twitter, facebook o linkedin. Este bloque es proporcionado por&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-03-29T19:18:00Z</dc:date>
  </entry>
  <entry>
    <title>Hemeroteca #1</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1" />
    <category term="hemeroteca" />
    <category term="raspberrypi" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="otros" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <category term="tapestry" />
    <category term="java" />
    <category term="minix" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-07-07T01:16:10Z</updated>
    <published>2012-06-29T16:43:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img src="http://1.bp.blogspot.com/-cK1PH5pzXNc/TdKfToeduKI/AAAAAAAAApw/axtoypLaDfU/s1600/El+blog+de+picodev+%2528watermark%2529.png" /&gt; 
&lt;/div&gt;Ya han pasado seis meses de este 2012 y seguro que muchos estamos ya pensando en coger vacaciones dentro de poco. En esta entrada recopilar&amp;eacute; para que han dado estos seis meses en El blog de pico.dev. Si te interesan entradas como estas y a&amp;uacute;n no lo has hecho suscr&amp;iacute;bete al feed de mi blog, tengo una buena cantidad de entradas esperando a ser escritas y que ir&amp;eacute; publicando a raz&amp;oacute;n de una por semana si dispongo del tiempo y el &amp;aacute;nimo para escribirlas. 
&lt;br /&gt; 
&lt;br /&gt;En estos seis meses he escrito estas 23 entradas agrupadas por tem&amp;aacute;tica: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Varios&lt;/b&gt; 
&lt;br /&gt;Como menci&amp;oacute;n especial integr&amp;eacute; el widget de karmacracy que puede verse al final de cada entrada mediante el cual cualquier usuario puede compartir la entradas de este blog en sus redes sociales como facebook, twitter o linkedin de una forma r&amp;aacute;pida y sencilla obteniendo a cambio un lugar en el widget para los usuarios que m&amp;aacute;s clics atraigan.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-06-29T16:43:00Z</dc:date>
  </entry>
  <entry>
    <title>Hemeroteca #3</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/06/hemeroteca-3" />
    <category term="hemeroteca" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="gnulinux" />
    <category term="tapestry" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-06-29T08:54:49Z</updated>
    <published>2013-06-29T08:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
  &lt;img alt="El blog de pico.dev" height="44" src="http://4.bp.blogspot.com/-cK1PH5pzXNc/TdKfToeduKI/AAAAAAAAApw/axtoypLaDfU/s320/El+blog+de+picodev+%2528watermark%2529.png" title="El blog de pico.dev" width="320" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Mitad del a&amp;ntilde;o y otros seis meses m&amp;aacute;s que han pasado, ya queda menos para las esperadas vacaciones ;). Como he empezado a hacer desde hace un tiempo en esta entrada quiero recapitular las 25 entradas que he escrito durante este primer semestre de 2013, una por semana publicada normalmente durante la tarde de los viernes. Esta ser&amp;aacute; la cuarta Hemeroteca aunque lleve el n&amp;uacute;mero #3. Si te has suscrito a mi blog hace poco es buen momento para revisar alguna entrada anterior que he escrito y si hace un tiempo que estabas suscrito puedes releer alguna entrada que ya vistes y que en su momento te interes&amp;oacute; o que por falta de tiempo dejaste de leer. Muchas de las entradas que he escrito durante este semestre han estado relacionados con la programaci&amp;oacute;n de una o de otra manera.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/06/hemeroteca-3"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-06-29T08:46:00Z</dc:date>
  </entry>
  <entry>
    <title>1º aniversario del blog</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/02/1$003f-aniversario-del-blog" />
    <category term="hola" />
    <category term="blogger" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-06T09:00:03Z</updated>
    <published>2011-02-06T09:00:00Z</published>
    <content type="html">&lt;p&gt;Pues pacere que fue ayer pero ya se ha cumplido un a&amp;ntilde;o desde que cree el blog. En todo este tiempo han sido 48 entradas las que he publicado hablando sobre 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/arch%20linux"&gt;Arch Linux&lt;/a&gt; y 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/java"&gt;programaci&amp;oacute;n en java&lt;/a&gt; principalmente pero tambi&amp;eacute;n he tenido tiempo para hablar sobre otros temas como 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/Minix"&gt;Minix&lt;/a&gt;, 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/personalizaci%C3%B3n"&gt;personalizaci&amp;oacute;n de Linux&lt;/a&gt;, 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/juegos"&gt;juegos&lt;/a&gt; y alg&amp;uacute;n otro. Durante este a&amp;ntilde;o he quedado bastante contento con las entradas que he publicado sobretodo con las referentes a 
&lt;a href="http://elblogdepicodev.blogspot.com/search/label/tapestry"&gt;Tapestry&lt;/a&gt; por haber podido devolverle algo por los buenos momentos que paso con &amp;eacute;l programando y del que espero seguir escribiendo. 
&lt;br /&gt; 
&lt;br /&gt;En cuanto a los usuarios que visitan este blog pr&amp;aacute;cticamente todos llegais por alguna b&amp;uacute;squeda en Google, en estos momentos recibo en el blog unas 70 visitas diarias y durante este a&amp;ntilde;o en total han sido 24755 p&amp;aacute;ginas vistas, 18200 visitas &amp;uacute;nicas con un promedio de 3 minutos en el sitio. Si ya s&amp;eacute;, alguno dir&amp;aacute; que no son muchas pero en el momento que inicie el blog no pens&amp;eacute; que fueran tantas :).&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/02/1$003f-aniversario-del-blog"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-02-06T09:00:00Z</dc:date>
  </entry>
  <entry>
    <title>Diseñador de plantillas de Blogger in Draft</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/06/disenador-de-plantillas-de-blogger-in-draft" />
    <category term="blogger" />
    <category term="personalizacion" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2010-06-12T12:43:44Z</updated>
    <published>2010-06-12T12:42:00Z</published>
    <content type="html">&lt;p&gt;Mediante el dise&amp;ntilde;ador de plantillas de 
&lt;a href="http://draft.blogger.com/"&gt;Blogger in Draft&lt;/a&gt; se pueden modificar muy f&amp;aacute;cilmente y sin necesidad de tener ning&amp;uacute;n conocimiento de HTML o CSS los aspectos m&amp;aacute;s importantes del estilo del blog como la imagen de fondo, tama&amp;ntilde;os de letras, colores, anchura, disposici&amp;oacute;n en columnas, n&amp;uacute;mero de columnas, etc... Este nuevo dise&amp;ntilde;ador da una gran cantidad de nuevas posibilidades de personalizaci&amp;oacute;n del blog y hacerlo diferente a otros. 
&lt;br /&gt; 
&lt;br /&gt;Otras mejoras que se incluyen en Blogger in Draft es en la redacci&amp;oacute;n de las entradas dando ahora la posibilidad de subir videos desde el propio equipo as&amp;iacute; como la incorporaci&amp;oacute;n de un diccionario y traductor de varios idiomas. Tambi&amp;eacute;n se incorpora una vista previa mucho m&amp;aacute;s real del resultado final. 
&lt;br /&gt; 
&lt;br /&gt;Sin embargo, hay que tener en cuenta que al cambiar de plantilla las modificaciones que hayamos hecho en el c&amp;oacute;digo fuente de la plantilla para incluir el c&amp;oacute;digo de Google Analytics u otras modificaciones se pierden, con lo que es recomendable guardar una copia de la plantilla antes de hacer los cambios.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/06/disenador-de-plantillas-de-blogger-in-draft"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-06-12T12:42:00Z</dc:date>
  </entry>
  <entry>
    <title>¡Hola mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/$003fhola-mundo" />
    <category term="hola" />
    <category term="ubuntu" />
    <category term="blogger" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2010-02-07T18:07:04Z</updated>
    <published>2010-02-06T15:55:00Z</published>
    <content type="html">&lt;p&gt;Bueno, &amp;iexcl;pues ya est&amp;aacute;!, ya tengo mi propio blog, todav&amp;iacute;a est&amp;aacute; en fase de construcci&amp;oacute;n as&amp;iacute; que seg&amp;uacute;n vaya teniendo tiempo ir&amp;eacute; haciendo peque&amp;ntilde;os cambios en los gadgets y en su disposici&amp;oacute;n. Por ahora me conformo con tenerlo visible e ir conociendo como funciona 
&lt;a href="http://www.blogger.com/"&gt;Blogger&lt;/a&gt; y otras herramientas como 
&lt;a href="https://www.google.com/adsense"&gt;Google Adsense&lt;/a&gt;, 
&lt;a href="http://www.google.com/analytics/"&gt;Google Analytics&lt;/a&gt; y 
&lt;a href="https://www.google.com/accounts/ServiceLogin?service=feedburner"&gt;Google FeedBurner&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;Pero lo principal, escribir entradas en el blog, es algo que ya puedo realizar. Tratar&amp;aacute;n sobre temas relacionados con el software libre, incluyendo las dos distribuciones GNU/Linux que en este momento uso m&amp;aacute;s habitualmente que son 
&lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt; y 
&lt;a href="http://www.archlinux.org/"&gt;Arch Linux&lt;/a&gt;, temas de tecnolog&amp;iacute;a, quiz&amp;aacute; temas de programaci&amp;oacute;n, experiencias personales sobre los mismos y otras cosas que se me vayan ocurriendo. 
&lt;br /&gt; 
&lt;br /&gt;En cualquier caso, espero que algunas entradas las consider&amp;eacute;is interesantes u os resulten &amp;uacute;tiles. Y como no podr&amp;iacute;a ser de otra forma &amp;iexcl;sois bienvenidos a realizar comentarios y a enviarme sugerencias!.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/$003fhola-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-06T15:55:00Z</dc:date>
  </entry>
</feed>

