<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Principales problemas de Linux en el escritorio | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio"><span itemprop="headline">Principales problemas de Linux en el escritorio</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/windows"><img title="windows" alt="windows" src="/assets/images/labels/windows.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/01/principales-problemas-de-linux-en-el.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-01-13T10:45" itemprop="dateModified">Actualizado el lunes, 13 de enero de 2014 a las 10:45 UTC</span></div><div><span>
Etiquetado como
<a href="/label/windows"><span itemprop="articleSection">windows</span></a>, gnu-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Hace alg&uacute;n tiempo me top&eacute; con la p&aacute;gina personal de Artem S. Tashkinov, un administrador de sistemas que se define a s&iacute; mismo como un entusiasta del 
<a href="https://es.wikipedia.org/wiki/FOSS">FOSS</a>, y que a lo largo de los a&ntilde;os ha ayudado a resolver multitud de errores y problemas que afectaban tanto al kernel como a otros componentes de GNU/Linux. Cuando lo le&iacute; qued&eacute; fascinado, pues me pareci&oacute; que su cr&iacute;tica constructiva es precisamente el aspecto del que m&aacute;s adolece nuestro sistema operativo preferido. &quot;Har&iacute;an falta m&aacute;s Artems&quot;, pens&eacute;. En los comentarios suscitados por mi 
<a href="http://www.lasombradelhelicoptero.com/2014/01/pesadilla-antes-de-navidad.html">&uacute;ltimo art&iacute;culo</a>, traje a colaci&oacute;n este escrito, el cual no ha tenido excesiva difusi&oacute;n en el mundo de habla hispana, probablemente por carecer de una traducci&oacute;n correcta, pues emplear el &quot;gadget&quot; que incorpora la propia web para este menester nos da un resultado francamente rid&iacute;culo. Encontr&eacute;, no obstante, una menci&oacute;n en el blog 
<a href="http://www.alcancelibre.org/article.php/20090518125218266">Alcance Libre</a>, pero algo desactualizada ya.
<br />
<br />
<div style="clear: both; text-align: center;"></div>
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-16woRas4JzA/UtKDMfuoUJI/AAAAAAAAEKY/zkaXj-01Zqk/s1600/error-150x150.png"><img height="200" src="http://3.bp.blogspot.com/-16woRas4JzA/UtKDMfuoUJI/AAAAAAAAEKY/zkaXj-01Zqk/s1600/error-150x150.png" width="200" /></a>
</div>
<br />
<br />
<a></a>El art&iacute;culo original es muy extenso y profundiza en aspectos que no todo el mundo domina. Con esto quiero decir que hay palabras t&eacute;cnicas y ejemplos que, tal vez, solo los Inform&aacute;ticos y personas que se dedican al desarrollo de aplicaciones podr&aacute;n entender. No lo voy a traducir entero, pero creo que el resumen nos da un buen punto de partida para comprender lo que algunas personas sentimos hoy d&iacute;a que es mejorable en GNU/Linux. Algunos de los problemas que expone tienen soluci&oacute;n; otros, sencillamente, son inherentes al mundo competitivo y salvaje en que vivimos. &Eacute;sos, creedme, no se arreglar&aacute;n. Pero me callo ya, para que hable Artem:
<br />
<br />
<u><b>Art&iacute;culo original de Artem S. Tashkinov. Traducci&oacute;n de Enrique Bravo.</b></u> El documento original, en constante revisi&oacute;n, se encuentra en 
<a href="http://linuxfonts.narod.ru/why.linux.is.not.ready.for.the.desktop.current.html">este enlace</a>.
<br />
<br />
<b>Prefacio</b>
<br />En este art&iacute;culo en continua actualizaci&oacute;n, que constituye sin duda alguna la lista de este tipo m&aacute;s f&aacute;cil de entender en todo Internet, &uacute;nicamente se discuten los problemas principales y las deficiencias de Linux, que podr&iacute;an ser la raz&oacute;n por la que mucha gente dice que las distros Linux no est&aacute;n listas para su uso como sistema de escritorio. Si bien, todo el mundo deber&iacute;a tener en mente que hay parcelas donde Linux ya ha superado a otros sistemas operativos: un manejo de paquetes excelente, soporte para m&uacute;ltiples plataformas y arquitecturas &quot;out of the box&quot;, una excelente estabilidad (por lo general), inexistencia de virus o malware de amplia difusi&oacute;n, casi nunca se precisa una reinstalaci&oacute;n completa del sistema, aparte de que Linux es altamente personalizable, resulta f&aacute;cil crear &quot;scripts&quot; y es gratis.
<br />
<br />Una vez m&aacute;s, debo reiterarlo, este art&iacute;culo trata principalmente sobre distribuciones Linux, si bien muchos problemas de los que se citan afectan tambi&eacute;n al kernel.
<br />
<br />No se trata de una comparaci&oacute;n Windows contra Linux, aunque a veces se pueden tomar comparativas con Windows o Mac OS como punto de referencia (despu&eacute;s de todo, su penetraci&oacute;n en el mercado es, por mucho, mayor). La mayor&iacute;a de problemas que se detallan son de naturaleza t&eacute;cnica, si bien otros son de tipo &quot;pol&iacute;tico&quot; (no lo digo yo, as&iacute; los llaman otros) - como, por ejemplo, cuando las compa&ntilde;&iacute;as se niegan a proporcionar datos, o los dan incompletos, sobre temas de hardware, de modo que los usuarios de Linux no pueden beneficiarse de todas las caracter&iacute;sticas, o los controladores tienen errores que casi nadie en la comunidad Linux es capaz de resolver.
<br />
<br />Quisiera que una cosa quedara totalmente clara: Windows, en algunos aspectos, es incluso peor que Linux y tampoco est&aacute; preparado para ser usado como sistema de escritorio. Por poner algunos ejemplos incontestables, cito de memoria: la creciente pesadez del sistema con el paso del tiempo, el sistema de ficheros y la jerarqu&iacute;a del registro (a&uacute;n no he encontrado una sola aplicaci&oacute;n seria que se pueda desinstalar de un modo limpio y completo), no existe un aut&eacute;ntico modo seguro, el uso como administrador del sistema no lo entienden ni lo entender&aacute;n la mayor&iacute;a de usuarios, no existe un buen sistema de empaquetado (MSI es una abominaci&oacute;n), no existe un modo de actualizar el sistema completo (incluyendo aplicaciones de terceros), la depuraci&oacute;n de errores es muy complicada de hacer, en muchos casos en que Windows no arranca es casi imposible resolver el problema para un usuario normal... Windows depende del hardware (en especial, en sistemas con UEFI) y, en la mayor&iacute;a de los casos no se puede actualizar el sistema de una forma segura (siempre quedar&aacute;n miles de restos), etc.
<br />
<br />Es posible que hayas o&iacute;do muchas veces que Android supone el modo en que Linux ha conquistado el mundo, pues lo incorporan la mayor&iacute;a de tel&eacute;fonos inteligentes (que son, ciertamente, peque&ntilde;os ordenadores especializados, mas no sistemas de escritorio). Sin embargo, hay dos cosas importantes que conviene considerar: primero, Android no es Linux (&iquest;conoces a alguien que use Android en su ordenador de sobremesa o port&aacute;til?). Android solamente contiene un componente Linux: el kernel (en concreto, es una versi&oacute;n antigua para el a&ntilde;o en que estamos, mantenida y soportada &uacute;nicamente por Google). Segundo, Android no es un sistema de escritorio, es un sistema operativo para dispositivos m&oacute;viles, tablets y otros artilugios t&aacute;ctiles. De modo que este art&iacute;culo no trata sobre Android, sino sobre la plaga de distribuciones Linux y software libre y de c&oacute;digo abierto incluido en dichas distros.
<br />
<br />
<a href="https://es.wikipedia.org/wiki/Miguel_de_icaza">Miguel de Icaza</a>, el creador de Gnome y Mono (
<i>N. del T.: ser&iacute;a m&aacute;s bien, co-creador de Gnome, en cualquier caso</i>), opinaba sobre los problemas de Linux en t&eacute;rminos parecidos. Dej&oacute; de usar Linux en 2012, y dec&iacute;a lo siguiente sobre su Mac: &quot;Desde el punto de vista tecnol&oacute;gico, estas vacaciones de tres semanas han resultado muy relajantes. Mi equipo suspende y vuelve de la suspensi&oacute;n sin problemas, el WiFi funciona, el sonido nunca ha dejado de funcionar, he pasado tres semanas sin tener que recompilar el kernel para arreglar esto o aquello, sin pelearme con los controladores gr&aacute;ficos, o hacer frente a la extra&ntilde;a y aleatoria p&eacute;rdida de velocidad que sufr&iacute;a mi ThinkPad&quot;. De este modo subrayaba alguna de las &aacute;reas m&aacute;s problem&aacute;ticas de Linux. Recientemente, 
<a href="https://www.youtube.com/watch?v=jjRAKuis7T8#t=979">Linus Torvalds</a> expresaba su absoluto descontento con el estado actual de Linux en el escritorio.
<br />
<br />Los desarrolladores de Ubuntu decidieron impulsar a su sistema como una plataforma de juegos viable, identificando los problemas que deben resolverse para alcanzar dicha meta. Incre&iacute;blemente, la lista que han publicado coincide con la que vas a leer m&aacute;s abajo, casi palabra por palabra.
<br />
<br />Algunos desarrolladores de Fedora propusieron realizar cambios en la distro en aras de proveerla de 
<a href="https://es.wikipedia.org/wiki/Interfaz_de_programaci%C3%B3n_de_aplicaciones">APIs</a> y 
<a href="https://en.wikipedia.org/wiki/Application_binary_interface">ABIs</a> estables que evitaran regresiones en la medida de lo posible.
<br />
<br />Algunas consideraciones importantes a tener en cuenta antes de leer esta lista:
<br />
<br />- Si crees que Linux es perfecto y no tiene problemas, por favor, cierra esta p&aacute;gina.
<br />
<br />- Si crees que cualquier cr&iacute;tica a Linux solo busca perjudicarlo, por favor, cierra esta p&aacute;gina.
<br />
<br />- Si crees que el prop&oacute;sito de este art&iacute;culo es probar que &quot;nunca funciona nada en Linux, o que Linux es casi inutilizable&quot;, te equivocas, por favor, cierra esta p&aacute;gina.
<br />
<br />- Si crees que Linux y sus usuarios pueden vivir y trabajar bien sin programas y juegos comerciales, por favor, cierra esta p&aacute;gina.
<br />
<br />- Si crees que estoy aqu&iacute; para promocionar Windows o Mac OS, por favor, cierra esta p&aacute;gina.
<br />
<br />- Si crees que estoy aqu&iacute; para proclamar mentiras&nbsp; y sembrar miedo, incertidumbre y dudas sobre Linux, por favor, cierra esta p&aacute;gina inmediatamente y no vuelvas nunca m&aacute;s. &iquest;Qu&eacute; est&aacute;s haciendo aqu&iacute;, a todo esto? Por favor, vuelve a tus &quot;flame wars&quot; y tus difamaciones.
<br />
<br />Ten en cuenta que esta lista sirve al prop&oacute;sito de descubrir qu&eacute; hay que arreglar en Linux, m&aacute;s all&aacute; de solo se&ntilde;alar los fallos que tiene.
<br />
<br />
<b>La lista (resumida) de problemas</b>
<br />(
<i>N. del T.: ten&eacute;is la lista completa, complet&iacute;sima de hecho, en el <a href="http://linuxfonts.narod.ru/why.linux.is.not.ready.for.the.desktop.current.html">enlace original</a></i>)
<br />
<b> </b>
<br />
<b>1. Falta de estabilidad, errores, regresiones, regresiones y regresiones. </b>Hay una incre&iacute;ble cantidad de regresiones, tanto en el kernel como en las aplicaciones de escritorio. Cuando las cosas parece que funcionan bien, se rompen de un modo inexplicable; algunas regresiones pueden conllevar la p&eacute;rdida de datos. B&aacute;sicamente no existe el control de calidad sobre las regresiones en la mayor&iacute;a de proyectos de FOSS (kernel incluido). Microsoft, por ejemplo, informa que Windows 8 fue probado durante 1.240.000.000 horas, mientras que cada nueva versi&oacute;n del kernel recibe, calculo yo, menos de 10.000 horas. Y cada nueva versi&oacute;n del kernel de Linux puede compararse a una nueva versi&oacute;n de Windows. Los errores graves, los que impiden el flujo de trabajo normal, pueden estar a&ntilde;os sin resolverse. Un mont&oacute;n de hardware de crucial importancia, como GPUs y tarjetas WiFi, no funcionan correctamente.
<br />
<br />
<b>2. Problemas de hardware. </b>Bajo Linux, muchos dispositivos y sus caracter&iacute;sticas asociadas est&aacute;n mal soportadas, o no soportadas en absoluto. Hay hardware (adaptadores WiFi Broadcom, por ejemplo) que no se puede usar a menos que ya poseas una conexi&oacute;n a Internet que funcione. El hardware nuevo es soportado, a veces, meses despu&eacute;s de su aparici&oacute;n. Los programas especializados, para el manejo de dispositivos como impresoras, esc&aacute;neres, c&aacute;maras, webcams, reproductores de sonido, tel&eacute;fonos inteligentes, etc. casi nunca est&aacute;n disponibles, de modo que no ser&aacute;s capaz de acceder con plenas garant&iacute;as a tu nuevo iPad o actualizar el firmware de tu Galaxy SIII. El soporte gr&aacute;fico en Linux es un maldito embrollo porque las APIs/ABIs del kernel/X.org cambian constantemente, y las compa&ntilde;&iacute;as como Nvidia, ATI, Broadcom, etc. no desean destinar recursos adicionales y desperdiciar su dinero solo para mantenerse al d&iacute;a con el continuo y absurdo ritmo de los cambios en el FOSS.
<br />
<br />
<b>3. La falta de estandarizaci&oacute;n, la fragmentaci&oacute;n, la falta de garant&iacute;as y la excesiva variedad. </b>Hay demasiadas distribuciones Linux con configuraciones, librer&iacute;as y sistema de empaquetado incompatibles entre s&iacute;. Distros diferentes que emplean entornos de escritorio totalmente distintos, aplicaciones gr&aacute;ficas y de consola diferentes para configurar el escritorio, etc. Debian y derivadas, por ejemplo, te obligan a usar la utilidad de texto &quot;dpkg-reconfigure&quot; para hacer ciertas tareas relativas al mantenimiento del sistema.
<br />
<br />
<b>4. La falta de cooperaci&oacute;n entre los desarrolladores de software libre y las guerras internas. </b>No existe un organismo central que regule el desarrollo de las distintas partes del software libre, lo que a menudo conduce a una situaci&oacute;n en que los cambios introducidos por un proyecto termina por romper otros proyectos (el mismo problema se refleja en las APIs/ABIs inestables, que veremos ahora). Aunque el movimiento del software libre carece de suficiente mano de obra,las distintas distros siempre encuentran los recursos necesarios para realizar &quot;forks&quot; o proyectos alternativos (los desarrolladores de Gentoo van a crear una alternativa a udev; un desencuentro en ffmpeg llev&oacute; a la aparici&oacute;n de libav; la situaci&oacute;n en OpenOffice y LibreOffice; la nueva alternativa a X.org/Wayland llamada Mir) y para usar sus propias soluciones (Ubuntu no usar&aacute; systemd).
<br />
<br />
<b>5. Un mont&oacute;n de r&aacute;pidos cambios. </b>La mayor&iacute;a de distros tienen unos ciclos de actualizaci&oacute;n y lanzamiento demasiado cortos, tanto como seis meses en algunos casos. O, por ejemplo, Arch, que es una &quot;rolling release&quot;, o Fedora, que se actualiza cada seis meses. Te bombardean constantemente con cambios que ni esperas ni deseas. Las distros LTS (de soporte a largo plazo) no son usables en la mayor&iacute;a de los casos, debido a la pol&iacute;tica que emplean de mantener versiones muy antiguas de las aplicaciones de escritorio. Y, normalmente, no hay manera oficial de instalar versiones m&aacute;s nuevas (por favor, no me habl&eacute;is de los PPAs y los backports, estos no son soportados oficialmente ni se garantiza que funcionen bien). Otro problema de las distros LTS es que los kernels que incorporan, muchas veces, no soportan el hardware m&aacute;s nuevo.
<br />
<br />
<b>6. APIs/ABIs inestables y la falta de compatibilidad real. </b>Es muy complicado usar software antiguo, ya sea libre o privativo, en las distros modernas. En muchos casos resulta imposible, debido a cambios en los componentes principales del kernel, en el compilador GCC o en glibc. La casi inexistencia de la retro-compatibilidad entre versiones hace que sea incre&iacute;blemente dif&iacute;cil y costoso crear aplicaciones de c&oacute;digo cerrado para distros Linux. El software libre que se queda sin desarrolladores activos o mantenedores, simplemente no sirve si sus dependencias no pueden cumplirse debido a librer&iacute;as antiguas y obsoletas que ya no est&aacute;n disponibles. Por este motivo, por ejemplo, montones de aplicaciones de KDE3/Qt3 ya no est&aacute;n disponibles en las distros modernas, aunque no exista una alternativa v&aacute;lida. El desarrollo de controladores, m&aacute;s all&aacute; del kernel de Linux, supone un esfuerzo insoportable y caro. No hay alternativa a 
<a href="https://en.wikipedia.org/wiki/Winsxs">WinSxS</a> para Linux, pues no hay un modo sencillo de instalar las librer&iacute;as con conflictos.
<br />
<br />
<b>7. Problemas de software. </b>Hay pocos juegos, y muy pocos son grandes producciones. Los esfuerzos de Valve y la colaboraci&oacute;n con los desarrolladores de juegos est&aacute;n llevando a la reciente aparici&oacute;n de juegos para Linux, sin embargo, miles de t&iacute;tulos se lanzan cada a&ntilde;o exclusivamente para Windows. No existen programas de aspecto parecido a los de Windows, no existe MS Office (LibreOffice a&uacute;n presenta graves problemas cuando se trata de abrir correctamente documentos escritos en MS Office), no hay un 
<a href="https://es.wikipedia.org/wiki/Common_Intermediate_Format">CIF</a> nativo, que sea simple de configurar y usar, as&iacute; como un sistema de compartici&oacute;n de archivos en red encriptado y protegido por contrase&ntilde;a, ni hay un equivalente para &quot;
<a href="https://es.wikipedia.org/wiki/Active_directory">Active Directory</a>&quot;.
<br />
<br />
<b>8. Dinero, entusiasmo, motivaci&oacute;n y responsabilidad. </b>Predije, hace a&ntilde;os, que los desarrolladores de software libre comenzar&iacute;an a alejarse de esta plataforma debido a que ya no es un juego de ni&ntilde;os, como antes, ya requiere cuantiosos esfuerzos y mucho tiempo. Digamos que la diversi&oacute;n se acab&oacute;, y los desarrolladores necesitan dinero real para que se pueda terminar el trabajo duro. El desarrollo de software libre, que carece de un respaldo financiero real, comienza a mostrar signos de fatiga y desilusi&oacute;n. Despu&eacute;s de todo, se requieren desarrolladores motivados econ&oacute;micamente, pues los proyectos sin fondos comienzan a desaparecer y a dejar errores cr&iacute;ticos sin resolver durante a&ntilde;os. Siempre se puede decir que proyectos as&iacute; no se echan de menos, pero el problema, en muchos casos, es que estos proyectos moribundos no tienen alternativas v&aacute;lidas o sus sucesores no est&aacute;n a la altura.
<br />
<br />
<b>9. No hay brillo, no hay consistencia y no se siguen las <a href="http://es.wikipedia.org/wiki/Human_Interface_Guidelines">HIG</a>. </b>Hasta los desarrolladores de KDE lo admiten.
<br />
<br />
<b>Comentarios del autor (Artem S. Tashkinov)</b>
<br />Un mont&oacute;n de nuevos usuarios de Linux o aquellos que usan muy pocas aplicaciones, r&aacute;pidamente desacreditan la lista completa diciendo cosas como &quot;el sonido en Linux a m&iacute; me funciona bien&quot; o &quot;nunca he tenido problemas con el v&iacute;deo en Linux&quot;. &iquest;Sabes qu&eacute;? Hay miles de usuarios que tienen grandes problemas porque tienen un hardware o usan un software diferente. Haceos un favor, visitad los foros de Ubuntu o Linux.com y contad el n&uacute;mero de entradas que contienen &quot;he borrado PulseAudio y solo ahora me funciona el sonido&quot; o &quot;finalmente he descubierto que puedo usar Nouveau en vez de los controladores privativos de Nvidia (o viceversa) y he arreglado el problema&quot;.
<br />
<br />Hay otro punto importante que los cr&iacute;ticos no comprenden. Si algo no funciona en Linux, a la gente le da igual de qui&eacute;n es la culpa. Autom&aacute;ticamente asumen que es culpa de Linux. Para el usuario medio, Linux es solo un sistema operativo m&aacute;s, y no le importa que la compa&ntilde;&iacute;a X no d&eacute; soporte a Linux o no desarrolle controladores plenamente operativos para Linux. El hardware que han pagado, simplemente, no funciona, ergo Linux no funciona. A la gente no le importa que Skype se cuelgue cada cinco minutos en determinadas circunstancias, aunque en realidad Skype es un p&eacute;simo programa con montones de errores y cuelgues incluso bajo Windows y Mac OS.
<br />
<br />Quisiera aclarar un concepto normalmente mal entendido sobre que el soporte a hardware antiguo es mucho mejor en Linux que en Windows. En parte es cierto, pero tambi&eacute;n falso. Por ejemplo, ni los Nouveau ni los controladores propietarios de Nvidia tienen buen soporte para las antiguas GPUs de Nvidia. La aceleraci&oacute;n de hardware en Nouveau no existe, y el 
<a href="https://es.wikipedia.org/wiki/Blob_binario">blob</a> de Nvidia no soporta muchas caracter&iacute;sticas esenciales de Xandr o funciones requeridas por los escritorios modernos de Linux, como Gnome 3 o KDE 4. En el caso de que tu hardware antiguo a&uacute;n est&eacute; m&aacute;gicamente soportado, los controladores Linux casi siempre ofrecen solo una peque&ntilde;a porci&oacute;n de las caracter&iacute;sticas que encuentras bajo Windows, de modo que decir que el soporte es mejor en Linux, solamente porque no has de pasarte 20 minutos instalando controladores, es, como m&iacute;nimo, injusto.
<br />
<br />Algunos comentarios me dejan de piedra: &quot;Es horrible, el art&iacute;culo est&aacute; lleno de medias verdades y opiniones personales. Si Nvidia no funciona bien, no lo uses, usa Intel o cualquier otra cosa&quot;. &iexcl;Y una mierda, se&ntilde;or m&iacute;o! &iquest;Me compr&eacute; el port&aacute;til para disfrutar de juegos con Wine o hacer arranque dual con Windows y usted me dice que no me lo tendr&iacute;a que haber comprado? Le sugiero, cort&eacute;smente, que no imponga su opini&oacute;n a otras personas que a lo mejor encuentran diversi&oacute;n jugando a juegos de gran calidad. Decir que 
<a href="https://es.wikipedia.org/wiki/SSHFS">SSHFS</a> puede reemplazar a Windows File Sharing es lo m&aacute;s rid&iacute;culo que he o&iacute;do en toda mi vida.
<br />
<br />Es preciso recalcar que los participantes que m&aacute;s se hacen oir en la comunidad del software libre son extremadamente insidiosos y gente exageradamente idealista, que demandan continuamente que todos los programas sean de c&oacute;digo abierto y gratis, o de lo contrario, no hay raz&oacute;n para que existan en Linux. Con actitudes como esta no sorprende que un mont&oacute;n de compa&ntilde;&iacute;as ignoren y rehuyan al escritorio Linux. Linus Torvalds habl&oacute; en una ocasi&oacute;n sobre esto: &quot;Hay extremistas en el mundo del software libre, &eacute;se es uno de los motivos principales por los que ya nunca digo que hago software libre. No quiero que se me asocie con gente para la que el software libre representa exclusi&oacute;n y odio&quot;.
<br />
<br />Lo m&aacute;s importante es que esta lista no es una opini&oacute;n. Casi cada punto listado aporta enlaces a los respectivos art&iacute;culos, hechos y discusiones que prueban mi afirmaci&oacute;n. (
<i>N. del T.: se pueden consultar dichos enlaces en el extens&iacute;simo art&iacute;culo original</i>).
<br />
<br />
<b>El lado positivo</b>
<br />Si por leer este art&iacute;culo tienes la impresi&oacute;n de que Linux es un asco, est&aacute;s completamente equivocado. Si tuviera que crear una lista de los problemas de Windows ser&iacute;a casi tan larga como esta. Los problemas inherentes a Windows son casi imposibles de solucionar, a menos que Microsoft volviera a reescribirlo desde cero. Los problemas de Linux son, en realidad, abordables.
<b> </b>
<br />
<br />Por fortuna, en la actualidad hay varios proyectos en desarrollo que pretenden unir el escritorio Linux y hacerlo verdaderamente moderno y unificado. Como son systemd, Wayland, el sistema &uacute;nico de ficheros propuesto e implementado por Fedora, y otros m&aacute;s. Valve ha desarrollado Steam (plataforma de distribuci&oacute;n de juegos) para Linux, abriendo la puerta a la posibilidad de que se hagan verdaderos juegos de primera clase para este sistema (han prometido portar todos los grandes juegos de Windows a Linux a lo largo de 2014, la mejor noticia en el mundo de Tux en los &uacute;ltimos 10 a&ntilde;os). Nvidia est&aacute; estudiando opciones para soportar Optimus bajo Linux. Linus Torvalds cree que las APIs en Linux se han vuelto mucho m&aacute;s estables, aunque yo no comparto su optimismo. Los desarrolladores de Ubuntu me han escuchado y han creado un formato de paqueter&iacute;a unificado.
<br />
<br />
<b>Postdata</b>
<br />A veces encuentro motivos de sobra para decir que Linux es un asco y que lo odio con todas mis fuerzas. A 
<a href="http://es.wikipedia.org/wiki/Lennart_Poettering">Lennart Poettering</a> le importa un carajo c&oacute;mo quiero usar mi sistema (
<i>N. del T.: se refiere a <a href="https://bugzilla.redhat.com/show_bug.cgi?id=817186">dos</a> <a href="https://bugzilla.redhat.com/show_bug.cgi?id=817183">errores</a> reportados por &eacute;l que no han obtenido respuesta satisfactoria, en su opini&oacute;n</i>). &quot;Soy desarrollador, s&eacute; mejor que nadie lo que quieren los usuarios y c&oacute;mo usan su sistema y sus programas&quot;, es lo que dice el desarrollador medio en Linux. El resultado final es que la mayor&iacute;a de novedades provocan el asco y el enfado general. Gnome 3, Unity y KDE 4.0 son los ejemplos perfectos de esta tendencia a fastidiar al usuario en Linux.
<br />
<br />
<b>Fin de la traducci&oacute;n del art&iacute;culo original ----------------------------------------</b>
<br />
<br />Bueno, se podr&aacute; estar m&aacute;s o menos de acuerdo con lo que expone, pero no me negar&eacute;is que el art&iacute;culo est&aacute; trabajado y que sabe de lo que habla. Desde mi punto de vista hay cosas que no soy capaz de rebatir por falta de conocimientos, pero hay otras muchas que no tengo m&aacute;s remedio que aplaudir, aunque no me gusten. En realidad, Tashkinov inici&oacute; esta lista hace varios a&ntilde;os, y con el transcurrir del tiempo ha ido eliminando gran cantidad de cosas que ya se han conseguido solucionar. No obstante, la lista sigue siendo muy larga.
<br />
<br />En particular, por rebatir algo, no entiendo por qu&eacute; considera que cada versi&oacute;n del kernel de Linux es comparable a un nuevo Windows. Dir&iacute;a que no cabe comparaci&oacute;n posible, del mismo modo que el c&aacute;lculo que presupone de las horas dedicadas al testeo del kernel no s&eacute; de d&oacute;nde lo saca.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-Gas3MO0w84I/T5wECw0S5UI/AAAAAAAAAo8/bjlxtOAj2fY/s1600/Ubuntu8.png"><img height="120" src="http://3.bp.blogspot.com/-Gas3MO0w84I/T5wECw0S5UI/AAAAAAAAAo8/bjlxtOAj2fY/s1600/Ubuntu8.png" width="400" /></a>
</div>
<br />Quiz&aacute;s la parte con la que estoy m&aacute;s de acuerdo es aquella en que expone el problema que un lector se&ntilde;alaba en los comentarios del art&iacute;culo anterior publicado en este blog. T&uacute; puedes instalar con total comodidad la versi&oacute;n m&aacute;s actualizada del programa X en Windows XP (trece a&ntilde;os despu&eacute;s de su lanzamiento), pero te las ves y te las deseas para hacer lo mismo en Debian estable. Mucha gente, y me incluyo, desea un kernel y unos componentes centrales del sistema estables y duraderos, pero tambi&eacute;n quiere poder usar las nuevas versiones de aplicaciones, cuando &eacute;stas incorporan funcionalidades que no traen las versiones anteriores. En su opini&oacute;n, backports y PPAs no funcionan bien... algo que tambi&eacute;n es rebatible, seg&uacute;n qu&eacute; casos.
<br />
<br />El objetivo de publicar esta traducci&oacute;n/resumen en LSDH es mover a la reflexi&oacute;n y al debate. Soy plenamente consciente de que es muy f&aacute;cil que dicha discusi&oacute;n derive en &quot;flamewar&quot;, pero estoy dispuesto a correr ese riesgo. Se&ntilde;alar los defectos de aquello que disfrutas, con el noble prop&oacute;sito de que pueda mejorar alg&uacute;n d&iacute;a, no me parece una mala pr&aacute;ctica. Siempre podremos optar por ponernos una venda y arremeter contra todo aquello que supone una cr&iacute;tica constructiva hacia nuestro sistema operativo preferido, aun cuando dicha cr&iacute;tica provenga de personas que han dedicado muchas horas de su vida al desarrollo del mismo. Ello nos convertir&iacute;a, en mi humilde opini&oacute;n, en parte del problema.</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" st_title="Principales problemas de Linux en el escritorio | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/windows/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta windows</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 321,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>