<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores"><span itemprop="headline">Chakra Euler: conocimos tiempos mejores</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/kde"><img title="kde" alt="kde" src="/assets/images/labels/kde.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/10/chakra-euler-conocimos-tiempos-mejores.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-10-20T09:40" itemprop="dateModified">Actualizado el lunes, 20 de octubre de 2014 a las 09:40 UTC</span></div><div><span>
Etiquetado como
revision, chakra, <a href="/label/kde"><span itemprop="articleSection">kde</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Bienvenidos a una nueva etapa de revisiones en el blog. Motivado por un renovado esp&iacute;ritu curioso y unas tremendas ganas de retomar la principal y m&aacute;s demandada actividad de LSDH, me dispongo a relatar mis experiencias con un nuevo lanzamiento de la que siempre consider&eacute; mi distribuci&oacute;n favorita: Chakra Euler. Como muchos ya sab&eacute;is, 
<a href="http://www.lasombradelhelicoptero.com/p/chakra.html">Chakra</a> es una distro tipo &quot;semi-rolling&quot;, que publica una imagen con el estado de los repositorios cuatro veces al a&ntilde;o, aprovechando habitualmente para actualizar los paquetes centrales y cr&iacute;ticos. Pero el continuo lanzamiento de nuevas versiones no es &oacute;bice para que, de cuando en cuando echemos un vistazo escrutador, siempre con cari&ntilde;o, eso s&iacute;, al momento en que se encuentra la distro.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-4Ga3QOa_nUM/Uht2iSk_bqI/AAAAAAAAD68/CyVtrBza2FI/s1600/chakra-logo1.png"><img src="http://3.bp.blogspot.com/-4Ga3QOa_nUM/Uht2iSk_bqI/AAAAAAAAD68/CyVtrBza2FI/s1600/chakra-logo1.png" height="320" width="320" /></a>
</div>
<br />
<br />
<a></a>Antes de comenzar considero importante hacer un par de puntualizaciones sobre las clasificaciones. He introducido alg&uacute;n cambio en los par&aacute;metros, confiriendo mayor importancia al rendimiento ofrecido, de modo que a la tradicional bater&iacute;a de pruebas de la Phoronix Test Suite se viene a a&ntilde;adir un &quot;benchmark&quot; de navegadores (Browsermark 2.1) que ejecuto sobre los dos m&aacute;s utilizados (Firefox y Chrome), a la par que incluyo el tiempo de transferencia de archivos a dispositivos externos como indicador de calidad.
<br />
<br />Tambi&eacute;n contamos a partir de ahora con una correcci&oacute;n por errores (leves, moderados o graves), con la idea de reflejar fallos de la distribuci&oacute;n que no entran en ninguna de las categor&iacute;as estudiadas. Pod&eacute;is consultar el remozado sistema de calificaciones en 
<a href="http://www.lasombradelhelicoptero.com/p/asi-hacemos-las-pruebas.html">este enlace</a>. Por pura l&oacute;gica y sentido de la justicia, se hace necesario hacer tabla rasa y volver a comenzar la clasificaci&oacute;n desde el principio. Pues bien, Chakra ha de ser la primera en someterse a revisi&oacute;n con nuestro particular sistema, el cual, os recuerdo, hace especial hincapi&eacute; en la facilidad de uso, la estabilidad y la experiencia de usuario. No son nimiedades, desde luego. Vamos al turr&oacute;n, pues.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Tribe sigue y seguir&aacute; en estado alfa. Se trata, pese a ello, de un instalador muy bueno, de los mejores que podemos encontrar ah&iacute; fuera, pero sigue adoleciendo de caracter&iacute;sticas que son cada vez m&aacute;s comunes en sus &quot;competidores&quot; (n&oacute;tense las comillas, por favor). Y cuanto m&aacute;s tiempo pasa m&aacute;s inexplicable resulta la ausencia de mejoras... hasta que uno lee que han decidido prescindir de Tribe para futuras versiones, sustituy&eacute;ndolo por 
<a href="https://github.com/calamares/calamares">Calamares</a>, un nuevo marco de instalaci&oacute;n que se prev&eacute; implementar en muchas distribuciones. No s&eacute; qu&eacute; aspecto tendr&aacute;, pero con el nombre se pod&iacute;an haber esmerado un poco m&aacute;s. En cualquier caso, una forma de acercamiento y de convergencia entre distribuciones que no ser&eacute; yo quien desmerezca: me parece una gran idea.
<br />
<br />Entre las cosas que me enervan de Tribe est&aacute; una que nunca he comprendido por qu&eacute; ocurre: la mezcla de textos en ingl&eacute;s y en espa&ntilde;ol. Como usuario colaborador en la traducci&oacute;n de la distro y sus herramientas, v&iacute;a 
<a href="https://www.transifex.com/projects/p/chakra/language/es/">Transifex</a>, simplemente no puedo entender por qu&eacute;, lanzamiento tras lanzamiento, si uno escoge el idioma de Cervantes siempre surgen m&uacute;ltiples p&aacute;rrafos de texto en Tribe que no se muestran traducidos, cuando me consta que s&iacute; hemos trabajado sobre ellos. Puede parecer una tonter&iacute;a, pero afea mucho el aspecto profesional de la distribuci&oacute;n.
<br />
<br />Y luego est&aacute; lo peor: la err&aacute;tica instalaci&oacute;n de los controladores propietarios de AMD, los archiconocidos Catalyst. Chakra siempre fue una de las pocas (puede que la &uacute;nica, no estoy seguro) distribuciones que permitieron al usuario/sufridor de estas tarjetas y APUs poder disponer de los controladores propietarios desde el mismo momento de la instalaci&oacute;n. En pasadas ediciones de Chakra ni siquiera se pod&iacute;a iniciar en modo controladores no libres, mientras que en la que hoy nos ocupa, se inicia e incluso se logra instalar, para luego descubrir que se est&aacute; usando un controlador vesa que ser&aacute; fuente de no pocos problemas, como veremos a continuaci&oacute;n.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-IUdBFTOFl4o/VETLK3ZVm1I/AAAAAAAAEuc/JoRDX4013Nw/s1600/instant%C3%A1nea2.png"><img src="http://1.bp.blogspot.com/-IUdBFTOFl4o/VETLK3ZVm1I/AAAAAAAAEuc/JoRDX4013Nw/s1600/instant%C3%A1nea2.png" height="320" width="400" /></a>
</div>
<br />La instalaci&oacute;n la hice con una resoluci&oacute;n de pantalla muy baja (1024x768). Tras el primer reinicio s&iacute; pude usar una resoluci&oacute;n adecuada, pero a qu&eacute; precio: los sucesivos reinicios colgaban el sistema, no era capaz de apagar el equipo (quedaba en bucle infinito y necesitaba de un &quot;hard reset&quot;), no se reproduc&iacute;a el v&iacute;deo con Dragon Player... Ya preve&iacute;a un desastre en las puntuaciones cuando ca&iacute; en la cuenta de que todo se deb&iacute;a a que estaba utilizando un controlador de v&iacute;deo gen&eacute;rico (vesa), en lugar del que yo cre&iacute;a que Tribe hab&iacute;a instalado (Catalyst). La soluci&oacute;n pasa por instalar manualmente los controladores, siguiendo las indicaciones de la 
<a href="http://chakraos.org/wiki/index.php?title=Catalyst">wiki de Chakra</a>.
<br />
<br />Solventado este importante asunto, que provoca que Chakra inaugure, a mi pesar, las correcciones negativas por fallos graves (la distro queda casi inutilizable con el controlador gen&eacute;rico), me encuentro con un escritorio que presenta el familiar aspecto de siempre. Una est&eacute;tica inigualable, para mi gusto personal. Kapudan nos da, como otras veces, la bienvenida, aunque lo sigue haciendo a medias entre ingl&eacute;s y espa&ntilde;ol (volvemos a lo mismo de antes). A destacar la inclusi&oacute;n de la posibilidad de activar el repositorio extra desde el propio Kapudan, as&iacute; como las notificaciones de actualizaciones de software en la barra de tareas.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-E2-0-t14-FU/VETLUeq3ZTI/AAAAAAAAEuk/HCl7MHJtlsc/s1600/instant%C3%A1nea3.png"><img src="http://1.bp.blogspot.com/-E2-0-t14-FU/VETLUeq3ZTI/AAAAAAAAEuk/HCl7MHJtlsc/s1600/instant%C3%A1nea3.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />El Chakra Euler instalado en mi equipo se inicia en 45 segundos y se apaga en tan solo 7. Son tiempos m&aacute;s que aceptables. El men&uacute; de elecci&oacute;n de sistema en el arranque (&quot;aka&quot; Grub) est&aacute; en perfecta consonancia con el tono art&iacute;stico del resto de la distribuci&oacute;n, algo que, como siempre, debemos al fenomenal trabajo de 
<a href="http://ext4.wordpress.com/">Malcer</a>. El sistema que habitualmente empleo, Ubuntu 14.04, es reconocido y se puede iniciar sin problemas.
<br />
<br />
<b>Software</b>
<br />La colecci&oacute;n de programas por defecto que incluye Chakra Euler es adecuada, con soluciones para la mayor&iacute;a de tareas b&aacute;sicas que un usuario pueda precisar. Cabe recordar para los puristas de Qt que si no se activa el repositorio extra no se podr&aacute; instalar nada que incluya librer&iacute;as Gtk. Es por ello que todos los programas que vienen con Chakra beben de las fuentes de las librer&iacute;as Qt: el navegador Rekonq (2.4.2), la suite Calligra (2.8.6), el reproductor de medios Amarok (2.8.0) o el de v&iacute;deo Dragon Player (2.0) son solo algunos ejemplos. Considero un acierto la inclusi&oacute;n, en su momento, de Octopi para facilitar la instalaci&oacute;n de software a usuarios poco c&oacute;modos con el uso de la terminal, si bien el propio programa llama a una instrucci&oacute;n que ejecuta el shell de comandos. Pese a esto, es sencillo de usar y cuenta con un indicador de actualizaciones, como comentaba antes.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-24JBlJ_vPuc/VETLcWFspZI/AAAAAAAAEus/YQlflAFQzn4/s1600/instant%C3%A1nea5.png"><img src="http://1.bp.blogspot.com/-24JBlJ_vPuc/VETLcWFspZI/AAAAAAAAEus/YQlflAFQzn4/s1600/instant%C3%A1nea5.png" height="320" width="400" /></a>
</div>
<br />
<b>Hardware</b>
<br />Comenzar&eacute; con todo lo que Chakra Euler reconoce con solo encenderlo: el esc&aacute;ner (probado con Skanlite), la webcam (&iacute;dem, con VLC, pues no funciona Kamoso) y el adaptador de red wifi (funciona desde el entorno en vivo pre-instalaci&oacute;n). La impresora es caso aparte, por desgracia, al precisar de un software propietario (un &quot;plugin&quot; de HP), problema que en otras ocasiones logr&eacute; salvar usando el controlador &quot;foo2zjs&quot;, disponible en CCR. A d&iacute;a de hoy, dicho paquete no est&aacute; actualizado (falla la suma MD5) y se debe instalar de modo manual. Pese a no ser excesivamente complicado (lo explico 
<a href="http://www.lasombradelhelicoptero.com/2014/04/solucionando-problemas-en-chakra.html">aqu&iacute;</a>), yo dir&iacute;a que excede los conocimientos de un usuario novel o medio, por lo que no puedo reconocer a Chakra el m&eacute;rito de proporcionar una f&aacute;cil instalaci&oacute;n de la impresora que poseo, cosa que s&iacute; hace, por ejemplo, Ubuntu.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-mkrcWaZM_fc/VETLpl3k-EI/AAAAAAAAEu0/bZCPwrGXhtg/s1600/instant%C3%A1nea8.png"><img src="http://4.bp.blogspot.com/-mkrcWaZM_fc/VETLpl3k-EI/AAAAAAAAEu0/bZCPwrGXhtg/s1600/instant%C3%A1nea8.png" height="320" width="400" /></a>
</div>
<br />Todo ello ocurre a pesar de que, con solo encender la impresora, se nos muestra el mensaje de que se est&aacute; configurando y que, tras unos segundos, queda &quot;lista para imprimir&quot;. Pronto descubriremos que no es as&iacute;: la impresora no imprime y se necesitan seguir los pasos anteriormente descritos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-LqQytlrh8e0/VETLwxtvTLI/AAAAAAAAEu8/x6pyIai7Los/s1600/instant%C3%A1nea9.png"><img src="http://3.bp.blogspot.com/-LqQytlrh8e0/VETLwxtvTLI/AAAAAAAAEu8/x6pyIai7Los/s1600/instant%C3%A1nea9.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />En el apartado referente a la conectividad, Chakra Euler falla en la comunicaci&oacute;n con mi equipo port&aacute;til con Windows 7 a trav&eacute;s del protocolo habitual (samba). Pese a estar instalado de serie, el servicio correspondiente de systemd (samba.service) no parece funcionar, lo que provoca un mensaje de error en Dolphin al intentar acceder al equipo remoto. La copia de archivos a pendrive, disco duro externo USB y tarjeta de memoria SD-mini se produce sin contratiempos, aunque en todos los dispositivos la velocidad alcanzada es inferior a la lograda en Ubuntu.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-WF7sekDzhGY/VETL9MWwszI/AAAAAAAAEvE/c-_rmB2NicY/s1600/instant%C3%A1nea12.png"><img src="http://4.bp.blogspot.com/-WF7sekDzhGY/VETL9MWwszI/AAAAAAAAEvE/c-_rmB2NicY/s1600/instant%C3%A1nea12.png" height="320" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-sAD3pBUPGBU/VETMEI8mATI/AAAAAAAAEvM/njz94UUeLfU/s1600/instant%C3%A1nea14.png"><img src="http://3.bp.blogspot.com/-sAD3pBUPGBU/VETMEI8mATI/AAAAAAAAEvM/njz94UUeLfU/s1600/instant%C3%A1nea14.png" height="320" width="400" /></a>
</div>
<br />Mas no todo es negativo, pues no queda ni rastro de las cuestiones comentadas en mi entrada &quot;
<a href="http://www.lasombradelhelicoptero.com/2014/04/solucionando-problemas-en-chakra.html">Solucionando problemas en Chakra</a>&quot; en lo que respecta a las congelaciones del escritorio y la baj&iacute;sima velocidad de transmisi&oacute;n. Punto positivo para el equipo de Chakra.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-0BiBQwZtZuo/VETML_AZdaI/AAAAAAAAEvU/QMmCTzH_ykc/s1600/instant%C3%A1nea11.png"><img src="http://3.bp.blogspot.com/-0BiBQwZtZuo/VETML_AZdaI/AAAAAAAAEvU/QMmCTzH_ykc/s1600/instant%C3%A1nea11.png" height="320" width="400" /></a>
</div>
<br />
<b>Experiencia de uso</b>
<br />Como ya es habitual con esta distribuci&oacute;n, se nos ofrece una experiencia &quot;out-of-the-box&quot; pr&aacute;cticamente perfecta en cuanto a reproducci&oacute;n de formatos de archivo. Podemos abrir casi todo lo que almacenamos en nuestro disco sin recurrir a la instalaci&oacute;n de programas adicionales. El &uacute;nico pero est&aacute; en que Dragon Player no abre el formato de v&iacute;deo digital (.dv), algo que se resuelve f&aacute;cilmente con la instalaci&oacute;n de VLC.
<br />
<br />Rekonq, por otra parte, sigue presentando algunas lagunas en determinadas p&aacute;ginas. Si optamos por Firefox (que, recordemos, est&aacute; en el repositorio extra), es altamente aconsejable instalar los paquetes oxygen-gtk2 y oxygen-gtk3 si no queremos que se vea realmente horrible.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-xMlzjAzXxhc/VETM8sdiKwI/AAAAAAAAEvo/R6wij6xEUVU/s1600/instant%C3%A1nea17.png"><img src="http://1.bp.blogspot.com/-xMlzjAzXxhc/VETM8sdiKwI/AAAAAAAAEvo/R6wij6xEUVU/s1600/instant%C3%A1nea17.png" height="320" width="400" /></a>
</div>
<br />
<b>Estabilidad</b>
<br />M&aacute;s all&aacute; de lo referido anteriormente acerca del controlador de v&iacute;deo err&oacute;neo, cuando ca&iacute; en la cuenta y puse remedio al tema se resolvieron todos los extra&ntilde;os comportamientos (impropios de Chakra, la verdad) que me hab&iacute;an acontecido. Abreviando: si eres el sufrido poseedor de una tarjeta gr&aacute;fica o APU de AMD y deseas instalar Chakra Euler tienes dos opciones: quedarte con los controladores libres, que funcionan muy bien siempre que no vayas a utilizar el equipo para jugar o, como segunda posibilidad, instalar la distro con dichos controladores libres para luego recurrir a la 
<a href="http://chakraos.org/wiki/index.php?title=Catalyst">wiki</a> y pasar a los privativos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-gmcHM3wUI0w/VETM2u4ZjYI/AAAAAAAAEvg/5W8MAYWJwcw/s1600/instant%C3%A1nea16.png"><img src="http://1.bp.blogspot.com/-gmcHM3wUI0w/VETM2u4ZjYI/AAAAAAAAEvg/5W8MAYWJwcw/s1600/instant%C3%A1nea16.png" height="320" width="400" /></a>
</div>
<br />
<b>Fluidez</b>
<br />Nada negativo que destacar en este apartado, lo normal cuando hablamos de Chakra. Un KDE liviano y, sin embargo, est&eacute;tica y funcionalmente perfecto, como es marca de la casa. Pasan los a&ntilde;os, pasan las distros, y sigo sin encontrar una experiencia KDE parecida a la que ofrece Chakra.
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Que los controladores privativos de AMD son cada vez peores es algo que, por desgracia, parece irrefutable. Hace ya varios meses que me resulta imposible, use la distro que use, suspender a RAM o hibernar. &Uacute;nicamente se puede hacer en Windows, pues cualquier intento de hacerlo en GNU/Linux provoca que, inmediatamente tras entrar en estado de suspensi&oacute;n o hibernaci&oacute;n, el equipo se reinicie. Si Nvidia mereci&oacute; en su momento el famoso dedo de Linus, &iquest;cu&aacute;ntos dedos merece, por acumulaci&oacute;n, AMD? Pues eso.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-iGlCtFQEiMM/VETNuivCVvI/AAAAAAAAEvw/WaK73Jn0kY4/s1600/Linus%2Bfinger.png"><img src="http://2.bp.blogspot.com/-iGlCtFQEiMM/VETNuivCVvI/AAAAAAAAEvw/WaK73Jn0kY4/s1600/Linus%2Bfinger.png" height="223" width="400" /></a>
</div>
<br />
<b>Rendimiento</b>
<br />Como ya comentaba m&aacute;s arriba, me he propuesto dar mayor importancia a las pruebas de rendimiento a la hora de evaluar las distribuciones GNU/Linux. Contamos ahora con 10 puntos de prueba con los que estimar el mejor o peor desempe&ntilde;o respecto a Ubuntu LTS, en los que Chakra solamente es superior en 3 de ellos. Destaca la gran velocidad de codificaci&oacute;n de formato FLAC, mientras que, por el contrario, se muestra bastante inferior en el rendimiento gr&aacute;fico (pese a Unity, lo que son las cosas) y en la transferencia de datos a dispositivos externos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Hhrv_W32xAY/VETOQ4I95pI/AAAAAAAAEv4/FViMBLQyFz8/s1600/instant%C3%A1nea20.png"><img src="http://1.bp.blogspot.com/-Hhrv_W32xAY/VETOQ4I95pI/AAAAAAAAEv4/FViMBLQyFz8/s1600/instant%C3%A1nea20.png" height="320" width="400" /></a>
</div>
<br />Sienta bien volver a las revisiones, mejor de lo que esperaba. Lo cierto es que hab&iacute;a llegado a un punto de saturaci&oacute;n que aconsejaba descansar y dedicarse a otras historias. Superado el mal momento, he disfrutado con la evaluaci&oacute;n y probatura de mi distro preferida, la que adorna la cabecera de este blog.
<br />
<br />Y eso es as&iacute; aunque actualmente no la use demasiado a menudo. Es una cuesti&oacute;n de practicidad y compatibilidad, a la par que de seguridad: el modelo &quot;semi-rolling&quot; est&aacute; muy bien, pero KDE saca versiones como churros y va demasiado r&aacute;pido para mis necesidades actuales. Casi siempre hay algo que falla. Chakra va dando pasos hacia la facilidad de uso (Kapudan y el repo extra, Octopi y las notificaciones...), si bien me parece que sigue sin ser adecuada para usuarios noveles, algo que, nunca est&aacute; de m&aacute;s recordarlo, jam&aacute;s fue el objetivo de la distribuci&oacute;n ni creo que lo sea.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-N74mR1neB5A/VETOhT09Y6I/AAAAAAAAEwA/rYERKVnAuFs/s1600/instant%C3%A1nea18.png"><img src="http://1.bp.blogspot.com/-N74mR1neB5A/VETOhT09Y6I/AAAAAAAAEwA/rYERKVnAuFs/s1600/instant%C3%A1nea18.png" height="320" width="400" /></a>
</div>
<br />Chakra Euler es continuista, como no pod&iacute;a ser de otra manera, en la filosof&iacute;a y car&aacute;cter de la distribuci&oacute;n. Centrada en KDE y dirigida a sus pocos pero fieles incondicionales, es el &uacute;nico refugio de los que desean una experiencia completa de uso de este popular escritorio y no pueden renunciar a las librer&iacute;as de 32 bits (la gran limitaci&oacute;n de KaOS). Pero aun as&iacute;, me queda la impresi&oacute;n de que corrieron tiempos mejores para esta distro, unos en los que se pod&iacute;a instalar con los controladores privativos sin problemas y la impresora funcionaba sin comerse demasiado el coco, o en los que los paquetes en CCR eran mejor mantenidos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-raTO8N87WdU/VETOoodwc6I/AAAAAAAAEwI/XIuegoL4nwU/s1600/instant%C3%A1nea21.png"><img src="http://3.bp.blogspot.com/-raTO8N87WdU/VETOoodwc6I/AAAAAAAAEwI/XIuegoL4nwU/s1600/instant%C3%A1nea21.png" height="320" width="400" /></a>
</div>
<br />Pero esto escapa a la capacidad de los desarrolladores. A la hora de buscar culpables: AMD y sus controladores, HP y los suyos, cada usuario de CCR y su tiempo para dedicar al repositorio. No obstante, la decisi&oacute;n de seguir incluyendo una opci&oacute;n de instalaci&oacute;n con controladores propietarios o el error al cargar los servicios de samba s&iacute; pueden apuntarse en el dem&eacute;rito del equipo de Chakra. Que cada palo aguante su vela, pues. Chakra Euler sigue siendo una gran distribuci&oacute;n gracias al trabajo de su peque&ntilde;o pero dedicado equipo de desarrollo. Y que este 7'09 de puntuaci&oacute;n no lleve a nadie a enga&ntilde;o. Tened en cuenta siempre, por favor, que la combinaci&oacute;n del hardware de cada cual con la distro que se analiza produce un resultado muy variable. Sin esta premisa en mente todo el trabajo que aqu&iacute; realizo vale para bien poco.
<br />
<br />Salud
<br />
<br />
<b>LO MEJOR</b>
<br />
<ul>
 <li>Como siempre, la experiencia KDE y la est&eacute;tica muy cuidada</li>
</ul>
<br />
<b>LO PEOR</b>
<br />
<ul>
 <li>Error al instalar con los controladores propietarios AMD</li>
</ul>
<div style="text-align: center;">
 <br />
 <b>FICHA T&Eacute;CNICA</b>
</div>
<div style="text-align: center;"></div>
<div style="text-align: center;">
 <br />Distribuci&oacute;n: Chakra Euler
</div>
<div style="text-align: center;">
 Entorno de escritorio: KDE 4.14.1
</div>
<div style="text-align: center;">
 Kernel: 3.15.5
</div>
<div style="text-align: center;">
 Xorg: 1.15.2
</div>
<div style="text-align: center;">
 Controlador gr&aacute;fico: fglrx 14.10.2
 <br />&nbsp;OpenGL: 4.4.12874
 <br />GCC: 4.9.0
</div>
<br />
<table>
 <tbody>
  <tr>
   <th>CHAKRA EULER</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>9,00</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5,00</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>9,58</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.802</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>19.389,79</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>7,62</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,51</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>441</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.791</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.970</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>4,17</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,23</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>5,43</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-0,23</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>-1,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>7,09</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" st_title="Chakra Euler: conocimos tiempos mejores | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/kde/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta kde</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1035,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>