<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>¡Hola nuevo mundo! | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2013/12/hola-nuevo-mundo"><span itemprop="headline">¡Hola nuevo mundo!</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2013/12/hola-nuevo-mundo/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-12-09T23:00" itemprop="dateModified">Actualizado el lunes, 09 de diciembre de 2013 a las 23:00 UTC</span></div><div><span>
Etiquetado como
planeta-codigo, blog, planeta-arch-linux, planeta-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /> 
</div> 
<p>Esta es la &uacute;ltima entrada que publicar&eacute; en el <a href="http://elblogdepicodev.blogspot.com.es">elblogdepicodev.blogspot.com.es</a> o la primera de <a href="http://picodotdev.github.io/blog-bitix">picodotdev.github.io/blog-bitix</a> dependiendo del blog al que hayas accedido, es decir, seguir&eacute; teniendo un blog y escribiendo sobre la tem&aacute;tica alrededor de la tecnolog&iacute;a como hasta ahora pero a partir de este momento todo el nuevo contenido que publique lo har&eacute; en el nuevo blog <a href="http://picodotdev.github.io/blog-bitix">picodotdev.github.io/blog-bitix</a>, por lo que si est&aacute;s suscrito al feed de elblogdepicodev te recomiendo que te suscribas al <a href="http://feeds.feedburner.com/blog-bitix/">feed de bitix</a> para no perderte ninguna de las nuevas entradas que publique.</p> 
<h2>Que est&aacute; por venir en Bitix</h2> 
<p>Tengo bastante cotenido por publicar en el futuro m&aacute;s o menos inmediato empezando por continuar con la <a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html">serie de art&iacute;culos sobre criptograf&iacute;a, GPG y DNI electr&oacute;nico</a>, instalar la <a href="http://www.raspberrypi.org/">Raspberry Pi</a> en una memoria USB o disco duro externo para ganar velocidad en vez de en la tarjeta SD como he explicado en la <a href="http://elblogdepicodev.blogspot.com.es/2012/06/guia-instalacion-raspberry-pi-con-arch.html">gu&iacute;a de instalaci&oacute;n con Arch Linux para la RPi</a>, como usar la Raspberry Pi como &laquo;media center&raquo; con <a href="http://www.geexbox.org/">GeeXboX</a>, explicar como usar <a href="http://octopress.org/">Octopress</a> y <a href="http://pages.github.com/">GitHub Pages</a> para bloggear y como personalizarlo, programas para &laquo;scrapear&raquo; webs, mi experiencia y consejos como blogger, el patr&oacute;n de dise&ntilde;o no operation, usar marcadores con herramientas de logging como <a href="http://www.slf4j.org/">SLF4J</a>, el servidor de aplicaciones <a href="http://www.jboss.org/jbossas">JBoss</a> y <a href="http://www.wildfly.org/">Wildfly</a> y muchas otras cosas que tengo apuntadas o que se me vayan ocurriendo seg&uacute;n publico estas. Desde luego tengo contenido para seguir escribiendo en el nuevo blog que al ritmo de una entrada por semana continuar&eacute; publicando.</p> 
<h2>&iquest;Por que este cambio?</h2> 
<p>Por varias razones, <a href="http://www.blogger.com">blogger</a> es una plataforma estupenda y a mi durante todo este tiempo me ha servidor perfectamente, es sencillo usarla y en muy poco tiempo se puede tener un blog listo para empezar a escribir en &eacute;l sin necesidad de muchos conocimientos. Pero tambien tiene varias desventajas, algunas de ellas son:</p> 
<ul> 
 <li>Las entradas han de ser escritas con su <a href="http://es.wikipedia.org/wiki/WYSIWYG">editor wysiwyg</a> y como muchos editores en los que ves es lo que obtienes a veces para dejar las cosas como uno quiere hay que acceder al c&oacute;digo html que genera y modificarlo directamente, esto consume tiempo que podr&iacute;a dedicarse a escribir contenido en el blog y no en la publicaci&oacute;n. Yo suelo escribir las entradas en un bloc de notas (con gedit) en texto plano, el pasarlo a blogger y formatearlo posteriormente con su editor me consume tambi&eacute;n bastante tiempo, tanto o m&aacute;s que en escribir una primera versi&oacute;n de la entrada.</li> 
 <li>La edici&oacute;n de la entrada con el editor de blogger requiere conexi&oacute;n a internet, si no estamos conectados a internet no podemos editar o nos obliga a usar un bloc de notas y posteriormente cuando dispongamos de conexi&oacute;n a internet transpasarlo al editor y darle formato.</li> 
 <li>Las im&aacute;genes hay que subirlas usando la propia herramienta de blogger en el momento de publicaci&oacute;n de la entrada y conectado a internet. La gesti&oacute;n de las mismas no es muy c&oacute;moda, para borrar una imagen una vez subida hay que ir a los &aacute;lbumes de picasa y cuando se tienen muchas im&aacute;genes ya subidas al blog encontrar una en toda la lista se vuelve complicado y lento.</li> 
 <li>Ajustar el dise&ntilde;o de blogger no es muy complicado pero para personalizarlo de forma avanzada requiere editar el HTML de la plantilla. Esta edici&oacute;n no es nada amigable para un usuario con pocos conocimientos y para algunas cosas hay que hacerlo, como por ejemplo, <a href="http://elblogdepicodev.blogspot.com.es/2012/03/karmacracy-y-como-integrarlo-en-blogger.html">integrar Karmacracy en blogger</a>.</li> 
 <li>Parece que blogger no es una de las herramientas que Google cuide (al igual que otras varias), las actualizaciones son escasas y con el tiempo van surgiendo herramientas mejores que blogger.</li> 
 <li>Los ejemplos de c&oacute;digo los a&ntilde;ado a cada entrada utilizando <a href="https://gist.github.com/">Gist</a> e introducir la referencias adecuadas en cada entrada implica editar e introducir c&oacute;digo en la vista html. Adem&aacute;s en la vista del editor wysiwyg los gist no se visualizan y si no se tiene cuidado se pueden borrar sin querer con lo que hay que volver a introducirlos. Nuevamente incluir las referencias de los gist me consume tiempo.</li> 
</ul> 
<h2>&iquest;Que herramienta de blogging he elegido?</h2> 
<p>La plataforma de blogging que he elegido ha sido <a href="http://octopress.org/">Octopress</a>, una plataforma de blogging que en mi caso solventa casi todos los problemas o molestias que actualmente me ocasiona blogger descritos en los anteriores puntos. Es una plataforma basada en <a href="https://www.ruby-lang.org">Ruby</a> y <a href="http://jekyllrb.com/">Jekyll</a>, uno de los precursores de una nueva generaci&oacute;n de plataforma para blogear y es la plataforma de referencia para escribir en blogs y alojarlos en <a href="http://pages.github.com/">GitHub Pages</a>. A&uacute;n asi hay alternativas parecidas en otros lenguajes de programaci&oacute;n como en Python con <a href="http://docs.getpelican.com">Pelican</a>. La verdad es que usar Pelican en un principio me atra&iacute;a m&aacute;s porque con ello quiz&aacute; aprendiese algo de Python pero el hecho de que Jekyll sea la plataforma de referencia de GitHub es un punto a su favor.</p> 
<p>En las siguientes entradas (<a href="http://arunrocks.com/moving-blogs-to-pelican/">1</a>), (<a href="http://blog.parkermoore.de/2012/12/18/the-immediate-future-of-jekyll/">2</a>) hay algunos comentarios interesantes sobre <a href="http://docs.getpelican.com">Pelican</a> y <a href="http://jekyllrb.com/">Jekyll</a>. Jekyll por lo visto ha estado abandonado durante un tiempo y Octopress no ha avanzado durante un buen tiempo aunque el desarrollo parece haberse retomado, desde luego por lo que he le&iacute;do (<a href="http://sasheldon.com/blog/2013/07/07/waiting-for-octopress-2-successor/">3</a>) de Octopress es que llevan bastante tiempo con la intenci&oacute;n de publicar una nueva versi&oacute;n pero hasta el momento no se ha producido.</p> 
<p>Lo principal que buscaba en cualquiera de estas plataformas eran las siguientes ventajas sobre blogger:</p> 
<ul> 
 <li><a href="http://es.wikipedia.org/wiki/Markdown">Markdown</a> (<a href="http://daringfireball.net/projects/markdown/">4</a>): este es un formato en texto plano que puede ser transformado a html con ciertos estilos. Como edito con gedit en texto plano usando markdown me va a evitar tener que transformar el contenido de la entrada a html usando el editor wysiwyg de blogger. Adem&aacute;s, el html resultante ser&aacute; mejor gracias por una parte a las plantillas de Octopress y por otro a Markdown.</li> 
 <li>Edici&oacute;n fuera de linea o desconectado: como el editor puede ser cualquier editor de texto no hace falta estar conectado a internet para escribir o transformar lo escrito al editor de bogger, para las im&aacute;genes tampoco hace falta usar la herramienta de blogger sino que su administraci&oacute;n es tan simple como gestionar archivos con el navegador de archivos de nuestro sistema operativo. El sitio puede previsualizarse en local.</li> 
 <li>Dise&ntilde;o adaptable (&laquo;responsive&raquo;): blogger posee plantillas que puede visualizarse m&aacute;s o menos correctamente tanto en el navegador como en un dispositivo m&oacute;vil con una resoluci&oacute;n y pantalla m&aacute;s peque&ntilde;a pero no se adaptan al tama&ntilde;o de pantalla o ventana del navegador que est&eacute; usando el usuario. Por el contrario, las plantillas por defecto de Octopress son adaptables o &laquo;responsivas&raquo; lo que mejora la experiencia del usuario al leer el blog, los elementos cambian de posici&oacute;n y de tama&ntilde;o seg&uacute;n el tama&ntilde;o de ventana para el navegador. Esto se consigue mediante las nuevas caracter&iacute;sticas de CSS3 con las que se pueden aplicar unos estilos u otros en funci&oacute;n del espacio disponible para los elementos en el navegador del usuario.</li> 
 <li><a href="http://git-scm.com/">Git</a>: todo el c&oacute;digo del blog lo tenemos en local y podemos regenerar su contenido en cualquier momento. Al usar git tenemos un hist&oacute;rico de todos los cambios que hemos hecho a los archivos y podemos recuperar algo si nos es necesario, en blogger solo tenemos la &uacute;ltima versi&oacute;n. Si en blogger perdiesemos el acceso a nuestro blog regenerar uno nuevo nos ser&iacute;a complicado, tendr&iacute;amos que tener una copia de seguridad del contenido y esto no nos servir&iacute;a para recuperar la plantilla si la hemos personalizado.</li> 
 <li><a href="https://gist.github.com/">Gist</a>: el soporte que ofrece Octopress para incluir trozos de c&oacute;digo de los gist es m&aacute;s simple, basta indicar el n&uacute;mero y el nombre del archivo del gist.</li> 
 <li>Cualquier servidor web como hospedaje: si disponemos de una cuenta de GitHub podemos crear un repositorio para servir el contenido del blog con lo que no necesitaremos contratar ning&uacute;n servidor de hosting pero si disponemos de un servidor web podemos emplearlo para servir el contenido del blog ya que todo es contenido est&aacute;tico.</li> 
 <li>Y otras ventajas como la posibilidad de <a href="https://github.com/mojombo/jekyll/pull/369">hacer referencia a otras entradas del blog</a> sin usar la URL completa.</li> 
</ul> 
<p>Octopress tambi&eacute;n es f&aacute;cilmente integrable con todos los elementos de terceras partes que buscaba como <a href="http://www.sharethis.com">Share This</a> y <a href="http://www.karmacracy.com/">Karmacracy</a> para compartir contenido, <a href="http://disqus.com/">Disqus</a> para los comentarios, <a href="http://www.google.com/adsense">AdSense</a> para la publicidad, <a href="http://feedburner.google.com">Feedburner</a> para los feeds y <a href="https://gist.github.com/">Gist</a> para los ejemplos de c&oacute;digo.</p> 
<p>As&iacute; que dicho todo esto solo me queda a&ntilde;adir, suscr&iacute;bete al <a href="http://feeds.feedburner.com/blog-bitix/">nuevo feed</a> y… &iexcl;Hola nuevo mundo!</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo" st_title="¡Hola nuevo mundo! | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "¡Hola nuevo mundo!";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2013/12/hola-nuevo-mundo/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 47,
      "url" : "http://www.blogstack.info/post/blogbitix/2013/12/hola-nuevo-mundo"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>