<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>openSUSE 13.2: cosas que mejorar | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar"><span itemprop="headline">openSUSE 13.2: cosas que mejorar</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/opensuse"><img title="opensuse" alt="opensuse" src="/assets/images/labels/opensuse.png"/></a><a class="label" href="/label/kde"><img title="kde" alt="kde" src="/assets/images/labels/kde.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/11/opensuse-132-cosas-que-mejorar.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-11-18T17:19" itemprop="dateModified">Actualizado el martes, 18 de noviembre de 2014 a las 17:19 UTC</span></div><div><span>
Etiquetado como
revision, <a href="/label/opensuse"><span itemprop="articleSection">opensuse</span></a>, <a href="/label/kde"><span itemprop="articleSection">kde</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">No sab&eacute;is el trabajo que me ha costado decidirme a escribir este art&iacute;culo. Para alguien enamorado del mundo del FOSS no hay nada m&aacute;s apetecible que airear a los cuatro vientos las virtudes de un sistema operativo libre, gratuito y de c&oacute;digo abierto, como lo es openSUSE. As&iacute; lo hice y estuve encantado de hacerlo con la 
<a href="http://www.lasombradelhelicoptero.com/2013/03/opensuse-123-si-la-perfeccion-existiera.html">&uacute;ltima versi&oacute;n</a> revisada, la que en su momento coron&eacute; como mejor sistema jam&aacute;s probado en este blog. No obstante, tambi&eacute;n las hubo algo peores, e incluso alguna 
<a href="http://www.lasombradelhelicoptero.com/2011/11/opensuse-121-un-pasito-atras.html">bastante deficiente</a>. As&iacute; es este mundillo, tan variable y tan dependiente de la m&aacute;quina en la que se utiliza cada sistema. Y la versi&oacute;n que hoy nos ocupa, de nombre c&oacute;digo Harlequin, no se ha comportado como yo esperaba.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-KfH3HPpr3ic/VGtmd2hL_wI/AAAAAAAAFTY/Zj6gVbdG5lQ/s1600/Opensuse-logo%2Btype-wog.sh-600x600.png"><img src="http://4.bp.blogspot.com/-KfH3HPpr3ic/VGtmd2hL_wI/AAAAAAAAFTY/Zj6gVbdG5lQ/s1600/Opensuse-logo%2Btype-wog.sh-600x600.png" height="320" width="320" /></a>
</div>
<br />
<br />
<a></a>Puesto que silenciar los errores no ayuda en absoluto a corregirlos, os propongo hacer un repaso por este nuevo lanzamiento de la distro de Geeko, viendo tanto los problemas como las muchas virtudes, que por supuesto tambi&eacute;n las tiene, y recordando, una vez m&aacute;s y van mil, que se trata de una revisi&oacute;n realizada en un hardware espec&iacute;fico. Para otros ordenadores, la experiencia puede variar. Y mucho.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />openSUSE sigue contando con uno de los mejores instaladores de GNU/Linux, tan sencillo de usar para los m&aacute;s legos en la materia como completo en cuanto a prestaciones e informaci&oacute;n ofrecida para aquellos m&aacute;s acostumbrados a lidiar con el tema. Ofrece como predeterminada la opci&oacute;n de formatear la partici&oacute;n principal en btrfs, sistema de archivos que hasta hace poco se consideraba en fase experimental y cuyo uso no se aconsejaba.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-mTlBRft0QcQ/VGtm8okkInI/AAAAAAAAFTg/ZwvIyGWEGXY/s1600/snapshot1.png"><img src="http://1.bp.blogspot.com/-mTlBRft0QcQ/VGtm8okkInI/AAAAAAAAFTg/ZwvIyGWEGXY/s1600/snapshot1.png" height="320" width="400" /></a>
</div>
<br />Tras la r&aacute;pida instalaci&oacute;n, un primer reinicio que nos trae un escritorio KDE cuyo tema parece prepararse ya para la llegada de Plasma 5, con tonos suaves y claros, muy diferenciados de los &uacute;ltimos que incorporaba la distro. Las primeras actualizaciones que selecciono comienzan a descargarse en segundo plano, &quot;escondi&eacute;ndose&quot; el indicador en la bandeja del sistema, lo cual me lleva a pensar que algo ha fallado, sin ser as&iacute;. Una vez que culmina el proceso me percato de que todo el escritorio est&aacute; en ingl&eacute;s, da&ntilde;o colateral que asumo al haber descargado la versi&oacute;n de escritorio en vivo de KDE, en lugar del DVD que incluye todos los idiomas y escritorios.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-8ESyliBt17o/VGtnMwsYa0I/AAAAAAAAFTo/2fqAeuMLOAY/s1600/snapshot4.png"><img src="http://4.bp.blogspot.com/-8ESyliBt17o/VGtnMwsYa0I/AAAAAAAAFTo/2fqAeuMLOAY/s1600/snapshot4.png" height="320" width="400" /></a>
</div>
<br />Nada que no se pueda solucionar entrando en &quot;Software Management&quot; y aceptando la instalaci&oacute;n de todos los paquetes sugeridos, entre los cuales se encuentran los m&oacute;dulos de traducci&oacute;n, y que en total suman la nada despreciable cifra de 500 Mb.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-YxAPbyJJ7Wo/VGtnX4b23wI/AAAAAAAAFTw/x0XQpKsE-Xc/s1600/snapshot5.png"><img src="http://3.bp.blogspot.com/-YxAPbyJJ7Wo/VGtnX4b23wI/AAAAAAAAFTw/x0XQpKsE-Xc/s1600/snapshot5.png" height="320" width="400" /></a>
</div>
<br />Y ahora s&iacute;, ya podemos dar por concluida la instalaci&oacute;n con &eacute;xito, tras reiniciar y comprobar que todo funciona y el escritorio ya est&aacute; en castellano.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-MamnBWaHIig/VGtnhaYjt9I/AAAAAAAAFT4/c6QH88QXI8w/s1600/snapshot9.png"><img src="http://3.bp.blogspot.com/-MamnBWaHIig/VGtnhaYjt9I/AAAAAAAAFT4/c6QH88QXI8w/s1600/snapshot9.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />El grub que incorpora openSUSE es bastante bonito de por s&iacute;, pero podemos adecuarlo a nuestro gusto, tanto est&eacute;tica como funcionalmente, con uno de los m&oacute;dulos incluidos en Yast, esa fant&aacute;stica herramienta exclusiva de la distro del camale&oacute;n. En cuanto a tiempos de inicio y apagado, openSUSE toma 50 segundos para lo primero y unos excelentes 9 segundos para lo &uacute;ltimo.
<br />
<br />
<b>Software</b>
<br />Aunque la distro ya viene cargada con un importante arsenal de aplicaciones de uso diario, los desarrolladores ponen a nuestra disposici&oacute;n hasta 3 formas distintas de instalar nuevos programas: Yast, Apper y la siempre &uacute;til opci&oacute;n de localizar los paquetes en los repositorios de openSUSE o en webs de terceros, e instalarlos con el &quot;1-click install&quot;. Esta opci&oacute;n es especialmente interesante, pues nos exime de conocer los entresijos de la distro, limit&aacute;ndose a a&ntilde;adir el correspondiente repositorio (a lo PPA de Ubuntu) y a instalar el programa por nosotros. Todo un lujo no disponible en casi ninguna otra distribuci&oacute;n GNU/Linux.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-r6CFCKjhYqo/VGtnrE3hDSI/AAAAAAAAFUA/XK05c9LO8N0/s1600/snapshot8.png"><img src="http://3.bp.blogspot.com/-r6CFCKjhYqo/VGtnrE3hDSI/AAAAAAAAFUA/XK05c9LO8N0/s1600/snapshot8.png" height="320" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-FLwa4Q54K-o/VGtn0VvjkEI/AAAAAAAAFUI/fwHjatIywYI/s1600/snapshot10.png"><img src="http://1.bp.blogspot.com/-FLwa4Q54K-o/VGtn0VvjkEI/AAAAAAAAFUI/fwHjatIywYI/s1600/snapshot10.png" height="320" width="400" /></a>
</div>
<br />
<b>Hardware</b>
<br />Como hemos visto &uacute;ltimamente en otras revisiones, mi impresora HP Laserjet no es precisamente sencilla de instalar. En openSUSE, aunque, como no pod&iacute;a ser de otra forma, no funciona a la primera, se nos ofrecen varias alternativas para solucionar el problema, que adem&aacute;s no incluyen el uso de la terminal. Basta abrir Yast y ejecutar el m&oacute;dulo de impresoras. Esto es una tremenda ventaja para los usuarios noveles que no conviene olvidar. En mi caso, tras escoger hacer una instalaci&oacute;n mediante &quot;hp-setup&quot;, todo queda perfectamente preparado para funcionar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-QJ1x_n3HYSc/VGtoFLHgyJI/AAAAAAAAFUQ/yGZjklxbxC8/s1600/snapshot14.png"><img src="http://1.bp.blogspot.com/-QJ1x_n3HYSc/VGtoFLHgyJI/AAAAAAAAFUQ/yGZjklxbxC8/s1600/snapshot14.png" height="320" width="400" /></a>
</div>
<br />El esc&aacute;ner tambi&eacute;n precisa de Yast para instalar los paquetes faltantes y echarlo a andar correctamente. La webcam, en cambio, ya funciona de inicio.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-pRL0lDT9jOo/VGtoNmlWURI/AAAAAAAAFUY/q1JL86XHGpM/s1600/snapshot16.png"><img src="http://2.bp.blogspot.com/-pRL0lDT9jOo/VGtoNmlWURI/AAAAAAAAFUY/q1JL86XHGpM/s1600/snapshot16.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Otro problema que se viene repitiendo con frecuencia en mis &uacute;ltimos an&aacute;lisis es la imposibilidad de conectar con mi port&aacute;til con Windows 7 a trav&eacute;s de Samba. Era algo sencillo con anteriores versiones del paquete, pero &uacute;ltimamente no hay manera de hacerlo con Dolphin, alegando siempre la existencia de un cortafuegos (cosa que no es cierta). Con openSUSE ocurre igual.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-tOGfqmQ2kT0/VGtoVqV_RCI/AAAAAAAAFUg/lIXu4DQD_vM/s1600/snapshot17.png"><img src="http://2.bp.blogspot.com/-tOGfqmQ2kT0/VGtoVqV_RCI/AAAAAAAAFUg/lIXu4DQD_vM/s1600/snapshot17.png" height="320" width="400" /></a>
</div>
<br />En cuanto a los dispositivos externos, la experiencia con la distro no ha sido buena. Si bien reconoce los tres (pendrive, disco duro y tarjeta de memoria), los tiempos de acceso son bastante pobres en comparaci&oacute;n con los obtenidos en Ubuntu, Chakra o Manjaro. A este inconveniente hay que a&ntilde;adir el cuelgue de Dolphin mientras copiaba los datos a la tarjeta de memoria en una primera intentona. Tras el correspondiente reinicio del navegador, a la segunda se pudo completar la tarea. Incidente este que penaliza a la distro con un error leve.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-LREZvMVuIXk/VGtoah-wweI/AAAAAAAAFUo/ulN4Ej4l2cY/s1600/snapshot19.png"><img src="http://3.bp.blogspot.com/-LREZvMVuIXk/VGtoah-wweI/AAAAAAAAFUo/ulN4Ej4l2cY/s1600/snapshot19.png" height="320" width="400" /></a>
</div>
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />Algo que yo s&eacute; por experiencia, pero que un usuario novel no tiene por qu&eacute; conocer, es que openSUSE, por cuestiones de licencias, no incorpora casi ning&uacute;n &quot;c&oacute;dec&quot; de reproducci&oacute;n multimedia de los habitualmente empleados. Sin embargo, Ubuntu tampoco lo hace, lo cual no es &oacute;bice para que se pueda obtener una mejor experiencia desde el inicio con el sencillo acto de marcar una casilla durante la instalaci&oacute;n. Ah&iacute; est&aacute;, en mi opini&oacute;n, el principal fallo de openSUSE, f&aacute;cilmente subsanable si se conoce un poco la distro, o se leen art&iacute;culos del estilo &quot;qu&eacute; hacer despu&eacute;s de instalar...&quot;.
<br />
<br />Pero estas revisiones las hago tratando de ponerme en la piel del usuario menos experimentado. Un usuario que, tras tratar de abrir un v&iacute;deo, se encontrar&iacute;a con un mensaje de Kaffeine que advierte que necesita buscar los &quot;c&oacute;decs&quot;. Esto nos lleva a Yast, donde tendremos que escoger la opci&oacute;n de a&ntilde;adir los repositorios comunitarios, que a su vez nos deja con una lista de sitios cuyos nombres, en ocasiones en ingl&eacute;s, pueden no aclarar en absoluto qu&eacute; o cu&aacute;l habilitar, y qu&eacute; paquetes instalar. Para colmo, tras a&ntilde;adir Packman, Main Oss y Non-Oss, el resultado es el mismo: no se encuentran &quot;c&oacute;decs&quot; para reproducir el archivo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-apugm7TNPzY/VGto38DB77I/AAAAAAAAFUw/e6gEpopD8Z8/s1600/snapshot22.png"><img src="http://4.bp.blogspot.com/-apugm7TNPzY/VGto38DB77I/AAAAAAAAFUw/e6gEpopD8Z8/s1600/snapshot22.png" height="320" width="400" /></a>
</div>
<br />&iquest;D&oacute;nde est&aacute; el problema? Pues que la adici&oacute;n de estos repositorios va a activar una serie de paquetes que se han de instalar como recomendados en Yast, algo que el usuario no habituado a la distro desconoce por completo. En resumidas cuentas, un proceso bastante m&aacute;s complejo de lo que deber&iacute;a, siempre en mi opini&oacute;n, por supuesto. Si est&aacute;s leyendo estas l&iacute;neas porque no encuentras la manera de instalar los &quot;c&oacute;decs&quot;, puedes optar por la soluci&oacute;n r&aacute;pida y sencilla que proporciona la siempre atenta y diligente 
<a href="http://www.opensuse-community.org/">comunidad susera</a>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-H0zyPt_WoPY/VGto-zEImVI/AAAAAAAAFU4/5MxxOdQTOyM/s1600/snapshot23.png"><img src="http://4.bp.blogspot.com/-H0zyPt_WoPY/VGto-zEImVI/AAAAAAAAFU4/5MxxOdQTOyM/s1600/snapshot23.png" height="320" width="400" /></a>
</div>
<br />
<b>Estabilidad</b>
<br />No sufr&iacute; cuelgues o problemas graves, salvo uno puntual achacable a los controladores propietarios: tras a&ntilde;adir el repositorio de los Catalyst, gracias a 
<a href="http://lamiradadelreplicante.com/2014/11/14/disponibles-los-drivers-amd-catalyst-para-opensuse-13-2-y-tumbleweed/">Tannhausser y su web</a>, logr&eacute; instalarlos en su &uacute;ltima versi&oacute;n para openSUSE, pero en el primer reinicio se qued&oacute; colgado el sistema, sin poder entrar el entorno gr&aacute;fico. El desaguisado lo pude solucionar entrando en una terminal de texto para hacer un &quot;aticonfig --initial&quot; (siempre aconsejable, por lo que pueda pasar) y volviendo a reiniciar.
<br />
<br />Por cierto, al entrar en la terminal de texto y leer el &quot;Have a lot of fun&quot; entend&iacute; la coletilla de despedida del otro gran bloguero usuario fiel de openSUSE: 
<a href="https://victorhckinthefreeworld.wordpress.com/">victorhck</a>. Todo tiene su porqu&eacute;... Sea como fuere, puesto que el problema parece asociado a la necesidad de que el usuario intervenga en la instalaci&oacute;n de los controladores propietarios, no cre&iacute; preciso penalizar este error en el apartado de estabilidad, mas s&iacute; como un error grave que puede arruinar la experiencia del usuario novel. Junto con el error leve antes comentado, suman un 1'25 de nota negativa.
<br />
<br />
<b>Fluidez</b>
<br />openSUSE nos brinda un KDE ligero y a la vez potente, que de inicio consume menos memoria que Chakra, por poner un ejemplo conocido. Nada extra&ntilde;o en las transiciones, ni retardo en la reproducci&oacute;n de v&iacute;deo. Una buena experiencia de usuario, en este sentido.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-WpNXXXfl628/VGtpLdLKh8I/AAAAAAAAFVA/jDlxSWVE2BM/s1600/snapshot20.png"><img src="http://4.bp.blogspot.com/-WpNXXXfl628/VGtpLdLKh8I/AAAAAAAAFVA/jDlxSWVE2BM/s1600/snapshot20.png" height="320" width="400" /></a>
</div>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Una vez ya tuve instalados los controladores propietarios comprob&eacute;, de nuevo, como no hay forma de suspender o hibernar sin que el equipo se reinicie solo. Nada nuevo bajo el sol de AMD.
<br />
<br />
<b>Rendimiento</b>
<br />Lamentablemente este es el otro aspecto donde openSUSE flojea de un modo considerable, obteniendo puntuaciones por debajo de las logradas en el resto de sistemas analizados, destacando negativamente el largo tiempo de copia a pendrive y a tarjeta de memoria. Los &quot;benchmarks&quot; con navegadores, aunque sea solo ligeramente, tambi&eacute;n arrojan resultados inferiores a los de Ubuntu o Chakra, al igual que la prueba de rendimiento gr&aacute;fico realizada con Unigine Valley.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-RA6ERFyte74/VGtpRNeMueI/AAAAAAAAFVI/Ecfdbxr3WoA/s1600/snapshot25.png"><img src="http://3.bp.blogspot.com/-RA6ERFyte74/VGtpRNeMueI/AAAAAAAAFVI/Ecfdbxr3WoA/s1600/snapshot25.png" height="320" width="400" /></a>
</div>
<br />Desde la prehistoria de la era GNU/Linux en el escritorio, openSUSE ha tenido fama de distribuci&oacute;n pesada y de desempe&ntilde;o m&aacute;s lento que la mayor&iacute;a. Mi experiencia personal desmiente categ&oacute;ricamente esto, al menos en lo que al uso del d&iacute;a a d&iacute;a se refiere. Sin embargo, los resultados de las pruebas de rendimiento son los que son... A mi modo de ver, openSUSE es una de las distribuciones m&aacute;s robustas que existen, a la par que orientada al usuario, en tanto en cuanto se pone &eacute;nfasis en que &eacute;ste apenas tenga que tocar la terminal (o no tocarla en absoluto). Es posible que esta forma de hacer las cosas vaya en detrimento del rendimiento general, algo as&iacute; como la ant&iacute;tesis del principio KISS que otras distribuciones llevan por bandera.
<br />
<br />Pero no conviene caer en el tremendismo. Que un archivo tarde 1 minuto m&aacute;s en copiarse a un dispositivo externo, o que los &quot;frames&quot; caigan ligeramente en un juego, no tienen que tomarse como argumento para desprestigiar una distribuci&oacute;n detr&aacute;s de la cual se encuentra un gran equipo de trabajo que desempe&ntilde;a una labor encomiable. No en vano, reitero, nos entregan un sistema muy completo, con muchas herramientas para facilitar la labor al usuario y una comunidad muy activa y amigable. Por supuesto que hay aspectos que mejorar, como en casi todo en la vida, pero si est&aacute;s pensando en darle una oportunidad a Geeko, no dejes que una nota de 6'63 te convenza de lo contrario. En t&eacute;rminos no mesurables, la experiencia que ofrece openSUSE no tiene precio. Y, tal vez, con su modo peculiar de hacer las cosas, sea &eacute;sta la distribuci&oacute;n GNU/Linux que andas buscando...
<br />
<br />Salud y... &quot;have a lot of fun&quot; ;)
<br />
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>OPENSUSE 13.2 KDE</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>9,80</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>4,17</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.361</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>22.073,44</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>8,51</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,94</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>450</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.717</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.870</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>5,10</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,09</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>6,07</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-0,40</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>-1,25</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>6,63</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" st_title="openSUSE 13.2: cosas que mejorar | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/opensuse/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta opensuse</a></li><li><a href="/label/kde/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta kde</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1134,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>