<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-11-11T00:05:31Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-11-11T00:05:31Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Que es el portapapeles y como gestionarlo con Diodon en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-portapapeles-y-como-gestionarlo-con-diodon-en-ubuntu" />
    <category term="diodon" />
    <category term="ubuntu" />
    <category term="portapapeles" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-10T23:03:32Z</updated>
    <published>2014-11-10T23:03:32Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Seguro que en mas de una ocasi&amp;oacute;n hab&amp;eacute;is utilizado el &lt;strong&gt;portapapeles&lt;/strong&gt; en vuestro ordenador, yo lo uso todos los d&amp;iacute;as, pero puede que no supierais como se llamaba y como funciona. Eso es precisamente de lo que os voy a hablar en este articulo, y ademas os voy a hablar tambi&amp;eacute;n de un programa muy bueno y sencillo que nos permite avanzar de forma muy eficaz en su uso llamado &lt;strong&gt;Diodon&lt;/strong&gt;, y tambi&amp;eacute;n veremos como instalarlo en &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;En los art&amp;iacute;culos, como este por ejemplo, en los cuales os muestro como instalar un programa os pongo una serie de comandos para introducirlos en la Terminal de vuestro Ubuntu con el fin de pod&amp;aacute;is disfrutar de dichos programas. En mi caso, cuando leo art&amp;iacute;culos de otros blogs y en ellos hablan sobre un programa o como hacer una tarea en concreto y quiero usar dichos comandos, selecciono el texto del comando en cuesti&amp;oacute;n y con el bot&amp;oacute;n derecho de rat&amp;oacute;n hago click sobre el y selecciono la opci&amp;oacute;n “Copiar”, con esto lo que hacemos es guardar ese texto en la memoria de nuestro ordenador, luego abrimos una Terminal y con el bot&amp;oacute;n derecho del rat&amp;oacute;n hacemos click donde quieres poner dicho texto y seleccionamos la opci&amp;oacute;n “Pegar”, con esta sencilla acci&amp;oacute;n hemos hecho uso del &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-portapapeles-y-como-gestionarlo-con-diodon-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-10T23:03:32Z</dc:date>
  </entry>
  <entry>
    <title>Inicio básico de Docker</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/11/inicio-basico-de-docker" />
    <category term="blog-stack" />
    <category term="planeta-linux" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-11-10T14:00:00Z</updated>
    <published>2014-11-01T08:47:51Z</published>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/docker.png" alt="Docker" title="Docker" /&gt; 
 &lt;br /&gt; 
&lt;/div&gt; 
&lt;p&gt;En el &lt;a href="http://picodotdev.github.io/blog-bitix/2014/10/introduccion-y-caracteristicas-de-docker/"&gt;art&amp;iacute;culo anterior introductorio sobre Docker&lt;/a&gt; comentaba cuales son sus principales caracter&amp;iacute;sticas, que diferencias tiene con la virtualizaci&amp;oacute;n y algunos casos y motivos por los que nos puede interesar usarlo. El objetivo de este art&amp;iacute;culo ser&amp;aacute; a modo de gu&amp;iacute;a r&amp;aacute;pida como empezar a usar &lt;a href="https://www.docker.com/"&gt;docker&lt;/a&gt;. Comentar&amp;eacute; cuales son los comandos b&amp;aacute;sicos para manejar docker, las im&amp;aacute;genes y los contenedores.&lt;/p&gt; 
&lt;p&gt;Antes de empezar con la gu&amp;iacute;a propiamente hay que tener en cuenta que otra de las caracter&amp;iacute;sticas de docker es que &amp;uacute;nicamente se inicia un solo proceso, cuando este finaliza finaliza la instancia del contenedor. Aunque en principio un contenedor solo tiene un proceso, podemos usar como proceso inicial uno que arranque otros, la &lt;a href="https://registry.hub.docker.com/u/phusion/baseimage/"&gt;imagen pushion&lt;/a&gt; tiene un sistema de inicio adaptado al funcionamiento de docker (no siendo as&amp;iacute; upstart de las im&amp;aacute;genes de ubuntu o systemd usado por otras distribuciones) con el que podemos iniciar otros procesos, en cualquier caso es recomendable que un contenedor sino tiene un solo proceso tenga unos pocos procesos relacionados con el servicio que proporciona la imagen, la recomendaci&amp;oacute;n es no proporcionar una imagen con un mont&amp;oacute;n de servicios/procesos sino varias peque&amp;ntilde;as cuyos servicios colaboren. Una imagen de un contenedor es b&amp;aacute;sicamente el sistema de archivos que usar&amp;aacute; el proceso que iniciamos en el contenedor, necesitamos obtener o construir una imagen para iniciar los contenedores y trabajar con docker.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/11/inicio-basico-de-docker"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2014-11-01T08:47:51Z</dc:date>
  </entry>
  <entry>
    <title>Cómo crear una imagen para Docker usando un Dockerfile</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/11/como-crear-una-imagen-para-docker-usando-un-dockerfile" />
    <category term="blog-stack" />
    <category term="planeta-linux" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-11-10T14:00:00Z</updated>
    <published>2014-11-07T18:50:17Z</published>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/docker.png" alt="Docker" title="Docker" /&gt; 
 &lt;br /&gt; 
&lt;/div&gt; 
&lt;p&gt;Las im&amp;aacute;genes de &lt;a href="https://www.docker.com/"&gt;docker&lt;/a&gt; son el sistema de archivos que usa el proceso o procesos que se arrancan en los contenedores. Si nos convencen las &lt;a href="http://picodotdev.github.io/blog-bitix/2014/10/introduccion-y-caracteristicas-de-docker/"&gt;caracter&amp;iacute;sticas de docker&lt;/a&gt; y estamos decididos a usarlo y ya sabemos &lt;a href="http://picodotdev.github.io/blog-bitix/2014/11/como-crear-una-imagen-para-docker-usando-un-dockerfile/"&gt;como administrar de forma b&amp;aacute;sica los contendores&lt;/a&gt; si queremos disponer de una imagen adaptada a los servicios que necesitamos para iniciar contenedores tendremos que crearla, en este art&amp;iacute;culo explicar&amp;eacute; c&amp;oacute;mo crear una imagen para docker personalizada.&lt;/p&gt; 
&lt;p&gt;Antes de crear una imagen para docker podemos buscar en el &lt;a href="https://registry.hub.docker.com/"&gt;registro de im&amp;aacute;genes de docker&lt;/a&gt; que han creado otros usuarios y los han compartido por si hay alguna que ya se adapte a nuestras necesidades, si nos sirve alguna y es algo popular nos evitaremos tener que modificarla nosotros mismos seg&amp;uacute;n salgan nuevas versiones de los servicios que use. El registro de im&amp;aacute;genes de docker es un servicio en el que los usuarios comparten y colaboran en la creaci&amp;oacute;n de las im&amp;aacute;genes. Para los servicios m&amp;aacute;s conocidos dispondremos ya de las im&amp;aacute;genes como podr&amp;iacute;an ser: &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/11/como-crear-una-imagen-para-docker-usando-un-dockerfile"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2014-11-07T18:50:17Z</dc:date>
  </entry>
  <entry>
    <title>Introducción y características de Docker</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/10/introduccion-y-caracteristicas-de-docker" />
    <category term="blog-stack" />
    <category term="planeta-linux" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-11-10T14:00:00Z</updated>
    <published>2014-10-25T08:52:34Z</published>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/docker.png" alt="Docker" title="Docker" /&gt; 
 &lt;br /&gt; 
&lt;/div&gt; 
&lt;p&gt;&lt;a href="https://www.docker.com/"&gt;Docker&lt;/a&gt; es una de las herramientas de la que se est&amp;aacute; hablando mucho, esto es as&amp;iacute; ya que tiene varios aspectos interesantes que &lt;a href="http://www.javaworld.com/article/2685223/java-app-dev/four-ways-docker-fundamentally-changes-application-development.html"&gt;cambian la forma de desarrollar aplicaciones&lt;/a&gt;. Docker es una forma de ejecutar procesos de forma aislada pero tambi&amp;eacute;n se compone de herramientas para construir im&amp;aacute;genes y un repositorio para compartirlas.&lt;/p&gt; 
&lt;p&gt;Al contrario de la virtualizaci&amp;oacute;n Docker no emula o virtualiza una m&amp;aacute;quina y su sistema operativo con lo que los procesos son mucho m&amp;aacute;s ligeros y hace que el hardware pueda ser aprovechado m&amp;aacute;s al poder aumentar la densidad de los servicios en una misma m&amp;aacute;quina. Los contenedores y servicios incluidos en ellos inician muy r&amp;aacute;pidamente, en pocos segundos. Adem&amp;aacute;s, no es necesario el sistema de archivos completo del sistema operativo invitado con lo que docker usa una fracci&amp;oacute;n de espacio de almacenamiento necesario en la virtualizaci&amp;oacute;n.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/10/introduccion-y-caracteristicas-de-docker"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2014-10-25T08:52:34Z</dc:date>
  </entry>
  <entry>
    <title>Mira que llegan a ser pesados</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mira-que-llegan-a-ser-pesados" />
    <category term="comentarios" />
    <category term="opinion" />
    <category term="spam" />
    <category term="wordpress" />
    <category term="blog" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-10T09:48:13Z</updated>
    <published>2014-11-10T09:48:13Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Crear un blog esta muy bien, puedes escribir todo lo que quieras sobre las cosas que te gustan, conoces gente nueva con tus mismos gustos y preocupaciones y, ademas, aprendes cosas muy a menudo sobre todo gracias a la participaci&amp;oacute;n de los usuarios que lo visitan, pero tambi&amp;eacute;n tiene sus cosas malas, esto es como el Ying y el Yang, o algo as&amp;iacute;. Llevo con este blog unos 10 meses aproximadamente y he tenido de todo lo que he mencionado, y hoy os voy a hablar de una cosa que me toca mucho la moral, los spammers.&lt;/p&gt; 
 &lt;p&gt;Desde que cree este blog el numero de comentarios Spam ha ido creciendo paulatinamente hasta convertirse en una verdadera molestia, que se elimina muy f&amp;aacute;cilmente eso si, pero la verdadera molestia que suponen los Spammers no radica en los aproximadamente 200 mensajes Spam que recibe este blog a diario, si no en su consecuencia hoy en d&amp;iacute;a, y me explico.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mira-que-llegan-a-ser-pesados"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-10T09:48:13Z</dc:date>
  </entry>
  <entry>
    <title>2 Maneras de generar identificadores universalmente únicos (UUID) en C</title>
    <link rel="alternate" href="http://www.blogstack.info/post/poesiabinaria/2014/11/2-maneras-de-generar-identificadores-universalmente-unicos-uuid-en-c" />
    <category term="unicas" />
    <category term="numeros" />
    <category term="claves" />
    <category term="urandom" />
    <category term="aleatorios" />
    <category term="srand" />
    <category term="uuid" />
    <category term="c-c" />
    <category term="semilla" />
    <category term="universal" />
    <category term="random" />
    <category term="linux" />
    <author>
      <name>Gaspar Fernández</name>
    </author>
    <updated>2014-11-10T09:32:40Z</updated>
    <published>2014-11-10T09:32:40Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3RvdGFraS5jb20vcG9lc2lhYmluYXJpYS93cC1jb250ZW50L3VwbG9hZHMvMjAxNC8xMS85OTM3MjEwMjU0X2ZiNDhkNjExZGFfYi5qcGc="&gt;&lt;img src="http://totaki.com/poesiabinaria/wp-content/uploads/2014/11/9937210254_fb48d611da_b-560x560.jpg" alt="" title="9937210254_fb48d611da_b" width="560" height="560" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Una buena forma de poner nombre a nuestros recursos con m&amp;aacute;s o menos certeza de que ese nombre es &amp;uacute;nico, es utilizar &lt;a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9Vbml2ZXJzYWxseV91bmlxdWVfaWRlbnRpZmllcg=="&gt;UUID&lt;/a&gt;‘s. Es cierto, que si en m&amp;aacute;quinas diferentes se generan UUIDs al mismo tiempo, puede ser que haya cierta coincidencia en los valores generados (si nos ponemos cabezones, y si en alg&amp;uacute;n sitio deben convivir varios UUIDs, podemos comprobar que no est&amp;eacute;n repetidos. Incluso, dependiendo del algoritmo utilizado para generarlos, puede que en la misma m&amp;aacute;quina haya valores repetidos.&lt;/p&gt; 
&lt;p&gt;En C, usando Linux, podemos utilizar la biblioteca uuid para generar dichos identificadores, para obtener la cadena del identificador podemos hacer:&lt;/p&gt; 
&lt;div style="overflow:auto;white-space:nowrap;border:1px solid #9F9F9F;width:435px;"&gt; 
 &lt;table&gt; 
  &lt;tbody&gt; 
   &lt;tr&gt; 
    &lt;td&gt; 
     &lt;div&gt;
       1 
      &lt;br /&gt;2 
      &lt;br /&gt;3 
      &lt;br /&gt;4 
      &lt;br /&gt;5 
      &lt;br /&gt;6 
      &lt;br /&gt;7 
      &lt;br /&gt;8 
      &lt;br /&gt;9 
      &lt;br /&gt;10 
      &lt;br /&gt;11 
      &lt;br /&gt;12 
      &lt;br /&gt;13 
      &lt;br /&gt;14 
      &lt;br /&gt; 
     &lt;/div&gt;&lt;/td&gt; 
    &lt;td&gt; 
     &lt;div style="padding:5px;font:normal 12px/1.4em Monaco, Lucida Console, monospace;white-space:nowrap"&gt;
       #include &amp;lt;stdio.h&amp;gt; 
      &lt;br /&gt; #include &amp;lt;uuid/uuid.h&amp;gt; 
      &lt;br /&gt; 
      &lt;br /&gt; int main() 
      &lt;br /&gt; { 
      &lt;br /&gt; &amp;nbsp; uuid_t out; 
     &lt;/div&gt;&lt;/td&gt;
   &lt;/tr&gt;
  &lt;/tbody&gt;
 &lt;/table&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/poesiabinaria/2014/11/2-maneras-de-generar-identificadores-universalmente-unicos-uuid-en-c"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Gaspar Fernández</dc:creator>
    <dc:date>2014-11-10T09:32:40Z</dc:date>
  </entry>
  <entry>
    <title>Disponible The Original Hacker No. 10 Edición de Aniversario</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2014/11/disponible-the-original-hacker-no-1-edicion-de-aniversario" />
    <category term="software-libre" />
    <category term="linux" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2014-11-09T13:43:04Z</updated>
    <published>2014-11-09T13:43:04Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Ya esta Disponible la edici&amp;oacute;n especial de Aniversario de la Revista Digital &lt;a href="http://www.originalhacker.org/"&gt;&lt;strong&gt;The Original Hacker&lt;/strong&gt;&lt;/a&gt;, un proyecto de &lt;a href="http://eugeniabahit.com/"&gt;Eugenia Bahit&lt;/a&gt;. Ya tuve la oportunidad de Leerla y debo decir que es un n&amp;uacute;mero que todo usuario que se quiera iniciar en la programaci&amp;oacute;n bajo &lt;strong&gt;Linux&lt;/strong&gt; debe leer.&lt;/p&gt; 
&lt;p&gt;Si eres usuario novato, intermedio o experto, no importa, este n&amp;uacute;mero de seguro tiene algo que te puede interesar. Los temas que &lt;strong&gt;Eugenia&lt;/strong&gt; toca en este n&amp;uacute;mero:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;&lt;strong&gt;Como tener tu Dominio Propio a un precio asequible&lt;/strong&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;Como montar tu servidor privado&lt;/strong&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;Tener un Entorno de Desarrollo integrado en la nube con &lt;a href="https://c9.io/"&gt;Cloud9&lt;/a&gt;&lt;br /&gt; &lt;/strong&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;Montar tu servidor Web y asegurarlo con &lt;a href="http://eugeniabahit.com/proyectos/jackthestripper"&gt;JackTheStripper&lt;/a&gt;&lt;/strong&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;Unos consejos para ti como Profesional&lt;/strong&gt;&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Felicidades a &lt;strong&gt;Eugenia&lt;/strong&gt; por un A&amp;ntilde;o mas de un excelente proyecto que ha servido para el crecimiento profesional de muchos durante todo el tiempo que tiene en linea.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2014/11/disponible-the-original-hacker-no-1-edicion-de-aniversario"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2014-11-09T13:43:04Z</dc:date>
  </entry>
  <entry>
    <title>Participaré como ponente en la @librecon; os quiero presentar Civi CRM en la economía social</title>
    <link rel="alternate" href="http://www.blogstack.info/post/laborategia/2014/11/participare-como-ponente-en-la-librecon-os-quiero-presentar-civi-crm-en-la-economia-social" />
    <category term="librecon" />
    <category term="colaboracion" />
    <category term="cosas-que-hago" />
    <category term="blog-stack" />
    <category term="jornadas" />
    <category term="crm" />
    <category term="en-castellano" />
    <category term="emprendiendo" />
    <category term="charla" />
    <category term="civicrm" />
    <category term="software-libre" />
    <category term="productividad" />
    <author>
      <name>Dabid Martinez</name>
    </author>
    <updated>2014-11-07T15:56:57Z</updated>
    <published>2014-11-07T15:54:47Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Ya me lo han confirmado desde la Secretar&amp;iacute;a T&amp;eacute;cnica,&amp;nbsp;participar&amp;eacute; como ponente en la &lt;a href="http://www.librecon.io/librecon-2014/"&gt;Librecon&lt;/a&gt;&lt;/strong&gt;&amp;nbsp;dentro del &lt;a href="http://www.librecon.io/txoko-emprendimiento/"&gt;Txoko Take Up&lt;/a&gt;, en mi ponencia tratare de explicaros de forma breve y concisa que beneficios conlleva el uso del software &lt;a href="https://civicrm.org/"&gt;Civi CRM&lt;/a&gt; en vuestros proyectos de econom&amp;iacute;a social.&lt;/p&gt; 
&lt;p&gt;Ya hemos hablado alguna vez de de este software en este mismo blog por lo que si vais a asistir a mi peque&amp;ntilde;a ponencia os invito a leeros la entrada “&lt;a href="http://laborategia.net/2014/07/como-podemos-comenzar-a-usar-un-crm-dentro-de-nuestra-asociacion-y-sobre-todo-que-ventajas-nos-aporta/"&gt;&amp;iquest;Como podemos comenzar a usar un CRM dentro de nuestra organizaci&amp;oacute;n? Y sobre todo que ventajas nos aporta&lt;/a&gt;” o “&lt;a href="http://laborategia.net/2014/06/libremente-cc-administracion-basada-en-la-relacion-con-los-clientes-para-organizaciones-del-3-sector/"&gt;Administraci&amp;oacute;n basada en la relaci&amp;oacute;n con los clientes para organizaciones del 3. sector&lt;/a&gt;” para que sep&amp;aacute;is mas o menos de que hablaremos ya que me escudar&amp;eacute; en esos dos art&amp;iacute;culos para presentaros el producto.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Estad &lt;a href="http://twitter.com/dabidmp"&gt;atentos a mi Twitter&lt;/a&gt;&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/laborategia/2014/11/participare-como-ponente-en-la-librecon-os-quiero-presentar-civi-crm-en-la-economia-social"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Dabid Martinez</dc:creator>
    <dc:date>2014-11-07T15:54:47Z</dc:date>
  </entry>
  <entry>
    <title>Cómo instalar MariaDB y primeros pasos</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/11/como-instalar-mariadb-y-primeros-pasos" />
    <category term="mysql" />
    <category term="blog-stack" />
    <category term="bases-de-datos" />
    <category term="sistemas-operativos" />
    <category term="oracle" />
    <category term="mariadb" />
    <category term="wheezy" />
    <category term="linux" />
    <category term="debian" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-11-07T11:05:36Z</updated>
    <published>2014-11-03T22:33:24Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hasta hace no mucho &lt;strong&gt;MySQL&lt;/strong&gt; era la opci&amp;oacute;n principal para los que quer&amp;iacute;amos un motor de base de datos potente y libre, con permiso de &lt;strong&gt;PostgreSQL&lt;/strong&gt;, claro.&lt;/p&gt; 
&lt;p&gt;C&amp;oacute;mo muchos ya sab&amp;eacute;is, hace unos a&amp;ntilde;os la empresa creadora, del software fue comprada por &lt;strong&gt;Novell&lt;/strong&gt;, que a su vez tiempo m&amp;aacute;s tarde fue adquirida por la todopoderosa &lt;strong&gt;Oracle&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;El problema reside en que &lt;strong&gt;Oracle&lt;/strong&gt; ya tiene en el mercado una &lt;strong&gt;BBDD&lt;/strong&gt; que lleva su mismo nombre, y claro, muchos vieron peligrar las licencias libres de &lt;strong&gt;MySQL&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/11/mariadb-seal-shaded-browntext-alt.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/11/mariadb-seal-shaded-browntext-alt.png" alt="mariadb-seal-shaded-browntext-alt" width="246" height="185" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Actualmente el &lt;a title="Michael Widenius MySQL" href="http://es.wikipedia.org/wiki/Michael_Widenius"&gt;creador &lt;/a&gt;de &lt;strong&gt;MySQL&lt;/strong&gt; es el principal impulsor de &lt;strong&gt;MariaDB&lt;/strong&gt;, utilizando la licencia libre &lt;strong&gt;GPL&lt;/strong&gt; en su versi&amp;oacute;n 2.&lt;/p&gt; 
&lt;p&gt;De hecho se nota tanto que es el mismo creador, que entre ambas&lt;strong&gt; BBDD relacionales&lt;/strong&gt; existe compatibilidad casi al cien por cien.&lt;/p&gt; 
&lt;p&gt;Respecto a las aventuras de &lt;strong&gt;MySQL&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/11/como-instalar-mariadb-y-primeros-pasos"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-11-03T22:33:24Z</dc:date>
  </entry>
  <entry>
    <title>Estamos Promoviendo el uso de Linux y Software Libre correctamente?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2014/11/estamos-promoviendo-el-uso-de-linux-y-software-libre-correctamente" />
    <category term="software-libre" />
    <category term="linux" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2014-11-07T00:08:00Z</updated>
    <published>2014-11-07T00:08:00Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.jsitech.com/wp-content/uploads/2014/11/FSFS-title2.jpg"&gt;&lt;img src="http://www.jsitech.com/wp-content/uploads/2014/11/FSFS-title2.jpg" alt="FSFS-title2" width="555" height="117" /&gt;&lt;/a&gt;Hace D&amp;iacute;as que quer&amp;iacute;a crear esta entrada por la sencilla raz&amp;oacute;n de que a veces muchos de los que queremos promover el &lt;strong&gt;Software Libre&lt;/strong&gt; y el uso de &lt;strong&gt;Linux&lt;/strong&gt; no lo hacemos de manera correcta, A que viene esto? Ultimamente he visto personas que quieren imponer el uso tanto del &lt;strong&gt;Software Libre&lt;/strong&gt; como de &lt;strong&gt;Linux&lt;/strong&gt;, ya sea porque entiende que el software &lt;strong&gt;propietario&lt;/strong&gt; atenta contra la libertad o cualquier otra raz&amp;oacute;n, pero debemos entender que todos vemos las cosas de manera distinta y a la mayor&amp;iacute;a de usuarios no le gusta que le impongan las cosas. Hace un tiempo recuerdo que vi en un grupo de &lt;strong&gt;Facebook&lt;/strong&gt; de software libre, un &lt;strong&gt;Post&lt;/strong&gt; de una persona que estaba solicitando ayuda o una aclaraci&amp;oacute;n con una implementaci&amp;oacute;n de un gestor base de datos, pero por el simple hecho de que lo estaba haciendo en &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2014/11/estamos-promoviendo-el-uso-de-linux-y-software-libre-correctamente"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2014-11-07T00:08:00Z</dc:date>
  </entry>
  <entry>
    <title>Nueva intervención manual necesaria en Chakra</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra" />
    <category term="tutorial" />
    <category term="chakra" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-11-06T15:42:22Z</updated>
    <published>2014-11-06T15:06:00Z</published>
    <content type="html">&lt;p&gt;Las distros para usuarios con ciertos conocimientos tienen estas cosas, que de cuando en cuando se precisa intervenir antes de una actualizaci&amp;oacute;n para que el sistema no se vuelva inestable o, directamente, inutilizable. Como suele ocurrir con Chakra, la falta de una, digamos, portavoc&amp;iacute;a en castellano hace que muchos usuarios se alarmen ante un aviso como el que nos ocupa por no entender del todo en qu&amp;eacute; consiste. Callen las alarmas, que aqu&amp;iacute; estamos para traducirlo y explicarlo. Veremos, no obstante, que el proceso no es tan sencillo y no est&amp;aacute; exento de riesgos para nuestro sistema. Es lo que hay... 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://1.bp.blogspot.com/-Sr_s1nPvhdY/VFtt5sZr3wI/AAAAAAAAFPM/B0WoQJ1Ztvo/s1600/instant%C3%A1nea1.png"&gt;&lt;img src="http://1.bp.blogspot.com/-Sr_s1nPvhdY/VFtt5sZr3wI/AAAAAAAAFPM/B0WoQJ1Ztvo/s1600/instant%C3%A1nea1.png" height="320" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;b&gt;&lt;/b&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt; 
&lt;b&gt;Atenci&amp;oacute;n - Intervenci&amp;oacute;n manual necesaria en la pr&amp;oacute;xima actualizaci&amp;oacute;n masiva&lt;/b&gt; 
&lt;br /&gt; 
&lt;b&gt;&lt;br /&gt;&lt;/b&gt;Este anuncio es para informar a los usuarios de Chakra de todos los cambios que vienen con el paso al repositorio estable de un grupo enorme de paquetes. &amp;iexcl;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/nueva-intervencion-manual-necesaria-en-chakra"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-11-06T15:06:00Z</dc:date>
  </entry>
  <entry>
    <title>¿Qué ciclo de lanzamiento quieres para openSUSE?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/que-ciclo-de-lanzamiento-quieres-para-opensuse" />
    <category term="opensuse" />
    <category term="opensuse-13-2" />
    <category term="encuesta" />
    <author>
      <name>victorhck</name>
    </author>
    <updated>2014-11-06T14:16:09Z</updated>
    <published>2014-11-06T14:16:09Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Desde el pasado 4 de noviembre ya est&amp;aacute; openSUSE 13.2 disponible para descargar, &amp;iquest;y ahora que?&lt;/strong&gt; &lt;img src="https://victorhckinthefreeworld.files.wordpress.com/2014/08/funny-chameleon_2.jpg?w=300&amp;amp;h=245" alt="Funny Chameleon_2" width="300" height="245" /&gt; openSUSE 13.2 llega despu&amp;eacute;s de &lt;strong&gt;1 a&amp;ntilde;o&lt;/strong&gt; de desarrollo desde el pasado lanzamiento de una versi&amp;oacute;n estable, que fue la 13.1 Normalmente el periodo de desarrollo de openSUSE era de&lt;strong&gt; 9 meses.&lt;/strong&gt; &lt;strong&gt;&amp;iquest;De ambas opciones a vosotros cual os gusta m&amp;aacute;s?&lt;/strong&gt; &lt;strong&gt;Me gustar&amp;iacute;a saber qu&amp;eacute; opinan los que pasais por aqui de manera habitua&lt;/strong&gt;l, ya seais usuarios de openSUSE o no Hace unos d&amp;iacute;as propuse una encuesta en Google Plus, que puedes consultar y votar en este enlace:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;&lt;a href="https://plus.google.com/109728877561846377353/posts/4VWH39cQxMf"&gt;&lt;strong&gt;https://plus.google.com/109728877561846377353/posts/4VWH39cQxMf&lt;/strong&gt;&lt;/a&gt;&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Pero si no tienes cuenta de Google, o no te apetece votar all&amp;iacute;, tambi&amp;eacute;n aqui en el blog he propuesto la misma encuesta.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Pudes votar&lt;/strong&gt; por un ciclo de desarrollo de &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/que-ciclo-de-lanzamiento-quieres-para-opensuse"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>victorhck</dc:creator>
    <dc:date>2014-11-06T14:16:09Z</dc:date>
  </entry>
  <entry>
    <title>Que es preload y porque lo deberiamos instalar en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-preload-y-porque-lo-deberiamos-instalar-en-ubuntu" />
    <category term="ubuntu" />
    <category term="preload" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-06T09:56:24Z</updated>
    <published>2014-11-06T09:56:24Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Desde que empece con este blog todav&amp;iacute;a no he tratado nada sobre como mejorar el rendimiento de &lt;strong&gt;Ubuntu&lt;/strong&gt; y creo que ya va siendo hora. En las pr&amp;oacute;ximas fechas ir&amp;eacute; escribiendo una serie de art&amp;iacute;culos en los cuales ir&amp;eacute; hablando de este tema. Hoy es el turno de hablar de &lt;strong&gt;Preload&lt;/strong&gt;, os voy a explicar &lt;strong&gt;que es&lt;/strong&gt;, para que sirve, las mejores que obtendremos y como instalarlo en Ubuntu. Considero que es algo que deber&amp;iacute;a venir por defecto en la instalaci&amp;oacute;n de Ubuntu ya que mejora el rendimiento del sistema y yo siempre lo instalo.&lt;/p&gt; 
 &lt;p&gt;Lo primero es explicar que es &lt;strong&gt;Preload&lt;/strong&gt;, es un&amp;nbsp; “adaptive readahead daemon”, esto dicho as&amp;iacute; puede sonar a chino aunque este en ingles ;D, pero es muy f&amp;aacute;cil de explicar, Preload es un demonio, es decir, un programa que se ejecuta en segundo plano y que nosotros no notamos que esta trabajando. Mientras estamos usamos el ordenador Preload, una vez que este instalado, ira recolectando informaci&amp;oacute;n acerca de las aplicaciones que usemos mas a menudo y usara esa informaci&amp;oacute;n para “precargar” en la RAM de nuestro ordenador las librer&amp;iacute;as que esas aplicaciones necesitan para funcionar, con esto conseguiremos que los programas que usemos mas habitualmente se carguen o abran mas r&amp;aacute;pido.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-preload-y-porque-lo-deberiamos-instalar-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-06T09:56:24Z</dc:date>
  </entry>
  <entry>
    <title>Java Constructores this() y super()</title>
    <link rel="alternate" href="http://www.blogstack.info/post/arquitecturajava/2014/11/java-constructores-this-y-super" />
    <category term="java" />
    <category term="java-conceptos" />
    <category term="java-basico" />
    <author>
      <name>Cecilio Álvarez Caules</name>
    </author>
    <updated>2014-11-05T11:32:30Z</updated>
    <published>2014-11-05T11:32:30Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;En Java creamos objetos todos los d&amp;iacute;as y para ellos usamos constructores. Todos estamos muy habituados a programarlos pero siempre hay algunos bordes que se nos escapan, vamos a revisarlos. Supongamos que tenemos la siguiente clase:&lt;/p&gt; 
&lt;pre&gt;

package com.arquitecturajava;

public class Persona {

private String nombre;

public String getNombre() {
return nombre;
}

public void setNombre(String nombre) {
this.nombre = nombre;
}
}

&lt;/pre&gt; 
&lt;h2&gt;&amp;nbsp;Java Constructores por defecto&lt;/h2&gt; 
&lt;p&gt;&lt;strong&gt;&amp;iquest;Tiene esta clase alg&amp;uacute;n constructor?&lt;/strong&gt;. La respuesta es s&amp;iacute; toda clase Java si no se le incluye ning&amp;uacute;n constructor el compilador a&amp;ntilde;ade &lt;strong&gt;un constructor por defecto&lt;/strong&gt;. As&amp;iacute; pues el c&amp;oacute;digo para el compilador ser&amp;iacute;a el siguiente:&lt;/p&gt; 
&lt;pre&gt;

package com.arquitecturajava;

public class Persona {

private String nombre;
public Persona() {

}

public String getNombre() {
return nombre;
}

public void setNombre(String nombre) {
this.nombre = nombre;
}
}

&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/arquitecturajava/2014/11/java-constructores-this-y-super"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Cecilio Álvarez Caules</dc:creator>
    <dc:date>2014-11-05T11:32:30Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Qmmp en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-y-como-instalar-qmmp-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="qmmp" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-05T09:11:17Z</updated>
    <published>2014-11-05T09:11:17Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os voy a hablar de un programa que me encanta y que hace tiempo que uso, &lt;strong&gt;Qmmp&lt;/strong&gt;. Para aquellos que no lo conozc&amp;aacute;is os puedo decir que es un reproductor de m&amp;uacute;sica muy sencillo y que cumple con lo necesario. No es tan completo como otros reproductores del tipo VLC o Rhythmbox, pero para escuchar m&amp;uacute;sica es perfecto para mi por su sencillez. Qmmp puede que no os suene, pero si os digo Winamp, &amp;iquest;os suena mas? Winamp fue un reproductor muy popular hace a&amp;ntilde;os, la verdad es que desconozco si sigue funcionando, pues Qmmp es muy parecido. A Qmmp le podemos a&amp;ntilde;adir pieles o skins, incluso hay uno que le da la apariencia exacta del Winamp. En este articulo os voy a hablar un poco de &lt;strong&gt;Qmmp&lt;/strong&gt;, como instalarlo agregando el correspondiente &lt;strong&gt;PPA&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y ademas os voy a dejar para descargar un paquete de temas para que pod&amp;aacute;is cambiar el que viene por defecto.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-y-como-instalar-qmmp-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-05T09:11:17Z</dc:date>
  </entry>
  <entry>
    <title>Instalar Open Stack Juno con devstack</title>
    <link rel="alternate" href="http://www.blogstack.info/post/pledin/2014/11/instalar-open-stack-juno-con-devstack" />
    <category term="open-stack" />
    <category term="devstack" />
    <category term="general" />
    <author>
      <name>admin</name>
    </author>
    <updated>2014-11-04T18:55:22Z</updated>
    <published>2014-11-04T18:55:22Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.josedomingo.org/pledin/wp-content/uploads/2014/10/openstack-logo.jpg"&gt;&lt;img src="http://www.josedomingo.org/pledin/wp-content/uploads/2014/10/openstack-logo-300x300.jpg" alt="openstack-logo" width="300" height="300" /&gt;&lt;/a&gt;&lt;a href="http://devstack.org/"&gt;DevStack&lt;/a&gt; es un conjunto de script bash que nos permiten instalar OpenStack de forma autom&amp;aacute;tica. En este art&amp;iacute;culo vamos a a utilizarlo para instalar en nuestro ordenador la &amp;uacute;ltima versi&amp;oacute;n de OpenStack que tiene el nombre de Juno y que ha sido &lt;a href="https://www.openstack.org/software/roadmap/"&gt;liberada el pasado 16 de octubre&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;En otra ocasi&amp;oacute;n explicamos como instalar OpenStack Havana (&lt;a title="Instalando OpenStack en mi port&amp;aacute;til (2&amp;ordf; parte): DevStack" href="http://www.josedomingo.org/pledin/2014/03/instalando-openstack-en-mi-portatil-2a-parte-devstack/"&gt;Instalando OpenStack en mi port&amp;aacute;til (2&amp;ordf; parte): DevStack&lt;/a&gt;), en este caso vamos a intalar la &amp;uacute;ltima versi&amp;oacute;n de OpenStack teniendo en cuenta que se puede instalar en una m&amp;aacute;quina f&amp;iacute;sica o en una virtual, sin embargo hay que tener en cuenta que en este &amp;uacute;ltimo caso se usar&amp;aacute; &lt;a href="http://es.wikipedia.org/wiki/QEMU"&gt;qemu&lt;/a&gt; para la emulaci&amp;oacute;n de las m&amp;aacute;quinas virtuales con lo que se perder&amp;aacute; rendimiento.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h4&gt;Requisitos m&amp;iacute;nimos&lt;/h4&gt; 
&lt;ul&gt; 
 &lt;li&gt;Equipo necesario: RAM 2Gb y procesador VT-x/AMD-v&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/pledin/2014/11/instalar-open-stack-juno-con-devstack"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>admin</dc:creator>
    <dc:date>2014-11-04T18:55:22Z</dc:date>
  </entry>
  <entry>
    <title>Probamos la versión 7 de Trisquel GNU</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/11/probamos-la-version-7-de-trisquel-gnu" />
    <category term="gimp" />
    <category term="blog-stack" />
    <category term="sistemas-operativos" />
    <category term="libreoffice" />
    <category term="fsf" />
    <category term="vmware" />
    <category term="gnu" />
    <category term="trisquel-gnu" />
    <category term="debian" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-11-04T14:29:18Z</updated>
    <published>2014-11-04T14:29:18Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/11/libre.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/11/libre.png" alt="libre" width="200" height="200" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Ya hace un tiempo habl&amp;eacute; de las diferentes distribuciones patrocinadas por la &lt;strong&gt;Free Software Foundation&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Una de ellas, la que podr&amp;iacute;amos denominar buque insignia de la &lt;strong&gt;FSF&lt;/strong&gt;, es &lt;strong&gt;Trisquel GNU&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Trisquel&lt;/strong&gt; es un sistema &lt;strong&gt;GNU&lt;/strong&gt;, que utiliza un kernel linux libre, es decir, no contiene ninguna parte privativa.&lt;/p&gt; 
&lt;p&gt;La distribuc&amp;oacute;n naci&amp;oacute; en 2004 en una la &lt;strong&gt;Universidad de Vigo&lt;/strong&gt;, en Galicia. En sus inicios se bas&amp;oacute; en &lt;strong&gt;Debian&lt;/strong&gt;. Utiliza licencias libres.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Versi&amp;oacute;n 7 LTS Belenos&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;El anuncio de la versi&amp;oacute;n ha aparecido en la nueva web de &lt;a title="Trisquel GNU WEB" href="http://trisquel.info/es"&gt;Trisquel GNU&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;El anuncio oficial entre otras cosas comenta que la nueva versi&amp;oacute;n se llama “&lt;strong&gt;Belenos&lt;/strong&gt;“, el dios Celta del sol.&amp;nbsp; La versi&amp;oacute;n es &lt;strong&gt;LTS&lt;/strong&gt;, es decir, que tendr&amp;aacute; soporte a largo plazo, concretamente hasta 2019.&lt;/p&gt; 
&lt;p&gt;Entre las caracter&amp;iacute;sticas m&amp;aacute;s importantes o destacadas:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/11/probamos-la-version-7-de-trisquel-gnu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-11-04T14:29:18Z</dc:date>
  </entry>
  <entry>
    <title>Lanzada openSUSE 13.2. Luz verde para descargar e instalar</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/lanzada-opensuse-13-2-luz-verde-para-descargar-e-instalar" />
    <category term="opensuse" />
    <author>
      <name>victorhck</name>
    </author>
    <updated>2014-11-04T12:03:16Z</updated>
    <published>2014-11-04T12:03:16Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Hoy, despu&amp;eacute;s de un a&amp;ntilde;o de trabajo. openSUSE 13.2 tiene luz verde para descargar, compartir e instalar este sistema operativo de GNU/Linux.&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;img src="https://es.opensuse.org/images/a/a3/13.2_-_Anuncio_-_Semaforo.png" alt="" width="1133" height="727" /&gt;&lt;/p&gt; 
&lt;p&gt;Normalmente los ciclos de desarrollo de openSUSE suelen ser 9 meses. Pero en esta ocasi&amp;oacute;n se prolog&amp;oacute; por 1 a&amp;ntilde;o, debido a que se iba a trabajar en ciertas herramientas que iban a mejorar el producto final.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Por el blog ya has podido leer varias noticias referentes a openSUSE.&lt;/strong&gt; Desde el anuncio inicial de la decisi&amp;oacute;n de alargar 1 a&amp;ntilde;o este nuevo lanzamiento, hasta la reciente noticia de crear una rolling release oficial bajo el nombre de Tumbleweed, abandonando al antiguo modelo de desarrollo de esa versi&amp;oacute;n con el mismo nombre.&lt;/p&gt; 
&lt;p&gt;Y &lt;strong&gt;hoy vuelvo a acercarte una de esas noticias que son hitos en la historia de esta distribuci&amp;oacute;n.&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/lanzada-opensuse-13-2-luz-verde-para-descargar-e-instalar"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>victorhck</dc:creator>
    <dc:date>2014-11-04T12:03:16Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar una nueva fuente de texto en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu" />
    <category term="fuente-de-texto" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="fuente" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-04T09:52:46Z</updated>
    <published>2014-11-04T09:52:46Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Puede que en alguna ocasi&amp;oacute;n esteis escribiendo un texto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, con el Gimp o, como me paso a mi, haciendo un Conky y quer&amp;iacute;ais usar una &lt;strong&gt;fuente&lt;/strong&gt; de &lt;strong&gt;texto&lt;/strong&gt; que no esta en el sistema instalada por defecto, vale que vienen muchas instaladas pero puede que queramos alguna en particular. En mi caso, para el ultimo Conky que he creado hace poco quise usar una fuente que me gusto mucho llamada “Capture it”, por si no la conoc&amp;eacute;is o no hab&amp;eacute;is visto mi ultimo Conky mas abajo podr&amp;eacute;is ver como es dicha fuente ya que es la que voy a usar como ejemplo para mostraros como se instala una en Ubuntu.&lt;/p&gt; 
 &lt;p&gt;En Internet tenemos muchos sitios en los cuales podemos descargar&lt;strong&gt; fuentes de texto&lt;/strong&gt; nuevo para &lt;strong&gt;instalar&lt;/strong&gt; en nuestro ordenador y os voy a dejar el enlace a una pagina que esta muy bien llamada “Dafont”, aqu&amp;iacute; os dejo el enlace de la pagina:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-04T09:52:46Z</dc:date>
  </entry>
  <entry>
    <title>Mi antiguo blog, Ubuntu y mas, morirá el día 5-11-2014</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14" />
    <category term="noticias" />
    <category term="ubuntu" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-03T23:10:14Z</updated>
    <published>2014-11-03T23:10:14Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Todos aquellos que lean habitualmente este blog puede que hayan le&amp;iacute;do en alguna ocasi&amp;oacute;n que este no es mi primer blog, sino el tercero. El primero fue y es, uno que cree en Blogger, todav&amp;iacute;a esta activo pero no lo actualizo desde hace desde el 4 de Febrero de 2013, me da pena eliminarlo por eso de la nostalgia pero alg&amp;uacute;n d&amp;iacute;a lo har&amp;eacute;, ese lo llame El rinc&amp;oacute;n de Liher. Ese blog me sirvi&amp;oacute; para iniciarme como blogger y para mi primer toma de contacto con el dise&amp;ntilde;o web.&lt;/p&gt; 
 &lt;p&gt;Mi primer articulo fue en Octubre de 2012 y el ultimo en Febrero de 2013, solo dedique unos 5 mese a ese blog y en ese tiempo me di cuenta de que necesitaba algo mas, fue entonces cuando decid&amp;iacute; crear otro en un hosting privado y con WordPress y fue cuando cree mi segundo blog, Ubuntu y mas. Nunca hab&amp;iacute;a tenido ning&amp;uacute;n contacto con WordPress y me tire a la piscina de lleno, a lo bestia ;D Tengo que decir que aprend&amp;iacute; mucho mientras me dedique a ese blog. Fue una experiencia bonita y de la cual aprend&amp;iacute; muchas cosas que hoy en d&amp;iacute;a aplico en El blog de Liher.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-03T23:10:14Z</dc:date>
  </entry>
  <entry>
    <title>Aprende despacio</title>
    <link rel="alternate" href="http://www.blogstack.info/post/koalite/2014/11/aprende-despacio" />
    <category term="software-development" />
    <category term="development" />
    <author>
      <name>Juan María Hernández</name>
    </author>
    <updated>2014-11-03T05:06:15Z</updated>
    <published>2014-11-03T05:06:15Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Dicen que en nuestra profesi&amp;oacute;n es necesario estar continuamente aprendiendo. La verdad es que no conozco en profundidad muchas m&amp;aacute;s profesiones, pero supongo que esto tampoco es algo tan extraordinario, y que en cierto modo un m&amp;eacute;dico, un economista, un carpintero o un profesor tambi&amp;eacute;n tiene que adquirir nuevos conocimientos a lo largo de su carrera profesional para mantenerse actualizados.&lt;/p&gt; 
&lt;p&gt;En lo que s&amp;iacute; nos diferenciamos de otro tipo de profesiones es que somos una profesi&amp;oacute;n muy joven, todav&amp;iacute;a tenemos muy poca historia por detr&amp;aacute;s y estamos continuamente replante&amp;aacute;ndonos la mejor forma de hacer las cosas.&lt;/p&gt; 
&lt;p&gt;Adem&amp;aacute;s el desarrollo de software engloba muchas actividades de la &amp;iacute;ndole m&amp;aacute;s diversa, desde la teor&amp;iacute;a de la computaci&amp;oacute;n hasta la configuraci&amp;oacute;n de sistemas interconectados a nivel global, desde la gesti&amp;oacute;n de grandes (o peque&amp;ntilde;os) vol&amp;uacute;menes de datos hasta la creaci&amp;oacute;n de interfaces de usuario cada vez m&amp;aacute;s amigables y potentes que nos ayuden a realizar todo tipo de tareas.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/koalite/2014/11/aprende-despacio"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Juan María Hernández</dc:creator>
    <dc:date>2014-11-03T05:06:15Z</dc:date>
  </entry>
  <entry>
    <title>Infografía resumen de la gestión de proyectos predictiva y evolutiva.</title>
    <link rel="alternate" href="http://www.blogstack.info/post/navegapolis/2014/11/infografia-resumen-de-la-gestion-de-proyectos-predictiva-y-evolutiva" />
    <category term="blog" />
    <author>
      <name>juan.palacio@gmail.com (Juan Palacio)</name>
    </author>
    <updated>2014-11-02T23:49:15Z</updated>
    <published>2014-11-02T23:49:15Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt; &lt;img alt="Gesti&amp;oacute;n de proyectos predictiva - evolutiva (cascada - agilidad)" src="http://www.navegapolis.com/files/predictiva_evolutiva.png" style="text-align: center; font-size: 0.9em; line-height: 1.3em; width: 600px; height: 945px;" /&gt;&lt;/p&gt; 
 &lt;script&gt;&lt;/script&gt; 
 &lt;div&gt;&lt;/div&gt; 
 &lt;script&gt;&lt;/script&gt; 
 &lt;br /&gt; 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/navegapolis/2014/11/infografia-resumen-de-la-gestion-de-proyectos-predictiva-y-evolutiva"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>juan.palacio@gmail.com (Juan Palacio)</dc:creator>
    <dc:date>2014-11-02T23:49:15Z</dc:date>
  </entry>
  <entry>
    <title>Taller sobre AngularJs en Buenos Aires</title>
    <link rel="alternate" href="http://www.blogstack.info/post/unasinfoniadecsharp/2014/11/taller-sobre-angularjs-en-buenos-aires" />
    <author>
      <name>leonardo</name>
    </author>
    <updated>2014-11-02T23:34:03Z</updated>
    <published>2014-11-02T23:34:03Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;img src="http://fc07.deviantart.net/fs71/f/2013/333/8/2/angularjs_by_abhishekghosh-d6w57fs.png" /&gt;&lt;/p&gt; 
&lt;p&gt;Este jueves 6 de Noviembre voy a estar una vez m&amp;aacute;s en las instalaci&amp;oacute;n del Microsoft User Group en Buenos Aires, esta vez con un taller sobre AngularJs.&lt;/p&gt; 
&lt;h3&gt;Ejemplos pr&amp;aacute;cticos&lt;/h3&gt; 
&lt;p&gt;El taller se desarrollar&amp;aacute; a trav&amp;eacute;s de 50 ejemplos pr&amp;aacute;cticos, los mismo quedar&amp;aacute;n publicados en Github.&lt;/p&gt; 
&lt;p&gt;Le idea es ir avanzando paso a paso con ejemplos para que una vez terminados los dos encuentros tener las herramientas b&amp;aacute;sicas para empezar a trabjar con Angular.&lt;/p&gt; 
&lt;p&gt;Dejo el &lt;a href="http://www.mug-it.org.ar/Event.aspx?Event=188"&gt;link con la informaci&amp;oacute;n para anotarse&lt;/a&gt;. Nos vemos!&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/unasinfoniadecsharp/2014/11/taller-sobre-angularjs-en-buenos-aires"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>leonardo</dc:creator>
    <dc:date>2014-11-02T23:34:03Z</dc:date>
  </entry>
  <entry>
    <title>Microsoft pierde poder en los ordenadores italianos</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/microsoft-pierde-poder-en-los-ordenadores-italianos" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-02T22:28:28Z</updated>
    <published>2014-11-02T22:28:28Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Por todos es sabido que desde hace muchos a&amp;ntilde;os, cuando queremos comprar un ordenador es casi obligatorio comprarlo con Windows preinstalado, si que es cierto que tenemos alternativas como algunas marcas que ya ponen a disposici&amp;oacute;n de los usuarios el poder elegir el sistema operativo o comprarlo sin el, como los Mountain, tambi&amp;eacute;n tenemos la opci&amp;oacute;n de comprar un ordenador clonico. Pues bien, os quiero hablar de una noticia que he podido leer en &lt;a href="http://www.muylinux.com/2014/10/27/italia-tasa-microsoft"&gt;MuyLinux&lt;/a&gt; y que me ha producido una alegr&amp;iacute;a enorme por que puede suponer un avance para Linux.&amp;nbsp;Al comprar un ordenador que viene con Windows preinstalado el usuario que lo compra, destina parte del dinero pagado a la adquisici&amp;oacute;n de la licencia de Windows para ese equipo, esto se denomina popularmente como la “Tasa Microsoft”.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/microsoft-pierde-poder-en-los-ordenadores-italianos"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-02T22:28:28Z</dc:date>
  </entry>
  <entry>
    <title>Arachni – Framework Scanning de Seguridad Aplicaciones Web</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2014/11/arachni-framework-scanning-de-seguridad-aplicaciones-web" />
    <category term="ethical-hacking" />
    <category term="seguridad" />
    <category term="tutoriales" />
    <category term="arachni" />
    <category term="linux" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2014-11-02T15:53:45Z</updated>
    <published>2014-11-02T15:53:45Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.jsitech.com/wp-content/uploads/2014/11/arachni-620x350.png"&gt;&lt;img src="http://www.jsitech.com/wp-content/uploads/2014/11/arachni-620x350-300x169.png" alt="arachni-620x350" width="300" height="169" /&gt;&lt;/a&gt;Hoy me he topado con un proyecto bastante interesante en &lt;a href="http://www.darknet.org.uk/2014/10/arachni-v1-0-released-web-application-security-scanner-framework/"&gt;DarkNet &lt;/a&gt;que nos da una mano en el escaneo de una aplicaci&amp;oacute;n web. Como profesionales de Seguridad herramientas de este tipo nos pueden ayudar al momento de auditar aplicaciones y p&amp;oacute;rtales web, este proyecto es &lt;a href="http://www.arachni-scanner.com/"&gt;&lt;strong&gt;Arachni.&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Arachni&lt;/strong&gt; es un Framework desarrollado en Ruby de C&amp;oacute;digo Libre, modular y lleno de Features que nos ayuda a los profesionales de Seguridad o administradores de Sistema evaluar el nivel de seguridad de nuestras aplicaciones web. Es inteligente por el hecho ya que se autoentrena monitoreando y aprendiendo del comportamiento de la aplicacion web durante el proceso de escaneo y es capaz de llevar a cabo meta-an&amp;aacute;lisis usando ciertos factores para evaluar correctamente los resultados y evitar falsos positivos.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2014/11/arachni-framework-scanning-de-seguridad-aplicaciones-web"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2014-11-02T15:53:45Z</dc:date>
  </entry>
  <entry>
    <title>¿Hay alguien ahí fuera?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/hay-alguien-ahi-fuera" />
    <category term="videos" />
    <category term="ciencia" />
    <category term="de-todo-un-poco" />
    <author>
      <name>victorhck</name>
    </author>
    <updated>2014-11-02T11:29:59Z</updated>
    <published>2014-11-02T11:29:59Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;&amp;iquest;Quienes somos, de d&amp;oacute;nde venimos, a d&amp;oacute;nde vamos? &amp;iquest;Estamos solos en la galaxia o acompa&amp;ntilde;ados?&lt;/strong&gt;&lt;/p&gt; 
&lt;div&gt; 
 &lt;iframe width="652" height="397" src="http://www.youtube.com/embed/JlDnevvKud0?version=3&amp;amp;rel=1&amp;amp;fs=1&amp;amp;showsearch=0&amp;amp;showinfo=1&amp;amp;iv_load_policy=1&amp;amp;wmode=transparent" frameborder="0" allowfullscreen="true"&gt;&lt;/iframe&gt; 
&lt;/div&gt; 
&lt;p&gt;Desde siempre la raza humana ha pensado en estas cuestiones. Un d&amp;iacute;a un primitivo y lejano antecesor nuestro, levant&amp;oacute; la vista a las estrellas y se pregunt&amp;oacute; &amp;iquest;qu&amp;eacute; era eso? Ese d&amp;iacute;a naci&amp;oacute; la astronom&amp;iacute;a, y la inquietud se instal&amp;oacute; en nuestro ADN para siempre!&lt;/p&gt; 
&lt;p&gt;Y a lo largo de los tiempos&lt;strong&gt; muchas han sido las teor&amp;iacute;as.&lt;/strong&gt; Algunas persisten hoy en lo que llamamos religi&amp;oacute;n o superstici&amp;oacute;n. Todas tratan de hacernos sentir trascendentales, t&lt;strong&gt;odas caen en el vicio de situarnos en el epicentro del cosmos.&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;Nuestros peque&amp;ntilde;os cerebros se marean con las inmensidades inabarcables de lo que est&amp;aacute; ah&amp;iacute; fuera. Por tanto en vez de enfrentarnos a nuestra peque&amp;ntilde;ez, nos &lt;strong&gt;autocomplacemos pensando que somos &lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/hay-alguien-ahi-fuera"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>victorhck</dc:creator>
    <dc:date>2014-11-02T11:29:59Z</dc:date>
  </entry>
  <entry>
    <title>Presentación en español de la charla de Richard Stallman en TEDx</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/presentacion-en-espanol-de-la-charla-de-richard-stallman-en-tedx" />
    <category term="video" />
    <category term="free-software-foundation" />
    <category term="software-libre" />
    <author>
      <name>victorhck</name>
    </author>
    <updated>2014-11-01T12:14:58Z</updated>
    <published>2014-11-01T12:14:58Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;&amp;iquest;Quieres divulgar y difundir el software libre? Aqui tienes un recurso m&amp;aacute;s, para hacer tu charla m&amp;aacute;s entretenida.&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;img src="https://victorhckinthefreeworld.files.wordpress.com/2014/08/libre_vs_privativo.jpg?w=652&amp;amp;h=487" alt="libre_vs_privativo" /&gt;&lt;/p&gt; 
&lt;p&gt;Hace unos meses traje por el blog el v&amp;iacute;deo de la charla de &lt;strong&gt;Richard Stallman para TEDx Geneva.&lt;/strong&gt; En esa charla Stallman volv&amp;iacute;a a divulgar y defender al software libre como &amp;uacute;nico medio para acabar con el seguimiento y espionaje de empresas y gobiernos a los usuarios.&lt;/p&gt; 
&lt;p&gt;Esa entrada del blog la puedes visitar en este enlace y ver el v&amp;iacute;deo de Stallman.&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;&lt;a href="http://victorhckinthefreeworld.wordpress.com/2014/08/20/charla-de-richard-stallman-en-tedx-geneva/"&gt;&lt;strong&gt;http://victorhckinthefreeworld.wordpress.com/2014/08/20/charla-de-richard-stallman-en-tedx-geneva/&lt;/strong&gt;&lt;/a&gt;&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;En el v&amp;iacute;deo puedes ver que Stallman se apoya en unas &lt;strong&gt;diapositivas, presentaci&amp;oacute;n, slide o como quieras llamarlo.&lt;/strong&gt; Unas im&amp;aacute;genes muy simples y esquem&amp;aacute;ticas que ayudan a comprender mejor el mensaje y al mismo tiempo hacen la charla m&amp;aacute;s entretenida.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/11/presentacion-en-espanol-de-la-charla-de-richard-stallman-en-tedx"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>victorhck</dc:creator>
    <dc:date>2014-11-01T12:14:58Z</dc:date>
  </entry>
  <entry>
    <title>Instalar FAMP: Apache, MySQL y PHP en FreeBSD 10</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalar-famp-apache-mysql-y-php-en-freebsd-1" />
    <category term="mysql" />
    <category term="famp" />
    <category term="blog-stack" />
    <category term="comandos" />
    <category term="sistemas-operativos" />
    <category term="apache22" />
    <category term="freebsd" />
    <category term="php55" />
    <category term="comunidad-open-source" />
    <category term="php5" />
    <category term="apache2" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-31T11:39:30Z</updated>
    <published>2014-10-31T11:36:35Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/freebsd-horny-800-600.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/freebsd-horny-800-600.jpg" alt="freebsd-horny-800-600" width="800" height="600" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Hasta ahora hemos visto &lt;strong&gt;FreeBSD 10&lt;/strong&gt; tanto en su instalaci&amp;oacute;n c&amp;oacute;mo en la actualizaci&amp;oacute;n de paquetes.&lt;/p&gt; 
&lt;p&gt;En el cap&amp;iacute;tulo de hoy trataremos sobre la instalaci&amp;oacute;n de un servidor &lt;strong&gt;FAMP&lt;/strong&gt;, que es lo mismo que &lt;strong&gt;LAMP&lt;/strong&gt;, pero para &lt;strong&gt;FreeBSD&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Antes de comenzar actualizaremos el sistema usando el comando&lt;strong&gt;&lt;em&gt; pkg&lt;/em&gt;&lt;/strong&gt;, en vez de usar&amp;nbsp; &lt;strong&gt;&lt;em&gt;ports&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt; 
&lt;pre&gt;pkg update&lt;/pre&gt; 
&lt;p&gt;Yo soy un usuario habitual de &lt;strong&gt;GNU/Linux&lt;/strong&gt; por que ir&amp;eacute; explicando las diferencias entre los paquetes en ambos sistemas operativos.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Instalamos Apache&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;En el sistema del ping&amp;uuml;ino el paquete de apache es &lt;strong&gt;Apache2&lt;/strong&gt;, en cambio en el sistema del demonio con tridente el paquete es &lt;strong&gt;Apache22 &lt;/strong&gt;, de hecho existe hasta la versi&amp;oacute;n &lt;strong&gt;Apache24&lt;/strong&gt;, que se puede descargar usando &lt;strong&gt;&lt;em&gt;ports&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Podemos ver las versiones disponibles del sofware usando &lt;strong&gt;&lt;em&gt;pkg&lt;/em&gt;&lt;/strong&gt; con el par&amp;aacute;metro &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalar-famp-apache-mysql-y-php-en-freebsd-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-31T11:36:35Z</dc:date>
  </entry>
  <entry>
    <title>Java EE 6 vs Spring Framework 4 (Video)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/arquitecturajava/2014/10/java-ee-6-vs-spring-framework-4-video" />
    <category term="patrones" />
    <category term="spring" />
    <category term="jee" />
    <author>
      <name>Cecilio Álvarez Caules</name>
    </author>
    <updated>2014-10-31T11:14:24Z</updated>
    <published>2014-10-31T11:14:24Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;iframe width="500" height="281" src="http://www.youtube.com/embed/JcGCwK83PmQ?feature=oembed" frameborder="0" allowfullscreen=""&gt;&lt;/iframe&gt;&lt;/p&gt; 
&lt;p&gt;Comparativa entre Java EE 6 y Spring Framework 4 .Otros videos relacionados con Java EE 6 vs Spring Framework 4: &lt;a title="JSF vs Spring MVC  (Video)" href="http://www.arquitecturajava.com/jsf-vs-spring-mvc-video/"&gt;Spring MVC vs JSF&lt;/a&gt;&amp;nbsp;,&lt;a title="POJOs, VO, DTO y JavaBeans (Video)" href="http://www.arquitecturajava.com/pojos-vo-dto-y-javabeans/"&gt;POJOS, DTO y VO&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;p&gt;La entrada &lt;a href="http://www.arquitecturajava.com/java-ee-6-vs-spring-framework-4/"&gt;Java EE 6 vs Spring Framework 4 (Video)&lt;/a&gt; aparece primero en &lt;a href="http://www.arquitecturajava.com"&gt;Arquitectura Java&lt;/a&gt;.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/arquitecturajava/2014/10/java-ee-6-vs-spring-framework-4-video"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Cecilio Álvarez Caules</dc:creator>
    <dc:date>2014-10-31T11:14:24Z</dc:date>
  </entry>
  <entry>
    <title>Los discos SSD, el TRIM y como activarlo en Ubuntu 14.04 y anteriores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores" />
    <category term="discos" />
    <category term="ubuntu-14-4" />
    <category term="ssd" />
    <category term="ubuntu" />
    <category term="trim" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-31T11:05:57Z</updated>
    <published>2014-10-31T11:05:57Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos 4 o 5 meses que cambie de port&amp;aacute;til, lo compre de segunda mano en Ebay y estoy muy contento con el. Cuando lo recib&amp;iacute; venia con un disco duro normal de 1 TB pero decid&amp;iacute; poner un &lt;strong&gt;disco SSD&lt;/strong&gt;, compre uno de la marca Kingston de 120GB, entonces me puse a buscar informaci&amp;oacute;n sobre como sacarle el mejor rendimiento posible y sobre el &lt;strong&gt;TRIM&lt;/strong&gt;. Fui leyendo en varias webs como hacer su configuraci&amp;oacute;n y saque las siguientes conclusiones de las que os voy a hablar un poco, aunque son solo conclusiones m&amp;iacute;as que no tienen por que ser las mejores.&lt;/p&gt; 
 &lt;p&gt;Le&amp;iacute; en varias webs que los &lt;strong&gt;discos SSD&lt;/strong&gt; duran menos que los discos normales y me puse a investigar un poco al respecto. Los datos mas relevantes surgieron en la pagina de Seagate, una reconocida marca a nivel mundial que fabrica discos duros desde hace a&amp;ntilde;os. En dicha web pude leer que los discos duros convencionales tienen un MTBF (maximum time between failure) que oscila entre 300.000 y 1.200.000 horas, voy a tomar como referencia un valor intermedio de 750.000 horas, esto quier decir que te&amp;oacute;ricamente un disco duro normal de una calidad media podr&amp;iacute;a estar encendido y us&amp;aacute;ndose unos 85 a&amp;ntilde;os, a raz&amp;oacute;n de 8760 horas que tiene un a&amp;ntilde;o. Despu&amp;eacute;s fui a mirar cual era el MTBF del &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-31T11:05:57Z</dc:date>
  </entry>
</feed>

