<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>No es una cuestión de envidia, ni mucho menos | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos"><span itemprop="headline">No es una cuestión de envidia, ni mucho menos</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/no-es-una-cuestion-de-envidia-ni-mucho-menos/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-06-06T09:30" itemprop="dateModified">Actualizado el viernes, 06 de junio de 2014 a las 09:30 UTC</span></div><div><span>
Etiquetado como
opinion</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Este es un articulo un tanto at&iacute;pico y lo escribo en relaci&oacute;n a un comentario que me ha hecho un usuario llamado Pablo en un articulo en el cual hablo sobre los virus en Linux, si quer&eacute;is leer el articulo aqu&iacute; os dejo un enlace:</p>
<ul>
 <li><a href="http://elblogdeliher.com/los-virus-en-linux/">Los virus en Linux</a></li>
</ul>
<p>Si solo quer&eacute;is leer el comentario que ha hecho os lo dejo aqu&iacute; para que pod&aacute;is leerlo:</p>
<p><em>Comentario de Pablo:</em></p>
<p><em>&nbsp; &nbsp; &nbsp;Muy buenas.. a ver yo no soy usuario de Linux, no demasiado.. pero quisiera hacer una&nbsp;correcci&oacute;n sobre el art&iacute;culo o anotaci&oacute;n… Windows cuenta con el User Account Control&nbsp;o Control de Cuentas de Usuario que solicita al usuario “elevaci&oacute;n”&nbsp;para llevar a cabo ciertas tareas, adem&aacute;s de esto todos los sistemas Windows NT cuentan con una estructura jer&aacute;rquica&nbsp;de usuarios siendo el Administrador un equivalente al root y el “Usuario” el Usuario, pero adem&aacute;s cuenta con otros&nbsp;niveles como Invitado y depende de la versi&oacute;n de Windows, usuarios avanzados y varias categor&iacute;as de Administradores&nbsp;adem&aacute;s de la posibilidad de poder “delegar tareas” a un usuario especifico para que no requiera de privilegios de&nbsp;Administrador para por ejemplo, unir un equipo a un dominio.</em></p>
<p><em>Me parece muy interesante gran parte del art&iacute;culo y puedo estar m&aacute;s o menos de acuerdo con unos u otros puntos, pero&nbsp;considero que esta man&iacute;a de los usuarios de atacar porque si a los sistemas Windows, tratando de demostrar la&nbsp;superioridad de uno ante otro y ofreciendo informaci&oacute;n incorrecto, queriendo o sin querer, solo hacen que los que&nbsp;somos usuarios un poco m&aacute;s avanzados de Windows nos demos cuenta de cierta envidia.</em></p>
<p><em>Y para terminar, cuando a un usuario medio de Windows le preguntas por Linux su respuesta suele ser de tipo… “No lo&nbsp;conozco” “Es muy complicado” o “Es que es muy diferente y no me aclaro” en cambio la de los usuarios de Linux, y&nbsp;esto es una realidad suele ser del tipo “Uso Linux porque es mejor que Windows, porque es gratis, porque no tiene&nbsp;virus etc etc etc…”</em></p>
<p><em>Espero que haga reflexionar a algunos.</em></p>
<p>Cuando me dispuse a escribir la respuesta a dicho comentario me di cuenta de que iba a ser extensa por lo cual he decidido hacer un articulo al respecto, me parec&iacute;a mas correcto. Antes que nada me gustar&iacute;a contar un poco mi experiencia y conocimientos con Windows y Linux para que sep&aacute;is en que me baso a la hora de dar opiniones y escribir art&iacute;culos hablando de ambos sistemas operativos.</p>
<p>Con 14 a&ntilde;os tuve mi primer ordenador, venia con MS-DOS 5.0 y Windows 3.1, sin haber estudiado nada de inform&aacute;tica de forma autodidacta antes de cumplir un a&ntilde;o con el sabia formatearlo, configurar el sistema operativo toqueteando en “autoexec.bat” y “config.sys” y otras muchas cosas mas, no quiero explayarme demasiado. Cuando recib&iacute; mi primera clase de inform&aacute;tica con 17 a&ntilde;os, precisamente sobre MS-DOS, no aprend&iacute; nada nuevo, incluso el profesor me preguntaba cosas acerca del MS-DOS y sus comandos.</p>
<p>Posteriormente a ese ordenador he tenido varios y he probado las siguientes versiones de Windows:</p>
<ul>
 <li>Windows 3.1</li>
 <li>Windows 3.11</li>
 <li>Windows 95</li>
 <li>Windows 98</li>
 <li>Windows ME</li>
 <li>Windows 2000</li>
 <li>Windows XP</li>
 <li>Windows Vista</li>
 <li>Windows 7</li>
</ul>
<p>La ultima versi&oacute;n de Windows, la 8, todav&iacute;a no la he probado, pero supongo que sera mas de lo mismo y no tengo ganas de probarla, por lo menos por ahora. En mi opini&oacute;n, los mejores han sido Windows 200o y Windows 7.</p>
<p>Con 18 a&ntilde;os empece a estudiar Inform&aacute;tica de gesti&oacute;n, programaci&oacute;n de ordenadores para los que no sepan lo que es, ademas lo compaginaba con un curso del INEM de programador de aplicaciones inform&aacute;ticas de 950 horas, estaba unas 5 horas por la ma&ntilde;ana en el instituto y luego 6 horas por la tarde en el curso del INEM. Decid&iacute; dejar el instituto por razones personales y no termine esos estudios, pero si el curso del INEM. El a&ntilde;o pasado tambi&eacute;n hice un curso de Dise&ntilde;ador web.</p>
<p>Nunca he tenido que llevar un ordenador a una tienda para que lo arreglasen por temas de software ni he tenido que llamar a nadie para lo mismo, y llevo usando ordenadores desde hace 22 a&ntilde;os. Ademas me encanta toquetear todo lo relacionado con las tripas del sistema operativo.</p>
<p>He arreglado muchos problemas en los ordenadores de amigos, familiares y tambi&eacute;n cobro por hacerlo ahora, aunque esporadicamente. He formateado muchos ordenadores y en los &uacute;ltimos 3 a&ntilde;os he convencido a varios usuarios de que usen Linux, del cual he probado un buen pu&ntilde;ado de distribuciones.</p>
<p>Con todo esto que he contado no pretendo mas que dar credibilidad o base a mi opini&oacute;n sobre Windows y Linux, nada mas, no soy ingeniero inform&aacute;tico ni profesor ni nada parecido, pero si me considero un usuario de nivel medio-alto y no usuario que usa su ordenador para descargar pel&iacute;culas o m&uacute;sica y conectarse al Facebook, me gusta ir mucho mas all&aacute; y aprender.</p>
<p>Con toda esta chapa que os he dado y con mi experiencia puedo responder con una buena base a Pablo y lo voy a hacer por partes, respondiendo a su comentario. El sistema de cuentas de usuario al que haces referencia en Windows es de risa, si quieres instalar un programa y necesitas instalarlo con permisos de Administrador basta con hacer click sobre el ejecutable y pinchar en la opci&oacute;n que pone “Ejecutar como Administrador”, sin necesidad de introducir ninguna contrase&ntilde;a, y podr&aacute;s instalarlo. En el mejor de los casos solo tienes que teclear tu contrase&ntilde;a al iniciar sesi&oacute;n, despu&eacute;s ya eres “caballito blanco” y puedes hacer lo que quieras. La verdad es que nunca he usado NT, siempre he usado las versiones de escritorio normales de Windows, al igual que en Linux y es a las versiones a las que hago referencia, espero que las versiones NT de Windows esto de la gesti&oacute;n de cuentas de usuario sea mejor. En Linux no puedes hacer lo que te de la gana sin una cuenta de administrador y su correspondiente contrase&ntilde;a, por lo cual, sin ahondar mas ya me parece un sistema de gesti&oacute;n de usuarios mejor, con limitaciones reales. Ademas como bien mencionas si no has usado Linux demasiado no lo conoces lo suficiente.</p>
<p>No creo haber atacado a los sistemas Windows, pero si los he comparado con Linux para hacer ver las diferencias existentes, y esto no es una man&iacute;a, se llama comparar y contrastar. Como ya he dicho antes no me considero un usuario de nivel bajo y puedo decir con absoluta certeza que Linux mejora el rendimiento de un ordenador de una forma muy notable. Para ello basta un dato, prueba a instalar Windows 8 en un ordenador de hace unos 7 u 8 a&ntilde;os y prueba tambi&eacute;n a instalarle Ubuntu 14.04 y veras la abismal diferencia de rendimiento.</p>
<p>Te puedo asegurar, Pablo, que te va a costar mucho encontrar un solo usuario de Linux que tenga envidia de Windows, no es una cuesti&oacute;n de envidia, es de que cuando instalas Linux en un ordenador y lo usas un tiempo te das cuenta de que has estado haciendo el tonto en varios aspectos. Para esto tengo que decir que he instalado Ubuntu a muchas personas, no podr&iacute;a decirte cuantas ahora mismo, pero <strong>solo una </strong>me<strong>&nbsp;</strong>ha pedido que le quite Linux y le instale Windows nuevamente y la raz&oacute;n fue porque su hijo peque&ntilde;o tiene una serie de problemas para los cuales necesita usar unos programas que solo funcionan con Internet Explorer porque en su colegio lo han hecho as&iacute;, solo por esa raz&oacute;n me lo pidi&oacute;, todos los dem&aacute;s est&aacute;n encantados con el cambio. Incluso algunos con los que he hablado posteriormente me han dicho que cuando han tenido que volver a usar Windows en un ordenador se han dado cuenta de las grandes diferencias existentes y de que no quieres volver a tener Windows en sus ordenador personales nunca mas.</p>
<p>En el segundo p&aacute;rrafo tambi&eacute;n mencionas que he dado datos incorrectos, me gustar&iacute;a por favor que me indicases cuales han sido para corregirlos.</p>
<p>En este ultimo p&aacute;rrafo de tu comentario dices lo siguiente:</p>
<p><em>Y para terminar, cuando a un usuario medio de Windows le preguntas por Linux su respuesta suele ser de tipo… “No lo&nbsp;conozco” “Es muy complicado” o “Es que es muy diferente y no me aclaro” en cambio la de los usuarios de Linux, y&nbsp;esto es una realidad suele ser del tipo “Uso Linux porque es mejor que Windows, porque es gratis, porque no tiene&nbsp;virus etc etc etc…”</em></p>
<p>No se si te has fijado en lo que dices, pero lo primero es “no lo conozco”, &iquest;como puedes dar una opini&oacute;n de algo que no conoces?, piensa una cosa Pablo, de los usuarios que usan Windows intenta hacer un calculo de cuantos han usado Linux y hazlo tambi&eacute;n al rev&eacute;s, ah&iacute; tienes la respuesta a todo, seguramente el 100% de los usuarios de Linux han usado y conocen Windows, pero al rev&eacute;s la cifra seguro que es mucho mas reducida como para que esos usuarios puedan tener una base para emitir una opini&oacute;n real y fundamentada.</p>
<p>Como he dicho al principio del articulo esto iba para largo :D, si lees esto Pablo quiero que sepas que no un ataque hacia ti, ni mucho menos, solo pretendo dar mi opini&oacute;n igual que tu lo has hecho bas&aacute;ndome en mi experiencia y mis conocimientos y despues de 22 a&ntilde;os entre ordenadores y habiendo probado muchos Windows y muchos Linux, para mi la elecci&oacute;n es clara “Linux for ever” y “viva la madre que pario a Torvalds” :D.</p>
<p>Un saludo</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos" st_title="No es una cuestión de envidia, ni mucho menos | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 506,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/06/no-es-una-cuestion-de-envidia-ni-mucho-menos"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>