<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>¿Adios .NET, hola Java? | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2015/01/adios-net-hola-java"><span itemprop="headline">¿Adios .NET, hola Java?</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/linux"><img title="linux" alt="linux" src="/assets/images/labels/linux.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/cYVliEGxFh4/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-01-12T05:06" itemprop="datePublished">Publicado el lunes, 12 de enero de 2015 a las 05:06 UTC</span></div><div><span>
Etiquetado como
netcore, opinion, rant, development, <a href="/label/linux"><span itemprop="articleSection">linux</span></a>, jvm</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Hace ya unos cuantos meses que llevo d&aacute;ndole vueltas a la posibilidad de migrar parte de las aplicaciones que desarrollamos profesionalmente a entornos Linux.</p> 
<p>Hasta hace poco esto era algo impensable, ya que desarroll&aacute;bamos aplicaciones de escritorio basadas en .NET y aplicaciones para dispositivos m&oacute;viles con Windows Mobile, pero &uacute;ltimamente cada vez son m&aacute;s las aplicaciones basadas en HTML5 que forman parte de nuestro <a href="http://www.agorapos.com/">software para punto de venta</a>.</p> 
<p>Ese paso a aplicaciones HTML5 ha permitido que muchos de los clientes que se conectan al servidor central (desplegado localmente o <em>on-premises</em>, para los modernos) sean dispositivos con Android, iOS o incluso Linux. </p> 
<p>&iquest;El motivo fundamental? El coste del hardware y el coste de la licencia. Cuando tienes un equipo dedicado en exclusiva a realizar una tarea profesional, muchas veces el sistema operativo importa muy poco puesto que el usuario s&oacute;lo utiliza una aplicaci&oacute;n, y el coste de una tablet malucha con Android es mucho m&aacute;s bajo que el de cualquier PC con pantalla t&aacute;ctil y su correspondiente licencia de Windows.</p> 
<p>Todav&iacute;a tenemos una parte importante de aplicaciones que son aplicaciones de escritorio, pero parece plausible que a medio plazo &eacute;stas sean reemplazadas por sus equivalentes HTML5.</p> 
<p>En un escenario as&iacute;, lo &uacute;nico que seguir&iacute;a dependiendo de Windows ser&iacute;a el servidor central, y la idea de poder desplegarlo en Linux resulta muy atractiva. </p> 
<p>Por una parte, est&aacute; el ahorro directo del coste de licencia, que para nuestros clientes es importante. Estamos hablando de licencias de menos de 100€, que para los que est&aacute;is en mundos <em>enterprise</em> os parecer&aacute; algo rid&iacute;culo, pero la realidad es que en mi sector, ese coste se nota.</p> 
<p>Por otra, evitar&iacute;amos depender de la estrategia de negocio de Microsoft y tendr&iacute;amos m&aacute;s libertad a la hora de decidir qu&eacute; versiones de sistema operativo utilizar (<a href="http://blog.koalite.com/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico/" title="El fin de Windows XP y el anclaje tecnol&oacute;gico">el fin de soporte para Windows XP</a> ha sido inc&oacute;modo en nuestro sector).</p> 
<h3>.NET Core como soluci&oacute;n</h3> 
<p>Llegado a este punto, la opci&oacute;n m&aacute;s “l&oacute;gica” para dar el paso a Linux ser&iacute;a aprovechar .NET Core. A fin de cuentas, una de las cosas que est&aacute; “vendiendo” Microsoft de su nueva versi&oacute;n de .NET es que ser&aacute; multiplataforma.</p> 
<p>Vi&eacute;ndolo as&iacute;, no hay mucho que pensar. Seguir&iacute;amos utilizando .NET, con las herramientas que conocemos de hace mucho tiempo, el lenguaje que llevamos utilizando m&aacute;s de diez a&ntilde;os y un framework con el que estamos familiarizados, pero adem&aacute;s ganar&iacute;amos soporte multiplataforma. Todo perfecto, &iquest;no?</p> 
<p>Pues no tanto, la verdad. Resulta que .NET Core no es realmente compatible hacia atr&aacute;s y no es tan sencillo migrar una aplicaci&oacute;n compleja realizada con, por ejemplo, .NET Framework 3.5 a .NET Core. Frans Bouma escrib&iacute;a sobre ello hace unos meses cuando <a href="http://weblogs.asp.net/fbouma/%E2%80%9C-net-core-is-the-future%E2%80%9D-but-who%E2%80%99s-future-is-that">evaluaba la posibilidad de migrar su ORM (LLBLGen) a .NET Core</a>. </p> 
<p>En ese sentido, incluso <a href="http://blogs.msdn.com/b/cesardelatorre/archive/2014/11/18/what-is-net-core-5-and-asp-net-5-within-net-2015-preview.aspx">desde Microsoft hay quien recomienda actualizar las aplicaciones ya existentes a .NET Framework 4.6 en lugar de a .NET Core</a>:</p> 
<blockquote>
 <p> My personal advice? if you’re going to migrate an application, bet for ASP.NET 5 running on the <strong>regular CLR</strong>. </p>
</blockquote> 
<p>Para los que no est&eacute;is familiarizados con las nuevas versiones del Framework, al hablar del <em>regular CLR</em> se est&aacute; refiriendo a .NET Framework 4.6, que ser&aacute; la evoluci&oacute;n del actual .NET Framework 4.5 y que s&oacute;lo tendr&aacute; soporte para Windows.</p> 
<p>En el fondo, es razonable. Una de las partes buenas de .NET Core es que pretende “limpiar” el <a href="http://www.urbandictionary.com/define.php?term=kipple">kipple</a> acumulado en el framework durante todos estos a&ntilde;os para hacerlo m&aacute;s modular y liviano, y adem&aacute;s existen partes del framework que est&aacute;n &iacute;ntimamente ligadas a Windows, por lo que es necesario hacer algo con ellas para poder utilizarlo en otras plataformas.</p> 
<p>El hecho es que hay partes que para nosotros son importantes, como el caso de ORMs potentes, contenedores de inversi&oacute;n de control o soporte para determinadas bases de datos que, actualmente, no est&aacute;n soportados en .NET Core y no est&aacute; muy claro que lo vayan a estar en el futuro.</p> 
<p>Cuando empiezas a considerar todo esto y te das cuenta de que la transici&oacute;n no es directa, en parte por las caracter&iacute;sticas (yo no lo llamar&iacute;a limitaciones) de .NET Core, y en parte por las propias dependencias que tiene nuestra aplicaci&oacute;n sobre Windows (uso del registro de Windows, ejecuci&oacute;n como servicio, etc.) y determinadas librer&iacute;as, resulta que tal vez el esfuerzo sea lo bastante grande como para poder plantearse el paso a otras plataformas.</p> 
<p>Aqu&iacute; podr&iacute;amos empezar a culpar a nuestra aplicaci&oacute;n por estar acoplada a Windows, a un ORM o a lo que queramos. La realidad es que en su momento esas decisiones parec&iacute;an razonables, nos han permitido obtener muy buenos resultados de negocio y, en cualquier caso, ahora simplemente es lo que hay y forman parte del escenario del que partimos. Tampoco creo que se trate de algo tan extra&ntilde;o dentro del mundo de .NET.</p> 
<h3>La JVM como alternativa a .NET Core</h3> 
<p>Decir esto en este blog es casi una herej&iacute;a, pero lo cierto es que despu&eacute;s de pensar un poco sobre el tema, cada vez me parece una alternativa m&aacute;s razonable para conseguir mi objetivo, que es acabar ejecutando nuestro servidor sobre Linux.</p> 
<p>Dos de las cosas que ofrece .NET Core y que m&aacute;s se est&aacute;n publicitando en c&iacute;rculos afines a Microsoft, el ser open source y el ser multiplataforma, son algo que tiene Java desde hace mucho, mucho tiempo. <a href="http://blog.koalite.com/2014/11/net-es-open-source-y-ahora-que/" title=".NET es open source, &iquest;y ahora qu&eacute;?">La parte de open source, aun siendo importante, me importa algo menos en este momento</a>, pero el multiplataforma, <em>Linux first</em> (o al menos <em>Linux first-class</em>), s&iacute; es cr&iacute;tica para lo que estoy buscando.</p> 
<p>Al llevar tanto tiempo disponible para plataformas Linux, la estabilidad de la JVM est&aacute; mucho m&aacute;s contrastada que la que tendr&aacute; .NET Core cuando por fin est&eacute; disponible para Linux (hoy en d&iacute;a se est&aacute; usando Mono, cuya estabilidad y rendimiento no es comparable al de la JVM).</p> 
<p>El esfuerzo de convertir una aplicaci&oacute;n desarrollada en C# a Java (o posiblemente otro lenguaje sobre la JVM como Scala) no es despreciable, pero tampoco se trata de una tarea imposible. Adem&aacute;s, viendo las limitaciones actuales en cuanto a disponibilidad de librer&iacute;as para .NET Core, tal vez no fuese mucho mayor que el de convertir una aplicaci&oacute;n de .NET Framework 3.5 a .NET Core. S&oacute;lo prescindir de NHibernate para utilizar Entify Framework 7, con <a href="http://blogs.msdn.com/b/adonet/archive/2014/12/02/ef7-priorities-focus-and-initial-release.aspx">todas sus limitaciones iniciales</a>, ya supondr&iacute;a un trabajo considerable.</p> 
<p>Precisamente muchas de las librer&iacute;as que utilizamos actualmente, como NHibernate, NUnit o log4net son <em>ports</em> casi directos de sus equivalentes Java, por lo que ya estamos familiarizados con sus APIs y su funcionamiento general. Adem&aacute;s, el paso a la JVM nos permitir&iacute;a explorar otras v&iacute;as que parecen interesantes, como el uso de <a href="http://akka.io/">Akka</a> o <a href="https://www.playframework.com/">Play</a>.</p> 
<h3>En resumen</h3> 
<p>No pretendo convertir este post en un alegato sobre por qu&eacute; Java es mucho mejor que .NET, porque sinceramente no creo que sea as&iacute;. Cada uno tiene sus puntos fuertes y sus puntos d&eacute;biles, y ambos han demostrado que son alternativas viables para desarrollar casi cualquier tipo de aplicaci&oacute;n.</p> 
<p>En mi caso, se trata simplemente de analizar dos alternativas para evolucionar a medio plazo un proyecto concreto, buscando un equilibrio entre estabilidad, coste de desarrollo y proyecci&oacute;n de futuro. Cada escenario es diferente y merece una consideraci&oacute;n aparte.</p> 
<p>Lo que me resulta m&aacute;s curioso es que, hasta hace poco tiempo, para mi el mero hecho de plantearme cambiar .NET por la JVM era algo impensable, y sin embargo ahora me parece una alternativa razonable.</p> 
<p>Por suerte no es una decisi&oacute;n que necesite tomar inmediatamente y eso me va a permitir ver c&oacute;mo avanza .NET Core y c&oacute;mo van resolviendo parte de los problemas que he descrito, por lo que cuando llegue el momento podr&eacute; tomar una decisi&oacute;n basada en hechos m&aacute;s tangibles.</p> 
<p>En cualquier caso, reescribir un sistema, ya sea para migrar a una plataforma o a otra, no deja de ser una decisi&oacute;n arriesgada y, posiblemente, err&oacute;nea, por lo que es una decisi&oacute;n que no debe tomarse a la ligera. Veremos c&oacute;mo acaba todo dentro de un tiempo.</p> 
<p>Estoy seguro de que hay muchas cosas que se me escapan tanto de un entorno como del otro, y estar&eacute; eternamente agradecido al que lo indique en los comentarios.</p> 
<p><strong>Posts relacionados:</strong></p>
<ol> 
 <li><a href="http://blog.koalite.com/2011/10/adios-mocks/" title="Adios, Mocks">Adios, Mocks</a></li> 
</ol>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/cYVliEGxFh4" height="1" width="1" alt="" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java" st_title="¿Adios .NET, hola Java? | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/linux/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta linux</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1321,
      "url" : "http://www.blogstack.info/post/koalite/2015/01/adios-net-hola-java"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>