<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2"><span itemprop="headline">Crear servidor web virtual con Xubuntu 14.04 – Paso 2</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/ubuntu"><img title="ubuntu" alt="ubuntu" src="/assets/images/labels/ubuntu.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/crear-servidor-web-virtual-con-xubuntu-14-04-paso-2/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-05-13T16:41" itemprop="dateModified">Actualizado el martes, 13 de mayo de 2014 a las 16:41 UTC</span></div><div><span>
Etiquetado como
<a href="/label/ubuntu"><span itemprop="articleSection">ubuntu</span></a>, virtual, xubuntu-14-4, servidor-web, servidor-virtual, xubuntu</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div>
 <p>Lo siguiente que vamos a hacer para crear el servidor web virtual con <strong>Xubuntu 14.04</strong> es crear la maquina <strong>virtual</strong> en la que, posteriormente, instalaremos Xubuntu. Para ello tenemos que abrir el programa Virtual Box, con el podemos crear y gestionar nuestras maquinas virtuales. Lo abrimos y vemos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-1.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-1.jpg" alt="crear-maquina-virtual-1" width="700" height="583" /></a></p>
 <p>&nbsp;</p>
 <p>En mi caso ya tengo creadas varias maquinas virtuales, las podemos ver en la parte izquierda, a cada una le he puesto el nombre del sistema operativo que tiene instalado. Tengo que decir que esta maquina virtual que os voy a mostrar como crear paso a paso servir&aacute; para usar cualquier distribuci&oacute;n Linux que quer&iacute;as probar en ella, ademas del <strong>servidor web virtual</strong>. Para hacer el servidor web virtual tenemos que crear una y esto lo hacemos pinchando en el bot&oacute;n que se&ntilde;ala la flecha de la imagen. Al hacer click en “Nueva” nos aparecer&aacute; la siguiente ventana:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-2.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-2.jpg" alt="crear-maquina-virtual-2" width="630" height="417" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; tenemos que poner nombre a la maquina virtual que vamos a crear. Donde pone “Nombre:” pondremos el nombre deseado, en “Tipo” podemos elegir entre varias opciones seg&uacute;n el tipo de sistema operativo que queramos instalar despu&eacute;s y en “Versi&oacute;n”, pues eso la versi&oacute;n del sistema operativo. Por defecto sale como veis en la imagen, por lo menos a mi. Yo le voy a llamar Xubuntu server, al poner el nombre Virtual Box lo detecta y cambia el tipo y versi&oacute;n de forma autom&aacute;tica como pod&eacute;is ver en la siguiente imagen:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-3.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-3.jpg" alt="crear-maquina-virtual-3" width="631" height="415" /></a></p>
 <p>&nbsp;</p>
 <p>En este caso vamos a cambiar la “versi&oacute;n” ya que pone “Ubuntu (64 bit)”, pinchamos sobre este texto y en la opciones buscamos “Ubuntu (32 bit)” y la seleccionamos, despu&eacute;s hacemos click en “Siguiente”. El siguiente paso es:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-4.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-4.jpg" alt="crear-maquina-virtual-4" width="631" height="415" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; tenemos que asignar la memoria RAM de la que dispondr&aacute; el <strong>servidor web</strong>. Por defecto esta en 512MB, con este tama&ntilde;o funcionaria bien, pero si podemos seria mejor ponerle mas, 1000 MB, por ejemplo. Podremos subir la cantidad siempre que el indicador este en el color verde, pero el m&iacute;nimo es 512, tambi&eacute;n podemos dejarlo en el valor por defecto y si vemos que va un poco justa podemos cambiarlo en cualquier momento, como veremos mas adelante. De momento vamos a dejarlo en 512 MB y ya veremos mas adelante si tenemos que cambiarlo. Hacemos click en “Siguiente” y veremos esta pantalla:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-5.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-5.jpg" alt="crear-maquina-virtual-5" width="632" height="420" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; nos pregunta si queremos a&ntilde;adir un disco duro a la maquina virtual, por defecto esta pantalla aparece como veis en la imagen con la opci&oacute;n del medio seleccionada, lo dejamos as&iacute; y pulsamos en “Crear”. La siguiente pantalla es:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-6.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-6.jpg" alt="crear-maquina-virtual-6" width="757" height="456" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; nos pregunta por el tipo de archivo que sera la unidad de disco virtual, lo dejamos como se ve en la imagen, que es la opci&oacute;n por defecto y hacemos click en “Siguiente”. El pr&oacute;ximo paso es:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-7.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-7.jpg" alt="crear-maquina-virtual-7" width="759" height="453" /></a></p>
 <p>&nbsp;</p>
 <p>En este punto Virtual Box nos pregunta que tipo de disco queremos usar, la opci&oacute;n que viene marcada por defecto ocupara menos espacio en nuestro disco duro que la segunda. Lo dejamos as&iacute; y pulsamos en “Siguiente” y vemos esto:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-8.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-8.jpg" alt="crear-maquina-virtual-8" width="760" height="450" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; elegimos el tama&ntilde;o del disco duro que tendr&aacute; la maquina virtual. Podemos dejarlo como viene, en 8GB, pero yo suelo poner 10 GB para tener mas soltura. Lo dejo a vuestra elecci&oacute;n pero yo recomiendo poner 10GB. Entonces le damos a “Crear” y ya tenemos la maquina virtual creada como podemos ver en la siguiente imagen, es la que esta seleccionada en la parte de la izquierda</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-9.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/crear-maquina-virtual-9.jpg" alt="crear-maquina-virtual-9" width="401" height="623" /></a></p>
 <p>&nbsp;</p>
 <p>&nbsp;</p>
 <p>&nbsp;</p>
 <p>Ahora hay que ajustar un poco mas la configuraci&oacute;n. Para ello, con la <strong>maquina virtual</strong> seleccionada como vemos en la imagen hacemos click en el bot&oacute;n de la parte superior que pone “Configuraci&oacute;n” y veremos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-1.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-1.jpg" alt="configuracion -1" width="600" height="338" /></a></p>
 <p>&nbsp;</p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; tenemos diferentes secciones que podemos ver en la parte izquierda y en cada secci&oacute;n sus opciones en la parte derecha. La primera es “General”, pinchamos en ella y en la parte derecha vamos a “Avanzado” y veremos esto:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-2.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-2.jpg" alt="configuracion -2" width="817" height="463" /></a></p>
 <p>&nbsp;</p>
 <p>En la pesta&ntilde;a “Avanzado” tenemos una opci&oacute;n llamada “Compartir portapapeles” y esta inhabilitado, y tambi&eacute;n “Arrastrar y soltar” esta inhabilitado. Hay que habilitar las dos opciones, para ello pinchamos en el texto “Inhabilitado” y en el men&uacute; que aparece elegimos “Bidireccional”, esto hay que hacerlo en “Compartir portapapeles” y en “Arrastrar y soltar”. En la secci&oacute;n “General” no tocamos nada mas.</p>
 <p>Ahora vamos a la secci&oacute;n “Sistema”. Hacemos click en la parte derecha en “Sistema” y veremos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-3.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-3.jpg" alt="configuracion -3" width="820" height="461" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; podemos cambiar la memoria RAM, como os dije antes, entre otras cosas. Aqu&iacute;, en “Placa base”, no vamos a cambiar nada. Vamos a la pesta&ntilde;a “Procesador” y vemos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-4.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-4.jpg" alt="configuracion -4" width="817" height="460" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; podemos asignar a la maquina virtual mas de un procesador, siempre que nuestro ordenador tenga varios. En mi caso tiene 8 y podr&iacute;a asignarle hasta 4. No es necesario, con 1 procesador como viene por defecto es suficiente, pero si quer&eacute;is a&ntilde;adirle mas de uno para que vaya mas r&aacute;pida la maquina virtual lo pod&eacute;is subir siempre que el indicador permanezca en la zona verde. Si quer&eacute;is usar mas procesadores, en la pesta&ntilde;a de “Placa base”, la anterior imagen, ten&eacute;is que habilitar la opci&oacute;n “Habilitar I/O APIC”, si no activ&aacute;is esa opci&oacute;n la maquina virtual no podr&aacute; usar mas de un procesador. De todas formas no es necesario, con un procesador nos valdr&aacute;. Ademas esto lo podemos cambiar en otro momento si vemos que la maquina virtual va lenta. La siguiente pesta&ntilde;a es “Aceleraci&oacute;n” y vemos esto:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-5.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-5.jpg" alt="configuracion -5" width="819" height="465" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; lo ideal seria que estuviesen activadas las dos opciones, puede ser que no teng&aacute;is opci&oacute;n de activarlas, eso es porque vuestro ordenador no admite esta tecnolog&iacute;a de virtualizacion. Si pod&eacute;is hacerlo, activarlas y si no pod&eacute;is, tendr&iacute;ais que mirar si pod&eacute;is acceder a la BIOS de vuestro ordenador para activar esa funci&oacute;n, si es que vuestro ordenador dispone de esta tecnolog&iacute;a. De todas formas, aunque no pod&aacute;is activar estas dos casillas podemos hacer todo lo dem&aacute;s y probar la maquina virtual a ver que tal funciona, estas dos opciones sirven para mejorar el rendimiento de la virtualizacion pero igualmente podr&eacute;is usar la maquina virtual.</p>
 <p>La siguiente secci&oacute;n es “Pantalla” y al hacer click en ella veremos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-6.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-6.jpg" alt="configuracion -6" width="822" height="462" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; configuramos la pantalla de la maquina <strong>virtual</strong>. En la pesta&ntilde;a “V&iacute;deo” ponemos la opci&oacute;n “Memoria de v&iacute;deo” al m&aacute;ximo valor posible, en mi caso 128 MB y activamos la casilla “Habilitar aceleraci&oacute;n 3D”, tiene que quedar como veis en la imagen. Esto sirve para que la maquina virtual funcione mejor respecto a los gr&aacute;ficos. En las otras dos pesta&ntilde;as no tocamos nada.</p>
 <p>Ahora vamos a la secci&oacute;n “Almacenamiento”, en la cual veremos lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-7.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-7.jpg" alt="configuracion -7" width="824" height="464" /></a></p>
 <p>&nbsp;</p>
 <p>Aqu&iacute; podemos gestionar los discos duros y unidades de CD. Tenemos que hacer click donde se&ntilde;ala la flecha, es un icono de un CD y al pinchar en el se abrir&aacute; una ventana en la cual debemos pinchar donde pone “Seleccionar disco”, luego navegamos hasta encontrar la ISO de <strong>Xubuntu 14.04</strong> que hab&eacute;is descargado, la seleccionamos y pinchamos en “Abrir”. Esto es el equivalente a abrir la unidad de CD de nuestro ordenador y meter en ella un CD con la ISO de Xubuntu grabada, de esta forma cuando arranquemos la maquina virtual iniciara con la ISO de Xubuntu. En esta secci&oacute;n no hay que tocar nada mas.</p>
 <p>La siguiente secci&oacute;n es “Audio”, no vamos a tocar nada en ella y pasamos a la secci&oacute;n “Red” para ver lo siguiente:</p>
 <p>&nbsp;</p>
 <p><a href="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-8.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/05/configuracion-8.jpg" alt="configuracion -8" width="824" height="467" /></a></p>
 <p>&nbsp;</p>
 <p>En la pesta&ntilde;a “Adaptador 1″ por defecto, donde pone “Conectado a” viene “NAT”, tenemos que hacer click en ese texto y en la opciones que aparecen seleccionar “Adaptador puente”, debe quedar igual que en la imagen que os he puesto, puede ser que donde pone “wlan0″ ponga “eth0″, eso es porque vuestro ordenador esta conectado por cable a Internet, vale cualquiera de las dos opciones, “wlan0″ si os conect&aacute;is a Internet por wifi y “eth0″ si os conect&aacute;is a Internet por cable. En el resto de pesta&ntilde;as no vamos a tocar nada.</p>
 <p>Las tres ultimas secciones no necesitamos tocarlas de momento, mas adelante veremos como usar las “Carpetas compartidas” que nos servir&aacute;n para poder compartir archivos desde nuestro ordenador a la maquina virtual de una manera sencilla y r&aacute;pida, pero eso lo veremos mas adelante. Os dejo un v&iacute;deo que he subido a <a href="https://www.youtube.com/channel/UCm-NH4WuFI5cO40VqWyx2sA">mi canal de Youtube</a> en el cual muestro todo este proceso paso a paso por si quer&eacute;is verlo:</p>
 <p>&nbsp;</p>
 <p></p>
 <br /> 
 <iframe src="//www.youtube.com/embed/3RIRCp1XcEQ" width="640" height="360" frameborder="0" allowfullscreen="allowfullscreen"></iframe>
 <br /> &nbsp;
 <p></p>
 <p>El siguiente paso sera instalar Xubuntu en la maquina virtual y ya estaremos cada vez mas cerca de tener nuestro propio <strong>servidor web virtual</strong>. &iquest;Os ha parecido complicado el proceso? Espero que no, si ten&eacute;is alguna duda con algo decidmelo y encantado os ayudar, un saludo.</p>
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2" st_title="Crear servidor web virtual con Xubuntu 14.04 – Paso 2 | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/ubuntu/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta ubuntu</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 540,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/05/crear-servidor-web-virtual-con-xubuntu-14-4-paso-2"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>