<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>No subestimes el poder de un log | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/09/no-subestimes-el-poder-de-un-log"><span itemprop="headline">No subestimes el poder de un log</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/mirNr_Ur3qI/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-09-01T05:06" itemprop="datePublished">Publicado el lunes, 01 de septiembre de 2014 a las 05:06 UTC</span></div><div><span>
Etiquetado como
software-development, development</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Desarrollar software ser&iacute;a mucho m&aacute;s f&aacute;cil (aunque tal vez menos divertido) si todo funcionase siempre. La realidad es que, por muchos <a href="http://blog.koalite.com/2014/05/deconstruyendo-la-piramide-de-los-tests/" title="Deconstruyendo la pir&aacute;mide de los tests">tests autom&aacute;tizados que escribas</a> y muchos <a href="http://blog.koalite.com/2012/08/razones-para-cuidar-la-calidad-del-software-tu/" title="Razones para cuidar la calidad: t&uacute;">motivos que tengas para cuidar la calidad del software</a>, antes o despu&eacute;s, te encontrar&aacute;s con problemas de lo m&aacute;s ex&oacute;tico que jam&aacute;s hubieses pensado que podr&iacute;an llegar a producirse. </p> 
<p>Si tienes suerte, dar&aacute;s con un usuario muy colaborador que te proporcionar&aacute; una lista exacta de los pasos necesarios para reproducir el problema, podr&aacute;s reproducirlo en un entorno de desarrollo y, usando toda tu artiller&iacute;a pesada de depuradores, monitores, sniffers y dem&aacute;s, conseguir&aacute;s solucionarlo.</p> 
<p>Si vives en el mundo real, es probable que muchos de esos problemas se produzcan en condiciones extra&ntilde;as, con usuarios que “no saben que han hecho, pero la aplicaci&oacute;n falla”, y sean muy dif&iacute;ciles de diagnosticar (no digamos ya de reproducir en un entorno de desarrollo).</p> 
<p>Para estos casos, hay una herramienta que, por su simplicidad, resulta muy &uacute;til: un buen log.</p> 
<p>Existen muchas formas de obtener informaci&oacute;n sobre el comportamiento de una aplicaci&oacute;n una vez que llega a producci&oacute;n. Por ejemplo, puedes conseguir <a href="http://blog.koalite.com/2012/03/seguimiento-de-una-aplicacion-de-escritorio-con-google-analytics/" title="Seguimiento de una aplicaci&oacute;n de escritorio con Google Analytics">estad&iacute;sticas de uso</a>, puedes <a href="http://panicoenlaxbox.blogspot.com.es/2013/08/elmah-en-aspnet-mvc-paso-paso.html">guardar informaci&oacute;n de errores</a> o puedes mantener un hist&oacute;rico con las acciones realizadas por los usuarios con fines de auditor&iacute;a. Todo esto lo puedes hacer de forma “artesanal” o integr&aacute;ndolo con sistemas m&aacute;s potentes y estandarizados como contadores de rendimiento, eventos de windows, syslogs, etc.</p> 
<p>Teniendo en cuenta que existen todos estos sistemas que permiten mantener enormes hist&oacute;ricos y realizar complejas consultas y an&aacute;lisis, &iquest;tiene sentido escribir un triste log en un fichero de texto?</p> 
<h3>El poder de la simplicidad</h3> 
<p>La ventaja fundamental de un fichero de log frente a sistemas m&aacute;s potentes es su simplicidad. </p> 
<p>Generar un fichero de texto plano es f&aacute;cil desde cualquier lenguaje de programaci&oacute;n, no requiere desplegar servicios externos (o usar servicios de terceros) para almacenar la informaci&oacute;n, se puede consultar con cualquier editor de texto en cualquier dispositivo y se puede compartir de mil formas diferentes, desde un email hasta una memoria USB.</p> 
<p>Esto permite que generar un log suponga <strong>una inversi&oacute;n inicial muy baja</strong> y no tengamos que dedicar mucho esfuerzo a montar una infraestructura m&aacute;s potente hasta que no sea necesaria (vamos, YAGNI y todas esas siglas que molan tanto).</p> 
<p>No obstante, con el paso del tiempo, es posible que merezca la pena <strong>automatizar ciertos procesos</strong> relativos a la obtenci&oacute;n de los logs. Por ejemplo, puede ser interesante poder realizar un env&iacute;o autom&aacute;tico de logs desde la aplicaci&oacute;n (o con una herramienta externa, por si la aplicaci&oacute;n ni siquiere arranca), solicitar remotamente el env&iacute;o de esos logs para equipos que no est&aacute;n siempre conectados, o al menos ayudar al usuario a preparar un zip con los logs que luego pueda copiar a una memoria USB.</p> 
<p>Aprovechar esta simplicidad no quiere decir que dejemos de lado otros mecanismos m&aacute;s potentes. Por suerte, la mayor&iacute;a de librer&iacute;as de logging disponibles permiten enviar informaci&oacute;n a distintos almacenes, y por el mismo precio que generamos nuestro humilde fichero de log podemos ir alimentando una base de datos, el visor de sucesos de windows o un syslog.</p> 
<h3>Qu&eacute; informaci&oacute;n debe contener un buen log</h3> 
<p>La utilidad de un log va a depender directamente de la calidad de la informaci&oacute;n que contenga. Si partimos de la base de que nuestro objetivo fundamental con el log es resolver problemas, parece claro que la informaci&oacute;n que debemos incluir en el log es <strong>aquella informaci&oacute;n que nos gustar&iacute;a tener cuando ocurra un problema</strong>.</p> 
<p>El log debe contener informaci&oacute;n relevante para la aplicaci&oacute;n, que nos permita saber qu&eacute; est&aacute; ocurriendo en todo momento en la aplicaci&oacute;n, por ejemplo, cuando si estuvi&eacute;semos hablando de un cliente de twitter, un log deber&iacute;a poder mostrar los intentos de enviar un tweet que hace el usuario o el n&uacute;mero de tweets descargados cada vez que se conecta al servidor.</p> 
<p>Junto a este tipo de informaci&oacute;n, tambi&eacute;n puede resultar &uacute;til almacenar <strong>informaci&oacute;n del entorno de ejecuci&oacute;n</strong>: versiones de aplicaci&oacute;n, sistema operativo y plataforma (CLR, JRE, etc.), usuario de sistema que ejecuta la aplicaci&oacute;n, ruta de ejecuci&oacute;n, etc. Adem&aacute;s, podemos incluir una monitorizaci&oacute;n cada cierto tiempo para controlar aspectos como la cantidad de memoria disponible, el nivel de bater&iacute;a (si procede), si hay conexi&oacute;n disponible o no… </p> 
<p>Todo esto depende mucho del tipo de aplicaci&oacute;n, pero a veces es necesario contar con esta informaci&oacute;n para tener un cierto contexto que nos ayude a comprender por qu&eacute; se produjo ese OutOfMemoryException o por qu&eacute; dej&oacute; de responder la resoluci&oacute;n DNS.</p> 
<p>A la hora de presentar esta informaci&oacute;n en el log debemos tener en cuenta que debe ser <strong>f&aacute;cilmente legible</strong> para un humano (probablemente nosotros) y ser&iacute;a de agradecer que fuese m&aacute;s o menos sencillo buscar cosas en &eacute;l desde un editor de texto normal, ya sea con subcadenas o con expresiones regulares.</p> 
<p>Merece la pena dedicar un poco de tiempo a formatear correctamente los mensajes en el log para que sean homog&eacute;neos y realmente nos ayuden a seguir lo que est&aacute; pasando en la aplicaci&oacute;n.</p> 
<p>Es especialmente importante registrar en el log la forma en que se desarrollan <strong>procesos desatendidos</strong>. Volviendo al cliente de twitter, si va a estar actualizando datos en background, es importante registrar esos intentos de actualizaci&oacute;n para poder diagnosticar problemas cuando el usuario nos diga “no recibo nuevos tweets” y tengamos que decidir si es que se ha colgado la hebra que los actualiza, hemos dejado de recibir notificaciones push, no hay cobertura, el servidor est&aacute; ca&iacute;do, o realmente no hay ning&uacute;n tweet que recibir.</p> 
<p>Otro punto en el que un buen log puede salvarnos muchas horas de depuraci&oacute;n es en la <strong>integraci&oacute;n con sistemas externos</strong>. Tener informaci&oacute;n del tiempo que tardan en respondernos o la informaci&oacute;n que se intercambia con ellos (en la medida de lo posible) puede ser vital a la hora de decidir si el problema est&aacute; en el sistema externo o en nuestra aplicaci&oacute;n (s&iacute;, nuestras aplicaciones tambi&eacute;n puedes tener problemas). </p> 
<h3>Qu&eacute; informaci&oacute;n NO pertenece a un log</h3> 
<p>Hay informaci&oacute;n que <strong>no</strong> pertenece a un fichero de log (aunque podamos incluirla en &eacute;l), sino que forma parte de los requisitos propios de la aplicaci&oacute;n. Por ejemplo, si nuestra aplicaci&oacute;n debe mantener un hist&oacute;rico de qu&eacute; usuario modifica qu&eacute; productos, eso deber&aacute; tratarse de forma adecuada en la aplicaci&oacute;n y no s&oacute;lo como entradas en el log.</p> 
<p>Podemos tener casos en que necesitamos tener informaci&oacute;n para realizar una monitorizaci&oacute;n proactiva del sistema (memoria en uso, peticiones por segundo, etc.). En ese caso esta informaci&oacute;n deber&aacute; estar disponible por otros medios m&aacute;s adecuados que un log, que no deja de ser una herramienta reactiva, es decir, para cuando ya ha ocurrido el problema.</p> 
<p>Por &uacute;ltimo, tampoco debemos incluir en el log <em>toda</em> la informaci&oacute;n de llamadas a m&eacute;todos que se realizan en la aplicaci&oacute;n. Esto, que es muy tentador cuando uno empieza a jugar con AOP y cosas como <a href="http://www.postsharp.net/">PostSharp</a>, en realidad forma parte de una traza, no de un log, y en el log lo m&aacute;s que puede hacer es generar ruido y dificultarnos encontrar la informaci&oacute;n relevante para el problema que necesitamos resolver.</p> 
<h3>Conclusiones</h3> 
<p>Cuando no tenemos la opci&oacute;n de <a href="http://blog.koalite.com/2012/11/sobrevivir-sin-un-depurador/" title="Sobrevivir sin un depurador">engancharnos a un depurador</a> para ver qu&eacute; est&aacute; pasando con una aplicaci&oacute;n que da problemas, utilizar un simple fichero de log puede ser extremadamente &uacute;til para resolver el problema.</p> 
<p>A la hora de generar el log debemos definir claramente qu&eacute; tipo de informaci&oacute;n necesitamos guardar en &eacute;l y hacerlo de forma ordenada para que, cuando sea necesario revisarlo, realmente resulte &uacute;til y no sea una amalgama sin sentido llena de ruido e informaci&oacute;n redundante.</p> 
<p>Al final, <a href="http://blog.koalite.com/2012/11/la-ultima-linea-de-soporte-es-el-programador/" title="La &uacute;ltima l&iacute;nea de soporte es el programador">la &uacute;ltima l&iacute;nea de soporte somos nosotros</a>, y cuando llega el momento de solucionar un problema, contar con las herramientas adecuadas puede ser la diferencia entre resolver un problema en un rato o sufrirlo durante d&iacute;as.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/mirNr_Ur3qI" height="1" width="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log" st_title="No subestimes el poder de un log | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 863,
      "url" : "http://www.blogstack.info/post/koalite/2014/09/no-subestimes-el-poder-de-un-log"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>