<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Elegir herramientas para un proyecto Java | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java"><span itemprop="headline">Elegir herramientas para un proyecto Java</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/tapestry"><img title="tapestry" alt="tapestry" src="/assets/images/labels/tapestry.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2011/06/elegir-herramientas-para-un-proyecto.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2012-08-10T22:03" itemprop="dateModified">Actualizado el viernes, 10 de agosto de 2012 a las 22:03 UTC</span></div><div><span>
Etiquetado como
<a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, planeta-arch-linux, planeta-linux, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, gnulinux, <a href="/label/php"><span itemprop="articleSection">php</span></a>, <a href="/label/tapestry"><span itemprop="articleSection">tapestry</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Java" height="200" src="http://2.bp.blogspot.com/-hC2-QuC33AU/TBeztET3lAI/AAAAAAAAAZ8/EzZnNZw5do0/s200/java.png" title="Java" width="107" />
</div>Cuando empezamos un nuevo proyecto siempre tenemos que tomar decisiones en el aspecto t&eacute;cnico eligiendo las herramientas que vamos a usar para desarrollar el proyecto. La selecci&oacute;n adecuada de estas herramientas puede determinar en gran medida lo f&aacute;cil que pueda resultar el mantenimiento del mismo que en muchos proyectos es la parte a la que m&aacute;s tiempo se le suele dedicar. El elegir la herramienta adecuada no es una decisi&oacute;n f&aacute;cil ya que hay muchos lenguajes que podr&iacute;amos utilizar, para cada lenguaje numerosos frameworks y para algunas tareas espec&iacute;ficas como acceso a base de datos o generaci&oacute;n de informes varias librerias. La decisi&oacute;n de cual elegir es un poco subjetiva seg&uacute;n las preferencias de cada uno pero hay varios factores que pude ayudarnos como los conocimientos que tenga el equipo que lo va a desarrollar o las limitaciones impuestas por el mismo proyecto o cliente. Pero si tuviesemos una carta blanca y pudiesemos elegir libremente &iquest;cuales son las herramientas que utilizar&iacute;amos?
<br />
<br />Independientemente del tipo del proyecto hay ciertas categor&iacute;as de herramientas comunes a todos los proyectos para cada una de las cuales deber&iacute;amos elegir una. Estas ser&iacute;an:
<br />
<br />
<b>Herramienta control de versiones</b>: Esta es una herramienta imprescindible si son varias las personas que participan en el proyecto ya que permite compartir a todos los integrantes del mismo el c&oacute;digo fuente de una forma r&aacute;pida y c&oacute;moda. Y a&uacute;n trabajando solo en el proyecto una herramienta de este tipo nos permite almacenar un historial de todos los cambios que hemos ido realizando al c&oacute;digo fuente por si necesitamos recuperar alguna parte en alg&uacute;n momento adem&aacute;s de etiquetar ciertas versiones para igualmente poder recuperarlas si es necesario. En estos momentos Subversion y Git son dos de las herramientas m&aacute;s conocidas y utilizadas. La principal diferencia entre ellas es que Subversion utiliza un modelo cliente/servidor y 
<a href="http://git-scm.com/"><b>Git</b></a> utiliza un modelo distribuido. Git ser&iacute;a la opci&oacute;n que elegir&iacute;a por ser la evoluci&oacute;n que est&aacute;n tomando estas herramientas y por tener algunas ventajas sobre Subversion como la mayor facilidad para crear branches.
<br />
<br />
<b>Herramienta gesti&oacute;n de peticiones</b>: Habiendo trabajado con un herramienta de este tipo uno piensa como era posible trabajar sin una y es que permite conocer a todos los miembros de equipo las tareas que est&aacute;n pendientes de realizar, que est&aacute; haciendo cada uno y cual es el progreso de las mismas y su estado evitando que se &laquo;pierdan&raquo;. Adem&aacute;s pueden integrase con el sistema de control de versiones permitiendo anotar en los tickets referencias a una revisi&oacute;n del c&oacute;digo fuente y ver que cambios tiene cada petici&oacute;n cosa que puede implicar varios commits en la herramienta de control de versiones. Tenemos a disposici&oacute;n varias herramientas (bugzilla, Mantis, ...) pero de las que he visto Trac y 
<a href="http://www.redmine.org/"><b>Redmine</b></a> (por tener ambas una wiki que permite anotar documentaci&oacute;n) son las que m&aacute;s me han gustado.
<br />
<br />
<b>Herramienta de construcci&oacute;n del proyecto</b>: Si queremos trabajar de forma c&oacute;moda y no perder el tiempo realizando tareas repetitivas necesitamos una herramienta que nos automatice la tarea de compilar el proyecto y desplegarlo en el servidor asi como de ejecutar las pruebas unitarias. Herramientas espec&iacute;ficas para este prop&oacute;sito son Ant, Maven y por la que yo optar&iacute;a si pudiese elegir ser&iacute;a 
<a href="http://www.gradle.org/"><b>Gradle</b></a>.
<br />
<br />
<b>Herramienta de pruebas unitarias</b>: Si queremos asegurarnos de que las cosas hacen lo que tienen que hacer deber&iacute;amos desarrollar junto con nuestro c&oacute;digo fuente sus pruebas unitarias. Adem&aacute;s estas mismas pruebas nos servir&aacute;n para comprobar si las cosas siguen funcionando despu&eacute;s de un determinado cambio. Herramientas de pruebas hay muchas pero varias de ellas son 
<a href="http://www.junit.org/"><b>JUnit</b></a>, 
<a href="http://mockito.org/"><b>Mockito</b></a>, 
<a href="http://pmd.sourceforge.net/"><b>PMD</b></a>, 
<a href="http://checkstyle.sourceforge.net/"><b>Checkstyle</b></a> y 
<a href="http://seleniumhq.org/"><b>Selenium</b></a>.
<br />
<br />
<b>Herramienta de integraci&oacute;n continua</b>: Las herramientas de integraci&oacute;n continua permite realizar ciertas tareas cada cierto tiempo de forma autom&aacute;tica y se suelen utilizar para comprobar que el proyecto sigue compilando correctamente con los cambios que se van haciendo en la herramienta de control de versiones, para comprobar que siguen pasando las pruebas unitarias y para construir una versi&oacute;n a ser desplegada en los servidores. Quiz&aacute; la m&aacute;s conocida y utilizada en estos momentos es 
<a href="http://jenkins-ci.org/"><b>Jenkins</b></a>. Uno de sus puntos fuertes es su extensibilidad a trav&eacute;s de plugins.
<br />
<br />Despu&eacute;s de estas herramientas comunes a todos los proyectos deberemos elegir algunas espec&iacute;ficas para el proyecto que tengamos por delante:
<br />
<br />
<b>Lenguaje de programaci&oacute;n</b>: Esta ser&aacute; una elecci&oacute;n que condicionar&aacute; algunas de las herramientas que utilizaremos y el hecho de optar por un determinado lenguaje nos obligar&aacute; a buscar y a encontrar librer&iacute;as en ese lenguaje para resover las tareas del proyecto si no queremos reinventar la rueda. 
<br />
<br />En mi caso opto por 
<a href="http://www.oracle.com/technetwork/java/index.html"><b>Java</b></a> por ser un lenguaje orientado a objetos, fuertemente tipado (esto tiene la ventaja de que el compilador nos ayuda a encontrar errores r&aacute;pidamente en tiempo de compilaci&oacute;n) y con un mont&oacute;n de librer&iacute;as con licencia de c&oacute;digo abierto o de software libre que podemos usar. En estos momentos Java tiene algunas carencias como el no disponer de closures (aunque muy posiblemente se a&ntilde;adan en la versi&oacute;n 8) pero para alguna tarea espec&iacute;fica podemos utilizar 
<a href="http://groovy.codehaus.org/"><b>Groovy</b></a> (que es un lenguage de programaci&oacute;n que puede ejecutarse sobre la JVM y si dispone de ellas).
<br />
<br />
<b>Plataforma de desarrollo</b>: Siendo este un blog con una tem&aacute;tica entorno a software libre y 
<b>Linux</b> no podr&iacute;a elegir otra que no fuera el sistema del ping&uuml;ino. Pero tambi&eacute;n hay motivos importantes por lo que lo recomendar&iacute;a como tener a tu disposici&oacute;n un mont&oacute;n de software libre a un comando o unos cuantos clics de rat&oacute;n para instalar y tenerlo actualizado. En windows pasado un tiempo se hace pesado y es una p&eacute;rdida de tiempo el desinstalar el programa, buscar el instalador para la nueva versi&oacute;n y volverlo a instalar. Lo ideal ser&iacute;a que el proyecto pudiese ser desarrollado en cualquier plataforma y que cada persona eligiese con la que m&aacute;s c&oacute;modo se encontrase. Uno de los contras que tengo sensaci&oacute;n es que al usar Arch Linux por una actualizaci&oacute;n en alg&uacute;n momento algo se &laquo;rompa&raquo; y me deje el sistema inutilizado.
<br />
<br />
<b>IDE de desarrollo</b>: Siendo Java el lenguaje de desarrollo por el que he optado como IDE optar&iacute;a por 
<a href="http://www.eclipse.org/"><b>eclipse</b></a>. Aunque si necesitamos algo m&aacute;s liviano podr&iacute;amos optar por 
<b>Gedit</b> directamente, 
<b>emacs</b> o vim. Una de las cosas importantes ser&iacute;a utilizar una que nos resalte la sintaxis de nuestro c&oacute;digo fuente, soporte para hacer refactor o asistente de c&oacute;digo.
<br />
<br />
<b>Base de datos</b>: En muchos proyectos necesitaremos persistir informaci&oacute;n y consultarla. Para resolver este asunto est&aacute;n las bases de datos, lo m&aacute;s probable sea que necesitemos una relacional y para ello tenemos 
<a href="http://www.mysql.com/"><b>MySql</b></a> o 
<a href="http://www.postgresql.org/">PostgreSQL</a>&nbsp;aunque en estos momentos las bases de datos orientadas a documentos est&aacute;n siendo muy nombradas como 
<a href="http://www.mongodb.org/">MongoDB</a>, 
<a href="http://couchdb.apache.org/">CrouchDB</a> o 
<a href="http://redis.io/">Redis</a>.
<br />
<br />
<b>Herramienta de persistencia en base de datos</b>: Entre los lenguajes de programaci&oacute;n orientados a objetos y las bases de datos relacionales hay una discordancia en la forma de representar los datos. Para tratar de abstraernos del Sql que utilizan las bases de datos relacionales podemos utilizar un ORM que nos permitir&aacute; trabajar de una forma orientada a objetos adem&aacute;s de abstraernos de la base de datos en concreto que utilizamos ya que aunque cada una implementa una especificaci&oacute;n com&uacute;n de Sql hay ciertas diferencias entre ellas que deberemos tener en cuenta si no utilizamos un ORM. Uno de ellos es 
<a href="http://www.hibernate.org/"><b>hibernate</b></a>.
<br />
<br />
<b>Framework de desarrollo web</b>: Framework de desarrollo en Java hay para aburrir. De entre los que he usado en proyectos reales JSP, 
<a href="http://struts.apache.org/">Struts</a>, JSF,&nbsp;
<a href="http://www.grails.org/">Grails</a> y 
<a href="http://tapestry.apache.org/"><b>Tapestry</b></a> me quedo con este &uacute;ltimo principalmente por poder desarrollar componentes y librer&iacute;as de componentes que incluyen toda la funcionaliadad necesaria para que funcionen, que pueden ser reutilizados entre diferentes proyectos, que simplifica enormemente el desarrollo y es altamente extensible y adaptable a las necesidades que podamos tener en el proyecto.
<br />
<br />
<b>Tomcat</b>: es un contenedor de servlets y jsp &laquo;secillo&raquo; sobre el que desplegar nuestras aplicaciones web Java.
<br />
<br />
<b>Framework Javascript</b>: trabajar con javascript puede ser arduo m&aacute;s teniendo en cuenta que cada navegador tiene su propias peculiaridades por ello se hace casi imprescindible que en un proyecto web elegir un framework javascript que nos permita abstraernos de estas peculiaridades y nos simplifique el trabajo. Quiz&aacute; uno de los m&aacute;s conocidos y utilizados sea 
<a href="http://jquery.com/"><b>jQuery</b></a> aunque disponemos de otros como Prototype, Mootools aunque quiz&aacute; menos usados y con menos plugins disponibles.
<br />
<br />Otra serie de herramientas que quiz&aacute; tengamos que tener en cuenta son:
<br />
<a href="http://jasperforge.org/projects/jasperreports"><b>JasperReports</b></a>/
<b>iReport</b>: generaci&oacute;n de informes en varios formatos.
<br />
<a href="http://lucene.apache.org/java/docs/index.html"><b>Lucene</b></a>: indexaci&oacute;n de datos.
<br />
<a href="http://www.jboss.org/"><b>JBoss</b></a>: si necesitamos algo m&aacute;s completo que Tomcat prod&iacute;amos optar por servidor de aplicaciones como este.
<br />
<b><a href="http://www.cherokee-project.com/">Cherokee</a>, <a href="http://www.lighttpd.net/">Lighttpd</a>, <a href="http://nginx.org/">nginx</a></b>: servidor web ligero y r&aacute;pido.
<br />
<a href="http://www.jboss.org/jbpm"><b>jBPM</b></a>: permite modelar flujos de trabajo de negocio.
<br />
<a href="http://freemarker.sourceforge.net/"><b>Freemarker</b></a>: herramienta para genergar archivos de texto basandose en plantillas.
<br />
<a href="http://www.quartz-scheduler.org/"><b>Quartz</b></a>: planificador de trabajos.
<br />
<a href="http://www.slf4j.org/">SLF4J</a>&nbsp;y&nbsp;
<a href="http://logback.qos.ch/">Logback</a>: trazas&nbsp;de log.
<br />
<a href="http://lesscss.org/"><b>Less</b></a>: lenguaje para CSS.
<br />
<br />Estas son las herramientas que seguramente elegir&iacute;a para un proyecto web desarrollandolo con Java y que ser&aacute;n suficientes para la mayor&iacute;a de proyectos web, si tuviese que elegir otra plataforma probablemente optar&iacute;a por PHP y Symfony si el proyecto no es excesivamente complejo. Pero como digo hay muchas opciones y uno puede elegir la que m&aacute;s c&oacute;modo se encuentre desarrollando o considere m&aacute;s adecuada.
<br />
<br />&iquest;Alguna herramienta distinta de estas que t&uacute; consideres imprescincible o te haya gustado trabajar con ella?</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java" st_title="Elegir herramientas para un proyecto Java | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Elegir herramientas para un proyecto Java";
var disqus_url = "http://elblogdepicodev.blogspot.com/2011/06/elegir-herramientas-para-un-proyecto.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li><li><a href="/label/php/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta php</a></li><li><a href="/label/tapestry/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tapestry</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 147,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2011/06/elegir-herramientas-para-un-proyecto-java"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>