<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu"><span itemprop="headline">Mi recomendacion para hacer las particiones para instalar Ubuntu</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/ubuntu"><img title="ubuntu" alt="ubuntu" src="/assets/images/labels/ubuntu.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-11-20T09:04" itemprop="dateModified">Actualizado el jueves, 20 de noviembre de 2014 a las 09:04 UTC</span></div><div><span>
Etiquetado como
opinion, <a href="/label/ubuntu"><span itemprop="articleSection">ubuntu</span></a>, recomendacion, hacer, instalar, particiones</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Hace unos d&iacute;as tuve la ocasi&oacute;n de intercambiar unos mensajes con un par de usuarios acerca de como <strong>hacer las particiones</strong> a la hora de <strong>instalar</strong> <strong>Ubuntu</strong>, en particular uno de ellos me hizo llegar sus dudas entre las cuales estaba cuantas particiones deb&iacute;a crear y cual era la configuraci&oacute;n correcta. Le mande un email con mis recomendaciones y me pareci&oacute; una buena idea escribir un articulo al respecto y as&iacute; expresar mi opini&oacute;n sobre como hacer las particiones a la hora de instalar Ubuntu en un ordenador.</p>
<p>Habr&iacute;a que tener varias cosas en cuenta a la hora de instalar Ubuntu en un ordenador y como hacer sus particiones, la primera de ellas es si ten&eacute;is otro sistema operativo instalado, como por ejemplo Windows. Despu&eacute;s me meter&eacute; mas a fondo con el tema de las <strong>particiones</strong> de <strong>Ubuntu</strong>, pero si ten&eacute;is Windows ya instalado primero habr&iacute;a que pensar si lo quer&eacute;is conservar o borrar, en el segundo caso no habr&iacute;a que decir mucho mas ya que borrarlo es una tarea muy sencilla que podemos hacer en la propia instalaci&oacute;n de Ubuntu. En el caso de querer conservar Windows hay que tener en cuenta la capacidad del disco duro, para poder <strong>instalar Ubuntu</strong> y tener algo de espacio para archivos y vuestras cosas personales, seria necesario al menos unas 40 GB, puede que alguno se escandalice por esta cifra pero me voy a explicar un poco. Ubuntu reci&eacute;n instalado ocupa unas 4 GB, &iquest;porque la diferencia entre 4GB y las 40GB que recomiendo? Muy sencillo, dentro de esas 40Gb incluyo la instalaci&oacute;n de Ubuntu, los programas que posteriormente quer&aacute;is instalar, la partici&oacute;n de Swap y unas 30Gb mas o menos para archivos personales. Teniendo en cuenta las capacidades de los discos duros hoy en d&iacute;a, no me parece mucho dedicar 40Gb para Ubuntu.</p>
<p>&nbsp;</p>
<p><a href="http://elblogdeliher.com/wp-content/uploads/2014/11/las-particiones.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/11/las-particiones.jpg" alt="las-particiones" width="500" height="359" /></a></p>
<p>&nbsp;</p>
<p>Os voy a poner un ejemplo, supongamos que tienes un disco duro de 500 GB, y &nbsp;lo tienes todo para Windows. Quieres <strong>instalar Ubuntu</strong> pero conservar Windows, en el proceso de instalaci&oacute;n de Ubuntu tienes la posibilidad de una forma muy sencilla e intuitiva de redimensionar la partici&oacute;n que tiene Windows y as&iacute; liberar espacio para instalar Ubuntu. Yo dejar&iacute;a unas 300Gb para Windows y 200 GB para Ubuntu, que luego explicare como particionar. Dejar&iacute;a mas espacio para Windows porque el propio Windows y los programas que queramos instalar despu&eacute;s ocupan mas espacio que <a href="http://www.ubuntu.com/">Ubuntu</a> y sus programas. Una cosa a tener en cuenta es que si mas adelante, despu&eacute;s de instalar y usar Ubuntu durante un tiempo, quieres borrar Windows del ordenador sin tocar Ubuntu, se puede borrar Windows y a&ntilde;adir esas 300 GB a Ubuntu y que quede todo el disco duro para Ubuntu, aunque eso lo dejo para otro articulo.</p>
<p>Llegados a este punto, si quer&eacute;is conservar Windows en vuestro ordenador y tambi&eacute;n instalar Ubuntu para poder elegir cual usar cuando encend&aacute;is el ordenador, habr&iacute;a que defragmentar el disco duro. Defragmentar el disco duro significa organizar toda la informaci&oacute;n que tiene y “juntarla”, esto es una explicaci&oacute;n lo mas sencilla posible. Windows tiene un programa para ello llamado “Defragmentador de discos”, no recuerdo exactamente donde esta en el men&uacute;, creo que en “Herramientas”, lo pod&eacute;is encontrar muy f&aacute;cilmente si busc&aacute;is dentro del men&uacute; de Windows. Si nunca hab&eacute;is ejecutado el Defragmentador de discos de Windows seguramente tarde unas horas en hacerlo, puede que 5 o 6, es recomendable dejarlo trabajando por la noche mientras dorm&iacute;s, ademas no es recomendable usar el ordenador mientras se hace la defragmentacion. Para defragmentar el disco solo ten&eacute;is que abrir el Defragmentador de discos y pulsar un bot&oacute;n, es muy sencillo, luego Windows se encarga de hacer todo el trabajo. El tiempo que tardara depende de varias cosas:</p>
<ul>
 <li>El tama&ntilde;o del disco duro, a mas grande mas tardara</li>
 <li>Cuan lleno este el disco duro, cuanto mas lleno mas tardara</li>
 <li>Cuando fue la ultima vez que defragmentasteis el disco duro</li>
</ul>
<p>Lo mejor es, como he dicho anteriormente, dejarlo por la noche haci&eacute;ndolo y ya esta. Ahora vamos a ir con el tema de las <strong>particiones</strong> propiamente dicho. Yo tengo principalmente dos configuraciones:</p>
<ul>
 <li>2 particiones, una para la swap y otra raiz o “/”</li>
 <li>3 particiones, una para swap, otra para raiz o “/” y la tercera para “/home”</li>
</ul>
<p>Despu&eacute;s de leer informaci&oacute;n respecto a las particiones en otras paginas, llegue a la conclusi&oacute;n de que no es necesario mas particiones que esas para usar <strong>Ubuntu</strong> o cualquier distribuci&oacute;n Linux. Incluso se podr&iacute;a no crear la Swap, con la memoria RAM que tienen los ordenadores hoy en d&iacute;a no tiene utilidad, pero yo siempre creo una de 2GB por si acaso, esas 2GB no me suponen nada y te olvidas de posibles problemas y lo digo yo que mi port&aacute;til tiene 8GB de RAM y un disco SSD de 120GB, por lo que mi equipo tiene RAM suficiente para no necesitar la Swap, de hecho nunca he visto que se use en el Conky, y un disco peque&ntilde;o pero las 2GB de Swap no me suponen una perdida importante.</p>
<p>La primera configuraci&oacute;n en la que solo creo dos particiones es la que uso hoy en d&iacute;a en mi port&aacute;til, lo tengo as&iacute; por que no veo ning&uacute;n problema en hacerlo y porque me permite aprovechar mas el espacio, ademas el posible problema que puede surgir de quedarme sin espacio no me ha pasado nunca ya que me gusta estar al tanto de como esta el disco duro, para ello tengo el Conky en mi escritorio que me muestra en todo momento de cuando espacio me queda libre.</p>
<p>Digo esto porque en una ocasi&oacute;n le hice esta configuraci&oacute;n a mi cu&ntilde;ado en un ordenador con 40 GB de disco duro, precisamente para aprovechar mas el espacio, y al de un mes mas o menos me llamo dici&eacute;ndome que el ordenador no arrancaba, y se quedaba un mensaje en la pantalla, no recuerdo exactamente que dec&iacute;a el mensaje, el tema es que se hab&iacute;a puesto a descargar pel&iacute;culas, lleno el disco duro y todav&iacute;a tenia pel&iacute;culas en el programa de descargas pendientes de bajarse del todo, por lo que solo tenia unas pocas KB libres, fui a su casa y le tuve que borrar unos archivos con un LiveCD. Despu&eacute;s le hice la otra configuraci&oacute;n que he mencionado antes, con la “/home” a parte, y no ha vuelto a tener problemas. Respecto a esto os quiero mencionar algo tambi&eacute;n, cuando se borra un archivo y es enviado a la papelera, sigue ocupando el mismo espacio que si no estuviese borrado, por lo que si quer&eacute;is liberar el espacio hay que vaciar la papelera de vez en cuando, yo siempre la tengo vac&iacute;a, me molesta a la vista que tenga alg&uacute;n archivo, yo soy as&iacute; de rarito <img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /> Lo digo porque mi cu&ntilde;ado tambi&eacute;n tenia archivos en ella y el pensaba que como estaban en la papelera no ocupaban espacio.</p>
<p>La otra configuraci&oacute;n, en la que hago tres <strong>particiones</strong>, la suelo hacer en ordenadores que yo no voy a mantener, precisamente por la experiencia que tuve con mi cu&ntilde;ado. En ese caso hago lo siguiente:</p>
<ul>
 <li>Una partici&oacute;n ra&iacute;z o “/” de 20 GB</li>
 <li>Una partici&oacute;n Swap de 2GB</li>
 <li>El resto para la “/home”</li>
</ul>
<p>Con esa configuraci&oacute;n no tendr&eacute;is problemas. Al tener la partici&oacute;n ra&iacute;z 20GB os asegur&aacute;is de que podr&eacute;is instalar pr&aacute;cticamente todo los programas que hay en los repositorios de <strong>Ubuntu</strong>. Cuando formateo mi ordenador, despu&eacute;s de instalar Ubuntu y un mont&oacute;n de programas que me gusta tener instalados, que son muchos, con 7 GB me sobrar&iacute;a, por lo cual 20Gb para la “/” me parece una buena cifra. La Swap la creo por lo que he comentado antes y el resto para la “/home” y archivos personales.</p>
<p>Otra duda que me comentaron con respecto a las <strong>particiones</strong> es donde colocar la Swap, antes recomendaban que fuese la primera del disco duro, &iquest;por que? es muy sencillo, la Swap sirve para equipos que tienen poca RAM y sirve como un complemento para que cuando la RAM este llena, la partici&oacute;n Swap act&uacute;e como si fuese RAM, pero tiene un inconveniente, no tiene la velocidad de la RAM porque es una parte del disco duro y va mucho mas lenta. Precisamente para que sea un poco mas r&aacute;pida, se colocaba como primera partici&oacute;n ya que por el funcionamiento de los discos duros esta mas cerca del eje y as&iacute; su acceso es mas r&aacute;pido, pero como hoy en d&iacute;a los ordenadores tienen mucha RAM, no es necesaria esa partici&oacute;n o bien la podemos colocar donde queramos. Como ya he dicho antes, mi port&aacute;til tiene 8GB de RAM, tengo una Swap de 2GB y nunca he visto en estos 4 meses que <strong>Ubuntu</strong> haga uso de ella, y con el anterior port&aacute;til, que tenia 4GB de RAM nunca vi que se usase la Swap.</p>
<p>La verdad es que al final me ha quedado un articulo largu&iacute;simo, solo pretend&iacute;a hacer una peque&ntilde;a <strong>recomendaci&oacute;n</strong>&nbsp;sobre como <strong>hacer las particiones para instalar Ubuntu</strong> y al final me l&iacute;o a escribir y sigo y sigo y sigo <img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /> Espero que por lo menos sirva para resolver algunas dudas o ayudar a alguien, un saludo.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" st_title="Mi recomendacion para hacer las particiones para instalar Ubuntu | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/ubuntu/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta ubuntu</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1140,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>