<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Arquitectura y hospedaje de Blog Stack | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack"><span itemprop="headline">Arquitectura y hospedaje de Blog Stack</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/software"><img title="software" alt="software" src="/assets/images/labels/software.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2014/05/arquitectura-y-hospedaje-de-blog-stack/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-07-10T23:00" itemprop="dateModified">Actualizado el jueves, 10 de julio de 2014 a las 23:00 UTC</span></div><div><span>
Etiquetado como
blog-stack, planeta-codigo, <a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, <a href="/label/software"><span itemprop="articleSection">software</span></a>, planeta-arch-linux, planeta-linux, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right; text-align: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/blogstack.png" alt="Blog Stack" title="Blog Stack" />
 <br /> 
</div> 
<p>Normalmente en esta bit&aacute;cora suelo poner ejemplos para explicar como funciona una determinada herramienta, son ejemplos que podr&iacute;an aprovecharse para algo productivo pero para mantenerlos simples por si mismos no suelen serlo. En esta entrada voy a comentar cual es la arquitectura y como est&aacute; alojado <a href="http://www.blogstack.info/">Blog Stack</a>, que es un ejemplo de algo pr&aacute;ctico y real por si la experiencia de este ejemplo le sirve de ayuda o de inspiraci&oacute;n a alguien. En la red he encontrado comentada la experiencia de <a href="http://damog.nl/blog/the-new-planeta-linux-engine.html">Planeta Linux</a> y <a href="http://gallir.wordpress.com/2009/12/30/como-montamos-meneame-en-amazon-ec2/">Meneame</a>, otros proyectos web.</p> 
<p>Blog Stack (BS) es una agregador, planeta, o fuente de informaci&oacute;n de bit&aacute;coras sobre programaci&oacute;n, desarrollo, desarrollo &aacute;gil, software, software libre, hardware, gnu/linux o en general temas relacionados con la tecnolog&iacute;a, en definitiva es un servicio que est&aacute; disponible en una direcci&oacute;n de internet, <a href="http://www.blogstack.info">www.blogstack.info</a>.</p> 
<p>Una condici&oacute;n importante que buscaba para BS es que de cualquier opci&oacute;n no deber&iacute;a ser muy cara al menos en los inicios hasta que viese cuales eran los ingresos por la publicidad que era capaz de generar, estimaba que no iban a ser muchos hasta que se agregase unas decenas de bit&aacute;coras y tuviese algunos lectores suscritos a las fuentes se sindicaci&oacute;n. Por coste cualquier opci&oacute;n que fuese en la nube pr&aacute;cticamente quedaba desechada, la opci&oacute;n m&aacute;s barata era la de <a href="https://aws.amazon.com/es/ec2/">Amazon EC2</a>, reservando una instancia t1.micro (0,615 GB) por tres a&ntilde;os el coste era de unos 80 € anuales y de 140 € anuales para una instancia de tipo m1.small (1,7 GB), otras opciones como <a href="https://www.openshift.com/">OpenShift</a> con la capa gratuita de 3 gears si un small gear (512 MB) era suficiente no ten&iacute;a coste pero si necesitase un gear medium (1 GB) el coste era superior, de unos 438 € anuales. Finalmente otra opci&oacute;n que evalu&eacute; era <a href="https://cloud.google.com/products/compute-engine/">Google Compute</a> con un coste de 115 € anuales para una instancia f1-micro (0,60 GB) y de 305 € para una g1-small (1,7 GB). Si en cualquier opci&oacute;n de estas en la nube el coste deb&iacute;a de asumirlo yo probablemente al cabo de un tiempo, pocos a&ntilde;os, acabar&iacute;a cerrando el servicio, por ello el coste era importante. OpenShift y su capa gratuita ten&iacute;a muchas posibilidades.</p> 
<p>Por otro lado estaba bastante contento con la generaci&oacute;n est&aacute;tica de mi bit&aacute;cora con <a href="http://octopress.org/">Octopress</a> y el alojamiento en <a href="https://pages.github.com/">GitHub Pages</a>. Me pereci&oacute; que una opci&oacute;n con un coste m&iacute;nimo podr&iacute;a generar de forma est&aacute;tica el contenido y alojarlo en GitHub Pages al igual que hago con Octopress. Finalmente, me quedaba donde hacer la generaci&oacute;n est&aacute;tica, otra opci&oacute;n era usar la <a href="http://www.raspberrypi.org/">Raspberry Pi</a> pero esto me obligaba a mantenerla encendida siempre, cualquier problema en la Raspberry Pi o conexi&oacute;n en mi red o si la necesitaba apagar en alg&uacute;n momento podr&iacute;a dejar BS sin actualizarse. Si era posible necesitaba una forma de nube, por suerte OpenShift ofrece un plan gratuito de 3 gears con 512 MiB de memoria y 1 GiB de espacio en disco cada uno y en las primeras pruebas que hice era suficiente. Adem&aacute;s, OpenShift ofrec&iacute;a todas las herramientas que necesitaba git para subir el contenido est&aacute;tico al repositorio de GitHub, iconv, cron, bases de datos relacionales y no sql, poder usar <a href="http://undertow.io/">Undertow</a> como servidor y un &laquo;cartridge&raquo; diy (&laquo;Do It Yourself&raquo;). Ten&iacute;a varias piezas, finalmente eleg&iacute; la combinaci&oacute;n de OpenShift para la generaci&oacute;n est&aacute;tica y GitHub Pages para servir el contenido. El contenido podr&iacute;a servirlo desde OpenShift pero no estaba seguro de que el gear fuese capaz de aguantarlo todo si el tr&aacute;fico fuese grande. Por el espacio en disco de 1 GB ten&iacute;a dudas de cuanto podr&iacute;a necesitar pero si fuera mucho podr&iacute;a adquirir 1 GiB adicionar por 1 € al mes.</p> 
<p>Generar el contenido de forma est&aacute;tica tiene limitaciones y obliga a hacer las cosas de diferente forma que empleando una aplicaci&oacute;n web pero el requisto del coste era m&aacute;s importante que la funcionalidad y la forma de ofrecerla. El coste de BS es de unos &iexcl;10 €… al a&ntilde;o! y consiste b&aacute;sicamente en la compra del dominio. El domini&oacute; lo compre en <a href="https://www.dondominio.com/">DonDominio</a> por que por recomendaci&oacute;n era buena opci&oacute;n, en los 10 € est&aacute; incluido el WHOIS privado que en otras opciones tienen un coste adicional. Teniendo el nombre elegido de Blog Stack para el proyecto ten&iacute;a que saber que <a href="http://es.wikipedia.org/wiki/Dominio_de_nivel_superior">dominios de nivel superior (TLD)</a> estaban disponibles, los “okupas” de los dominios ten&iacute;an reservado el .com y el .net, como BS era un sitio de informaci&oacute;n no me import&oacute; mucho comprar el .info.</p> 
<p>Con todo la arquitectura de despliegue y hospedaje de Blog Stack es la siguiente:</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/24/arquitectura-blogstack.png" title="Arquitectura y hospedaje de Blog Stack"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/24/arquitectura-blogstack-thumb.png" /></a> 
</div> 
<p>En cuanto a la aplicaci&oacute;n y el c&oacute;digo Java en si las partes importantes est&aacute;n en un <a href="https://github.com/picodotdev/blog-stack/blob/master/src/main/java/info/blogstack/services/IndexerServiceImpl.java">servicio que se encarga de la indexaci&oacute;n</a> extrayendo el contenido de las fuentes y guardalo en una base de datos, otro <a href="https://github.com/picodotdev/blog-stack/blob/master/src/main/java/info/blogstack/services/GeneratorServiceImpl.java">servicio para la generaci&oacute;n del contenido</a> del sitio de forma est&aacute;tica (html, css, js, imgs, …) y finalmente el <a href="https://github.com/picodotdev/blog-stack/blob/master/src/main/java/info/blogstack/cli/Main.java">programa Java principal</a> que sirve para lanzarlo desde la linea de comandos, el resto son las <a href="https://github.com/picodotdev/blog-stack/tree/master/src/main/java/info/blogstack/entities">clases del modelo de datos</a> y los <a href="https://github.com/picodotdev/blog-stack/tree/master/src/main/java/info/blogstack/services/dao">DAO de persistencia y acceso a dataos</a>. La aplicaci&oacute;n sigue el esquema tradicional de 3 capas, la de presentaci&oacute;n (p&aacute;ginas y componentes de tapestry), la de l&oacute;gica de negocio formada por los servicios de indexaci&oacute;n, generaci&oacute;n y los DAOs (formada por el contenedor de servicios de tapestry y spring) y finalmente la capa de datos formada por una base de datos H2 (donde hibernate interviene). En realidad en BS no hay un servidor de aplicaciones sino que se usa Tapestry en una aplicaci&oacute;n &laquo;standalone&raquo;.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/24/arquitectura-aplicacion-blogstack.png" title="Arquitectura de la aplicaci&oacute;n Blog Stack"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/24/arquitectura-aplicacion-blogstack-thumb.png" /></a> 
</div> 
<p>La ra&iacute;z del proyecto fue que quer&iacute;a usar <a href="http://tapestry.apache.org/">Apache Tapestry</a> de alguna forma en alg&uacute;n proyecto que fuese de utilidad para otras personas, al mismo tiempo que meditaba la idea <a href="http://planetalinux.org/">Planeta Linux</a> dej&oacute; de funcionar durante unas semanas y tampoco estaba contento del todo con los otros planetas en los que ten&iacute;a mi bit&aacute;cora agregada. Con <a href="http://planeta.archlinux-es.org/">Planeta Arch Linux</a> porque despu&eacute;s de unos meses segu&iacute;a sin ni siquiera respuesta a la solicitud de agregaci&oacute;n y <a href="http://www.planetacodigo.com/">Planeta C&oacute;digo</a> ya que cre&iacute;a que podr&iacute;a ofrecer mejor funcionalidad, por ejemplo, los gist no se importaban bien (utilizan javascript y por seguridad deben estar excluidos). Ya que empezaba el proyecto cre&iacute;a que podr&iacute;a proporcionar alguna idea que permitiese descubrir contenido a los usuarios a trav&eacute;s de como hace <a href="http://stackoverflow.com/">stackoverflow</a> con las etiquetas de modo que una persona se pueda suscribir (mediante rss/atom) a una etiqueta para recibir el contenido de solo el tema que le interese de cualquier bit&aacute;cora agregada, descubrir nuevas bit&aacute;coras con contenido interesante a veces no es f&aacute;cil. La opci&oacute;n m&aacute;s parecida y mejor que he encontrado es <a href="http://bitacoras.com/">bitacoras.com</a>, salvo las votaciones, el ranking y que tiene un &aacute;mbito m&aacute;s amplio al poder incluir bit&aacute;coras de m&aacute;s tem&aacute;ticas y que la agregaci&oacute;n de bit&aacute;coras no est&aacute; automatizada, BS en lo importante ofrece lo mismo de forma m&aacute;s simple y est&aacute; m&aacute;s especializado tanto en la tem&aacute;tica de las bit&aacute;coras como en la suscripci&oacute;n por etiquetas.</p> 
<p>Apache Tapestry junto con el m&oacute;dulo Tapestry Offline y el hecho de que el contenedor de dependencias de Tapestry se puede usar en una aplicaci&oacute;n &laquo;standalone&raquo; me permit&iacute;a resolver la parte t&eacute;cnica en la mayor parte, el resto era usar unas cuantas librer&iacute;as para tener la funcionalidad que necesitaba. Una de ellas era <a href="http://jsoup.org/">jsoup</a> con la que pod&iacute;a filtrar el contenido agregado y evitar problemas de seguridad. Permitir en el contenido scripts e iframes puede ser un problema de seguridad pero permitiendo algunas fuentes confiables pod&iacute;a importar el contenido de forma segurar sin perder funcionalidades. En algunas bit&aacute;coras como la m&iacute;a se suelen utilizar como trozos de c&oacute;digo <a href="http://gist.github.com/">gist</a>, v&iacute;deos de youtube o vimeo, presentaciones de <a href="https://speakerdeck.com/">Speaker Deck</a> o usar el <a href="https://afiliados.amazon.es/">programa de afliados de amazon</a>. Iba a necesitar una base de datos ya que las entradas van desapareciendo de las fuentes agregadas a medida que se publica contenido. La base de datos que eleg&iacute; fue <a href="http://www.h2database.com/html/main.html">H2</a> principalmente porque puede estar contenida en un archivo que puedo descargar a mi ordenador, de esta manera podr&iacute;a evitar los volcados de <a href="http://postgresql.org/">PosgreSQL</a>. Si BS resultase que creciese bastante posteriormente podr&iacute;a cambiar H2 por PosgreSQL (la otra opci&oacute;n que consideraba), H2 al principio era m&aacute;s que suficiente. El resto era la colecci&oacute;n de herramientas que se suelen utilizar el proyectos <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> como <a href="http://hibernate.org/">Hibernate</a>, <a href="http://spring.io/">Spring</a>, <a href="http://gradle.org/">Gradle</a>, <a href="http://commons.apache.org/">Apache Commons</a>, <a href="http://rometools.github.io/rome/">Rome</a> (para obtener las fuentes)…</p> 
<p>El despliegue de nuevo c&oacute;digo est&aacute; totalmente automatizado tal y como aconseja el libro <a href="http://www.amazon.es/gp/product/B000SEGEKI/ref=as_li_ss_tl?ie=UTF8&amp;camp=3626&amp;creative=24822&amp;creativeASIN=B000SEGEKI&amp;linkCode=as2&amp;tag=blobit-21">The Pragmatic Programmer</a><img src="http://ir-es.amazon-adsystem.com/e/ir?t=blobit-21&amp;l=as2&amp;o=30&amp;a=B000SEGEKI" width="1" height="1" alt="" style="border:none !important; margin:0px !important;" />, con lo que me es muy simple y me consume muy poco tiempo hacer un nuevo despliegue, el tiempo ahorrado lo puedo emplear para desarrollar. El despliegue consiste en unos cuantos comandos ejecutados por una <a href="https://github.com/picodotdev/blog-stack/blob/master/build.gradle">tarea de gradle</a> que se env&iacute;an a OpenShift. Los comandos de despliegue se encargan de todo mediante ssh, hacer previamente una copia de seguridad de la base de datos (scp/unzip), sincronizar los archivos cambiados del proyecto con rsync, establecer los permisos de ejecuci&oacute;n de los archivos bash y actualizar el esquema de la base de datos con <a href="http://www.liquibase.org/">liquibase</a>.</p> 
<p>No estaba usando Apache Tapestry de la forma habitual que se suele emplear que es para desarrollar aplicaciones web que se despliegan en un servidor de aplicaciones Java. Lo iba a usar como motor de plantillas para generar el contenido est&aacute;tico, aparte de querer usar Tapestry &iquest;por que esta opci&oacute;n si hay soluciones espec&iacute;ficas para esto como <a href="http://www.thymeleaf.org/">Thymeleaf</a>, <a href="http://freemarker.org/">Freemarker</a>, …? Uno de los motivos es que en en la mayor&iacute;a de opciones se sigue un modelo &laquo;push&raquo; en el que se combinan los datos con la vista para producir el resultado. Este modelo &laquo;push&raquo; cada vez me convence menos a pesar de ser ampliamente usado en muchos motores de plantillas y frameworks web, la raz&oacute;n es que las vistas al final acaban conteniendo l&oacute;gica si son algo complejas, eso no es bueno. Tapestry por el contrario usa un modelo &laquo;pull&raquo; en el que la plantilla para generar el contenido puede acceder al controlador por lo que las plantillas no tienen l&oacute;gica, estando extra&iacute;da a una clase java con lo que nos beneficiaremos del compilador y el IDE para esa l&oacute;gica. Adem&aacute;s, los componentes de Tapestry son una manera f&aacute;cil de reutilizar c&oacute;digo, por si fuera poco si pasado un tiempo quisiese desplegar Blog Stack como aplicaci&oacute;n web podr&iacute;a aprovechar pr&aacute;cticamente todo el c&oacute;digo.</p> 
<p>Estando convencido del uso del software libre para ser coherente no ten&iacute;a otra opci&oacute;n que publicar el <a href="https://github.com/picodotdev/blog-stack/">c&oacute;digo fuente</a> bajo alguna licencia de software libre, la opci&oacute;n que eleg&iacute; fue <a href="http://www.gnu.org/licenses/agpl-3.0.html">AGPL</a>. Uno puede tener dudas de “dar” el c&oacute;digo fuente pero cre&iacute;a que ganaba si alguien en un caso remoto hiciese un fork de BS, ya que Tapestry siendo una parte tan importante ser&iacute;a lo usado y por tanto habr&iacute;a hecho que otra persona usase Tapestry. Si bas&aacute;ndose en la misma idea se hac&iacute;a un proyecto similar competir&iacute;amos y que triunfase la mejor opci&oacute;n. Pero lo m&aacute;s probable que ocurra es que se colabore con el desarrollo de BS, con esta opci&oacute;n tambi&eacute;n ganar&iacute;a. De tres opciones posibles en dos ganar&iacute;a, en la tercera se competir&iacute;a y las opciones que eleg&iacute; eran de lo mejor que hay en el mundo Java, BS est&aacute; bien armado.</p> 
<p>Con el desarrollo de Blog Stack he tenido que resolver unos cuantos problemas, en posteriores entradas explicar&eacute; como he implementado las soluciones a algunas funcionalidades que son comunes a los proyectos web, como la correspondencia entre las urls y los art&iacute;culos o etiquetas para no poner identificadores de entidades de la base de datos en las urls y que queden m&aacute;s limpias y amigables, como hacer la transliteraci&oacute;n de los t&iacute;tulos de las entradas para la construcci&oacute;n de las urls, como obtener un extracto de la entrada (puede parecer simple pero no lo es tanto), como usar un servidor embebido que sirva el contenido est&aacute;tico o como procesar recursos est&aacute;ticos como archivos less para generar el css con <a href="https://code.google.com/p/wro4j/">wro4j</a>.</p> 
<p>Referencia:<br /> <a href="http://picodotdev.github.io/blog-bitix/2014/05/presentacion-blog-stack/">Presentaci&oacute;n de Blog Stack</a></p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack" st_title="Arquitectura y hospedaje de Blog Stack | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "Arquitectura y hospedaje de Blog Stack";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2014/05/arquitectura-y-hospedaje-de-blog-stack/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 373,
      "url" : "http://www.blogstack.info/post/blogbitix/2014/05/arquitectura-y-hospedaje-de-blog-stack"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>