<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux"><span itemprop="headline">Linus Torvalds, entrevista al desarrollador de Linux</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/linux"><img title="linux" alt="linux" src="/assets/images/labels/linux.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Victor Hck</span> en la bitácora <a href="https://victorhckinthefreeworld.wordpress.com/">Victorhck in the free world</a>, <a href="https://victorhckinthefreeworld.wordpress.com/2014/05/23/linus-torvalds-entrevista-al-desarrollador-de-linux/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-05-23T15:39" itemprop="dateModified">Actualizado el viernes, 23 de mayo de 2014 a las 15:39 UTC</span></div><div><span>
Etiquetado como
blog-stack, <a href="/label/linux"><span itemprop="articleSection">linux</span></a>, gnu-linux, entrevista, kernel-linux, linus-torvalds</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><strong>Entrevista a Linus Torvalds creador del kernel Linux, el alma del sistema operativo GNU/Linux</strong></p> 
<p><img src="https://victorhckinthefreeworld.files.wordpress.com/2012/06/linus-266x300.jpg?w=652" alt="linus-266x300" /></p> 
<p>El pasado 20 de Mayo de 2014 en la web <strong>Huffington Post,</strong> en el apartado de tecnolog&iacute;a <a href="https://twitter.com/RelentlessBill"><strong>Bill Robinson</strong></a> publicaba una entrevista a<strong> Linus Torvalds</strong> (que supongo no necesita presentaci&oacute;n) el creador del kernel Linux.</p> 
<p>Puedes leer la entrevista original en ingl&eacute;s en este enlace:</p> 
<ul> 
 <li><a href="http://www.huffingtonpost.com/billrobinson/techview-linus-torvalds-i_b_5338844.html"><strong>http://www.huffingtonpost.com/billrobinson/techview-linus-torvalds.html</strong></a></li> 
</ul> 
<p>Me puse en contacto con el autor y le ped&iacute; permiso para traducirla y publicarla en mi blog. Y r&aacute;pidamente me contest&oacute; que me daba permiso para hacerlo, as&iacute; que aqui la ten&eacute;is</p> 
<p>Desde aqui dar las <strong>Gracias</strong> a <a href="https://twitter.com/RelentlessBill"><strong>Bill Robinson</strong></a>, por permitir la traducci&oacute;n y compartir su trabajo!! <strong>Thanks a lot!</strong> ;)</p> 
<p>Antes que nada decir, que <strong>fue un duro trabajo traducir algunas partes y me llev&oacute; bastante tiempo</strong> para buscar la frase id&oacute;nea y la mejor traducci&oacute;n, se aceptan sugerencias para mejorarla, pero creo que es interesante y quer&iacute;a compartirla por aqui con todos.</p> 
<p><strong>Espero que disfrut&eacute;is con ella</strong>. Empezamos…</p> 
<p><img src="https://victorhckinthefreeworld.files.wordpress.com/2013/03/tuxl.png?w=175&amp;h=206" alt="Tux" width="175" height="206" /></p> 
<p><strong>&iquest;Qu&eacute; es lo que te llama la atenci&oacute;n de la tecnolog&iacute;a actual?</strong></p> 
<p>Soy un tipo de persona con “la mirada puesta al frente”, as&iacute; que me gusta m&aacute;s las partes tecnol&oacute;gicas actuales m&aacute;s que las “grandes tendencias”</p> 
<p>Me encanta seguir lo que hacen las compa&ntilde;&iacute;as de hardware, los nuevos “chips”, lo que quiz&aacute;s me motiva m&aacute;s (ya que despu&eacute;s de todo soy un persona de software) es la gente que llega con nuevos algoritmos y software para sacarle partido a todas esas nuevas capacidades.</p> 
<p><strong>&iquest;Qu&eacute; es lo que de verdad te molesta de la tecnolog&iacute;a actual? &iquest;C&oacute;mo y por qu&eacute; te pone furioso?</strong></p> 
<p>No dir&iacute;a que me enfurezca, pero si hay algo que me disguste del mercado tecnol&oacute;gico, es la glorificaci&oacute;n de los “l&iacute;deres” m&aacute;s visibles.</p> 
<p>Eso por supuesto me incluye a m&iacute;. Creo que todo ese “culto de la personalidad” es muy preocupante, y odio c&oacute;mo la gente me toma a m&iacute; y a lo que digo muy en serio. Lo mismo sirve para Jobs, Ellison, Gates, o el nombre que quieras. Me gustar&iacute;a que m&aacute;s gente pensara por ellos mismos y se dieran cuenta que la tecnolog&iacute;a actual surge de todos esos aleatorios grandes ingenieros an&oacute;nimos que est&aacute;n alrededor.</p> 
<p>Entiendo que la gente quiera y necesite una referencia, y eso no s&oacute;lo pasa en la tecnolog&iacute;a (hey, estoy seguro que espero que suceda menos en la tecnolog&iacute;a de lo que sucede en la industria del entretenimiento;), pero a&uacute;n as&iacute; es un poco triste.</p> 
<p><strong><img src="https://victorhckinthefreeworld.files.wordpress.com/2014/03/itux-apple.jpg?w=189&amp;h=118" alt="itux-Apple" width="189" height="118" />&iquest;C&oacute;mo fue eso que te perdiste conseguir de “la posibilidad de concesi&oacute;n de licencias para toda la vida”, pero otros, como Red Hat, SuSE, etc no? &iquest;Fue esto porque si Linux no era de c&oacute;digo abierto no hubiera sido Linux? Quiero saber m&aacute;s sobre esto y si alguna vez has estado arrepentido por ello.</strong></p> 
<p>Definitivamente no me arrepiento por nada. Estoy en una posici&oacute;n envidiable en la que puedo hacer lo que me gusta, y la gente me respeta por ello, e incluso me pagan por hacer cosas que har&iacute;a (e hice) gratis!!</p> 
<p>Creo que pocas personas han conseguido sentirse como si actualmente han marcado la diferencia, y d&eacute;jame decirte, es una gran sensaci&oacute;n. Nunca me interes&oacute; el aspecto comercial, y para m&iacute; la gente y empresas que fueron capaces de coger Linux y usarlo comercialmente son personas que hicieron lo que yo simplemente nunca habr&iacute;a tenido el impulso de hacer. Y era necesario y &uacute;til, as&iacute; que estoy realmente muy agradecido a esas entidades comerciales: ellos han permitido que me concentre en las partes que me gustan.</p> 
<p><strong>&iquest;A qui&eacute;n respetas en el mundo de la tecnolog&iacute;a y por qu&eacute;?</strong></p> 
<p>Je. Mira respuesta en la que despotricaba contra todo ese “culto a la personalidad”. Es que no estoy muy impresionado por todo eso de “vamos a buscar a una persona ponerla en un pedestal”.<br /> As&iacute; que en lugar de nombres individuales, me gustar&iacute;a m&aacute;s para apuntar a cosas como la EFF – las organizaciones (y, a veces s&oacute;lo las nociones e ideas) que tratan de no s&oacute;lo de mejorar su propia suerte en la vida, sino tratar de hacer algo concreto para ayudar a hacer que la tecnolog&iacute;a trabaje mejor en un t&eacute;rmino m&aacute;s amplio.</p> 
<p>A nivel individual, me suelen gustar las personas que no se toman demasiado en serio, y juegan bien en lo que hacen. Si tuviera que elegir alg&uacute;n individuo conocido, creo que el tipo de persona de Steve Wozniak es el tipo que yo preferir&iacute;a ser, y supongo que hace que lo respete.</p> 
<p><strong><img src="https://victorhckinthefreeworld.files.wordpress.com/2011/05/ceros_unos1.png?w=164&amp;h=142" alt="ceros_unos1.png" width="164" height="142" />&iquest;Qu&eacute; sucede en tu opini&oacute;n entre Google y Microsoft, cuando todo ha sido dicho y hecho? &iquest;Por qu&eacute; gana el ganador?</strong></p> 
<p>No creo que el ganador sea tan interesante como lo es todo el proceso de que esto ocurra.<br /> En todo ese Google vs MS, no creo que las propias empresas sean tan interesantes como los cambios en la tecnolog&iacute;a que hizo cambiar el punto de vista. Cambi&oacute; de una empresa que controla lo que pasaba en las m&aacute;quinas individuales, a una compa&ntilde;&iacute;a que es mucho m&aacute;s que el conjunto de las miles de m&aacute;quinas individuales.</p> 
<p><strong>&iquest;Por qu&eacute; crees que se produjo el Naufragio de Tech, la Debacle Dot-Com o el Deshielo Telecom? &iquest;C&oacute;mo podemos prevenirnos de algo as&iacute; de nuevo en el futuro?</strong></p> 
<p>En realidad, voy a ser contrario a esa opini&oacute;n, y sostengo que no hay ninguna raz&oacute;n para “prevenir que se repita”. Soy un convencido de que se deben sobrepasar los l&iacute;mites, y no soy partidario de ser totalmente estable y 100% “cuerdo”</p> 
<p>Gran cantidad de desarrollo se produce a rachas, y como parte de lo que m&aacute;s tarde ser&aacute; llamado “hype” y otras cosas menos halagadoras. Pero las cosa es, tratar por todos los medios de ser cuerdo y aburrido y no hacer cosas est&uacute;pidas es actualmente contraproducente.</p> 
<p>Personalmente creo que el modelo de desarrollo estable no es uno de mejoras incrementales continuas, si no una sucesi&oacute;n de riesgos y fracasos.<br /> La mejora incremental gradual puede a menudo parecer una mejor estrategia, pero si no v&aacute;s m&aacute;s all&aacute; y te estrellas de vez en cuando &iquest;C&oacute;mo puedes saber que est&aacute;s tratando de pasar los l&iacute;mites?</p> 
<p><strong>&iquest;C&oacute;mo cambiar&aacute; la tecnolog&iacute;a nuestras vidas en el futuro? Trabajar&iacute;as con otros l&iacute;deres de otros sectores para crear nueva tecnolog&iacute;a, Bioinform&aacute;tica, por ejemplo?</strong></p> 
<p>Mi teor&iacute;a personal es que la tecnolog&iacute;a no cambia nuestras vidas tanto ya que tendemos a construir nuestra tecnolog&iacute;a para adaptarse a nuestras vidas.<br /> Es por lo que no ves coches voladores, etc estampas cl&aacute;sicas de la ciencia ficci&oacute;n, pero en vez de eso ves tecnolog&iacute;a que es usada para reducir costos de transacciones de cosas que exist&iacute;an antes pero que simplemente no eran pr&aacute;cticas hacerlas a gran escala o de forma individual a medida (excepto, a veces, para los que eran muy ricos).</p> 
<p>As&iacute; que la tecnolog&iacute;a rara vez cambia directamente nuestras vidas por s&iacute; misma – a pesar de que a menudo significa que mucha m&aacute;s gente tiene acceso a cosas que antes eran raras, o s&oacute;lo se limitaba a los inmensamente ricos.<br /> Los verdaderos cambios se producen cuando algo llega a ser tan barato y ubicuo que hacen que te comportes diferente. Y en muchos sentidos, los cambios de comportamiento son m&aacute;s interesantes que la propia tecnolog&iacute;a.</p> 
<p><img src="https://victorhckinthefreeworld.files.wordpress.com/2011/04/openmind.jpg?w=151&amp;h=151" alt="openmind.jpg" width="151" height="151" />Por ejemplo, la &uacute;nica cosa que internet realmente ha hecho es reducir los “costes de transacci&oacute;n” de encontrar y comunicarte con otras personas que comparten tus propios intereses, y creo que muchos de los cambios reales vienen de c&oacute;mo la gente cambia sus h&aacute;bitos cuando es sencillo encontrar otra gente que est&aacute; interesada en las mismas cosas sin tener que haber empleado mucho esfuerzo.</p> 
<p>As&iacute; que te encuentras a estos grupos con intereses especiales, y un mont&oacute;n de gente pasando mucho tiempo discutiendo sobre los asuntos m&aacute;s esot&eacute;ricos que les ha pasado o que encuentran interesantes, cosas que tu simplemente no podr&iacute;as practicar antes, porque era muy dif&iacute;cil encontrar y comunicarse con gente que estuviera interesada en algunos de esos temas poco usuales.<br /> Y creo que as&iacute; es como ha cambiado nuestra vida de verdad, no realmente por&nbsp; una gran y asombrante novedad tecnol&oacute;gica , si no por un aspecto de la tecnolog&iacute;a inesperado que reduce los costes incrementales.</p> 
<p><strong>&iquest;Qui&eacute;n a tu juicio la persona m&aacute;s importante hoy en el mundo de la tecnolog&iacute;a?</strong></p> 
<p>Creo que es un poco como decir que la tecnolog&iacute;a ya no est&aacute; impulsada en gran medida por por necesidades militares o incluso comerciales, sino por el mercado de consumo. Tambi&eacute;n creo que un mont&oacute;n de las cosas totalmente idiotas que las empresas parecen estar haciendo (DRM, en particular) parece estar pasando por alto que la persona m&aacute;s importante para cualquier tecnolog&iacute;a siempre termina siendo el “usuario”.</p> 
<p>As&iacute; que creo que la respuesta a tu pregunta en lo que a m&iacute; concierne es el “usuario” tambi&eacute;n conocido como el consumidor, y que es la parte m&aacute;s importante precisamente porque es de all&iacute; de donde provendr&aacute;n las necesidades y los &eacute;xitos comerciales reales.</p> 
<p><strong><img src="https://victorhckinthefreeworld.files.wordpress.com/2011/11/world_conect31.png?w=118&amp;h=126" alt="world_conect3" width="118" height="126" />&iquest;Cuales son algunos de tus puntos de vista? &iquest;Religi&oacute;n, pol&iacute;tica?</strong></p> 
<p>Soy completamente ateo. Me parece que la gente parece pensar que la religi&oacute;n trae la moral y aprecio por la naturaleza. De hecho creo que los priva de ambos. Da a la gente una excusa para decir, ‘Oh, la naturaleza se acaba de crear,’ por lo que el acto de la creaci&oacute;n es visto como algo milagroso. Aprecio el hecho de que, ‘Wow, es incre&iacute;ble que algo como esto haya podido suceder en primer lugar.’</p> 
<p>S&iacute; es un poco ir&oacute;nico que en muchos pa&iacute;ses europeos, hay actualmente una especie de acuerdo legal entre el estado y la religi&oacute;n del estado.<br /> Me convert&iacute; en un ciudadano de los Estados Unidos y estoy registrado para votar en los Estados Unidos. Yo no apoyo a ning&uacute;n partido pol&iacute;tico, porque, con toda franqueza, tengo demasiado orgullo personal para querer asociarse con cualquiera de ellos.</p> 
<p><strong><a href="https://en.wiktionary.org/wiki/kiitos">Kiitos</a> Linus!</strong></p> 
<p>&nbsp;</p> 
<p>&nbsp;</p>
<br /> 
<a href="http://feeds.wordpress.com/1.0/gocomments/victorhckinthefreeworld.wordpress.com/3643/"><img alt="" src="http://feeds.wordpress.com/1.0/comments/victorhckinthefreeworld.wordpress.com/3643/" /></a> 
<img alt="" src="https://stats.wordpress.com/b.gif?host=victorhckinthefreeworld.wordpress.com&amp;blog=22503493&amp;post=3643&amp;subd=victorhckinthefreeworld&amp;ref=&amp;feed=1" width="1" height="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux" st_title="Linus Torvalds, entrevista al desarrollador de Linux | Victorhck in the free world"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/linux/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta linux</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 467,
      "url" : "http://www.blogstack.info/post/victorhckinthefreeworld/2014/05/linus-torvalds-entrevista-al-desarrollador-de-linux"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "victorhckinthefreeworld",
      "name" : "Victorhck in the free world"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>