<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Introducción a los Patrones de Diseño | Codecriticon</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno"><span itemprop="headline">Introducción a los Patrones de Diseño</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Antonio</span> en la bitácora <a href="http://codecriticon.es">Codecriticon</a>, <a href="http://codecriticon.com/introduccion-patrones-diseno/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-11-11T12:59" itemprop="datePublished">Publicado el martes, 11 de noviembre de 2014 a las 12:59 UTC</span></div><div><span>
Etiquetado como
patron, patron-de-diseno, <a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, patrones-de-diseno</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><h2>Historia de los Patrones de Dise&ntilde;o</h2> 
<p>El t&eacute;rmino patr&oacute;n fue utilizado por primera vez por el arquitecto <a href="http://es.wikipedia.org/wiki/Christopher_Alexander" title="Christopher Alexander">Christopher Alexander</a> en el libro <em>“<a href="http://www.amazon.es/Pattern-Language-Buildings-Construction-Environmental/dp/0195019199" title="A Pattern Language: Towns, Buildings, Construction">A Pattern Language: Towns, Buildings, Construction</a>“</em>, donde defini&oacute; una serie de patrones arquitect&oacute;nicos. Alexander define: </p> 
<blockquote> 
 <p><em>“Un patr&oacute;n describe un problema que ocurre a menudo, acompa&ntilde;ado por un intento de soluci&oacute;n para el problema.”</em></p> 
</blockquote> 
<p><em>Christopher Alexander, 1977</em></p> 
<p>En 1987, <a href="http://en.wikipedia.org/wiki/Ward_Cunningham" title="Ward Cunningham">Ward Cunningham</a> y <a href="http://en.wikipedia.org/wiki/Kent_Beck" title="Kent Beck">Kent Beck</a> estaban trabajando con Smaltalk, dise&ntilde;ando interfaces de usuario. Para ello, decidieron utilizar alguna de las ideas de Alexander y desarrollaron un peque&ntilde;o lenguaje de patrones que servir&iacute;a de gu&iacute;a a los programadores de Smaltalk. A partir de estas idea escribieron el libro <em>“<a href="http://c2.com/doc/oopsla87.html" title="Using Pattern Languajes for Object-Oriented Programs">Using Pattern Languajes for Object-Oriented Programs</a>”</em>.</p> 
<p>Desde 1990 a 1994, <a href="http://en.wikipedia.org/wiki/Erich_Gamma" title="Erich Gamma">Erich Gamma</a>, <a href="http://c2.com/cgi/wiki?RichardHelm" title="Richard Helm">Richard Helm</a>, <a href="http://en.wikipedia.org/wiki/Ralph_Johnson_(computer_scientist)" title="Ralph Johnson">Ralph Johnson</a> y <a href="http://en.wikipedia.org/wiki/John_Vlissides" title="John_Vlissides">John Vlissides</a> (<em><a href="http://c2.com/cgi/wiki?GangOfFour" title="Gang of four">Gang of four</a></em>) realizaron un primer cat&aacute;logo de patrones de dise&ntilde;o. En 1994 publicar&oacute;n el libro <em>“<a href="http://www.amazon.es/Design-Patterns-Elements-Reusable-Object-Oriented/dp/0201633612" title="Design Patterns - Elements of Reusable Object-Oriented Software">Design Patterns – Elements of Reusable Object-Oriented Software</a>“</em> que introduc&iacute;a el termino de patr&oacute;n de dise&ntilde;o en el desarrollo del software.</p> 
<h2>&iquest;Qu&eacute; son los patrones de Dise&ntilde;o?</h2> 
<p>Un patr&oacute;n de dise&ntilde;o es una soluci&oacute;n repetible a problemas t&iacute;picos y recurrentes en el dise&ntilde;o del software. Son soluciones basadas en la experiencia y que se ha demostrado que funcionan. No son un dise&ntilde;o terminado que puede traducirse directamente a c&oacute;digo, sino m&aacute;s bien una descripci&oacute;n sobre c&oacute;mo resolver el problema, la cual puede ser utilizada en diversas situaciones. Eric Gamma define los patrones de dise&ntilde;o como:</p> 
<blockquote>
 <p><em>“Un patr&oacute;n de dise&ntilde;o es una descripci&oacute;n de clases y objetos comunic&aacute;ndose entre s&iacute; para resolver un problema de dise&ntilde;o general en un contexto particular.”</em></p> 
</blockquote> 
<p>En general, un patr&oacute;n de dise&ntilde;o consta de cuatro elementos esenciales:</p> 
<ol> 
 <li>El <strong>nombre del patr&oacute;n</strong> se utiliza para describir un problema de dise&ntilde;o, su soluci&oacute;n y consecuencias en una o dos palabras. Nombrar un patr&oacute;n incrementa inmediatamente nuestro vocabulario de dise&ntilde;o. Esto nos permite dise&ntilde;os a un alto nivel de abstracci&oacute;n. Tener un vocabulario de patrones nos permite hablar sobre ellos con nuestros compa&ntilde;eros, en nuestra documentaci&oacute;n, e incluso a nosotros mismos.</li> 
 <li>El problema describe <strong>cuando aplicar el patr&oacute;n</strong>. Se explica el problema y su contexto. Esto podr&iacute;a describir problemas de dise&ntilde;o espec&iacute;ficos tales como algoritmos como objetos. Podr&iacute;a describir estructuras de clases o objetos que son sintom&aacute;ticas de un dise&ntilde;o inflexible. Algunas veces el problema incluir&aacute; una lista de condiciones que deben cumplirse para poder aplicar el patr&oacute;n.</li> 
 <li>La <strong>soluci&oacute;n </strong>describe los elementos que forma el dise&ntilde;o, sus relaciones, responsabilidades y colaboraciones. La soluci&oacute;n no describe un dise&ntilde;o particular o implementaci&oacute;n, porque un patr&oacute;n es como una plantilla que puede ser aplicada en diferentes situaciones. En cambio, los patrones proveen una descripci&oacute;n abstracta de un problema de dise&ntilde;o y como una disposici&oacute;n general de los elementos (clases y objetos en nuestro caso) lo soluciona.</li> 
 <li>Las <strong>consecuencias </strong>son los resultados de aplicar el patr&oacute;n. Estas son muy importantes para la evaluaci&oacute;n de dise&ntilde;os alternativos y para comprender los costes y beneficios de la aplicaci&oacute;n del patr&oacute;n</li> 
</ol> 
<h2>Definici&oacute;n de los Patrones de Dise&ntilde;o</h2> 
<p>La documentaci&oacute;n de un patr&oacute;n de dise&ntilde;o describe el contexto en el que se utiliza el patr&oacute;n, las fuerzas dentro del contexto en el que el patr&oacute;n busca resolver, y la soluci&oacute;n sugerida. No existe un formato &uacute;nico para la documentaci&oacute;n de los patrones de dise&ntilde;o. El formato m&aacute;s frecuentemente utilizado es el utilizado por GoF en su libro de Patrones de Dise&ntilde;o. Contiene las siguientes secciones:</p> 
<ul> 
 <li><strong>Nombre del patr&oacute;n</strong>: identifica al patr&oacute;n. </li> 
 <li><strong>Clasificaci&oacute;n del patr&oacute;n</strong>: creacional, estructural o de comportamiento.</li> 
 <li><strong>Intenci&oacute;n</strong>: &iquest;Qu&eacute; problema pretende resolver el patr&oacute;n?</li> 
 <li><strong>Tambi&eacute;n conocido como</strong>: Otro nombres por los que es conocido el patr&oacute;n.</li> 
 <li><strong>Motivaci&oacute;n</strong>: Escenario de ejemplo para la aplicaci&oacute;n del patr&oacute;n.</li> 
 <li><strong>Aplicabilidad</strong>: Usos comunes y criterios de aplicabilidad del patr&oacute;n.</li> 
 <li><strong>Estructura</strong>: Diagramas de clases oportunos para describir las clases que intervienen en el patr&oacute;n.</li> 
 <li><strong>Participantes</strong>: Enumeraci&oacute;n y descripci&oacute;n de las entidades abstractas (y sus roles) que participan en el patr&oacute;n.</li> 
 <li><strong>Colaboraciones</strong>: Explicaci&oacute;n de las interrelaciones que se dan entre los participantes.</li> 
 <li><strong>Consecuencias</strong>: Consecuencias positivas y negativas en el dise&ntilde;o derivado de la aplicaci&oacute;n del patr&oacute;n.</li> 
 <li><strong>Implementaci&oacute;n</strong>: T&eacute;cnicas o comentarios oportunos de cara a la implementaci&oacute;n del patr&oacute;n.</li> 
 <li><strong>C&oacute;digo de ejemplo</strong>: C&oacute;digo fuente de ejemplo de la implementaci&oacute;n del patr&oacute;n.</li> 
 <li><strong>Usos conocidos</strong>: Ejemplos de sistemas reales que usan el patr&oacute;n.</li> 
 <li><strong>Patrones relacionados</strong>: Referencias cruzadas con otros patrones.</li> 
</ul> 
<h2>Listado Resumen de Patrones de Dise&ntilde;o</h2> 
<p>Existe una gran cantidad de patrones de dise&ntilde;o y tampoco pretendo explicarlos todos aqu&iacute;. He escogido un peque&ntilde;o listado de los principales patrones de dise&ntilde;o, entre ellos se encuentran los 23 patrones descritos en el libro de <em>“Design Patterns – Elements of Reusable Object-Oriented Software”</em>, adem&aacute;s he a&ntilde;adido un listado con patrones de concurrencia y tambi&eacute;n algunos patrones que me han parecido interesantes.</p> 
<h4>Patrones Creacionales</h4> 
<p>Los patrones creacionales ayudan a resolver los problemas relacionados con la creaci&oacute;n de instancias de un clase, y as&iacute; separar la implementaci&oacute;n del cliente de la de los objetos que se utilizan. Nos ayudan a abstraer y encapsular su creaci&oacute;n.</p> 
<ul> 
 <li><strong>Singleton</strong>: Asegura que una determinada clase sea instanciada una y s&oacute;lo una vez, proporcionando un &uacute;nico punto de acceso global a ella.</li> 
 <li><strong>Abstract Factory</strong>: Provee una interfaz para crear familias de objetos relacionados o que dependen entre si, sin especificar sus clases concretas.</li> 
 <li><strong>Builder</strong>: Separa la construcci&oacute;n de un objeto complejo de su representaci&oacute;n, de forma que el mismo proceso de construcci&oacute;n pueda crear diferentes representaciones. Simplifica la construcci&oacute;n de objetos con estructura interna compleja y permite la construcci&oacute;n de objetos paso a paso. </li> 
 <li><strong>Factory Method</strong>: Define una interfaz para crear un objeto, pero deja que sean las subclases quienes decidan qu&eacute; clase instanciar. Permite que una clase delegue en sus subclases la creaci&oacute;n de objetos.</li> 
 <li><strong>Object Pool</strong>: Administra la reutilizaci&oacute;n de objetos cuando un tipo de objetos es caro de crear o solamente un n&uacute;mero limitado de objetos puede ser creado.</li> 
 <li><strong>Prototype</strong>: Facilita la creaci&oacute;n din&aacute;mica de objetos mediante la definici&oacute;n de clases cuyos objetos pueden crear duplicados de si mismos. Estos objetos son llamados prototipos.</li> 
 <li><strong>Lazy initialization</strong>: Proporciona un camino para retrasar la creaci&oacute;n de un objeto o cualquier otro proceso que sea costoso hasta que se necesita por primera vez.</li> 
 <li><strong>Multiton</strong>: Expande en el concepto Singleton para gestionar un mapa de instancias de clases nombradas como pares clave-valor, y proporciona un punto de acceso a ellos.</li> 
</ul> 
<h4>Patrones Estructurales</h4> 
<p>Utilizados para crear clases u objetos que incluidos dentro de estructuras m&aacute;s complejas.</p> 
<ul> 
 <li><strong>Adapter</strong>: Convierte la interfaz de una clase en otra distinta que es la que esperan los clientes. Permiten que cooperen clases que de otra manera no podr&iacute;an por tener interfaces incompatibles.</li> 
 <li><strong>Bridge</strong>: Desvincula una abstracci&oacute;n de su implementaci&oacute;n, de manera que ambas puedan variar de forma independiente.</li> 
 <li><strong>Composite</strong>: Combina objetos en estructuras de &aacute;rbol para representar jerarqu&iacute;as de parte-todo. Permite que los clientes traten de manera uniforme a los objetos individuales y a los compuestos.</li> 
 <li><strong>Decorator</strong>: A&ntilde;ade din&aacute;micamente nuevas responsabilidades a un objeto, proporcionando una alternativa flexible a la herencia para extender la funcionalidad.</li> 
 <li><strong>Facade</strong>: Proporciona una interfaz unificada para un conjunto de interfaces de un subsistema. Define una interfaz de alto nivel que hace que el subsistema se m&aacute;s f&aacute;cil de usar.</li> 
 <li><strong>Flyweight</strong>: Usa el compartimiento para permitir un gran n&uacute;mero de objetos de grano fino de forma eficiente.</li> 
 <li><strong>Front controller</strong>: Proporciona un punto de entrada centralizado para tramitar las solicitudes. Este patr&oacute;n se refiere al dise&ntilde;o de las aplicaciones Web.</li> 
 <li><strong>Module</strong>: Implementa el concepto de m&oacute;dulos de software, que se define por la programaci&oacute;n modular, en un lenguaje de programaci&oacute;n que no es compatible o en parte s&oacute;lo admite m&oacute;dulos.</li> 
 <li><strong>Proxy</strong>: Proporciona un sustituto o representante de otro objeto para controlar el acceso a &eacute;ste.</li> 
 <li><strong>Twin</strong>: Permite modelar la herencia m&uacute;ltiple en los lenguajes de programaci&oacute;n que no soportan esta funci&oacute;n.</li> 
</ul> 
<h4>Patrones de Comportamiento</h4> 
<p>Se utilizan a la hora de definir como las clases y objetos interaccionan entre ellos.</p> 
<ul> 
 <li><strong>Blackboard</strong>: Se trata de una generalizaci&oacute;n del patr&oacute;n Observer que es compatible con m&uacute;ltiples lectores y escritores. El patr&oacute;n de la pizarra se comunica la informaci&oacute;n de todo el sistema.</li> 
 <li><strong>Chain of Responsibility</strong>: Evita acoplar el emisor de una petici&oacute;n a su receptor, al dar a m&aacute;s de un objeto la posibilidad de responder a la petici&oacute;n. Crea una cadena con los objetos receptores y pasa la petici&oacute;n a trav&eacute;s de la cadena hasta que esta sea tratada por alg&uacute;n objeto.</li> 
 <li><strong>Command</strong>: Encapsula una petici&oacute;n en un objeto, permitiendo as&iacute; parametrizar a los clientes con distintas peticiones, encolar o llevar un registro de las peticiones y poder deshacer la operaciones.</li> 
 <li><strong>Interpreter</strong>: Dado un lenguaje, define una representaci&oacute;n de su gram&aacute;tica junto con un int&eacute;rprete que usa dicha representaci&oacute;n para interpretar las sentencias del lenguaje.</li> 
 <li><strong>Iterator</strong>: Proporciona un modo de acceder secuencialmente a los elementos de un objeto agregado sin exponer su representaci&oacute;n interna.</li> 
 <li><strong>Mediator</strong>: Define un objeto que encapsula c&oacute;mo interact&uacute;an un conjunto de objetos. Promueve un bajo acoplamiento al evitar que los objetos se refieran unos a otros expl&iacute;citamente, y permite variar la interacci&oacute;n entre ellos de forma independiente. </li> 
 <li><strong>Memento</strong>: Representa y externaliza el estado interno de un objeto sin violar la encapsulaci&oacute;n, de forma que &eacute;ste puede volver a dicho estado m&aacute;s tarde.</li> 
 <li><strong>Null Object</strong>: En lugar de utilizar null, el patr&oacute;n Null Object utiliza una referencia a un objeto que no hace nada.</li> 
 <li><strong>Observer</strong>: Define una dependencia de uno-a-muchos entre objetos, de forma que cuando un objeto cambia de estado se notifica y actualizan autom&aacute;ticamente todos los objetos.</li> 
 <li><strong>Servant</strong>: Define la funcionalidad para un grupo de clases sin definir esa funcionalidad en cada una de esas clases. Un siervo es una clase cuya instancia (o la propia clase) proporciona m&eacute;todos que realizan un servicio deseado, mientras que los objetos para los cuales (o con qui&eacute;n) el siervo hace algo se pasan a los m&eacute;todos criado como par&aacute;metros.</li> 
 <li><strong>Specification</strong>: Recombina las reglas de negocio por el encadenamiento de las reglas de negocio en conjunto usando la l&oacute;gica de Boole.</li> 
 <li><strong>State</strong>: Permite que un objeto modifique su comportamiento cada vez que cambia su estado interno. Parecer&aacute; que cambia la clase del objeto.</li> 
 <li><strong>Strategy</strong>: Define una familia de algoritmos, encapsula uno de ellos y los hace intercambiables. Permite que un algoritmo var&iacute;e independientemente de los clientes que lo usan.</li> 
 <li><strong>Template Method</strong>: Define en una operaci&oacute;n el esqueleto de un algoritmo, delegando en las subclases algunos de sus pasos. Permite que las subclases redefinan ciertos pasos del algoritmo sin cambiar su estructura.</li> 
 <li><strong>Visitor</strong>: Representa una operaci&oacute;n sobre los elementos de una estructura de objetos. Permite definir una nueva operaci&oacute;n sin cambiar las clases de los elementos sobre los que opera.</li> 
</ul> 
<h4>Patrones de Concurrencia</h4> 
<p>Por &uacute;ltimo, un modelo de concurrencia aborda algunos aspectos de la programaci&oacute;n multihilo. Un patr&oacute;n bien conocido en esta categor&iacute;a es productor-consumidor, en el que un hilo productor almacena un elemento en un tamp&oacute;n compartida y un hilo consumidor recupera este art&iacute;culo. El hilo productor no debe almacenar otro elemento en este tamp&oacute;n hasta que el punto anterior se ha consumido, y el hilo consumidor no debe consumir un elemento inexistente.</p> 
<ul> 
 <li><strong>Active object</strong>: Desacopla la ejecuci&oacute;n de un m&eacute;todo desde la invocaci&oacute;n del m&eacute;todos por los objetos en el que cada objeto reside en su propio thread. El objetivo es introducir la concurrencia, mediante el uso de invocaci&oacute;n del m&eacute;todo as&iacute;ncrono y un programador para tramitar las solicitudes.</li> 
 <li><strong>Balking</strong>: S&oacute;lo ejecuta una acci&oacute;n en un objeto cuando el objeto est&aacute; en un estado en particular. Por ejemplo, un objeto lee un archivo y proporciona m&eacute;todos para acceder al contenido del archivo. Cuando el archivo no est&aacute; abierto y se intenta llamar a un m&eacute;todo para acceder al contenido, el objeto “rechaza” la petici&oacute;n.</li> 
 <li><strong>Binding properties</strong>: Combina varios observadores para forzar propiedades en diferentes objetos a ser sincronizados o coordinados de alguna manera.</li> 
 <li><strong>Double-checked locking</strong>: Reduce la sobrecarga de adquirir un bloqueo probando primero el criterio de bloqueo (la “sugerencia de bloqueo”) sin llegar a la adquisici&oacute;n del bloqueo. El bloqueo s&oacute;lo se adquiere cuando el chequeo del criterio de bloqueo indica que se requiere de un bloqueo.</li> 
 <li><strong>Event-based asynchronous</strong>: Un patr&oacute;n de concurrencia para la invocaci&oacute;n as&iacute;ncrona de m&eacute;todos potenciales larga ejecuci&oacute;n de un objeto.</li> 
 <li><strong>Guarded suspension</strong>: Gestiona las operaciones que requieren tanto un bloqueo para ser adquirida y una condici&oacute;n previa para ser satisfecho antes de la operaci&oacute;n puede ser ejecutada.</li> 
 <li><strong>Lock</strong>: Un mecanismo para hacer temporalmente alg&uacute;n aspecto de un objeto o inmodificable para suprimir las notificaciones de actualizaci&oacute;n que no sean necesarios.</li> 
 <li><strong>Messaging design pattern (MDP)</strong>: Permite el intercambio de informaci&oacute;n (es decir, los mensajes) entre los componentes y aplicaciones.</li> 
 <li><strong>Monitor object</strong>: Un objeto cuyos m&eacute;todos est&aacute;n sujetos a la exclusi&oacute;n mutua, evitando as&iacute; varios objetos de forma err&oacute;nea tratando de utilizar al mismo tiempo.</li> 
 <li><strong>Reactor</strong>: Un modelo de gesti&oacute;n de eventos para el manejo de solicitudes de servicio entregados simult&aacute;neamente a un manejador de servicio por una o m&aacute;s entradas. El controlador de servicio, entonces desmultiplexa las solicitudes entrantes y los env&iacute;a de forma sincr&oacute;nica a los gestores dependientes asociados.</li> 
 <li><strong>Read-write lock</strong>: Un bloqueo que permite el acceso de lectura simult&aacute;neo a un objeto, sino que requiere acceso exclusivo para las operaciones de escritura.</li> 
 <li><strong>Scheduler</strong>: Un patr&oacute;n de concurrencia utilizado para controlar de forma expl&iacute;cita cuando las discusiones pueden ejecutar c&oacute;digo de un &uacute;nico subproceso; por ejemplo, varios subprocesos con ganas de escribir datos en el mismo archivo.</li> 
 <li><strong> Thread pool</strong>: Un patr&oacute;n de concurrencia en el que se crean un n&uacute;mero de hilos para realizar diversas tareas, que se organizan por lo general en una cola. </li> 
 <li><strong>Thread-specific storage</strong>: Un patr&oacute;n de concurrencia en el que la memoria est&aacute;tica o global se localiza en un hilo. Cada hilo tiene su propia copia de la presente memoria.</li> 
</ul> 
<h2>Seleccionar un patr&oacute;n de dise&ntilde;o</h2> 
<p>De entre los diferentes patrones de dise&ntilde;o que existen puede ser complicado la elecci&oacute;n de uno para el dise&ntilde;o de una aplicaci&oacute;n. Entre las pautas que hay que seguir a la hora de seleccionar un patr&oacute;n se pueden indicar las siguientes:</p> 
<ol> 
 <li><strong>Observar</strong> como el patr&oacute;n de dise&ntilde;o resuelve los problemas de dise&ntilde;o.</li> 
 <li><strong>Revisar</strong> las secciones de “<em>Objetivo</em>”.</li> 
 <li><strong>Estudiar la interrelaci&oacute;n</strong> entre los diferentes patrones. Estudiar estas relaciones puede guiar directamente al patr&oacute;n correcto o grupo de patrones.</li> 
 <li><strong>Estudiar los patrones con un prop&oacute;sito similar</strong>. Hay patrones que son muy parecidos estudiar sus similitudes y sus diferencias te ayudar&aacute; en la elecci&oacute;n del patr&oacute;n que mejor se adapte a tu problema.</li> 
 <li>Examinar las <strong>razones de cambio</strong>. Mirar las causas de redise&ntilde;o. Luego mirar los patrones que te ayudan a evitar las causas de redise&ntilde;o.</li> 
 <li><strong>Considerar lo que se deber&iacute;a cambiar</strong> en el dise&ntilde;o concreto. Este apartado es el opuesto al anterior, es decir al enfocado sobre las razones de cambio. En lugar de considerar que podr&iacute;a forzar un cambio en un dise&ntilde;o, considera lo que quieres que Gu&iacute;a de construcci&oacute;n de software en Java con patrones de dise&ntilde;o sea capaz de cambiar sin redise&ntilde;arlo. El objetivo aqu&iacute; es encapsular el concepto que var&iacute;a, un fin de muchos patrones de dise&ntilde;o. Son aspectos del dise&ntilde;o que los patrones de dise&ntilde;o permiten que var&iacute;en independientemente, por lo tanto puedes hacer cambios sin redise&ntilde;ar.</li> 
</ol> 
<h2>Como usar un patr&oacute;n de dise&ntilde;o</h2> 
<p>Una vez seleccionado el patr&oacute;n de dise&ntilde;o que se va a aplicar hay que tener en cuenta las siguientes claves para utilizar el patr&oacute;n:</p> 
<ul> 
 <li>Leer el patr&oacute;n de dise&ntilde;o por encima. Prestar una atenci&oacute;n particular a las secciones “<em>Aplicabilidad</em>” y “<em>Consecuencias</em>” para asegurarse de que el patr&oacute;n es correcto para tu problema.</li> 
 <li>Observar la estructura, los elementos que participan en el patr&oacute;n y las colaboraciones entre ellos. Asegurarse de que comprendes las clases y objetos del patr&oacute;n y como se relacionan.</li> 
 <li>Mirar la secci&oacute;n “<em>C&oacute;digo del ejemplo</em>” para ver un ejemplo concreto del patr&oacute;n en c&oacute;digo. Estudiar el c&oacute;digo te ense&ntilde;ar&aacute; como implementar el patr&oacute;n.</li> 
 <li>Escoger nombres significativos de los elementos que participan en el patr&oacute;n para el contexto de la aplicaci&oacute;n. Los nombres de los elementos de un patr&oacute;n son normalmente demasiado abstractos para aparecer directamente en una aplicaci&oacute;n. No obstante, es muy &uacute;til incorporar los nombres de los participantes en el nombre que aparece en la aplicaci&oacute;n. Esto te ayudar&aacute; a tener el patr&oacute;n m&aacute;s expl&iacute;cito en la implementaci&oacute;n.</li> 
 <li>Definir las clases. Declarar sus interfaces, establecer sus relaciones de herencia, y definir las variables instanciadas que representan datos y referencias de objetos.</li> 
 <li>Identificar las clases existentes en tu aplicaci&oacute;n que el patr&oacute;n afectar&aacute; y modificar&aacute; adecuadamente.</li> 
 <li>Definir nombres espec&iacute;ficos para las operaciones en dicha aplicaci&oacute;n. Otra vez, los nombres dependen generalmente de la aplicaci&oacute;n. Utilizar las responsabilidades y colaboraciones asociadas con cada operaci&oacute;n como gu&iacute;a.</li> 
 <li>Implementar las operaciones que conllevan responsabilidad y colaboraci&oacute;n en el patr&oacute;n. La secci&oacute;n “<em>Implementaci&oacute;n</em>” te ofrece una gu&iacute;a en la implementaci&oacute;n. Los ejemplos de la secci&oacute;n “<em>C&oacute;digo del ejemplo</em>” tambi&eacute;n te ayudan.</li> 
</ul> 
<h2>Conclusi&oacute;n</h2> 
<p>Los patrones de dise&ntilde;o describen la soluci&oacute;n a problemas que se repiten una y otra vez en nuestros sistemas, de forma que se puede usar esa soluci&oacute;n siempre que haga falta. Capturan el conocimiento que tienen los expertos a la hora de dise&ntilde;ar. Ayudan a generar software “maleable” (software que soporta y facilita el cambio, la reutilizaci&oacute;n y la mejora). Son gu&iacute;as de dise&ntilde;o, no reglas rigurosas.</p> 
<p>En este art&iacute;culo he realizado un peque&ntilde;o resumen de los principales patrones de dise&ntilde;o y de alg&uacute;n otro que me ha parecido interesante. En los siguiente art&iacute;culos explicar&eacute; m&aacute;s en profundidad cada uno de estos patrones. Si ech&aacute;is en falta alguno o hay alguno que no entend&aacute;is bien, no dud&eacute;is en dejar vuestro comentario.</p> 
<p>The post <a href="http://codecriticon.com/introduccion-patrones-diseno/">Introducci&oacute;n a los Patrones de Dise&ntilde;o</a> appeared first on <a href="http://codecriticon.com">Codecriticon</a>.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno" st_title="Introducción a los Patrones de Diseño | Codecriticon"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1107,
      "url" : "http://www.blogstack.info/post/codecriticon/2014/11/introduccion-a-los-patrones-de-diseno"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "codecriticon",
      "name" : "Codecriticon"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3975359868571413",
        "adSlot" : "1725339562"
      }
    }
  ]
]); });</script></body></html>