<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Como sería si Microsoft, Apple y Linux... | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux"><span itemprop="headline">Como sería si Microsoft, Apple y Linux...</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/microsoft"><img title="microsoft" alt="microsoft" src="/assets/images/labels/microsoft.png"/></a><a class="label" href="/label/apple"><img title="apple" alt="apple" src="/assets/images/labels/apple.png"/></a><a class="label" href="/label/software-privativo"><img title="software-privativo" alt="software-privativo" src="/assets/images/labels/software-privativo.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2011/12/como-seria-si-microsoft-apple-y-linux.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2012-10-03T01:23" itemprop="dateModified">Actualizado el miércoles, 03 de octubre de 2012 a las 01:23 UTC</span></div><div><span>
Etiquetado como
planeta-codigo, planeta-arch-linux, <a href="/label/software-privativo"><span itemprop="articleSection">software-privativo</span></a>, planeta-linux, <a href="/label/microsoft"><span itemprop="articleSection">microsoft</span></a>, <a href="/label/apple"><span itemprop="articleSection">apple</span></a>, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, gnulinux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">&iquest;Como ser&iacute;a si Microsoft, Apple y Linux se decicasen a la industria automovil&iacute;stica y vendiesen motores y coches conociendo sus pol&iacute;ticas y formas de comercializar su software y productos?
<br />
<br />set small_troll_mode=on
<br />
<br />Empecemos por 
<b>Microsoft</b>
<br />
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Microsoft" height="75" src="http://1.bp.blogspot.com/-XdqPJUzoXGQ/TuJcYIW8UkI/AAAAAAAABB8/nw_ryoLf4NY/s320/microsoft.png" title="Microsoft" width="320" />
</div>Algunos modelos de sus motores son conocidos y recordados por provocar fallos en el coche que son instalados [1], algunos no m&aacute;s molestos como que las ruedas se desinchan de vez en cuando o el aire acondicionado no funciona a veces si a la vez tienes puesta la radio y algunos graves como que el motor se apaga de repente o deja de frenar cuando lo necesitas que provocan peque&ntilde;os accidentes y peque&ntilde;as perdidas de memoria en el conductor a los que se les queda la cara de un tono azulado despu&eacute;s de los hechos por el susto.
<br />
<br />Aproxim&aacute;damente cada segundo martes del mes [2] tienes que llevar el coche al taller para hacer una revisi&oacute;n de algunas partes del coche por fallos de seguridad detectados en diversas partes del mismo, no sabes muy bien que van a revisar pero oye si lo dice Microsoft por algo ser&aacute;. Otros problemas de seguridad conocidos y explotados por los ladrones para acceder al interior no son resueltos pasados meses e incluso a&ntilde;os siempre a criterio de Microsoft, ellos saben lo que es importante y bueno para sus usuarios.
<br />
<br />Los coches vienen con un mont&oacute;n de extras in&uacute;tiles [3] que no quieres como una aler&oacute;n hortera, una luces de neon en los bajos o un sistema de alarma que deja de funcionar a los 30 d&iacute;as si no pagas la licencia. Todo ello hace que el coche nuevo y recien salido de f&aacute;brica circule a una velocidad m&aacute;xima de 80 km/h cuando deber&iacute;a alcanzar los 120 km/h y a veces sin ning&uacute;n motivo aparente se reduzca a 50 km/h pasados unos meses.
<br />
<br />No puedes abrir el cap&oacute; del coche para para ver como es el motor, y por tanto no puedes cambiarle de aceite, la bater&iacute;a o algunas piezas para conseguir una mayor potencia, fiabilidad, seguridad o menor consumo de combustible.
<br />
<br />Las administraciones p&uacute;blicas que tienen enormes flotas de autom&oacute;viles comprados a Microsoft [4] se gastan cada a&ntilde;o millones de euros en renovar licencias para usarlos, ya que el coche en realidad no lo compran solo les da un licencia de uso. Pueden comprar coches con motor Linux que algunos no tienen costes de licencias pero los funcionarios est&aacute;n acostumbrados a los coches con motor Windows, es el que usan como particulares.
<br />
<br />Por lo visto debe de haber una forma de duplicar un motor r&aacute;pidamente, las personas lo utilizan para instalarle a sus coches la &uacute;ltima versi&oacute;n del motor Windows que siempre dicen trae nuevas prestaciones. Saben que esto no es legal por la licencia de uso del motor y les llaman piratas, pero a la vez Microsoft lo consiente, sabe que cuando vayan a sus trabajos sus empresas tendr&aacute;n que pagar ya que no estar&aacute;n acostumbrados a ning&uacute;n otro tipo de motor. Sino puede obligarles a comprar la licencia como particulares al menos los convierte en adictos a sus motores, piensan que es mejor que usen uno de ellos pirateado que uno de la competencia [5], y as&iacute; est&aacute;n los funcionarios de muchas las administraciones p&uacute;blicas.
<br />
<br />En alguna ocasi&oacute;n el navegador GPS de Microsoft ven&iacute;a ya instalado en el coche junto con el motor. Sin embargo, la Uni&oacute;n Europera a partir de una denuncia del fabricante de navegadores Opera [6] dictamin&oacute; que esto era un abuso de posici&oacute;n dominante ya que imped&iacute;a al resto de fabricantes de GPS colocar sus navegadores y dificultaba la libre competencia. Microsoft argumentaba que el navegador GPS era parte inseparable de su motor y que sin &eacute;l en no funcionaba. Finalmente, Microsoft se vi&oacute; obligada a darle al usuario la posibilidad de seleccionar su navegador GPS en una Ballot Screen [7], ya estaba escarmentada de anteriores multas por valor de 500 millones de euros por anteriores litigios [8].
<br />
<br />Pasados 5 a&ntilde;os, con suerte, tienes que comprar otro coche porque el que que tienes ya no puede cargar con los trastos que llevas en &eacute;l, no sabes por qu&eacute; ya que los utilizas para hacer lo mismo que hace 5 a&ntilde;os solo son un poco m&aacute;s modernos, te han comentado que puede ser debido a la obsolescencia programada. Tal vez solo quieres la carrocer&iacute;a que ya tienes el motor de tu anterior coche que es antiguo pero que todav&iacute;a puede funcionar en el nuevo o tal vez te plantes instalar un motor basado en Linux ya que conoces alguna distribuci&oacute;n que te lo d&aacute; sin ning&uacute;n coste, ya estas cansado de los defectos de los motores Windows, el comercial sorprendido te dir&aacute; que eso no es posible que a ellos los fabricantes de coches no les venden solo carrocerias, ya les dan el motor de Windows preinstalado y as&iacute; es como lo venden, a esto algunas personas lo conocen como el impuesto Windows.
<br />
<br />El turno de 
<b>Apple</b>
<br />
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Apple" height="200" src="http://4.bp.blogspot.com/-3MJB1pCLYQs/TuJcVZvonJI/AAAAAAAABB0/_idkN6Gi-g0/s200/apple.png" title="Apple" width="167" />
</div>Al contrario que Microsoft, Apple no solo fabrica motores sino tambi&eacute;n la carrocer&iacute;a y tampoco podras adquirirlos por separado. La producci&oacute;n se ha deslocalizado a China ya que all&iacute; hay mano de obra m&aacute;s barata, abundante y los trabajadores de esas plantas tiene menos derechos laborales que los trabajadores occidentales. Sin embargo, cuando sale alg&uacute;n caso de que alg&uacute;n empleado de esas f&aacute;bricas llega a suicidarse [1] por las condiciones en que se encuentra, en Apple, dicen que van a cancelar relaciones contractuales si los contratistas no ponen remedio en un intento de que el asunto no afecte a su marca [1].
<br />
<br />Apple no fabrica coches de bajo coste, seg&uacute;n ellos no saben hacerlo sin que sean una basura [2], (&iexcl;tragaros eso fabricantes de utilitarios PC!),&nbsp;asunto arreglado ya tienen una raz&oacute;n para vender sus coches &nbsp;esos precios,&nbsp;a pesar de utilizar las mismas piezas, son sensiblemente mas caros que los coches PC. A quien no le importa pagar el precio de un coche Mac no le importa sacar de nuevo y a menudo la tarjeta de cr&eacute;dito para pagar el precio que tienen sus accesorios y para pagar los a&ntilde;adidos de la nueva App Store, motivo por el cual esta tiene m&aacute;s &eacute;xito que el mismo concepto en otras marcas.
<br />
<br />Cada cierto tiempo sacan nuevas actualizaciones para sus motores con un precio de tan solo X con 99, tipica regla comercial para fijar precios y hacer pensar a los clientes que estan pagando menos en un intento por confundirles y demostrando que no les importa contar mentiras piadosas, parece que funciona.
<br />
<br />Tampoco puedes abrir el capo para ver como es el motor ni modificarlo ni puedes saber si te han puesto un sistema de segimiento y rastreo CarrierIQ con el que puedan conocer en que sitios has estado o analizar y recopilar informaci&oacute;n tuya sin tu consentimiento ni saber con que fines [3]. Cuando los alarmados conductores Mac se informan de la existencia de dichos dispositivos instalados en sus veh&iacute;culos les comentan que en el pr&oacute;ximo modelo dejar&aacute;n de utilizarlos, prometen hacer borr&oacute;n, cuenta nueva y asunto arreglado, aqu&iacute; no ha pasado nada &iexcl;estos no son los androides que and&aacute;is buscando!. Algunas personas tachadas de&nbsp;poco menos que locos&nbsp;ya advert&iacute;an de que estas funciones mal&eacute;volas en motores privativos pod&iacute;an estar presentes [4].
<br />
<br />Dicen que sus productos son respetuosos con el medio ambiente, solo utilizan piezas que lo sean, son el&eacute;ctricos e h&iacute;bridos nada de utilizar la obsoleta y contaminante tecnolog&iacute;a de combusti&oacute;n. Sus motores son lo &uacute;ltimo y son productos deseados, su maquinaria de marketing se encarga de hacer que asi sea. Tienen una carrocer&iacute;a cuidada pero solo en dos colores, negro y blanco, este &uacute;ltimo les cost&oacute; sacarlo al mercado varios meses m&aacute;s tarde que el primero parece ser que por un problema en los focos [5].
<br />
<br />Apple es distinta, en los lanzamientos de sus productos algunos clientes pueden pasarse una noche esperando en la puerta del concesionario a que abran al d&iacute;a siguiente para gastarse su dinero y comprar lo &uacute;ltimo de la marca [6]. Para que no decaiga el &aacute;nimo los empleados del concesionario los reciben con aplausos y vitores cuando entran.
<br />
<br />Ahora 
<b>Linux</b>
<br />
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Linux" height="200" src="http://4.bp.blogspot.com/-gf0CBdHQ0EI/TQJrCzG9OZI/AAAAAAAAAiY/NcJAFNmleAw/s200/tux.png" title="Linux" width="169" />
</div>Los motores Linux son libres y podr&aacute;s utilizarlos con cualquier prop&oacute;psito. Su licencia te da el derecho a obtener sus planos, y si tienes los conocimientos puedes estudiarlos, modificarlos y redistribuir tu mejoras con tus vecinos para ayudarles, estas son las 4 libertades b&aacute;sicas [1]. Algunas personas han logrado proporcionar la mayor potencia, fiabilidad, seguridad o menor consumo de combustible que no se puede hacer con motores Windows o Max OS X. Con los accesorios en su mayor&iacute;a tambien libres pasa otro tanto de lo mismo.
<br />
<br />Han demostrado su fiabilidad y ser muy vers&aacute;tiles y se pueden instalar adem&aacute;s de coches, en otro tipo de veh&iacute;culos como motos, camiones, barcos y aviones e incluso en micromotos como Kutxashares. Pueden utilizar no solo v&aacute;lvulas x86 sino tambi&eacute;n de las marcas ARM, MIPS, OpenRisc, PowerPC y otras menos conocidas [2].
<br />
<br />No existen concesionarios Linux y no lo encontrar&aacute;s en el resto de concesionarios PC, se piden por internet y en la mayoria de los casos su coste es nulo, a pesar de ello la mayor&iacute;a de personas PAsan DE FOllones y se quedan con lo que les d&aacute;n preinstalado aceptando sus defectos. Su negocio no se basa&nbsp;principalmente&nbsp;en vender licencias sino servicios, como 
<a href="http://www.redhat.com/">RedHat</a>, 
<a href="http://www.ibm.com/us/en/">IBM</a>&nbsp;y 
<a href="http://www.canonical.com/">Canonical</a>. Dado que cualquier persona puede proponer mejoras construyen comunidades, el avance conseguido por esas comunidades luego es aplicado a sus productos comerciales y el avance en los productos comerciales acaba llegando tambi&eacute;n a las comunidades de modo que todo el mundo se vea beneficiado. Alrededor de los motores Linux y sus accesorios se crean talleres mec&aacute;nicos y puestos de trabajo localizados [3] con el objetivo de prestar esos servicios en su &aacute;mbito local.
<br />
<br />El reciente concepto de App Store y Market para Apple y Microsoft es algo que ya tenian los distribuidores Linux desde hace ya mucho tiempo.
<br />
<br />Estos motores tampoco est&aacute;n exentos de fallos y a veces a sus coches tambi&eacute;n se les desinchan las ruedas pero por lo general una vez conocidos son resueltos m&aacute;s r&aacute;pidamente que en los coches Microsoft y Apple. Algunos fabricantes de accesorios mec&aacute;nicos no dan soporte para estos motores y a veces no funcionan correctamente aunque los m&aacute;s comunes ya no suelen presentar problemas, no es como en los a&ntilde;os 90 pero la leyenda urbana sigue extendida.
<br />
<br />Algunas versiones de los distribuidores requieren que los usuarios monten las piezas ellos mismos como en 
<a href="http://www.archlinux.org/">Arch Linux</a> y 
<a href="http://www.gentoo.org/">Gentoo</a>, otros distribuidores lo ponen tan f&aacute;cil o m&aacute;s que no tienen nada que envidiar a los coches Microsoft, es el caso de 
<a href="http://www.ubuntu.com/">Ubuntu</a>, 
<a href="http://linuxmint.com/">Linux Mint</a> y 
<a href="http://fedoraproject.org/es/">Fedora</a>. Tener esta amplia variedad de modelos de motores Linux hace que a alguna gente le cueste decidirse por uno, tratan de buscar &laquo;el mejor&raquo;, pero se equivocan, en Linux no hay &laquo;el mejor&raquo; quiz&aacute; s&iacute; el mas adecuado para cada tipo de conductor. Para los que tienen el primer motor Linux posiblemente las opciones m&aacute;s adecuadas ser&iacute;an&nbsp;
<a href="http://www.ubuntu.com/">Ubuntu</a>,&nbsp;
<a href="http://linuxmint.com/">Linux Mint</a>,&nbsp;
<a href="http://fedoraproject.org/es/">Fedora</a>&nbsp;o 
<a href="http://es.opensuse.org/">openSUSE</a>.&nbsp;Para los usuarios que ya llevan un tiempo us&aacute;ndolos quiz&aacute; les parezca m&aacute;s adecuada para sus necesidades 
<a href="http://www.archlinux.org/">Arch Linux</a>&nbsp;aunque hay muchos otros modelos [4].
<br />
<br />Pasado el tiempo si tratas bien el coche y no lo metes por cualquier carrtera no notar&aacute;s una degradaci&oacute;n de prestaciones y funcionar&aacute; a los mismos 120 km/h del primer d&iacute;a.
<br />
<br />set small_troll_mode=off
<br />
<br />Por suerte ni Microsoft, ni Apple, ni Linux se dedican a la fabricaci&oacute;n de motores ni coches pero piensa si lo hicieran si aceptar&iacute;as que instalasen en tu coche un dispositivo de seguimiento sin que te informasen de ello o si no te parecer&iacute;a rid&iacute;culo que hubiese gente esperando una noche en la puerta de un concesionario para comprar un nuevo modelo de Renault o si tu coche recien comprado te viene con un mot&oacute;n de accesorios que no quieres o si... tal vez tampoco los coches y los ordenadores no sean lo mismo pero... &iquest;si algunas de estas cosas no las aceptar&iacute;as en tu coche u otros &aacute;mbitos por que las aceptas en tu ordenador? T&uacute; decides.
<br />
<br />Art&iacute;culos relacionados:
<br />
<a href="http://elblogdepicodev.blogspot.com/2011/05/impuesto-windows.html">El impuesto Windows</a>
<br />
<a href="http://elblogdepicodev.blogspot.com/2010/03/de-windows-arch-linux.html">De Windows a Arch Linux</a>
<br />
<a href="http://elblogdepicodev.blogspot.com/2010/05/guia-instalacion-arch-linux-parte-i.html">Gu&iacute;a instalaci&oacute;n Arch Linux (Parte I, instalaci&oacute;n base)</a>
<br />
<br />Referencia:
<br />
<a href="http://www.microsoft.com/en-us/default.aspx">Microsoft</a>
<br />[1] Buscar: Windows Millenium y Windows Vista
<br />[2] Buscar: windows martes de parches
<br />[3] Buscar: windows programas preinstaldos
<br />[4] Buscar: windows administracion p&uacute;blica
<br />[5] Buscar: Las versiones pirateadas de Windows frenan el avance de Linux
<br />[6] Buscar: windows explorer denuncia opera
<br />[7] Buscar: windows ballot screen
<br />[8] Buscar: microsoft multa union europea
<br />
<br />
<a href="http://www.apple.com/">Apple</a>
<br />[1] Buscar: apple foxconn suicidios
<br />[2] Buscar: apple ordenadores basura 500
<br />[3] Buscar: apple carrieriq
<br />[4] Buscar: richard stallman
<br />[5] Buscar: apple iphone blanco retrasado
<br />[6] Buscar: apple colas tiendas
<br />
<br />
<a href="https://www.linux.com/">Linux</a>
<br />[1] Buscar: libertades software libre
<br />[2] Buscar: linux arquitecturas soportadas
<br />
<div style="clear: both; text-align: center;"></div>[3] Buscar: empresas software libre euskadi
<br />[4] Buscar: linux distribuciones</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" st_title="Como sería si Microsoft, Apple y Linux... | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Como sería si Microsoft, Apple y Linux...";
var disqus_url = "http://elblogdepicodev.blogspot.com/2011/12/como-seria-si-microsoft-apple-y-linux.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/software-privativo/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-privativo</a></li><li><a href="/label/microsoft/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta microsoft</a></li><li><a href="/label/apple/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta apple</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 124,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>