<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Normas de diseño y codificación de .NET framework | Variable not found</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework"><span itemprop="headline">Normas de diseño y codificación de .NET framework</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/desarrollo"><img title="desarrollo" alt="desarrollo" src="/assets/images/labels/desarrollo.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">José M. Aguilar</span> en la bitácora <a href="http://www.variablenotfound.com">Variable not found</a>, <a href="http://feedproxy.google.com/~r/vnf/~3/D9xqL1PbLx8/normas-de-diseno-y-codificacion-de-net.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-01-20T08:25" itemprop="dateModified">Actualizado el martes, 20 de enero de 2015 a las 08:25 UTC</span></div><div><span>
Etiquetado como
<a href="/label/desarrollo"><span itemprop="articleSection">desarrollo</span></a>, buenas-practicas</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><img align="right" alt="Framework design guidelines" src="http://lh6.ggpht.com/-NlEjyNEjqj8/VLwE0KYNpyI/AAAAAAAADwk/1iS9c-CQwLM/image4.png?imgmax=800" height="191" style="background-image: none; border-bottom-width: 0px; border-left-width: 0px; border-right-width: 0px; border-top-width: 0px; display: inline; float: right; margin: 0px 0px 10px 10px; padding-left: 0px; padding-right: 0px; padding-top: 0px;" title="Framework design guidelines" width="141" />Hace relativamente poco tiempo, y como parte del popular salto al 
<em>open source</em> del nuevo stack de Microsoft, se publicaron en Github las directrices 
<a href="https://github.com/dotnet/corefx/wiki/Framework%20Design%20Guidelines%20Digest">o normas de codificaci&oacute;n</a> que deben seguirse para contribuir en el desarrollo de .NET Core. Se trata de un resumen simplificado del contenido del libro “
<a href="http://www.amazon.com/dp/0321545613">Framework design guidelines</a>” publicado por Krzysztof Cwalina y Brad Abrams en 2008. 
<br />
<br />Aunque creo que este mismo documento o versiones anteriores lo he le&iacute;do en otras ocasiones, la verdad es que sigue result&aacute;ndome muy interesante porque me recuerda normas y convenciones que conviene tener en cuenta al desarrollar marcos de trabajo y componentes. No hay que olvidar que estas directrices han sido refinadas y mejoradas con los a&ntilde;os, acumulando ya la experiencia de muchos a&ntilde;os y muchos desarrolladores que han trabajado en .NET framework, as&iacute; que se trata de una base de conocimiento nada despreciable. De hecho, estas pautas son las bases del dise&ntilde;o de frameworks dentro de la propia Microsoft.
<br />
<br />Y como a menudo me encuentro con equipos que no tienen gu&iacute;as de estilo ni convenciones de codificaci&oacute;n formalizadas, he pensado que quiz&aacute;s ser&iacute;a interesante traducirlas para que puedan ser usadas como punto de partida para crear sus propias normas y, en cualquier caso, siempre dan buenas ideas que podemos aplicar en el d&iacute;a a d&iacute;a para hacer mejor nuestros componentes.
<br />
<br />Es una lectura cortita, &iexcl;que aproveche!
<br />
<a></a>
<br />
<h3>1. Principios generales de dise&ntilde;o</h3>
<h4>1.1. Dise&ntilde;o guiado por escenarios</h4>Comienza el proceso de dise&ntilde;o de tu API p&uacute;blico definiendo los escenarios m&aacute;s importantes de cada &aacute;rea funcional. Escribe el c&oacute;digo que te gustar&iacute;a que escribieran los usuarios finales cuando vayan a implementar esos escenarios usando tu API. Despu&eacute;s, dise&ntilde;a tu API bas&aacute;ndote en el c&oacute;digo de ejemplo que escribiste.
<br />
<br />Por ejemplo, si dise&ntilde;as un API que permita tiempos, podr&iacute;as escribir el siguiente c&oacute;digo de ejemplo para los escenarios:
<br />
<pre>// Escenario #1 : medir el tiempo transcurrido<br />Stopwatch watch = Stopwatch.StartNew();<br />DoSomething();<br />Console.WriteLine(watch.Elapsed);<br /><br />// Escenario #2 : reutilizar el cron&oacute;metro<br />Dim watch As Stopwatch = Stopwatch.StartNew()<br />DoSomething();<br />Console.WriteLine(watch.Elapsed)<br />watch.Reset();<br />watch.Start();<br />DoSomething()<br />Console.WriteLine(watch.Elapsed)<br /><br />// Escenario #3: ...</pre>
<h4>1.2. Estudios de usabilidad</h4>Realiza pruebas de usabilidad de tu API. Haz que desarrolladores que no est&eacute;n familiarizados con tu API implementen los principales escenarios, e intenta identificar qu&eacute; partes no son intuitivas.
<br />
<h4>1.3. API auto-documentada</h4>Los desarrolladores que utilicen tu API deber&iacute;an ser capaces de implementar los principales escenarios sin leer la documentaci&oacute;n. Ayuda a los usuarios a descubrir qu&eacute; tipos y m&eacute;todos necesitan utilizar d&aacute;ndoles nombres intuitivos para los tipos y miembros m&aacute;s frecuentes. Hablad sobre la elecci&oacute;n de los nombres durante las revisiones.
<br />
<h4>1.4. Entiende a tu cliente</h4>Ten en cuenta que la mayor&iacute;a de tus clientes no son como t&uacute;. Deber&iacute;as dise&ntilde;ar el API para tus clientes, no para los desarrolladores m&aacute;s cercanos, que, a diferencia de tus clientes, son expertos en la tecnolog&iacute;a que est&aacute;s intentando exponer.
<br />
<h3>2. Reglas de nombrado</h3>El uso de may&uacute;sculas y min&uacute;sculas s&oacute;lo deben ser tenidas en cuenta en identificadores 
<code>public</code> y 
<code>protected</code>, as&iacute; como en implementaciones privadas de miembros de interfaz. Sin embargo, los equipos de trabajo pueden elegir libremente sus propio estilo para los identificadores 
<code>internal</code> y 
<code>private</code>.
<br />
<ul>
 <li>Utiliza “PascalCasing” (primera letra de cada palabra en may&uacute;sculas) para todos los identificadores excepto para los nombre de par&aacute;metro. Por ejemplo, usa <code><code><code>TextColor</code></code></code> en vez de <code><code><code>Textcolor</code></code></code> o <code><code><code>Text color</code></code></code>. </li>
 <br />
 <li>Utiliza “camelCasing” (primera letra de cada palabra excepto la primera en may&uacute;sculas) para todos los nombres de par&aacute;metro. Precede los nombres de par&aacute;metros gen&eacute;ricos con la letra “T”: <br /> <pre>public interface ISessionChannel&lt;TSession&gt;<br />    where TSession : ISession<br />{<br />    TSession Session { get; }<br />}</pre></li>
 <li>Considera utilizar simplemente T como nombre de par&aacute;metro gen&eacute;rico de una &uacute;nica letra.</li>
 <br />
 <li>Utiliza “PascalCasing” o “camelCasing” para acr&oacute;nimos con m&aacute;s de dos caracteres. Por ejemplo, utiliza <code>HtmlButton</code> en lugar de <code>HTMLButton</code>, pero <code>System.IO</code> en lugar de <code>System.Io</code>. </li>
 <br />
 <li>No uses acr&oacute;nimos que no est&eacute;n aceptados generalmente en el campo o contexto de la aplicaci&oacute;n.</li>
 <br />
 <li>Utiliza acr&oacute;nimos bien conocidos s&oacute;lo cuando sean absolutamente necesarios. Por ejemplo, puedes utilizar <code>UI</code> para <em>user interface</em> (interfaz de usuario) o <code>Html</code> para Hyper-Text Markup Language (lenguaje de marcas hipertexto). </li>
 <li>No uses contracciones como partes de nombres de identificador. Por ejemplo, usa <code>GetWindow</code> en lugar de <code>GetWin</code>. </li>
 <br />
 <li>No uses guiones, ni guiones bajos ni cualquier otro tipo de caracteres alfanum&eacute;ricos.&nbsp;</li>
 <br />
 <li>No uses la <a href="http://es.wikipedia.org/wiki/Notaci%C3%B3n_h%C3%BAngara">Notaci&oacute;n H&uacute;ngara</a>. <br />&nbsp;</li>
 <li>Nombra tipos y propiedades usando sustantivos o frases nominales.&nbsp;</li>
 <br />
 <li>Nombra m&eacute;todos y eventos con verbos o frases verbales. Para los eventos, elije siempre nombres que indiquen si se ha lanzado antes o despu&eacute;s de que la acci&oacute;n se produzca utilizando el gerundio y el pasado perfecto, respectivamente. Por ejemplo, si un evento es lanzado antes de cerrar un formulario, deber&iacute;a llamarse <code>Closing</code>; si es lanzado despu&eacute;s de que sea cerrado, deber&iacute;a llamarse <code>Closed</code>. </li>
 <br />
 <li>No utilices prefijos “Before” o “After” en el nombre de los eventos para indicar si la acci&oacute;n se realiz&oacute; o no (c&iacute;&ntilde;ete al punto anterior).&nbsp;</li>
 <br />
 <li>Utiliza <code>I</code> como prefijo para todos los nombres de interfaz. </li>
 <br />
 <li>Utiliza las siguientes terminaciones: <br /> 
  <ul>
   <br />
   <li><code>Exception</code> para tipos que hereden de <code>System.Exception</code>.</li>
   <li><code>Collection</code> para tipos que implementen <code>IEnumerable</code>.</li>
   <li><code>Dictionary</code> para tipos que implementen <code>IDictionary</code> o <code>IDictionary&lt;K,V&gt;</code>.</li>
   <li><code>EventArgs</code> para tipos que hereden de <code>System.EventArgs</code>.</li>
   <li><code>EventHandler</code> para tipos que hereden de <code>System.Delegate</code>.</li>
   <li><code>Attribute</code> para tipos que hereden de <code>System.Attribute</code>. </li>
  </ul></li>
 <br />
 <li>No utilices las terminaciones anteriores para ning&uacute;n otro tipo.&nbsp;</li>
 <br />
 <li>No uses como terminaci&oacute;n de nombres las palabras <code>Flags</code> o <code>Enum</code>. </li>
 <br />
 <li>Utiliza nombres o frases nominales en plural para las <a href="http://www.variablenotfound.com/2007/10/enumeraciones-de-campos-de-bits-en-net.html">enumeraciones de flags</a> (las que soportan operaciones de bit) y en singular para las enumeraciones normales. </li>
 <br />
 <li>Utiliza el siguiente esquema para los espacios de nombres: <br /> <pre><code>&lt;Company&gt;.&lt;Technology&gt;[.&lt;Feature&gt;].</code></pre>Un ejemplo ser&iacute;a <code>Microsoft.Office.ClipGallery</code>. Sin embargo, los componentes de sistema operativo deber&iacute;an usar espacios de nombres comenzando por <code>System</code>. </li>
 <br />
 <li>No utilices jerarqu&iacute;as de la organizaci&oacute;n para organizar los espacios de nombre. &Eacute;stos deben corresponder con escenarios, independientemente de los equipos que hayan creado las APIs.</li>
</ul>
<h3>3. Pautas generales de dise&ntilde;o</h3>
<ul>
 <li>Usa el tipo m&aacute;s espec&iacute;fico para los valores de retorno, y el menos espec&iacute;fico para los par&aacute;metros de entrada. Por ejemplo, acepta <code>IEnumerable</code> como par&aacute;metro de entrada, pero retorna <code>Collection&lt;string&gt;</code>.&nbsp;</li>
 <br />
 <li>Provee de un claro punto de entrada a tu API para cada escenario. Cada &aacute;rea funcional deber&iacute;a tener preferiblemente uno, aunque aunque a veces sean m&aacute;s, tipos que act&uacute;an como puntos de entrada para explorar la tecnolog&iacute;a. Lo llamamos “componentes agregados”. La implementaci&oacute;n de la gran mayor&iacute;a de escenarios en una tecnolog&iacute;a determinada deber&iacute;an comenzar desde uno de esos componentes agregados.</li>
 <br />
 <li>Escribe c&oacute;digo de ejemplo para los escenarios de uso m&aacute;s frecuentes. El primer tipo usado en esos ejemplos deber&iacute;a ser un componente agregado y el c&oacute;digo deber&iacute;a ser trivial. Si el c&oacute;digo va m&aacute;s all&aacute; de unas cuantas l&iacute;neas, necesitas redise&ntilde;arlo. Por ejemplo, escribir a un log de eventos en el API Win32 tomaba alrededor de 100 l&iacute;neas de c&oacute;digo; en .NET, escribir al EventLog necesita una &uacute;nica l&iacute;nea de c&oacute;digo.</li>
 <br />
 <li>Modela en componentes agregados los conceptos de mayor nivel (objetos f&iacute;sicos) en lugar de tareas a nivel de sistema. For example <code>File</code>, <code>Directory o</code>&nbsp;<code>Drive</code> son m&aacute;s sencillos de comprender y utilizar que <code>Stream</code>, <code>Formatter o</code>&nbsp;<code>Comparer</code>. </li>
 <br />
 <li>No obligues a que los usuarios de tus APIs instancien m&uacute;ltiples objetos en los principales escenarios. Las tareas simples deber&iacute;an hacerse con un &uacute;nico <code>new</code>. </li>
 <br />
 <li>Permite que tus APIs sean usadas mediante el estilo “crear-asignar-llamar” en todos los componentes agregados. Deber&iacute;a ser posible instanciar todos los componentes con el constructor por defecto, establecer una o m&aacute;s propiedades y llamar a m&eacute;todos o responder a eventos: <br /><pre>var applicationLog = new EventLog();<br />applicationLog.Source = &quot;MySource&quot;;<br />applicationLog.WriteEntry(exception.Message);</pre></li>
 <li>No requieras demasiadas inicializaciones antes de que los componentes agregados puedan ser utilizados. Si alguna inicializaci&oacute;n es necesaria, la excepci&oacute;n lanzada cuando el componente no haya sido correctamente inicializado deber&iacute;a explicar claramente qu&eacute; hay que hacer para que funcione.</li>
 <li>Elije cuidadosamente los nombres para tus tipos, m&eacute;todos y par&aacute;metros. Dedica tiempo a pensar cu&aacute;l es el primer nombre que la gente intentar&aacute; teclear cuando est&eacute; explorando tu API, y res&eacute;rvalo para tu componente agregado. Un error com&uacute;n es usar el “mejor” nombre para un tipo base. Pasa FxCop a tus bibliotecas.</li>
 <br />
 <li>Aseg&uacute;rate de que tu biblioteca es <a href="http://msdn.microsoft.com/en-us/library/12a7a7h3%28v=vs.110%29.aspx">CLS compliant</a>. Aplica <code>CLSCompliantAttribute</code> a tus ensamblados.&nbsp;</li>
 <br />
 <li>Ten preferencia por usar clases en lugar de interfaces.</li>
 <br />
 <li>No crees tipos sellados a menos que tengas buenas razones para hacerlo.</li>
 <br />
 <li>No crees tipos valor mutables.</li>
 <br />
 <li>No proveas abstracciones como interfaces o clases abstractas sin proveer al menos de un tipo concreto que implemente cada abstracci&oacute;n. Esto ayudar&aacute; a validar el dise&ntilde;o.</li>
 <br />
 <li>No proveas interfaces sin disponer al menos de un API que lo consuma, es decir, un m&eacute;todo que requiera un par&aacute;metro del tipo del interfaz. Esto ayudar&aacute; a validar el dise&ntilde;o del interfaz.</li>
 <br />
 <li>Evita crear tipos anidados p&uacute;blicos.</li>
 <br />
 <li>Aplica el atributo <code>FlagsAttribute</code> a enumeraciones de flags. </li>
 <br />
 <li>Utiliza principalmente colecciones en lugar de arrays en los APIs p&uacute;blicos.</li>
 <br />
 <li>No utilices <code>ArrayList</code>, <code>List&lt;T&gt;</code>, <code>Hashtable</code>, o <code>Dictionary&lt;K,V&gt;</code> in APIs p&uacute;blicas. Utiliza en su lugar <code>Collection&lt;T&gt;</code>, <code>ReadOnlyCollection&lt;T&gt;</code>, <code>KeyedCollection&lt;K,V&gt;</code>, o los subtipos de&nbsp; <code>CollectionBase</code>instead. Ten en cuenta que las colecciones gen&eacute;ricas son s&oacute;lo soportadas en .NET framework 2.0 o superior.</li>
 <br />
 <li>No utilices c&oacute;digos de error para notificar fallos. Usa excepciones en su lugar.&nbsp;</li>
 <br />
 <li>No lances excepciones de tipo <code>Exception</code> o <code>SystemException</code>. </li>
 <br />
 <li>Evita capturar excepciones del tipo base <code>Exception</code>. </li>
 <br />
 <li>Opta preferiblemente por lanzar excepciones ya existentes de prop&oacute;sito general como <code>ArgumentNullException</code>, <code>ArgumentOutOfRangeException o</code>&nbsp;<code>InvalidOperationException</code> en lugar de definir tus propias excepciones. Lanza siempre la excepci&oacute;n m&aacute;s espec&iacute;fica posible. </li>
 <br />
 <li>Aseg&uacute;rate de que los mensajes de excepci&oacute;n son claros y aplicables.</li>
 <br />
 <li>Utiliza <code>EventHandler&lt;T&gt;</code> para eventos en lugar de definir manualmente manejadores de delegados. </li>
 <br />
 <li>Usa preferiblemente APIs basadas en eventos en lugar de usar delegados.</li>
 <br />
 <li>Usa preferiblemente constructores en lugar de m&eacute;todos de factor&iacute;a.</li>
 <br />
 <li>No expongas directamente campos p&uacute;blicos. Utiliza propiedades en su lugar.</li>
 <br />
 <li>Usa preferiblemente propiedades para almacenamiento, pero utiliza m&eacute;todos en los siguientes casos: <br /> 
  <ul>
   <br />
   <li>Cuando la operaci&oacute;n sea una conversi&oacute;n (como en <code>Object.ToString()</code>) .</li>
   <li>Cuando la operaci&oacute;n puede ser costosa (&oacute;rdenes de magnitud m&aacute;s lento de lo que podr&iacute;a ser el establecimiento de un campo).</li>
   <li>Cuando el hecho de obtener el valor de una propiedad utilizando el <em>getter</em> tenga un efecto lateral observable.</li>
   <li>Cuando llamar varias veces consecutivas al miembro pudiera retornar distintos resultados.</li>
   <li>Cuando el miembro retorne un array. Nota: los miembros que retornen un array deber&iacute;an retornar copias del array interno, no una referencia al mismo.</li>
  </ul></li>
 <br />
 <li>Permite que las propiedades sean establecidas en cualquier orden. Las propiedades deber&iacute;an ser <em>stateless </em>respecto a otras propiedades. </li>
 <br />
 <li>No hagas que un miembro sea virtuales a menos que tengas razones de peso para hacerlo.&nbsp;</li>
 <br />
 <li>Evita los finalizadores de clases. </li>
 <br />
 <li>Implementa <code>IDisposable</code> en todos los tipos que adquieran recursos nativos, as&iacute; como en los que dispongan de finalizadores. </li>
 <br />
 <li>S&eacute; consistente en el orden y nombrado de los par&aacute;metros de m&eacute;todos. Es frecuente encontrar m&eacute;todos sobrecargados con un n&uacute;mero creciente de par&aacute;metros para permitir al desarrollador especificar el nivel de informaci&oacute;n que necesite.</li>
 <br />
 <li>Aseg&uacute;rate de que todas las sobrecargas muestran par&aacute;metros consistentes en su orden (el mismo par&aacute;metro se encuentra en el mismo lugar en la signatura) y nombre. Entre las sobrecargas, el &uacute;nico m&eacute;todo que deber&iacute;a ser virtual es el que tiene m&aacute;s par&aacute;metros y s&oacute;lo cuando la extensibilidad es necesaria. <br /> <pre>public class Foo<br />{<br />    private readonly string _defaultForA = &quot;default value for a&quot;;<br />    private readonly int _defaultForB = 42;<br /><br />    public void Bar()<br />    {<br />        Bar(_defaultForA, _defaultForB);<br />    }<br /><br />    public void Bar(string a)<br />    {<br />        Bar(a, _defaultForB);<br />    }<br /><br />    public void Bar(string a, int b)<br />    {<br />        // core implementation here<br />    }<br />}</pre></li>
 <li>Evita el uso de par&aacute;metros <code>out</code> y <code>ref</code>.</li>
</ul>
<br />&iexcl;Y eso es todo! Claramente hay algunas normas a las que se les nota el paso del tiempo, e incluso puede haber alguna discutible, pero espero que os resulten interesantes y os sean &uacute;tiles como base si a&uacute;n no ten&eacute;is directrices claras. Y si quer&eacute;is contribuir al desarrollo de .NET, son las reglas a las que hay que ce&ntilde;irse ;)
<br />
<br />Publicado en 
<a href="http://www.variablenotfound.com/">Variable not found</a>.
<div> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:ecdYMiMMAMM"><img src="http://feeds.feedburner.com/~ff/vnf?d=ecdYMiMMAMM" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:yIl2AUoC8zA"><img src="http://feeds.feedburner.com/~ff/vnf?d=yIl2AUoC8zA" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:qj6IDK7rITs"><img src="http://feeds.feedburner.com/~ff/vnf?d=qj6IDK7rITs" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:4cEx4HpKnUU"><img src="http://feeds.feedburner.com/~ff/vnf?i=D9xqL1PbLx8:moJuGXJQ8KQ:4cEx4HpKnUU" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:F7zBnMyn0Lo"><img src="http://feeds.feedburner.com/~ff/vnf?i=D9xqL1PbLx8:moJuGXJQ8KQ:F7zBnMyn0Lo" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:gIN9vFwOqvQ"><img src="http://feeds.feedburner.com/~ff/vnf?i=D9xqL1PbLx8:moJuGXJQ8KQ:gIN9vFwOqvQ" /></a> 
 <a href="http://feeds.feedburner.com/~ff/vnf?a=D9xqL1PbLx8:moJuGXJQ8KQ:I9og5sOYxJI"><img src="http://feeds.feedburner.com/~ff/vnf?d=I9og5sOYxJI" /></a> 
</div>
<img src="http://feeds.feedburner.com/~r/vnf/~4/D9xqL1PbLx8" height="1" width="1" alt="" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework" st_title="Normas de diseño y codificación de .NET framework | Variable not found"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/desarrollo/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta desarrollo</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1357,
      "url" : "http://www.blogstack.info/post/variablenotfound/2015/01/normas-de-diseno-y-codificacion-de-net-framework"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "variablenotfound",
      "name" : "Variable not found"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>