<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>La consulta que era lenta los domingos | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos"><span itemprop="headline">La consulta que era lenta los domingos</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/bauHMRSbJw4/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-01T05:06" itemprop="datePublished">Publicado el lunes, 01 de diciembre de 2014 a las 05:06 UTC</span></div><div><span>
Etiquetado como
sqlserver, development</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Como desarrolladores nos toca asumir que cuando las cosas se complican, <a href="http://blog.koalite.com/2012/11/la-ultima-linea-de-soporte-es-el-programador/" title="La &uacute;ltima l&iacute;nea de soporte es el programador">la &uacute;ltima l&iacute;nea de soporte somos nosotros </a>y claro, los problemas que nos llegan son los m&aacute;s extra&ntilde;os y complicados de resolver.</p> 
<p>Recientemente hemos tenido que tratar con un caso curioso: una consulta a una base de datos SQL Server que normalmente funcionaba bien, pero en determinados casos tardaba mucho en ejecutarse. Utilizando la misma base de datos y los mismos par&aacute;metros de consulta, pod&iacute;a pasar de ejecutarse en menos de un segundo a tardar un par de minutos.</p> 
<p>Despu&eacute;s de descartar al sospechoso habital (el ORM), comprobar que la consulta se lanzaba directamente con una sentencia SQL generada “a mano” con cari&ntilde;o, asegurarnos de que no hac&iacute;amos demasiadas barbaridades en ella y regenerar &iacute;ndices y estad&iacute;sticas, tocaba echar mano de la artiller&iacute;a pesada y empezar a investigar con el SQL Profiler para obtener m&aacute;s informaci&oacute;n.</p> 
<h3>Planes de ejecuci&oacute;n</h3> 
<p>Cuando se env&iacute;a una consulta a SQL Server el servidor se encarga de parsear el texto de la consulta, compilarla y generar un plan de ejecuci&oacute;n que indicar&aacute; la manera en que se ejecutar&aacute; la consulta sobre la base de datos.</p> 
<p>El plan de ejecuci&oacute;n contiene intrucciones de “bajo nivel” con la forma en que se procesar&aacute; la consulta, por ejemplo, decidiendo si una tabla se recorrer&aacute; entera o se acceder&aacute; a partir de un &iacute;ndice, o si se realizar&aacute;n bucles anidados o hash joins. </p> 
<p>Como os pod&eacute;is imaginar, elegir un plan de ejecuci&oacute;n de consulta adecuado puede ser la diferencia entre que una consulta se ejecute en un tiempo razonable o no.</p> 
<p>Por ejemplo, y simplificando mucho, si tenemos una tabla <code>Order</code> con pedidos y una tabla <code>Customer</code> con clientes, ambas con los &iacute;ndices adecuados, y queremos obtener los pedidos del &uacute;ltimo mes de clientes de Madrid, podr&iacute;amos tener dos estrategias diferentes:</p> 
<ul> 
 <li>Buscamos los clientes de Madrid usando un &iacute;ndice sobre la columna <code>City</code> de la tabla <code>Customer</code>, luego para cada cliente de Madrid buscamos sus pedidos y nos quedamos con los que son del &uacute;ltimo mes.</li> 
 <li>Buscamos los pedidos del &uacute;ltimo mes usando un &iacute;ndice sobre la columna <code>Date</code> de la tabla <code>Order</code>, y luego buscamos el cliente asociado a ese pedido y nos quedamos s&oacute;lo con los que son de Madrid. </li>
</ul> 
<p>Si tenemos pocos clientes de Madrid y muchos pedidos en el &uacute;ltimo mes, la primera opci&oacute;n ser&aacute; m&aacute;s eficiente porque estaremos reduciendo el conjunto de resultados antes. Obtendremos pocas filas de la tabla <code>Customer</code> al filtrar por <code>City = 'Madrid'</code> y por tanto haremos pocos accesos a la tabla <code>Order</code> para buscar pedidos asociados. </p> 
<p>Por el contrario, si tenemos pocos pedidos en el &uacute;ltimo mes y muchos clientes de Madrid, ser&aacute; mejor utilizar la segunda opci&oacute;n para acotar antes el conjunto de resultados.</p> 
<p>Para elegir entre una opci&oacute;n u otra, SQL Server se basa en las estad&iacute;sticas que mantiene sobre los datos almacenados en las tablas, y que le permiten hacerse una idea de cuantos datos devolver&aacute; una operaci&oacute;n concreta para as&iacute; optimizar el plan de ejecuci&oacute;n de la consulta.</p> 
<p>Todo este proceso de generaci&oacute;n del plan de ejecuci&oacute;n de consulta puede llevar su tiempo, por lo que SQL Server mantiene una cach&eacute; de planes de ejecuci&oacute;n de consulta para poder reutilizarlos. </p> 
<h3>Parameter <em>sniffing</em></h3> 
<p>Adem&aacute;s, en su af&aacute;n por mejorar el rendimiento, si estamos lanzando consultas con par&aacute;metros (ya sea mediante llamadas a procedimientos almacenados o con <code>sp_executesql</code>), SQL Server almacena el plan de ejecuci&oacute;n que gener&oacute; para el primer conjunto de par&aacute;metros y lo reutiliza en las siguientes ejecuciones de esa consulta, aunque los par&aacute;metros hayan cambiado.</p> 
<p>Y ah&iacute; est&aacute; el problema. Si volvemos al ejemplo anterior de los clientes y los pedidos, ve&iacute;amos que dependiendo del n&uacute;mero de pedidos que hubiera en el &uacute;ltimo mes y del n&uacute;mero de clientes de la ciudad indicada, era mejor utilizar una estrategia u otra.</p> 
<p>Imaginad que la primera vez que se lanza esa consulta, se filtra por clientes de Palencia, y resulta que nuestra empresa no vende nada en Palencia. SQL Server consulta sus estad&iacute;sticas y decide que es mejor empezar por la tabla <code>Customer</code>, quedarse con 0 filas correspondientes a clientes de Palencia, y luego buscar los pedidos de esos 0 clientes. Perfecto.</p> 
<p>Si a continuaci&oacute;n lanzamos la consulta para clientes de Barcelona y tenemos 8000 clientes en Barcelona y s&oacute;lo 50 pedidos en el &uacute;ltimo mes, SQL Server reutilizar&aacute; el plan anterior, obtendr&aacute; 8000 filas de la tabla <code>Customer</code> y por cada una de ellas buscar&aacute; sus pedidos asociados, cuando est&aacute; claro que hubiese sido mucho mejo partir de los 50 pedidos del &uacute;ltimo mes y ver si el cliente era de Barcelona o no.</p> 
<p>Este problema con el que ya me hab&iacute;a tocado lidiar alguna vez se conoce como <em>parameter sniffing</em> o <em>parameter spoofing</em> y hay un mont&oacute;n de documentaci&oacute;n en internet sobre &eacute;l y sobre c&oacute;mo podemos evitarlo, por ejemplo a&ntilde;adiendo un <a href="http://msdn.microsoft.com/en-us/library/ms181714.aspx">OPTION (RECOMPILE)</a> a nuestra consulta.</p> 
<h3>&iquest;Por qu&eacute; los domingos?</h3> 
<p>Tras revisar con el SQL Profiler que, efectivamente, se estaba generando un plan de ejecuci&oacute;n de consulta err&oacute;neo, hicimos la prueba evidente, vaciar la cach&eacute; de planes de ejecuci&oacute;n de consulta en la m&aacute;quina de pruebas con un <a href="http://msdn.microsoft.com/en-us/library/ms174283.aspx">DBCC FREEPROCCACHE</a> y ver qu&eacute; pasaba en la aplicaci&oacute;n. </p> 
<p>Como era de esperar funcion&oacute;… un rato. Tras reiniciar la m&aacute;quina para comprobar que todo segu&iacute;a bien (estamos hablando de una aplicaci&oacute;n con su propio SQL “privado” y local, no vay&aacute;is por ah&iacute; reiniciando servidores SQL, por favor), volvi&oacute; a fallar y el plan de ejecuci&oacute;n de consultas cacheado volv&iacute;a a ser incorrecto pero, &iquest;c&oacute;mo estaba llegando all&iacute; ese plan de ejecuci&oacute;n de consultas?</p> 
<p>La consulta que fallaba estaba en una pantalla que mostraba un listado de ventas durante un rango de fechas. Al cargar la pantalla por primera vez, se lanzaba esa consulta con la fecha de hoy para mostrar directamente al usuario las ventas del d&iacute;a.</p> 
<p>Cuando se ejecutaba la aplicaci&oacute;n un d&iacute;a normal, SQL Server sab&iacute;a (por sus estad&iacute;sticas) que hab&iacute;a registros en la tabla de ventas y establec&iacute;a un plan de ejecuci&oacute;n basado en ese hecho, pero cuando se ejecutaba un domingo, SQL Server sab&iacute;a que ese d&iacute;a no hab&iacute;a ning&uacute;n registro en la tabla de ventas, por lo que lo mejor era partir de ella para hacer los cruces.</p> 
<p>Eso hac&iacute;a que un plan preparado para obtener 0 filas de la tabla de ventas se viera procesando del orden de miles de filas si despu&eacute;s de cargar la ventana se intentaban obtener las ventas de un mes.</p> 
<p>La soluci&oacute;n, como ya he dicho antes, pasaba por a&ntilde;adir un <code>option (recompile)</code> a la consulta, que aunque tiene sus pegas (obliga al SQL a hacer m&aacute;s trabajo), en este caso es perfectamente aceptable para una consulta que se lanza s&oacute;lo una par de veces al d&iacute;a como mucho.</p> 
<p>Tal vez estar&iacute;a bien que SQL Server, despu&eacute;s de lanzar una consulta usando un plan cacheado, comprobase si hay mucha diferencia entre los n&uacute;meros de filas que hab&iacute;a estimado para cada paso del plan y los n&uacute;meros reales obtenidos al ejecutar la consulta. </p> 
<p>Si la diferencia es muy grande, podr&iacute;a descartar el plan y dejar que se volviese a generar en la siguiente consulta, evitando as&iacute; que todas las consultas queden condenadas a utilizar un plan generado para un caso extremo.</p> 
<p>Este problema lleva mucho tiempo existiendo, y si Microsoft no lo ha corregido, supongo que la soluci&oacute;n no ser&aacute; tan sencilla como la que planteo, pero estar&iacute;a bien que buscasen alguna soluci&oacute;n, porque este tipo de problemas son complicados de diagnosticar.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/bauHMRSbJw4" height="1" width="1" alt="" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos" st_title="La consulta que era lenta los domingos | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1175,
      "url" : "http://www.blogstack.info/post/koalite/2014/12/la-consulta-que-era-lenta-los-domingos"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>