<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-04T12:53:43Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-04T12:53:43Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Guía instalación CyanogenMod</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod" />
    <category term="android" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="gnulinux" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-05-26T19:33:04Z</updated>
    <published>2012-05-25T17:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
  &lt;img alt="Android" src="http://3.bp.blogspot.com/-SWH4vcj_XSA/T7-4U4INTbI/AAAAAAAABKg/zi-b2AOtzPw/s1600/android.png" title="Android" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Uno de los defectos que tienen los m&amp;oacute;viles android es que los fabricantes y las operadores si ofrecen actualizaciones a nuevas versiones de android lo hacen tarde y en algunos casos ni eso con lo que al cabo de una a&amp;ntilde;o ya no tienes la &amp;uacute;ltima versi&amp;oacute;n de andoid en un m&amp;oacute;vil que por hardware ser&amp;iacute;a perfectamente capaz. Esto causa uno de los problemas en android, fragmentaci&amp;oacute;n en el ecosistema, dificultando el desarrollo de las aplicaciones y obligando a soportar un mayor n&amp;uacute;mero de versiones andoid en vez de unas pocas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="CyanogenMod" height="68" src="http://1.bp.blogspot.com/-7_FkslK58nc/T7-zjoLu-GI/AAAAAAAABKQ/ls-xqbPKu7A/s320/cyanogenmod.png" title="CyanogenMod" width="320" /&gt; 
&lt;/div&gt;A raiz de este problema han ido surgiendo varias roms como 
&lt;a href="http://www.cyanogenmod.com/"&gt;CyanogenMod&lt;/a&gt; o 
&lt;a href="http://en.miui.com/"&gt;MIUI&lt;/a&gt;&amp;nbsp;que proporcionan versiones de android m&amp;aacute;s actualizadas y modificadas partiendo del c&amp;oacute;digo original proporcionado por google. CyanogenMod es una de las roms m&amp;aacute;s longevas, que soporta mayor n&amp;uacute;mero de dispositivos y de las m&amp;aacute;s estables. Adem&amp;aacute;s del motivo anterior de tener una versi&amp;oacute;n m&amp;aacute;s actualizada de android, CyanogenMod puede solucionar algunos defectos que tiene el android original del tel&amp;eacute;fono. En mi caso el tel&amp;eacute;fono ven&amp;iacute;a con froyo (2.2) y CyanogenMod me ha permitido disponer de gingerbread (2.3) adem&amp;aacute;s de corregir algunos problemas como poder desactivar la respuesta h&amp;aacute;ptica (vibraci&amp;oacute;n) de los botones y de los bloqueos que se produc&amp;iacute;an en algunas ocasiones al activar y desactivar la radio. Adem&amp;aacute;s CyanogenMod tiene muchas m&amp;aacute;s opciones de personalizaci&amp;oacute;n que las originales de android.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-25T17:10:00Z</dc:date>
  </entry>
</feed>

