<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2015-02-20T20:02:41Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2015-02-20T20:02:41Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>ALERTA!!! Descubierto Nuevo Malware para Android</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2015/02/alerta-descubierto-nuevo-malware-para-android" />
    <category term="seguridad" />
    <category term="malware" />
    <category term="android" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2015-02-20T20:01:23Z</updated>
    <published>2015-02-20T20:01:23Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Recientemente el personal de &lt;a href="http://now.avg.com/malware-is-still-spying-on-you-after-your-mobile-is-off/"&gt;AVG Mobile Security&lt;/a&gt; descubrieron un malware en &lt;strong&gt;Android&lt;/strong&gt; que toma control del &lt;strong&gt;proceso de apagado&lt;/strong&gt; dejando el equipo totalmente funcional aun parezca que se encuentra apagado. El usuario hace el proceso normal de apagado y el equipo muestra la animaci&amp;oacute;n de apagado, sin embargo, el equipo permanece encendido permiti&amp;eacute;ndole a un usuario malintencionado llevar a cabo varias tareas como el de hacer llamadas y tomar fotograf&amp;iacute;as.&lt;/p&gt; 
&lt;p&gt;Visto por primera vez en China, el &lt;strong&gt;malware&lt;/strong&gt; se propagaba a trav&amp;eacute;s de una aplicaci&amp;oacute;n y aproximadamente 10,000 dispositivos fueron infectados. Este &lt;strong&gt;Malware&lt;/strong&gt; afecta versiones de &lt;strong&gt;Androi&lt;/strong&gt;d antes de &lt;strong&gt;Lollipop (5.0)&lt;/strong&gt; y requiere &lt;strong&gt;permisos de root&lt;/strong&gt; para tomar control del proceso de apagado.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Como funciona?&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;Lo m&amp;aacute;s importante es que necesita permisos de root, el malware intentar&amp;aacute; obtener esos permisos, asi que ojo, los que tengan el equipo rooteado, luego de que el malware obtiene estos permisos:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2015/02/alerta-descubierto-nuevo-malware-para-android"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2015-02-20T20:01:23Z</dc:date>
  </entry>
  <entry>
    <title>HangoutON, Seguridad esencial en Android</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2015/01/hangouton-seguridad-esencial-en-android" />
    <category term="hangouton" />
    <category term="seguridad" />
    <category term="android" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2015-01-06T14:17:17Z</updated>
    <published>2015-01-06T14:17:17Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://jsitech.com/wp-content/uploads/2015/01/mobile-Android-Security1.jpg"&gt;&lt;img src="http://jsitech.com/wp-content/uploads/2015/01/mobile-Android-Security1.jpg" alt="mobile-Android-Security" width="500" height="375" /&gt;&lt;/a&gt;El Sistema operativo &lt;strong&gt;Android&lt;/strong&gt; ha tomado mucha popularidad y se ha convertido en uno de los m&amp;aacute;s utilizado. Esto lo convierte adem&amp;aacute;s en un objetivo atractivo para los &lt;strong&gt;cibercriminales&lt;/strong&gt; y es por esto que debemos todas las medidas de lugar para proteger nuestro sistema y nuestra informaci&amp;oacute;n.&lt;/p&gt; 
&lt;p&gt;Este &lt;strong&gt;Jueves 8 de Enero&lt;/strong&gt;, &lt;a href="http://hangouton.es"&gt;&lt;strong&gt;HangoutON&lt;/strong&gt;&lt;/a&gt; tendr&amp;aacute;n un evento en directo, donde un grupo de profesionales en el &amp;aacute;rea hablar&amp;aacute;n sobre las medidas de seguridad que debemos adoptar para proteger los dispositivos y la informaci&amp;oacute;n que en ellos tenemos.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Algunas de las cosas que ver&amp;aacute;n, tomado del site de &lt;a href="http://hangouton.es"&gt;HangoutON&lt;/a&gt;:&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Porque&lt;/strong&gt; &amp;iquest;es necesario tener un antivirus en el dispositivo m&amp;oacute;vil? &amp;iquest;qu&amp;eacute; otras medidas hay que tomar? &amp;iquest;c&amp;oacute;mo se pueden configurar las barreras de seguridad que vienen por defecto? &amp;iquest;es pr&amp;aacute;ctico activar la sesi&amp;oacute;n multiusuario en un Android? &amp;iquest;cu&amp;aacute;les son los ataques m&amp;aacute;s usuales a los dispositivos Android? &amp;iquest;es un sistema operativo seguro? &amp;iquest;c&amp;oacute;mo hay que actuar si un m&amp;oacute;vil ha sido infectado o bloqueado en un hackeo o por una aplicaci&amp;oacute;n maliciosa?&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2015/01/hangouton-seguridad-esencial-en-android"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2015-01-06T14:17:17Z</dc:date>
  </entry>
  <entry>
    <title>DriveDroid; cómo arrancar cualquier Linux desde nuestro smartphone</title>
    <link rel="alternate" href="http://www.blogstack.info/post/laborategia/2014/10/drivedroid-como-arrancar-cualquier-linux-desde-nuestro-smartphone" />
    <category term="colaboracion" />
    <category term="cosas-que-hago" />
    <category term="blog-stack" />
    <category term="planeta-linux" />
    <category term="privacidad" />
    <category term="en-castellano" />
    <category term="android" />
    <category term="software-libre" />
    <category term="productividad" />
    <category term="linux" />
    <author>
      <name>Dabid Martinez</name>
    </author>
    <updated>2014-10-22T21:05:45Z</updated>
    <published>2014-10-22T21:05:45Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://laborategia.net/wp-content/uploads/2014/10/logo-DriveDroid.png"&gt;&lt;img src="http://laborategia.net/wp-content/uploads/2014/10/logo-DriveDroid.png" alt="logo-DriveDroid" width="150" height="151" /&gt;&lt;/a&gt;&amp;iquest;Cuantas veces has tenido que iniciar un Live CD de Linux para instalar o recuperar un sistema y no has tenido el lapiz USB preparado? &amp;iquest;y cuantas veces no has tenido siquiera un lapiz USB a mano? Y ni mencionar de aquellas en las que no has tenido conexi&amp;oacute;n a Internet para descargarte la ISO. Pues bien &lt;a href="https://play.google.com/store/apps/details?id=com.softwarebakery.drivedroid&amp;amp;hl=es"&gt;DriveDroid&lt;/a&gt; ha venido a solucionarnos esos problemas. Es un aplicaci&amp;oacute;n para Android que nos permite arrancar cualquier sistema operativo con base Linux (he visto por ahi que alguien ha arrancado Windows) desde nuestro tel&amp;eacute;fono m&amp;oacute;vil. Por que si hay algo que no olvidamos al salir de nuestra casa eso el… el m&amp;oacute;vil y el tabaco.&lt;/p&gt; 
&lt;p&gt;Puede resultar una aplicaci&amp;oacute;n muy c&amp;oacute;moda para geeks y no tan geeks, tener la posibilidad de arrancar cualquier distribuci&amp;oacute;n de Linux simplemente sacado el smartphone de nuestro bolsillo me resulta cuanto menos estupendo y funcional:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/laborategia/2014/10/drivedroid-como-arrancar-cualquier-linux-desde-nuestro-smartphone"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Dabid Martinez</dc:creator>
    <dc:date>2014-10-22T21:05:45Z</dc:date>
  </entry>
  <entry>
    <title>Instalar Cyanogenmod 11 en Galaxy S3 Mini</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" />
    <category term="no-solo-linux" />
    <category term="cyanogenmod" />
    <category term="android" />
    <category term="software-libre" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-10-06T11:44:57Z</updated>
    <published>2014-04-28T10:26:00Z</published>
    <content type="html">&lt;p&gt;&lt;b&gt;ATENCI&amp;Oacute;N: para los problemas de bater&amp;iacute;a comentados en este art&amp;iacute;culo, he encontrado una soluci&amp;oacute;n detallada &lt;a href="http://www.lasombradelhelicoptero.com/2014/10/solucionar-problema-de-bateria-en.html"&gt;aqu&amp;iacute;&lt;/a&gt;.&lt;/b&gt; 
&lt;br /&gt; 
&lt;br /&gt;Seguimos con una nueva entrega de la serie &amp;quot; 
&lt;a href="http://www.lasombradelhelicoptero.com/2014/04/camino-la-libertad-openmailbox-y.html"&gt;Camino a la libertad&lt;/a&gt;&amp;quot;, toca ponernos manos a la obra para sacar a mi tel&amp;eacute;fono de la jaula a la que lo someten, al alim&amp;oacute;n, Google y Samsung. Se trata de una vieja aspiraci&amp;oacute;n que nunca me atrev&amp;iacute; a acometer, no ya tanto por lo complejo de la tarea, sino m&amp;aacute;s bien por la posibilidad, siempre presente, de convertir un elemento tan &amp;uacute;til como un tel&amp;eacute;fono m&amp;oacute;vil en un simple pisapapeles de lujo. De ah&amp;iacute; que haya demorado tanto el tema y no me haya lanzado a la piscina hasta tener todos los pasos a realizar completamente claros, sin atisbo de duda. Dos semanas de rebuscar y leer tutoriales de aqu&amp;iacute; y de all&amp;aacute;, ni m&amp;aacute;s ni menos, en las que me ha dado la impresi&amp;oacute;n de que la mayor&amp;iacute;a de problemas que la gente dice sufrir al dar este paso vienen provocados por el seguimiento de instrucciones que no son lo suficientemente precisas y llevan a cometer errores, algunos de ellos, sin soluci&amp;oacute;n posible.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-04-28T10:26:00Z</dc:date>
  </entry>
  <entry>
    <title>Solucionar problema de batería en Cyanogenmod 11</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/solucionar-problema-de-bateria-en-cyanogenmod-11" />
    <category term="tutorial" />
    <category term="no-solo-linux" />
    <category term="cyanogenmod" />
    <category term="android" />
    <category term="software-libre" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-10-06T11:37:09Z</updated>
    <published>2014-10-06T11:36:00Z</published>
    <content type="html">&lt;p&gt;Como comentaba recientemente he vuelto a instalar Cyanogenmod 11, versi&amp;oacute;n 
&lt;a href="http://maclaw.pl/"&gt;Novafusion&lt;/a&gt; (tambi&amp;eacute;n conocida como Maclaw, por su autor), en mi Samsung Galaxy S3 Mini. Mi 
&lt;a href="http://www.lasombradelhelicoptero.com/2014/04/instalar-cyanogenmod-11-en-galaxy-s3.html"&gt;primera experiencia&lt;/a&gt; con esta ROM no acab&amp;oacute; demasiado bien, debido a que exist&amp;iacute;a un problema de consumo excesivo de bater&amp;iacute;a, con sobrecalentamiento a&amp;ntilde;adido (ambas cosas relacionadas entre s&amp;iacute;) que hac&amp;iacute;an inviable su uso. Confieso que, como en tantas ocasiones me ha ocurrido con las distribuciones de GNU/Linux, ciertos errores disparan en m&amp;iacute; una sensaci&amp;oacute;n de malestar, seguida por la imperiosa necesidad de instalar otra cosa. En este caso lo que hice fue volver a la &amp;quot;stock ROM&amp;quot; del fabricante, que obtuve de la web de 
&lt;a href="http://www.sammobile.com/firmwares/"&gt;Sammobile&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://2.bp.blogspot.com/-3vsGRiZm5VM/VDJ8bqPARqI/AAAAAAAAEtg/a4MyqRsJF8I/s1600/Screenshot_2014-10-06-12-43-08.png"&gt;&lt;img src="http://2.bp.blogspot.com/-3vsGRiZm5VM/VDJ8bqPARqI/AAAAAAAAEtg/a4MyqRsJF8I/s1600/Screenshot_2014-10-06-12-43-08.png" height="400" width="240" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Pero tras regresar a la libertad del mundo sin Google con una nueva instalaci&amp;oacute;n de Cyanogenmod 11, y tras constatar que el susodicho error continuaba presente, se me ocurri&amp;oacute; que lo adecuado ser&amp;iacute;a investigar por qu&amp;eacute; sucede y tratar de ponerle fin.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/solucionar-problema-de-bateria-en-cyanogenmod-11"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-10-06T11:36:00Z</dc:date>
  </entry>
  <entry>
    <title>Prueba de Concepto, Vulnerabilidad Navegador Android (CVE-2014-6041)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2014/09/prueba-de-concepto-vulnerabilidad-navegador-android-cve-2-14-6-41" />
    <category term="android" />
    <category term="privacidad" />
    <category term="ethical-hacking" />
    <category term="seguridad" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2014-09-17T04:21:23Z</updated>
    <published>2014-09-17T04:21:23Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.jsitech.com/wp-content/uploads/2014/07/bugtroidlogo.png"&gt;&lt;img src="http://www.jsitech.com/wp-content/uploads/2014/07/bugtroidlogo-300x300.png" alt="bugtroidlogo" width="300" height="300" /&gt;&lt;/a&gt;Hace poco publiqu&amp;eacute; un art&amp;iacute;culo donde les hablaba de una vulnerabilidad detectada en el browser stock de &lt;strong&gt;Android&lt;/strong&gt;, lo pueden leer &lt;a href="http://www.jsitech.com/seguridad/fallo-de-seguridad-en-browser-android-cve-2014-6041/"&gt;aqu&amp;iacute;&lt;/a&gt;. Les comentaba que iba a hacer la prueba con el m&amp;oacute;dulo de Metasploit que estaba disponible. Realmente, si es posible explotar la vulnerabilidad y robar los cookies o sesiones. Porque Sucede esto? Por un Bypass a la pol&amp;iacute;tica del mismo origen, o &lt;strong&gt;Same Origin Policy (SOP)&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;SOP&lt;/strong&gt; es uno de los mecanismos mas importante que se aplica a los navegadores modernos y la idea es que el javascript de un origen no puede acceder o no debe acceder a las propiedades un portal de otro origen. El Origen es formado por la combinaci&amp;oacute;n de esquemas, dominio y puerto. Hay algunas excepciones con SOP tal como las propiedades de la ubicaci&amp;oacute;n y objetos con los atributos de la fuente.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2014/09/prueba-de-concepto-vulnerabilidad-navegador-android-cve-2-14-6-41"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2014-09-17T04:21:23Z</dc:date>
  </entry>
  <entry>
    <title>Fallo de Seguridad en Browser Android (CVE-2014-6041)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/jsitech/2014/09/fallo-de-seguridad-en-browser-android-cve-2-14-6-41" />
    <category term="metasploit" />
    <category term="android" />
    <category term="aosp" />
    <category term="ethical-hacking" />
    <category term="seguridad" />
    <author>
      <name>Jason Soto</name>
    </author>
    <updated>2014-09-16T19:02:07Z</updated>
    <published>2014-09-16T19:02:07Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.jsitech.com/wp-content/uploads/2014/09/security-alert-300x225.jpg"&gt;&lt;img src="http://www.jsitech.com/wp-content/uploads/2014/09/security-alert-300x225.jpg" alt="security-alert-300x225" width="300" height="225" /&gt;&lt;/a&gt;En el portal de &lt;a href="http://www.rapid7.com/"&gt;&lt;strong&gt;Rapid7&lt;/strong&gt;&lt;/a&gt; pude leer sobre una falla de seguridad grave en el browser stock &lt;strong&gt;AOSP&lt;/strong&gt; de &lt;strong&gt;Android&lt;/strong&gt; que atenta contra la privacidad del usuario. Seg&amp;uacute;n la informacion en el browser stock en las versiones de Android menores de 4.4, se puede cargar javascript malicioso en un frame o ventana. Ya existe un&lt;a href="https://github.com/rapid7/metasploit-framework/pull/3759"&gt; M&amp;oacute;dulo&lt;/a&gt; de&lt;strong&gt; Metasploit&lt;/strong&gt; para explotar esta vulnerabilidad y esta disponible en todas las versiones del Framework.&lt;br /&gt; &lt;/p&gt; 
&lt;p&gt;La vulnerabilidad fue revelada el 1 de Septiembre de este a&amp;ntilde;o por &lt;a href="http://www.rafayhackingarticles.net/2014/08/android-browser-same-origin-policy.html"&gt;Rafay Balock&lt;/a&gt;,informa que modificando un javascript, un atacante puede evadir los controles de seguridad del browser stock de &lt;strong&gt;Android&lt;/strong&gt;. El Art&amp;iacute;culo cuenta con algunas pruebas de concepto.&lt;br /&gt; &lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Que significa esto?&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;Al acceder a un sitio arbitrario, digase uno controlado por un spammer, puede ver el contenido de los portales que tiene abiertos en el navegador. Si por ejemplo en una ventana tenemos abierto nuestro correo y en otra accedemos al web site arbitrario , el atacante puede tener acceso a esos datos, y lo mas preocupante es que puede copiar el cookie de la sesi&amp;oacute;n y tomar control de ella. Es una amenaza grave a la privacidad.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/jsitech/2014/09/fallo-de-seguridad-en-browser-android-cve-2-14-6-41"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Jason Soto</dc:creator>
    <dc:date>2014-09-16T19:02:07Z</dc:date>
  </entry>
  <entry>
    <title>Recuperando viejos artículos: Herramientas para la productividad: manejo remoto de LibreOffice</title>
    <link rel="alternate" href="http://www.blogstack.info/post/laborategia/2014/06/recuperando-viejos-articulos-herramientas-para-la-productividad-manejo-remoto-de-libreoffice" />
    <category term="productividad" />
    <category term="blog-stack" />
    <category term="android" />
    <category term="en-castellano" />
    <category term="cosas-que-hago" />
    <category term="libre-office" />
    <category term="talleres" />
    <category term="emprendiendo" />
    <category term="charlas" />
    <author>
      <name>Dabid Martinez</name>
    </author>
    <updated>2014-06-21T12:37:08Z</updated>
    <published>2014-06-04T14:44:03Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;En &lt;a href="http://gaueko.com/"&gt;Gaueko&lt;/a&gt; damos charlas muy a menudo: taller de criptograf&amp;iacute;a, formaciones a diferentes clientes, redes sociales y comunicaci&amp;oacute;n, blogging profesional, administraci&amp;oacute;n de diferentes gestores de contenidos, sistemas, virtualizaci&amp;oacute;n, cloud computing y una de las ultimas que nos han pedido: privacidad… la semana pasada impart&amp;iacute; una muy interesante sobre los &lt;strong&gt;nuevos ecosistemas de software libre para las radios libres&lt;/strong&gt; en &lt;a href="http://www.astragernika.net/"&gt;ASTRA&lt;/a&gt; y la pr&amp;oacute;xima semana estar&amp;eacute; en la universidad, &lt;a href="http://www.ehu.es/"&gt;UPV-EHU&lt;/a&gt;, hablando sobre &lt;strong&gt;el quinto poder&lt;/strong&gt; con alumnos de comunicaci&amp;oacute;n invitado por Ingenier&amp;iacute;a Sin Fronteras – Mugarik Gabeko Ingenieritza (&lt;a href="https://euskadi.isf.es/"&gt;ISF-MGI&lt;/a&gt;).&lt;/p&gt; 
&lt;p&gt;Cuando trabajo toda la documentaci&amp;oacute;n o las presentaciones las trabajo usando software libre, en mi opini&amp;oacute;n no hay mejor suite ofim&amp;aacute;tica que &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/laborategia/2014/06/recuperando-viejos-articulos-herramientas-para-la-productividad-manejo-remoto-de-libreoffice"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Dabid Martinez</dc:creator>
    <dc:date>2014-06-04T14:44:03Z</dc:date>
  </entry>
  <entry>
    <title>Android TAG y  el principio DRY</title>
    <link rel="alternate" href="http://www.blogstack.info/post/arquitecturajava/2014/05/android-tag-y-el-principio-dry" />
    <category term="mobile" />
    <category term="android" />
    <author>
      <name>Cecilio Álvarez Caules</name>
    </author>
    <updated>2014-05-15T11:16:09Z</updated>
    <published>2014-05-15T11:16:09Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Android es una plataforma de desarrollo&lt;strong&gt; que empieza a tener el sobrenombre de INFINITA&lt;/strong&gt; &amp;nbsp;en cuanto a las cosas que se pueden hacer, conjunto de APIs soportadas etc . Sin embargo al ser tan grande muchas veces nos centramos en aprender los conceptos avanzados y nos olvidamos un poco de lo m&amp;aacute;s elemental. Vamos a ver un ejemplo sencillo que contiene 3 botones.&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.arquitecturajava.com/wp-content/uploads/001138.png"&gt;&lt;img src="http://www.arquitecturajava.com/wp-content/uploads/001138.png" alt="001" width="298" height="357" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Vamos a ver el c&amp;oacute;digo del Layout :&lt;/p&gt; 
&lt;pre&gt;

&amp;lt;LinearLayout android:id=&amp;quot;@+id/zona&amp;quot;
 xmlns:android=&amp;quot;http://schemas.android.com/apk/res/android&amp;quot;
 android:layout_width=&amp;quot;fill_parent&amp;quot;
 android:layout_height=&amp;quot;fill_parent&amp;quot; android:orientation=&amp;quot;vertical&amp;quot; &amp;gt;

 &amp;lt;TextView
 android:id=&amp;quot;@+id/texto_1&amp;quot;
 android:layout_width=&amp;quot;match_parent&amp;quot;
 android:layout_height=&amp;quot;wrap_content&amp;quot;
 /&amp;gt;

 &amp;lt;Button
 android:id=&amp;quot;@+id/boton_1&amp;quot;
 android:layout_width=&amp;quot;match_parent&amp;quot;
 android:layout_height=&amp;quot;wrap_content&amp;quot;
 android:text=&amp;quot;@string/boton_1&amp;quot; /&amp;gt;

 &amp;lt;Button
 android:id=&amp;quot;@+id/boton_2&amp;quot;
 android:layout_width=&amp;quot;match_parent&amp;quot;
 android:layout_height=&amp;quot;wrap_content&amp;quot;
 android:text=&amp;quot;@string/boton_2&amp;quot; /&amp;gt;

 &amp;lt;Button
 android:id=&amp;quot;@+id/boton_3&amp;quot;
 android:layout_width=&amp;quot;match_parent&amp;quot;
 android:layout_height=&amp;quot;wrap_content&amp;quot;
 android:text=&amp;quot;@string/boton_3&amp;quot; /&amp;gt;

&amp;lt;/LinearLayout&amp;gt;

&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/arquitecturajava/2014/05/android-tag-y-el-principio-dry"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Cecilio Álvarez Caules</dc:creator>
    <dc:date>2014-05-15T11:16:09Z</dc:date>
  </entry>
  <entry>
    <title>Cómo remover las inútiles imágenes de los remitentes en Gmail para Android</title>
    <link rel="alternate" href="http://www.blogstack.info/post/placerdigital/2013/06/como-remover-las-inutiles-imagenes-de-los-remitentes-en-gmail-para-android" />
    <category term="diseno" />
    <category term="blog-stack" />
    <category term="email" />
    <category term="analisis" />
    <category term="gmail" />
    <category term="android" />
    <category term="google" />
    <author>
      <name>Ricardo Barra</name>
    </author>
    <updated>2014-05-07T21:47:08Z</updated>
    <published>2013-06-18T04:13:38Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Si usan Gmail en Android ya deben haber visto algo como esto:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://placerdigital.net/pdblog/wp-content/uploads/2013/06/Gmail-Android-imagenes.png"&gt;&lt;img alt="Im&amp;aacute;genes de remitente en Gmail para Android" src="http://placerdigital.net/pdblog/wp-content/uploads/2013/06/Gmail-Android-imagenes.png" width="288" height="480" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Hermoso, &amp;iquest;no? Lamentablemente, m&amp;aacute;s all&amp;aacute; de la est&amp;eacute;tica esas im&amp;aacute;genes no sirven para nada. A menos que el remitente tenga una cuenta en Google+ con una imagen de perfil, esas im&amp;aacute;genes no son de utilidad, y como muchos de los correos que nos llegan son generados por robots (mensajes directos de Twitter, notificaciones de Facebook, promociones, etc.), jam&amp;aacute;s tendr&amp;aacute;n una cuenta con una imagen en Google+. Tambi&amp;eacute;n puede ocurrir que los remitentes S&amp;Iacute; tengan una cuenta en Google Plus pero sin foto o que el nombre del remitente comience con un caracter extra&amp;ntilde;o -como una comilla- por lo que estas im&amp;aacute;genes est&amp;aacute;n pr&amp;aacute;cticamente de adorno en Android.&lt;/p&gt; 
&lt;p&gt;No s&amp;eacute; qui&amp;eacute;n est&amp;aacute; dirigiendo los &amp;uacute;ltimos cambios en los m&amp;aacute;s variados servicios de Google pero claramente este ha sido el a&amp;ntilde;o de las malas decisiones en cuanto a dise&amp;ntilde;o de experiencia de usuario y usabilidad. Ok, no m&amp;aacute;s ch&amp;aacute;chara y veamos c&amp;oacute;mo desactivar, remover, eliminar o quitar esos lindos cuadraditos de colores.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/placerdigital/2013/06/como-remover-las-inutiles-imagenes-de-los-remitentes-en-gmail-para-android"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Ricardo Barra</dc:creator>
    <dc:date>2013-06-18T04:13:38Z</dc:date>
  </entry>
  <entry>
    <title>¿Quién hay detrás de Telegram?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/02/quien-hay-detras-de-telegram" />
    <category term="nikolai-durov" />
    <category term="pavel-durov" />
    <category term="internet" />
    <category term="android" />
    <category term="line" />
    <category term="comunidad-open-source" />
    <category term="linux" />
    <category term="telegram" />
    <category term="whatsapp" />
    <category term="mensajeria" />
    <category term="cifrado" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-02-24T17:06:02Z</updated>
    <published>2014-02-24T17:06:02Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/02/t_logo.png"&gt;&lt;img alt="t_logo" src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/02/t_logo-150x150.png" width="150" height="150" /&gt;&lt;/a&gt;El pasado s&amp;aacute;bado cundi&amp;oacute; el p&amp;aacute;nico, el famoso &lt;a title="WhatsApp" href="http://www.whatsapp.com/"&gt;WhatsApp&lt;/a&gt; no funcion&amp;oacute; durante varias horas, y la gente, acostumbrada a hablar con sus amigos v&amp;iacute;a mensaje en vez de v&amp;iacute;a voz, empez&amp;oacute; a ponerse nerviosa. Por suerte los usuarios ten&amp;iacute;an otras opciones c&amp;oacute;mo &lt;a title="Line" href="http://line.me/es/"&gt;Line&lt;/a&gt; o &lt;a title="Hangouts" href="https://www.google.com/intl/es/+/learnmore/hangouts/"&gt;Hangouts&lt;/a&gt;. Y sobre todo &lt;a title="Telegram" href="https://telegram.org/"&gt;Telegram&lt;/a&gt;, que desde que lleg&amp;oacute; al “barrio” no ha parado de ganar buena fama. Su funcionamiento es muy similar al de WhatsApp, pero mejorado. Podemos tener conversaciones seguras e encriptadas.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Pero, &amp;iquest;Qui&amp;eacute;n hay detr&amp;aacute;s de Telegram?&lt;/p&gt; 
&lt;p&gt;Si investigamos un poco vemos que detr&amp;aacute;s del proyecto tenemos a los hermanos &lt;a title="Pavel Durov" href="http://en.wikipedia.org/wiki/Pavel_Durov"&gt;Pavel &lt;/a&gt;y &lt;a title="Nikolai Durov" href="http://en.wikipedia.org/wiki/Nikolai_Durov"&gt;Nikolai Durov&lt;/a&gt;. Creadores de la tecnolog&amp;iacute;a que lo hace funcionar, adem&amp;aacute;s de apoyar el proyecto econ&amp;oacute;micamente. Seg&amp;uacute;n leemos utilizan un cifrado “&lt;a title="AES" href="http://es.wikipedia.org/wiki/Advanced_Encryption_Standard"&gt;256-symmetric AES&lt;/a&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/02/quien-hay-detras-de-telegram"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-02-24T17:06:02Z</dc:date>
  </entry>
  <entry>
    <title>KDE Connect: integra tu Android con KDE</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/kde-connect-integra-tu-android-con-kde" />
    <category term="android" />
    <category term="aplicaciones" />
    <category term="kde-connect" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2013-09-13T13:58:42Z</updated>
    <published>2013-09-13T13:58:00Z</published>
    <content type="html">&lt;p&gt;Los seguidores de nuestro mundillo linuxero estoy seguro de que llev&amp;aacute;is alg&amp;uacute;n tiempo leyendo aqu&amp;iacute; y all&amp;aacute; sobre las bondades de una nueva aplicaci&amp;oacute;n desarrollada por 
&lt;a href="http://albertvaka.wordpress.com/"&gt;Albert Vaca&lt;/a&gt; para el 
&lt;a href="https://es.wikipedia.org/wiki/Google_Summer_of_Code"&gt;GSoC 2013&lt;/a&gt;. Se trata de KDE Connect, una maravillosa utilidad que brilla m&amp;aacute;s por lo que promete que por lo que actualmente ofrece, que tampoco es moco de pavo, por otra parte. Descubr&amp;iacute; la aplicaci&amp;oacute;n de la mano del blog 
&lt;a href="http://victorhckinthefreeworld.wordpress.com/2013/08/31/tutorial-de-kde-connect-en-opensuse/"&gt;victorhckinthefreeworld&lt;/a&gt; hace unos d&amp;iacute;as y desde entonces la vengo usando. Transcurrido el tiempo suficiente creo que es un buen momento para hacerle justicia a su creador d&amp;aacute;ndola a conocer por el blog, a la par que orientar a los usuarios de Chakra en su instalaci&amp;oacute;n y uso. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://2.bp.blogspot.com/-LcGHqh4zUBg/UjLcJ2f9HVI/AAAAAAAAD9U/ZZBAgEVvQTE/s1600/kdelogo.png"&gt;&lt;img src="http://2.bp.blogspot.com/-LcGHqh4zUBg/UjLcJ2f9HVI/AAAAAAAAD9U/ZZBAgEVvQTE/s1600/kdelogo.png" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;b&gt;&lt;/b&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt; 
&lt;b&gt;Qu&amp;eacute; es y para qu&amp;eacute; sirve&lt;/b&gt; 
&lt;br /&gt;KDE Connect es un programa que permite la integraci&amp;oacute;n entre un dispositivo Android y el escritorio KDE. Cuenta con varias funcionalidades, que veremos m&amp;aacute;s adelante, y en principio se espera que se incorporen varias m&amp;aacute;s a medida que el desarrollo vaya avanzando. Podemos disfrutar de todo su poder si tenemos un dispositivo cuya versi&amp;oacute;n de Android sea 4.3, de casi todo si es una versi&amp;oacute;n superior a la 4.0 (mi caso), o de muy poco en el resto de los casos, si bien Albert Vaca indica en su blog que se pretende extender el soporte a versiones m&amp;aacute;s antiguas dentro de un tiempo.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/kde-connect-integra-tu-android-con-kde"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2013-09-13T13:58:00Z</dc:date>
  </entry>
  <entry>
    <title>Guía instalación CyanogenMod</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod" />
    <category term="android" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="gnulinux" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-05-26T23:33:04Z</updated>
    <published>2012-05-25T21:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
  &lt;img alt="Android" src="http://3.bp.blogspot.com/-SWH4vcj_XSA/T7-4U4INTbI/AAAAAAAABKg/zi-b2AOtzPw/s1600/android.png" title="Android" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Uno de los defectos que tienen los m&amp;oacute;viles android es que los fabricantes y las operadores si ofrecen actualizaciones a nuevas versiones de android lo hacen tarde y en algunos casos ni eso con lo que al cabo de una a&amp;ntilde;o ya no tienes la &amp;uacute;ltima versi&amp;oacute;n de andoid en un m&amp;oacute;vil que por hardware ser&amp;iacute;a perfectamente capaz. Esto causa uno de los problemas en android, fragmentaci&amp;oacute;n en el ecosistema, dificultando el desarrollo de las aplicaciones y obligando a soportar un mayor n&amp;uacute;mero de versiones andoid en vez de unas pocas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="CyanogenMod" height="68" src="http://1.bp.blogspot.com/-7_FkslK58nc/T7-zjoLu-GI/AAAAAAAABKQ/ls-xqbPKu7A/s320/cyanogenmod.png" title="CyanogenMod" width="320" /&gt; 
&lt;/div&gt;A raiz de este problema han ido surgiendo varias roms como 
&lt;a href="http://www.cyanogenmod.com/"&gt;CyanogenMod&lt;/a&gt; o 
&lt;a href="http://en.miui.com/"&gt;MIUI&lt;/a&gt;&amp;nbsp;que proporcionan versiones de android m&amp;aacute;s actualizadas y modificadas partiendo del c&amp;oacute;digo original proporcionado por google. CyanogenMod es una de las roms m&amp;aacute;s longevas, que soporta mayor n&amp;uacute;mero de dispositivos y de las m&amp;aacute;s estables. Adem&amp;aacute;s del motivo anterior de tener una versi&amp;oacute;n m&amp;aacute;s actualizada de android, CyanogenMod puede solucionar algunos defectos que tiene el android original del tel&amp;eacute;fono. En mi caso el tel&amp;eacute;fono ven&amp;iacute;a con froyo (2.2) y CyanogenMod me ha permitido disponer de gingerbread (2.3) adem&amp;aacute;s de corregir algunos problemas como poder desactivar la respuesta h&amp;aacute;ptica (vibraci&amp;oacute;n) de los botones y de los bloqueos que se produc&amp;iacute;an en algunas ocasiones al activar y desactivar la radio. Adem&amp;aacute;s CyanogenMod tiene muchas m&amp;aacute;s opciones de personalizaci&amp;oacute;n que las originales de android.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-25T21:10:00Z</dc:date>
  </entry>
</feed>

