<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Procesador de documentos LyX | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2014/09/procesador-de-documentos-lyx"><span itemprop="headline">Procesador de documentos LyX</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/software"><img title="software" alt="software" src="/assets/images/labels/software.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2014/09/procesador-de-documentos-lyx/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-09-07T01:00" itemprop="dateModified">Actualizado el domingo, 07 de septiembre de 2014 a las 01:00 UTC</span></div><div><span>
Etiquetado como
blog-stack, planeta-linux, planeta-codigo, <a href="/label/software"><span itemprop="articleSection">software</span></a>, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, planeta-arch-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right; text-align: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/lyx.png" alt="LyX" title="LyX" />
 <br /> 
</div> 
<p>Hace unos d&iacute;as publiqu&eacute; una <a href="http://picodotdev.github.io/blog-bitix/2014/08/actualizacion-del-libro-plugin-tapestry/">nueva edici&oacute;n del libro PlugIn Tapestry</a>, sobre el framework <a href="http://tapestry.apache.org">Apache Tapestry</a> para el desarrollo de p&aacute;ginas y aplicaciones web con Java. En este art&iacute;culo quiero recoger las herramientas que utilic&eacute; para escribirlo y algunas cosas b&aacute;sicas a conocer para tener un libro con un aspecto decente y m&aacute;s prefesional. Son cosas muy b&aacute;sicas pero que a mi me costo un poco poco encontrarlas para conseguir lo que quer&iacute;a, quiz&aacute; a alguien le sirvan.</p> 
<h2>Herramientas</h2> 
<p>Empec&eacute; evaluando la herramienta m&aacute;s adecuada para escribir el libro, en un principio empec&eacute; con <a href="https://docs.google.com/">Google Docs</a>, tambi&eacute;n con <a href="http://www.libreoffice.org/">LibreOffice</a>, sin embargo, al final descubr&iacute; <a href="http://www.lyx.org/">LyX</a> y fu&eacute; el que emple&eacute;. &iquest;Por que LyX? Porque al contrario de Google Docs y LibreOffice que son procesadores de textos LyX es un procesador de documentos &iquest;que significa esto? Que con LyX te centras casi exclusivamente en escribir el contenido del libro no de estar formate&aacute;ndolo. Como procesador de documentos hace que no tengas tanto control sobre los estilos pero a la vez hace que todo el libro tenga un formato homog&eacute;neo y no tengas que &laquo;microgestionar&raquo; el estilo de cada elemento, en un documento grande de m&aacute;s de 250 p&aacute;ginas es muy &uacute;til y te evita casi todo el trabajo de mantener la coherencia en los estilos, ahorr&aacute;ndole a uno mucho tiempo.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-plugin.png" title="LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-plugin-thumb.png" /></a> 
</div> 
<h2>LyX</h2> 
<p>LyX es una herramienta que funciona excelentemente, mucho mejor que LibreOffice seg&uacute;n mi experiencia y tiene m&aacute;s posibilidades que Google Docs. LyX tiene varias funcionalidades que nos ser&aacute;n muy &uacute;tiles como la creaci&oacute;n de &iacute;ndices (tambi&eacute;n para figuras, cuadros, …), inclusi&oacute;n de figuras y referencias que permiten a un t&eacute;rmino hacer referencia a otra parte del libro, inlcuir los listados de c&oacute;digo en archivos externos, …</p> 
<p>Una de las primeras cosas que deberemos hacer es indicarle a LyX la clase de documento que pretendemos escribir a partir del cual se establecer&aacute;n los estilos y opciones que LyX nos ofrecer&aacute;, tambi&eacute;n las secciones que dispondremos. Con la clase de documento book tendremos secciones numeradas y no numeradas, la diferencia es que adem&aacute;s de unas tener numeraci&oacute;n y otras no es que las numeradas aparecer&aacute;n en el &iacute;ndice y las no numeradas no. Para ello seleccionamos Documento &gt; Configuraci&oacute;n.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-configuracion-documento.png" title="Configuraci&oacute;n documento, LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-configuracion-documento-thumb.png" /></a> 
</div> 
<p>Entre las mismas opciones podemos seleccionar las tipograf&iacute;as, el dise&ntilde;o de la p&aacute;gina (A4, A5, …), los m&aacute;rgenes y una parte importe donde podremos modificar varios aspectos del documento, el pre&aacute;mbulo LaTeX, lo dif&iacute;cil de esta secci&oacute;n es saber cuales son las opciones podemos escribir en &eacute;l pero si necesitamos modificar algo probablemente debamos insertarlo en esta secci&oacute;n. Un posible contenido es el siguiente donde defino y modifico el color de los hiperenlaces del libro y las opciones por defecto de los listados.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-preambulo-latex.png" title="Configuraci&oacute;n documento, LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-preambulo-latex-thumb.png" /></a> 
</div> 
<p></p>
<div>
 <script src="https://gist.github.com/picodotdev/ba7ab60851eb904ee8ac.js?file=preamble.tex"></script> 
 <noscript>
  <pre><code>\usepackage{listings}

\definecolor{tapestry}{RGB}{86, 157, 2}
\definecolor{gris}{RGB}{200, 200, 200}

\lstset{language=java,tabsize=4,breaklines=true,frame=single,rulecolor={\color{gris}}}

\hypersetup{linkcolor=tapestry,citecolor=tapestry,urlcolor=tapestry}</code></pre>
 </noscript>
</div> 
<p></p> 
<p>Otras opciones deberemos incluirlas como c&oacute;digo Tex al principio (Insertar &gt; C&oacute;digo Tex) del documento, para establecer cu&aacute;l es la palabra a emplear para nombrar los cap&iacute;tulos, figuras y listados que por defecto aparecer&aacute;n en ingl&eacute;s en vez de espa&ntilde;ol (Chapter 1 en vez de Cap&iacute;tulo 1). Este es el primer recuadro en rojo de la imagen LyX.</p> 
<p>Con LyX si necesitamos reorganizar los cap&iacute;tulos o secciones es muy simple, para ello abrimos el panel del esquema, seleccionamos la secci&oacute;n o cap&iacute;tulo y pulsamos sobre las flechas de ordenaci&oacute;n.</p> 
<h2>Fuente del documento</h2> 
<p>Podemos modificar la fuente del documento en Documento &gt; Configuraci&oacute;n &gt; Tipograf&iacute;as. La fuente del elemento Romana ser&aacute; la que se use para la mayor&iacute;a de elementos del documento.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-tipografias.png" title="Tipograf&iacute;as, LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-tipografias-thumb.png" /></a> 
</div> 
<h2>Encabezados y pies de p&aacute;gina</h2> 
<p>En Documento &gt; Configuraci&oacute;n &gt; Dise&ntilde;o de p&aacute;gina podemos establecer si queremos encabezados y pies de p&aacute;gina en los que se incluye el n&uacute;mero de p&aacute;gina. Tenemos a nuestra disposici&oacute;n de varios tipos.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-diseno-pagina.png" title="Tipograf&iacute;as, LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/lyx-diseno-pagina-thumb.png" /></a> 
</div> 
<h2>Referencias</h2> 
<p>Las referencias permiten hacer referencia a otra parte del documento donde el concepto est&eacute; explicado de forma m&aacute;s completa. Las referencias son creadas en dos pasos, primero toda secci&oacute;n del documento a la que queramos hacer referencia deberemos asignarle una etiqueta Insertar &gt; Etiqueta.</p> 
<p>Una vez que disponemos la etiqueta podemos insertar una referencia a ella en cualquier otra parte del documento con Insertar &gt; Referencia cruzada. Disponemos de varios formatos para la referencia como texto al que hace la referencia o como la p&aacute;gina en la que se encuentra.</p> 
<h2>Listados de c&oacute;digo</h2> 
<p>Si el libro versa sobre un t&eacute;ma t&eacute;cnico y queremos mostrar listados de c&oacute;digo tenemos dos opciones incrustar el c&oacute;digo dentro del texto en LyX o hacer que se incluyan desde un archivo externo. En mi caso prefiero la segunda ya que de este modo si en alg&uacute;n momento queremos hacer alguna correcci&oacute;n a alg&uacute;n listado me parece m&aacute;s f&aacute;cil hacerlo en el archivo externo que en el propio LyX, adem&aacute;s el documento LyX queda m&aacute;s sencillo que con listados de c&oacute;digo.</p> 
<p>Para insertar un listado de c&oacute;digo como documento externo debemos usar la opci&oacute;n Insertar &gt; Archivo &gt; Documento hijo, seleccionamos el archivo, en tipo de inclusi&oacute;n seleccionamos Listado de c&oacute;digo y con el par&aacute;metro language=Java podemos hacer que LyX proporcione resaltado de sintaxis seg&uacute;n el lenguaje del listado, en este caso Java.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/listado-codigo.png" title="Listados de c&oacute;digo"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/listado-codigo-thumb.png" /></a> 
</div> 
<h2>Portada</h2> 
<p>Con LyX no podremos crear una portada atractiva dado lo limitado que estamos para modificar los estilos. Sin embargo, podemos incluir las p&aacute;ginas de un pdf externo a nuestro ducmento LyX. Este pdf externo lo podemos crear con la herramienta que queramos LibreOffice o Inskape. Con la opci&oacute;n Insertar &gt; Archivo &gt; Material externo podemos insertar todas las p&aacute;ginas del documento o solo las que queramos.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/libreoffice-plugin.png" title="Tipograf&iacute;as, LyX"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/41/libreoffice-plugin-thumb.png" /></a> 
</div> 
<h2>Corrector ortogr&aacute;fico</h2> 
<p>Parte de la revisi&oacute;n consiste en corregir los posibles fallos ortogr&aacute;ficos que cometamos, LyX incluye un corrector ortogr&aacute;fico. Para hacer uso de &eacute;l deberemos instalar los diccionarios, en <a href="https://wiki.archlinux.org">Arch Linux</a> instalaremos los paquetes aspell y aspell-es. Una vez instados podemos hacer uso del corrector con Herramientas &gt; Corrector ortogr&aacute;fico, una vez iniciada la revisi&oacute;n podremos ir corrigiendo las palabras que no se encuentren en el diccionario.</p> 
<h2>Versiones en formato de libro electr&oacute;nico (pdf, epub y mobi)</h2> 
<p>En un principio no lo tuve en cuenta pero con LyX es posible generar muy f&aacute;cilmente adem&aacute;s de la versi&oacute;n pdf, la versi&oacute;n epub y mobi del libro con la ayuda de <a href="http://calibre-ebook.com/">Calibre</a>. La versi&oacute;n de libro electr&oacute;nico en formato epub y mobi es muy &uacute;til para los usuarios que posean un lector de ebooks como el Kindle o cualquier otro, el pdf tambi&eacute;n se puede leer en un ebook pero una p&aacute;gina del pdf no entrar&aacute; de forma completa en la pantalla y obligaremos al usuario a hacer varios cambios de p&aacute;gina.</p> 
<p>Una vez que tenemos nuestro documento podemos exportarlo a diferentes formatos, uno de ellos es pdf para ello seleccionamos la opci&oacute;n Archivo &gt; Export &gt; PDF (LuaTeX). Para las versiones en libro electr&oacute;nico deberemos exportar primeramente a formato LyXHTML una vez tenemos el libro en este formato comprimimos en un archivo zip todos los archivos que forman parte del libro (los genera en la misma ubicaci&oacute;n del archivo .lyx). Este zip lo importamos en nuestra biblioteca de Calibre y a continuaci&oacute;n lo empleamos para hacer la conversi&oacute;n a formato epub y luego a mobi. Con esto ya tenemos la versi&oacute;n en formato electr&oacute;nico de nuestro libro que podr&aacute; ser le&iacute;do de forma m&aacute;s c&oacute;moda en un libro electr&oacute;nico.</p> 
<p>Con LyX le podemos ofrecer al usuario la versi&oacute;n del libro que prefiera sin mucho trabajo por nuestra parte.</p> 
<h2>Revisi&oacute;n, difusi&oacute;n y publicidad</h2> 
<p>Para finalizar dir&eacute; que escribir un libro es un trabajo que consume mucho tiempo y esfuerzo y aunque parezca que no escribir el contenido del libro puede no ser la parte m&aacute;s costosa, revisarlo me cost&oacute; tanto como escribirlo as&iacute; como el hacer la aplicaci&oacute;n con los ejemplos, la p&aacute;gina en la que la alojar&iacute;a y el marketing para darlo a conocer lo m&aacute;ximo posible public&aacute;ndolo en webs en las que sus usuarios podr&iacute;an estar interesados, en este caso en <a href="http://www.javahispano.org/">JavaHispano</a>, <a href="http://barrapunto.com/">Barrapunto</a>, en este blog y en los varios planetas en los que este blog puede publicar sus entradas.</p> 
<p>Referencia:<br /> <a href="http://elpinguinotolkiano.wordpress.com/latexxetexlyx/">Introducci&oacute;n a LaTeX/XeTeX/LyX</a></p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx" st_title="Procesador de documentos LyX | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "Procesador de documentos LyX";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2014/09/procesador-de-documentos-lyx/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 876,
      "url" : "http://www.blogstack.info/post/blogbitix/2014/09/procesador-de-documentos-lyx"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>