<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256"><span itemprop="headline">Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software"><img title="software" alt="software" src="/assets/images/labels/software.png"/></a><a class="label" href="/label/hardware"><img title="hardware" alt="hardware" src="/assets/images/labels/hardware.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Gaspar Fernández</span> en la bitácora <a href="http://totaki.com/poesiabinaria/">Poesía binaria</a>, <a href="http://totaki.com/poesiabinaria/2015/02/256-un-hito-en-el-blog-me-gusta-en-la-pagina-de-facebook/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-02-05T09:50" itemprop="datePublished">Publicado el jueves, 05 de febrero de 2015 a las 09:50 UTC</span></div><div><span>
Etiquetado como
gif, curioso, facebook, paleta, formatos, graficos, particion, microcomputacion, 256, numero, curiosidades, <a href="/label/hardware"><span itemprop="articleSection">hardware</span></a>, informatica, <a href="/label/software"><span itemprop="articleSection">software</span></a>, aleman, ascii, c-c, humor-tonterias, arabe, cosas-que-damos-por-hechas, hechos, egipto, potencias, hexadecimal, moviles, ram, comunicacion, estadisticas</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3RvdGFraS5jb20vcG9lc2lhYmluYXJpYS93cC1jb250ZW50L3VwbG9hZHMvMjAxNS8wMi9TY3JlZW5zaG90LTA1LTAyLTIwMTUtMDAwMjE3LnBuZw=="><img title="Screenshot 05-02-2015-000217" src="http://totaki.com/poesiabinaria/wp-content/uploads/2015/02/Screenshot-05-02-2015-000217-745x311.png" alt="" width="745" height="311" /></a></p> 
<p>Es un momento interesante y curioso en la historia del blog. Ya no puedo almacenar el n&uacute;mero de likes de Facebook en un byte.</p> 
<p>Pues los egipcios, utilizaban 256 / 81 como aproximaci&oacute;n del n&uacute;mero PI (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL21pbW9zYS5wbnRpYy5tZWMuZXMvamdvbWV6NTMvbWF0ZW1hL2Nvbm9jZXIvbnVtcGkuaHRt">+info</a>)</p> 
<p>Tal vez sea por la forma de sus d&iacute;gitos, por su sonido al pronunciarse (personalmente me gusta m&aacute;s el 256 que el 512) o que es el n&uacute;mero de combinaciones que se pueden formar con la unidad m&iacute;nima de memoria direccionable en la mayor&iacute;a de las arquitecturas de computadoras actuales. Y aunque es peque&ntilde;o para algunas cosas, es lo suficientemente grande para otras. </p> 
<p>Por ejemplo, para escribir un mensaje (en ingl&eacute;s), se necesitan 26 letras, est&aacute; bien, si basamos nuestros sistemas en potencias de 2, tenemos que 2<sup>4</sup> = 16 y no es suficiente, pero 2<sup>5</sup> = 32 con lo que nos sobrar&iacute;an caracteres, para poder representar espacios, el s&iacute;mbolo del d&oacute;lar (porque al final la inform&aacute;tica no hubiera evolucionado si no se pudieran hacer negocios), punto, coma… aunque no cabr&iacute;an los n&uacute;meros, como m&iacute;nimo y a ojo tendremos unos 50 s&iacute;mbolos, pero 2<sup>6</sup> = 64 por lo que habr&iacute;a suficiente. Aunque a poco que lo utilicemos un poco, necesitaremos algunos caracteres de control (para validar mensajes, separarlos, confirmarlos, y algo m&aacute;s, s&iacute;mbolos matem&aacute;ticos (+, -, /, %, *, =, (, ), [, ]…), el mismo alfabeto en min&uacute;sculas (porque todo may&uacute;sculas es dif&iacute;cil de leer y todo min&uacute;sculas queda feo), as&iacute; que subimos un bit m&aacute;s, 2<sup>7</sup> son 128 caracteres (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VzLndpa2lwZWRpYS5vcmcvd2lraS9BU0NJSQ==">ASCII</a>!)… y con eso pudimos sobrevivir algunos a&ntilde;os, aunque los espa&ntilde;oles queremos escribir bien (con tildes, &iexcl;y tener &Ntilde;!), los franceses quieren su &ccedil; y los alemanes su &szlig;, pues subimos un bit m&aacute;s (2<sup>8</sup> = 256, <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VzLndpa2lwZWRpYS5vcmcvd2lraS9BU0NJSV9leHRlbmRpZG8=">ASCII extendido</a>). Aunque hubo muchas codificaciones de 256 caracteres (pensemos en chinos, rusos, &aacute;rabes, etc que tambi&eacute;n tienen ordenador), aunque en la actualidad tenemos codificaciones multi-byte que no se limitan a 256 s&iacute;mbolos. Adem&aacute;s, es m&aacute;s f&aacute;cil trabajar con 2<sup>8</sup> que con 2<sup>7</sup> o 2<sup>9</sup>, porque ya puestos, un byte pod&iacute;a haber terminado siendo m&aacute;s grande, de hecho algunos sistemas no lo tienen de 8bits, pero es m&aacute;s f&aacute;cil trabajar con este n&uacute;mero, que nos permite hacer hasta las cuentas de cabeza con un poco de pr&aacute;ctica.</p> 
<p>256 = 2<sup>8</sup> = 4<sup>4</sup> = 8<sup>3</sup> = 16<sup>2</sup> = ((2<sup>2</sup>)<sup>2</sup>)<sup>2</sup><br /> Y si cambiamos de base<br /> 256<sub>10</sub> = 100000000<sub>2</sub> = 400<sub>8</sub> = 100 <sub>16</sub></p> 
<p>Como su representaci&oacute;n binaria contiene un n&uacute;mero impar de unos, se llama tambi&eacute;n n&uacute;mero odioso, si tuviera un n&uacute;mero par, ser&iacute;a un n&uacute;mero malvado.</p> 
<p><a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3RvdGFraS5jb20vcG9lc2lhYmluYXJpYS93cC1jb250ZW50L3VwbG9hZHMvMjAxNS8wMi8xMjQ3Ny5wYWNfbWFuXzI1Ni5ub3RfLmpwZw=="><img src="http://totaki.com/poesiabinaria/wp-content/uploads/2015/02/12477.pac_man_256.not_-500x500.jpg" alt="" title="12477.pac_man_256.not" width="500" height="500" /></a>256 es el nivel que s&oacute;lo Chuck Norris se ha pasado del Pacman. Aunque se supon&iacute;a que el juego deber&iacute;a ser infinito (de hecho si te lo pasas empiezas por el nivel 0), pero a ver qui&eacute;n lo consigue.<br /> Otros juegos que sufrieron cosas parecidas son <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9EaWdfRHVn">Dig Dug</a> cuya fase 256 no se pod&iacute;a jugar o <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9HYWxhZ2E=">Galaga</a> (secuela del Galaxian). Aunque hay cientos de juegos cl&aacute;sicos en los que no puedes tener m&aacute;s de 255 vidas(En <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2l0Lndpa2lwZWRpYS5vcmcvd2lraS9TdXBlcl9NYXJpb19Ccm9zLg==">Super Mario Bros</a>, el m&aacute;ximo son 255 vidas)/objetos/dinero(En The Legend Of Zelda, puedes tener como mucho 255 rupias)/256km por hora de velocidad en juegos de coches…</p> 
<p>Como en esos juegos, 256 era un valor permisible para las vidas por ejemplo (es dif&iacute;cil que logremos tener 256 vidas), pero dada la limitada memoria que ten&iacute;an los sistemas de la &eacute;poca (para este tipo de datos se ten&iacute;a un espacio muy limitado), se aprovechaba todo al m&aacute;ximo.</p> 
<p>En muchos sistemas (antiguos o microcomputadores), los arrays tienen un l&iacute;mite de 256 elementos (del 0 al 255) porque al tener un bus peque&ntilde;o no cabe mucha informaci&oacute;n y se destinan 8 bits solamente para el direccionamiento del valor que ponemos entre los corchetes [].</p> 
<p>Siguiendo con microcomputaci&oacute;n, algunos chips tienen un reloj que se reinicia cada 256 segundos, en este caso, si queremos m&aacute;s, debemos controlarlo a mano, ya que podremos detectar cu&aacute;ndo el reloj cambia de 255 a 0, aunque el control del tiempo ya no ser&aacute; at&oacute;mico (necesitaremos gastar varios ciclos para controlarlo).</p> 
<p>Los juegos de Sega Master System, ocupaban como m&aacute;ximo 256Kb, imaginad c&oacute;mo pudieron meter el Sonic en tan poca memoria.</p> 
<p>Si nos vamos a sistemas un poco m&aacute;s grandes, podemos ver que muchos de los m&oacute;viles de finales de los 90 y primeros de los 00 ten&iacute;an una agenda de alrededor de 256 contactos o 256 contactos. Si hab&iacute;a memoria dedicada a los contactos, pod&iacute;amos tener 256 contactos, pero si no, la memoria pod&iacute;a estar organizada en 256 bloques (o slots), de los cuales casi todos ser&iacute;an para los contactos (pero pronto las necesidades de los usuarios fueron algo m&aacute;s que la agenda y empezaron a meter memoria en bytes en lugar de gestionarla por slots.</p> 
<p>Las primeras <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VzLndpa2lwZWRpYS5vcmcvd2lraS9SYXNwYmVycnlfUGk=">Raspberry Pi</a> (modelo A y los primeros modelos B) ten&iacute;an 256Mb de RAM.</p> 
<p>Ahora en el terrenos de los discos duros SSD, &eacute;stos por lo general escriben en bloques de 4Kb, pero cuando se trata de borrar, deben borrar 64 bloques a la vez, en total 256Kb, bueno hay muchos modelos de SSD, pero &eacute;ste es el l&iacute;mite t&iacute;pico (aunque no el de mi disco duro).</p> 
<p>Es el tama&ntilde;o t&iacute;pico en bits de las claves criptogr&aacute;ficas <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9BZHZhbmNlZF9FbmNyeXB0aW9uX1N0YW5kYXJk">AES</a>. O los hashes <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9TSEEtMg==">SHA-256</a> (el n&uacute;mero lo dice ya).</p> 
<p>Tambi&eacute;n es el n&uacute;mero t&iacute;pico de colores que se utilizan t&iacute;picamente en cada canal de color en una imagen. Los valores que puede tomar cada color o el canal alfa (transparencia) est&aacute; comprendido entre 0 y 255 (en total 256). Cuando representamos un color en HTML (o CSS), normalmente, lo hacemos con la notaci&oacute;n hexadecimal, #RRGGBB (dos letras representan el rojo, otras dos el verde y otras dos el azul). Cada uno de los canales tiene valores comprendidos entre 00 y FF.</p> 
<p>Es la limitaci&oacute;n de muchos programas, sobre todo antiguos, porque antiguamente, aunque no lo parezca no desaprovech&aacute;bamos un int para un contador hasta 100; aunque tambi&eacute;n sistemas nuevos que necesitan economizar para aprovechar espacio (si tenemos que aprovechas 100 millones de datos y desaprovechamos 3 bytes en cada dato, ya son 300Mb. Por eso muchos l&iacute;mites son de 256 elementos o 255 + c&oacute;digo de control:</p> 
<ul>
 <li>MS Excel, en su antiguo formato XLS s&oacute;lo soportaba 256 columnas y 256 hojas. Entre otros l&iacute;mites (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3d3dy5leGNlbGxlbnRpYXMuY29tL3R1dG9yaWFsLWVzcGVjaWZpY2FjaW9uZXMteS1saW1pdGVzLWRlLWV4Y2VsLw==">m&aacute;s info</a>)</li> 
 <li>Altura m&aacute;xima que se puede alcanzar en Minecraft.(<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3dpa2ltaW5lY3JhZnQuZXMvU2VydmVyLnByb3BlcnRpZXM=">Fuente</a>). (Seg&uacute;ramente con alg&uacute;n mod se pueda cambiar)</li> 
 <li>Longitud m&aacute;xima de los nombres de archivo en muchos de los sistemas de archivos actuales</li> 
 <li>Antes de MySQL 5.0.3, la longitud de un tipo de dato VARCHAR estaba comprendida entre 0 y 255 (255+terminador=256). Los tipos CHAR siguen limitados a 255. Eso s&iacute;, si utilizamos en VARCHAR un valor + info). Y como no es algo espec&iacute;fico de MySQL, sino que otros motores de base de datos tambi&eacute;n hacen algo parecido, esto supone una limitaci&oacute;n para todos los programas que trabajan sobre este tipo de bases de datos (aunque a veces tenemos m&aacute;s que suficiente, es s&oacute;lo por quejarnos).</li> 
 <li>L&iacute;mite de 256Kb en tarjetas y grupos de contacto en iCloud (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3N1cHBvcnQuYXBwbGUuY29tL2VuLXVzL0hUMjAyMTU4">+info</a>)</li> 
 <li>Tama&ntilde;o de los enlaces que podemos abrir en Outlook 2003 (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cHM6Ly9zb2NpYWwudGVjaG5ldC5taWNyb3NvZnQuY29tL0ZvcnVtcy9vZmZpY2UvZW4tVVMvYmZiYWYxNDYtNWY0OC00MmNjLTgxNzItNDFlYjdiZTJlNTk1L291dGxvb2stMjAxMC13aGF0LWlzLXRoZS1jaGFyYWN0ZXItbGltaXQtZm9yLWEtbGluay10by1vcGVuP2ZvcnVtPW91dGxvb2s=">+info</a>)</li> 
 <li>Los registros SPF no pueden tener cadenas mayores de 255 caracteres. Si necesitas m&aacute;s, crea varias cadenas.</li> 
 <li>El tama&ntilde;o m&aacute;ximo de los nombres de dominio (sub.sub.sub.dominio.ext) es de 255 bytes. (<a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL3Rvb2xzLmlldGYub3JnL2h0bWwvcmZjMTAzNQ==">+info</a>)</li> 
 <li>En Blender, un personaje no puede tener m&aacute;s de 255 huesos (bones), no s&eacute; si habr&aacute; cambiado esto)</li> 
</ul>
<p>El tama&ntilde;o m&aacute;ximo que puede tener una partici&oacute;n <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9aRlM=">ZFS</a> (256 zebibytes = 2<sup>70</sup>)<br /> Es el n&uacute;mero de colores m&aacute;ximo que utilizan muchos formatos gr&aacute;ficos basados en paleta de colores, por ejemplo el formato <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9HSUY=">gif</a>, por lo que las im&aacute;genes son matrices de un s&oacute;lo n&uacute;mero de 8bits y en otro lugar almacenar&aacute;n la equivalencia entre ese &iacute;ndice y los componentes rojo, verde y azul del color. Bueno, antiguamente los modos gr&aacute;ficos funcionaban as&iacute;, nada de ver simult&aacute;neamente 16 millones de colores (256<sup>3</sup>), la tarjeta gr&aacute;fica manten&iacute;a una paleta y cada pixel hac&iacute;a referencia al &iacute;ndice de esa paleta. Aunque se notaba mucho cuando se representaban fotograf&iacute;as (las cuales se optimizaban mucho para entrar en 256 colores), hab&iacute;a verdaderas obras de arte para tener tan pocos colores.</p> 
<p>Es el n&uacute;mero de combinaciones que puede tener un n&uacute;mero de una direcci&oacute;n IPv4 (entre 0 y 255).</p> 
<p>Y por &uacute;ltimo, el <a href="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?url=aHR0cDovL2VuLndpa2lwZWRpYS5vcmcvd2lraS9Qcm9ncmFtbWVycyUyN19EYXk=">d&iacute;a del programador</a> se celebra el d&iacute;a 256 del a&ntilde;o (13 de septiembre, 12 de septiembre en a&ntilde;os bisiestos). </p> 
<div>
 <iframe src="http://www.facebook.com/plugins/like.php?href=http%3A%2F%2Ftotaki.com%2Fpoesiabinaria%2F2015%2F02%2F256-un-hito-en-el-blog-me-gusta-en-la-pagina-de-facebook%2F&amp;layout=standard&amp;show_faces=true&amp;width=500&amp;action=like&amp;font=segoe+ui&amp;colorscheme=light&amp;height=80" scrolling="no" frameborder="0" style="border:none; overflow:hidden; width:500px; height:80px;"></iframe>
</div> 
<img src="http://totaki.com/poesiabinaria/wp-content/plugins/wordpress-feed-statistics/feed-statistics.php?view=1&amp;post_id=2482" width="1" height="1" style="display: none;" />
<p>La entrada <a href="http://totaki.com/poesiabinaria/2015/02/256-un-hito-en-el-blog-me-gusta-en-la-pagina-de-facebook/">Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256</a> aparece primero en <a href="http://totaki.com/poesiabinaria">Poes&iacute;a Binaria</a>.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256" st_title="Un hito en el blog 256 = 2^8 Me gusta en Facebook y otras cosas del 256 | Poesía binaria"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/hardware/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta hardware</a></li><li><a href="/label/software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1429,
      "url" : "http://www.blogstack.info/post/poesiabinaria/2015/02/un-hito-en-el-blog-256-2-8-me-gusta-en-facebook-y-otras-cosas-del-256"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "poesiabinaria",
      "name" : "Poesía binaria"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>