<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>El lado oscuro de los gestores de paquetes | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes"><span itemprop="headline">El lado oscuro de los gestores de paquetes</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/K9UKqsQGjb8/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-07-14T09:06" itemprop="datePublished">Publicado el lunes, 14 de julio de 2014 a las 09:06 UTC</span></div><div><span>
Etiquetado como
development, software-development</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Hace no tanto tiempo (aunque en la escala de internet pueda parecer siglos) gestionar las dependencias de un proyecto era algo relativamente complicado o, al menos, laborioso. </p> 
<p>En aquellos lejanos y oscuros tiempos, para incluir en tu proyecto, por ejemplo, NHibernate, deb&iacute;as buscar la p&aacute;gina de descarga correspondiente, elegir la versi&oacute;n correcta para tu versi&oacute;n de .NET, buscar posibles dependencias (log4net, Castle.DynamicProxy, etc.), cruzar los dedos para que estuvieran en el zip que te hab&iacute;as descargado de la p&aacute;gina de NHibernate y, si no estaban, empezar a buscarlos en sus respectivas p&aacute;ginas de descarga, asegur&aacute;ndote de bajar las versiones exactas que necesitabas para NHibernate y rezando para que no hubiera colisiones entre unas versiones y otras, especialmente si hab&iacute;a alg&uacute;n assembly firmado (recuerdo con especial “cari&ntilde;o” log4net y sus versiones 1.2.9 y 1.2.10). Finalmente copiabas todo con mucho cuidado en una carpeta <code>.\lib</code> al lado de los fuentes de tu proyecto y lo a&ntilde;ad&iacute;as a tu sistema de control de c&oacute;digo fuente (subversion si ten&iacute;as suerte, Visual Source Safe si no). Vamos, todo muy r&aacute;pido, divertido y agradable.</p> 
<p>Por suerte hoy en d&iacute;a pr&aacute;cticamente todas las plataformmas de desarrollo cuentan con gestores de paquetes para realizar esta gesti&oacute;n de dependencias y, lo que es m&aacute;s importante, se han convertido en la manera “oficial” y habitual de instalarlas. En realidad todo esto de los gestores de paquetes no es algo nuevo, existen desde hace mucho tiempo, pero en algunas plataformas como .NET su popularidad es relativamente reciente (que Microsoft publicase NuGet fue clave en una comunidad que hab&iacute;a ignorado antes intentos como <a href="http://www.openwrap.org/">OpenWrap</a> o <a href="http://thesoftwaresimpleton.blogspot.com.es/2009/04/horn-package-manager-introduction.html">Horn</a>).</p> 
<p>Utilizando un gestor de paquetes, todo el proceso de descarga e instalaci&oacute;n de una dependencia que describ&iacute;a antes se reduce a algo como:</p> 
<pre>
npm install underscore
</pre> 
<p>As&iacute; de simple. Con s&oacute;lo un comando el gestor de paquetes se conectar&aacute; a un servidor que contiene un &iacute;ndice con los paquetes publicados y se descargar&aacute; el paquete seleccionado, ejecutar&aacute; los scripts de instalaci&oacute;n adecuados y har&aacute; lo mismo recursivamente con las dependencias del paquete indicado.</p> 
<p>Adem&aacute;s, estos paquetes que has instalado quedan registrados en un fichero de configuraci&oacute;n asociado al proyecto, por lo que existe un punto centralizado en el que revisar qu&eacute; dependencias tienes instaladas y con qu&eacute; versiones.</p> 
<p>Visto as&iacute;, es innegable que <strong>los gestores de paquetes suponen un gran avance</strong> para el desarrollo de software facilitando la gesti&oacute;n de dependencias y seguramente sean uno de los motivos por los cuales hoy en d&iacute;a se utilizan cada vez m&aacute;s componentes externos (muchos de ellos open source) en todo tipo de proyectos.</p> 
<h3>Cuidado con las dependencias que asumes</h3> 
<p>Desgraciadamente esta facilidad de uso tambi&eacute;n tiene puede tener consecuencias negativas y es importante tenerlas en cuenta. </p> 
<p>Al ser tan sencillo a&ntilde;adir nuevas dependencias a un proyecto, es habitual encontrar proyectos con decenas de dependencias externas, cada una de ellas con sus propias dependencias. Esto no es algo malo en si mismo, a fin de cuentas, &iquest;para qu&eacute; reinventar la rueda?, pero no hay que olvidar que <strong>cada dependencia que asumes en un proyecto es una dependencia que tienes que mantener</strong>.</p> 
<p>Es tan f&aacute;cil a&ntilde;adir un nuevo paquete que a veces, en lugar de implementar una funci&oacute;n de 10 l&iacute;neas de c&oacute;digo, se acaba asumiendo una dependencia sobre una librer&iacute;a de miles de l&iacute;neas de c&oacute;digo para usar s&oacute;lo esa funci&oacute;n. El utilizar una librer&iacute;a externa, probada y ampliamente usada proporciona una sensaci&oacute;n de seguridad que no siempre es real y, cuando se produce un problema, bien porque hay un bug en esa librer&iacute;a o porque hay problemas de compatibilidad entre dos librer&iacute;as que estamos utilizando, depurarlo puede ser bastante complicado.</p> 
<p>Cuando aparece un problema, no sirve de nada decir “el problema no est&aacute; en mi c&oacute;digo sino en la versi&oacute;n 1.9.10 de jQuery, yo no tengo la culpa”. De cara a tus usuarios y tus clientes, <strong>lo que no funciona es tu aplicacion</strong>, esa por la que ellos han pagado. Al final tienes que responder no s&oacute;lo por tu c&oacute;digo sino por el de todas las dependencias que est&aacute;s utilizando.</p> 
<p>Esto no quiere decir que no haya que utilizar librer&iacute;as externas. Igual que no tiene mucho sentido ponerte a escribir tu propio servidor web y es m&aacute;s razonable usar IIS, Apache o lo que m&aacute;s te guste, no merece la pena invertir tiempo en escribir tu propio ORM cuando hay alternativas perfectamente v&aacute;lidas.</p> 
<p>Lo que s&iacute; es necesario es ser consciente de que cada dependencia que asumes tiene un precio. Cuando programamos, si vemos una clase que recibe 12 par&aacute;metros en el constructor lo consideramos como algo problem&aacute;tico (o al menos algo que requiere cierta justificaci&oacute;n), porque sabemos que esa clase tiene demasiadas dependencias, lo que aumenta su acoplamiento con el resto del sistema y complica su futuro mantenimento. Pues con las dependencias de los proyectos pasa algo parecido. Si un proyecto depende de 12 paquetes distintos, estamos introduciendo 12 puntos de problemas potenciales, por lo que m&aacute;s nos vale ser conscientes de ellos y tener un buen motivo para hacerlo.</p> 
<h3>Recuperaci&oacute;n autom&aacute;tica de paquetes</h3> 
<p>Todos los gestores de paquetes que conozco cuentan con alguna opci&oacute;n para volver a descargarse los paquetes desde un repositorio central. Si record&aacute;is el flujo de trabajo que describ&iacute;a al principio del post, antes era frecuente almacenar los paquetes en alguna carpeta de proyecto e incluirlos en el control de c&oacute;digo fuente junto con nuestro propio c&oacute;digo. Hoy en d&iacute;a, esto no es lo habitual e incluso se considera una <a href="http://aventuraspuntonet.wordpress.com/2014/07/01/malas-practicas-binarios-en-repositorios-de-codigo-fuente/">mala pr&aacute;ctica</a>, puesto que podemos incluir &uacute;nicamente un fichero de configuraci&oacute;n y descargar los paquetes bajo demanda de sus servidores de origen cuando los necesitemos.</p> 
<p>La principal ventaja de esto es que el tama&ntilde;o de nuestro repositorio de c&oacute;digo ser&aacute; mucho menor, especialmente si los paquetes se distribuyen de forma binaria (como es habitual en .NET o Java), que es m&aacute;s dif&iacute;cil de comprimir y de almacenar usando deltas cuando hay cambios de versi&oacute;n. </p> 
<p>En un mundo en el que el almacenamiento en disco es tan barato puede parecer que esto no es importante, pero cuando pensamos en el tr&aacute;fico de red al clonar un repositorio, especialmente con sistemas de control de versiones distribuidos como Git o Mercurial en los que se clona el repositorio completo (y no s&oacute;lo una versi&oacute;n), y en accesos a trav&eacute;s de conexiones a internet en lugar de redes locales, s&iacute; que es un factor a tener en cuenta.</p> 
<p>Como siempre, esto no es gratis y utilizar la recuperaci&oacute;n autom&aacute;tica de paquetes en lugar de almacenar las dependencias en el control de c&oacute;digo fuente tambi&eacute;n tiene sus inconvenientes. Ahora, para poder compilar nuestro proyecto, <strong>dependemos de que el repositorio de paquetes est&eacute; disponible</strong>. Por suerte no es muy habitual que estos repositorios centrales se caigan, pero <a href="https://twitter.com/search?q=nuget down">tampoco es imposible</a>.</p> 
<p>Esto se puede resolver creando un repositorio de paquetes propio, dentro de tu red local, con una copia de los paquetes que usas en tus proyectos. Es una buena opci&oacute;n, especialmente en organizaciones grandes donde compensa aprovechar las ventajas de no incluir las dependencias en el control de c&oacute;digo fuente y se necesitan unas ciertas garant&iacute;as de disponibilidad, pero montar estos servidores requiere algo de tiempo y es una pieza m&aacute;s del sistema a mantener.</p> 
<p>Personalmente, cuando estoy desarrollando un proyecto profesionalmente, siempre incluyo todas las dependencias en el control de c&oacute;digo fuente. En mi escenario concreto, con todos los desarrolladores trabajando en una misma red local, no me compensa el riesgo de tener que lidiar con un servidor externo ca&iacute;do o un paquete eliminado para ahorrarme 10 segundos al clonar un repositorio (operaci&oacute;n que, por otra parte, tampoco es muy frecuente en nuestro caso).</p> 
<h3>Conclusiones</h3> 
<p>Los gestores de paquetes son un gran invento para facilitarnos las cosas al desarrollar aplicaciones porque nos permiten gestionar las dependencias de una manera f&aacute;cil y c&oacute;moda, pero eso no debe hacernos olvidar que cada paquete que instalamos es una dependencia de nuestra aplicaci&oacute;n por la que deberemos responder en el futuro.</p> 
<p>La existencia de servidores centralizados desde los que descargar las dependencias simplifica el acceso a las mismas y puedo ayudarnos a reducir el almacenamiento en disco y el tr&aacute;fico de red, aunque a cambio estaremos introduciendo una dependencia entre nuestros procesos y la disponibilidad de esos servidores, por lo que ser&aacute; necesario valorar si realmente merece la pena.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/K9UKqsQGjb8" height="1" width="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes" st_title="El lado oscuro de los gestores de paquetes | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 688,
      "url" : "http://www.blogstack.info/post/koalite/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>