<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini"><span itemprop="headline">Instalar Cyanogenmod 11 en Galaxy S3 Mini</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/android"><img title="android" alt="android" src="/assets/images/labels/android.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/04/instalar-cyanogenmod-11-en-galaxy-s3.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-10-06T11:44" itemprop="dateModified">Actualizado el lunes, 06 de octubre de 2014 a las 11:44 UTC</span></div><div><span>
Etiquetado como
no-solo-linux, cyanogenmod, <a href="/label/android"><span itemprop="articleSection">android</span></a>, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><b>ATENCI&Oacute;N: para los problemas de bater&iacute;a comentados en este art&iacute;culo, he encontrado una soluci&oacute;n detallada <a href="http://www.lasombradelhelicoptero.com/2014/10/solucionar-problema-de-bateria-en.html">aqu&iacute;</a>.</b> 
<br />
<br />Seguimos con una nueva entrega de la serie &quot;
<a href="http://www.lasombradelhelicoptero.com/2014/04/camino-la-libertad-openmailbox-y.html">Camino a la libertad</a>&quot;, toca ponernos manos a la obra para sacar a mi tel&eacute;fono de la jaula a la que lo someten, al alim&oacute;n, Google y Samsung. Se trata de una vieja aspiraci&oacute;n que nunca me atrev&iacute; a acometer, no ya tanto por lo complejo de la tarea, sino m&aacute;s bien por la posibilidad, siempre presente, de convertir un elemento tan &uacute;til como un tel&eacute;fono m&oacute;vil en un simple pisapapeles de lujo. De ah&iacute; que haya demorado tanto el tema y no me haya lanzado a la piscina hasta tener todos los pasos a realizar completamente claros, sin atisbo de duda. Dos semanas de rebuscar y leer tutoriales de aqu&iacute; y de all&aacute;, ni m&aacute;s ni menos, en las que me ha dado la impresi&oacute;n de que la mayor&iacute;a de problemas que la gente dice sufrir al dar este paso vienen provocados por el seguimiento de instrucciones que no son lo suficientemente precisas y llevan a cometer errores, algunos de ellos, sin soluci&oacute;n posible.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-4Hs114HpGqE/U1p2k58qtRI/AAAAAAAAEd8/1atU1H0Lwek/s1600/CyanogenMod.png"><img src="http://4.bp.blogspot.com/-4Hs114HpGqE/U1p2k58qtRI/AAAAAAAAEd8/1atU1H0Lwek/s1600/CyanogenMod.png" height="320" width="320" /></a>
</div>
<br />
<br />
<a></a>Os adelanto que no ha sido mi caso: ya disfruto de un terminal rejuvenecido, con Cyanogenmod 11 y sin haber usado mi cuenta de Google para nada. Puedo asegurar que el terminal agradece mucho la eliminaci&oacute;n de esa pl&eacute;yade de servicios que, corriendo en segundo plano, ralentizaban la experiencia de uso (la mayor&iacute;a relacionados con Samsung y Google). Servicios que, en la versi&oacute;n est&aacute;ndar de Android, no era posible deshabilitar, ni tampoco desinstalar las aplicaciones que hac&iacute;an uso de ellos.
<br />
<br />Mi terminal es un 
<a href="https://www.samsung.com/es/consumer/mobile-phone/smartphones/galaxy/GT-I8190MBAPHE">Samsung Galaxy S3 Mini</a>, que a&uacute;n pago a plazos a Yoigo (permanencias y dem&aacute;s al margen) y que recientemente se hab&iacute;a actualizado a Jelly Bean 4.1.2. Dicen las malas lenguas que la supuesta actualizaci&oacute;n a KitKat que anunci&oacute; Samsung hace unas semanas para este m&oacute;vil nunca se va a llevar a cabo. En cualquier caso no es el deseo de estar a la &uacute;ltima lo que me mueve a instalar Cyanogenmod, sino el proseguir dando pasos en pos de alcanzar una mayor libertad en el uso del dispositivo. Vamos, pues, a entrar en materia.
<br />
<br />
<b>Descargar aplicaciones necesarias</b>
<br />&iquest;Qu&eacute; necesitamos para instalar Cyanogenmod? Si bien hay alg&uacute;n que otro tutorial por ah&iacute; para hacerlo bajo GNU/Linux, es obvio, por razones de cuota de uso, que la gran mayor&iacute;a se centran en c&oacute;mo realizarlo bajo Windows. Dado que es un asunto delicado y que GNU/Linux y los puertos USB de mi equipo mantienen una relaci&oacute;n un tanto especial (todav&iacute;a hay ocasiones, raras eso s&iacute;, en que el kernel, en Arch y Chakra, no reconoce de inicio alg&uacute;n puerto) decid&iacute; que lo har&iacute;a en mi partici&oacute;n con el sistema de Microsoft. S&iacute;, igual parece un tanto hip&oacute;crita, pero no tengo dinero para reemplazar el terminal en caso de &quot;brickeo&quot;. Qu&eacute; se le va a hacer, tengo que ir sobre seguro.
<br />
<b> </b>
<br />Las aplicaciones en cuesti&oacute;n que necesitamos son:
<br />
<br />- 
<a href="http://techbeasts.com/2013/08/08/download-odin-pc-latest-version-v-3-07/">Odin</a>. Herramienta principal que se encarga de &quot;flashear&quot; las ROMs en nuestro m&oacute;vil.
<br />
<br />- La 
<a href="http://get.maclaw.pl/?id=528">ROM de Cyanogenmod</a>. Existen varias alternativas, tantas como versiones de Android. Yo escog&iacute; la m&aacute;s moderna, basada en KitKat. Es necesario destacar que Cyanogenmod no soporta oficialmente el Galaxy S3 Mini, de modo que se debe emplear una ROM no oficial &quot;cocinada&quot;, en este caso por uno de los mejores y m&aacute;s prolijos &quot;chefs&quot;: 
<a href="http://maclaw.pl/">Maclaw studio</a>. Es un archivo &quot;zip&quot; que habr&aacute; que descomprimir, quedando en formato &quot;tar.md5&quot;.
<br />
<br />- Una 
<a href="http://www.sammobile.com/firmwares/">ROM oficial de Samsung</a>, aquella correspondiente a nuestro operador y modelo, por si acaso algo sale mal o, simplemente, no nos gusta Cyanogenmod una vez instalada y deseamos regresar el tel&eacute;fono a su estado anterior.
<br />
<br />
<b>&iquest;Hace falta ser root?</b>
<br />Har&eacute; especial hincapi&eacute; en este aspecto, pues me cost&oacute; bastante aclarar el concepto durante mis d&iacute;as de estudio del tema. La respuesta es NO. La ROM que vamos a instalar nos convierte autom&aacute;ticamente en &quot;root&quot;, por lo que no tiene sentido &quot;rootear&quot; el dispositivo para, a continuaci&oacute;n, instalarle una ROM &quot;rooteada&quot;. Es una redundancia que tan solo aumenta las posibilidades de que nos equivoquemos en alg&uacute;n paso y la liemos. Por tanto, que quede claro y di&aacute;fano: NO NECESITAMOS SER ROOT PARA INSTALAR CYANOGENMOD.
<br />
<b> </b>
<br />
<b> La instalaci&oacute;n, paso a paso</b>
<br />Una vez contamos con todas las aplicaciones descargadas en el ordenador, es el turno del hardware indispensable: no, no te asustes, se trata &uacute;nicamente del tel&eacute;fono y del cable USB. En algunos tutoriales recomiendan que el cable sea el original que viene con el terminal. Pese a que desconozco el motivo, y no entiendo qu&eacute; diferencia puede haber, por aquello ya comentado del miedo al pisapapeles de lujo, opt&eacute; por dicho cable.
<br />
<br />Es conveniente que la bater&iacute;a del terminal est&eacute; cargada. No voy a aconsejar ninguna cantidad de carga en particular, tan solo apuntar&eacute; que el proceso, en mi caso, apenas si llev&oacute; diez minutos, por lo que tampoco entiendo el motivo por el cual algunos tutoriales aconsejan hasta un 85% de bater&iacute;a... En fin, all&aacute; cada cual.
<br />
<br />1 - Conectar el tel&eacute;fono al ordenador y abrir 
<a href="https://www.samsung.com/es/support/usefulsoftware/KIES/JSP">Samsung Kies</a>. Con este primer paso nos aseguramos de que Windows reconoce perfectamente el terminal e instala los controladores precisos para su funcionamiento.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-1oO2mKaOnh8/U1p3gNS2Y2I/AAAAAAAAEeQ/I9jLDMwUQCU/s1600/Captura+de+pantalla+2014-04-24+10.20.50.png"><img src="http://3.bp.blogspot.com/-1oO2mKaOnh8/U1p3gNS2Y2I/AAAAAAAAEeQ/I9jLDMwUQCU/s1600/Captura+de+pantalla+2014-04-24+10.20.50.png" height="320" width="400" /></a>
</div>
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-2UCjK4jYkH8/U1p3BDzVSkI/AAAAAAAAEeE/1J1Lu95Gbb0/s1600/Captura+de+pantalla+2014-04-24+10.18.58.png"><br /></a>
</div>
<br />2 - Hacer copia de seguridad de los datos. Ya que estamos con el Kies, aprovechemos para salvaguardar nuestros preciados archivos. Si hay un caso en que est&aacute; justificada una copia de seguridad, es &eacute;ste. Los contactos, por su especial relevancia, son tal vez la parte m&aacute;s delicada del proceso. En mi caso, puesto que utilizo 
<a href="http://www.lasombradelhelicoptero.com/2014/04/camino-la-libertad-openmailbox-y.html">ownCloud</a>, los tengo centralizados en la nube y m&aacute;s adelante explicar&eacute; c&oacute;mo recuperarlos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-EQhhDzI04mA/U1p3qev5GFI/AAAAAAAAEeY/3z4uteeUwoY/s1600/Captura+de+pantalla+2014-04-24+10.25.14.png"><img src="http://3.bp.blogspot.com/-EQhhDzI04mA/U1p3qev5GFI/AAAAAAAAEeY/3z4uteeUwoY/s1600/Captura+de+pantalla+2014-04-24+10.25.14.png" height="320" width="400" /></a>
</div>
<br />3 - Cerrar Kies y desconectar el tel&eacute;fono del ordenador. Importante asegurarnos de que Kies se ha cerrado y no est&aacute; minimizado en la bandeja del sistema.
<br />
<br />4 - Una vez el tel&eacute;fono est&aacute; desconectado del ordenador, lo apagamos. A continuaci&oacute;n, lo reiniciamos el modo descarga, pulsando a la vez 3 teclas: volumen abajo, men&uacute; (bot&oacute;n central) y bot&oacute;n de encendido.
<br />
<br />5 - Ejecutamos Odin en el ordenador.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-je6etLdgA9M/U1p9Mjp_kPI/AAAAAAAAEe8/v12S9TV5Iog/s1600/Captura+de+pantalla+2014-04-25+17.09.01.png"><img src="http://4.bp.blogspot.com/-je6etLdgA9M/U1p9Mjp_kPI/AAAAAAAAEe8/v12S9TV5Iog/s1600/Captura+de+pantalla+2014-04-25+17.09.01.png" height="320" width="400" /></a>
</div>
<br />6 - Conectamos el m&oacute;vil al ordenador. Aparecer&aacute; un &quot;0:COM4&quot; (los n&uacute;meros pueden variar) sobre fondo celeste en la casilla ID:COM, y un &quot;Added&quot; en los mensajes. Las &uacute;nicas casillas que deben estar marcadas en Odin son las que vienen as&iacute; por defecto: &quot;Auto Reboot&quot; y &quot;F. Reset Time&quot;.
<br />
<br />7 - Hacemos clic en el bot&oacute;n &quot;PDA&quot;. Se abrir&aacute; una ventana del explorador de archivos para que seleccionemos la ROM ya descomprimida (archivo con formato tar.md5).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Hxuph5Yu-9I/U1p9U4evYeI/AAAAAAAAEfE/YGhh5uM-PNs/s1600/Captura+de+pantalla+2014-04-25+17.10.10.png"><img src="http://1.bp.blogspot.com/-Hxuph5Yu-9I/U1p9U4evYeI/AAAAAAAAEfE/YGhh5uM-PNs/s1600/Captura+de+pantalla+2014-04-25+17.10.10.png" height="320" width="400" /></a>
</div>
<br />8 - Pulsamos el bot&oacute;n &quot;Start&quot; en Odin. Veremos una barra de progreso con el tiempo restante para finalizar. Cuando acabe su tarea, el tel&eacute;fono se reiniciar&aacute; solo y podemos desconectarlo del ordenador.
<br />
<br />9 - Al reiniciar se mostrar&aacute; el logo de Cyanogenmod y el terminal comenzar&aacute; a optimizar las aplicaciones existentes para la nueva versi&oacute;n de Android. En algunos tutoriales recomiendan quitar la bater&iacute;a del m&oacute;vil en este instante. Yo no tuve tiempo de hacerlo, lo &uacute;nico que ocurri&oacute;, tras tratar de optimizar las 155 aplicaciones que ten&iacute;a en mi m&oacute;vil, fue que algunas de ellas se cerraron y punto. Se optimice o no, lo primordial es apagar el terminal, para poder realizar el siguiente paso. 
<br />
<br />10 - Encendemos el tel&eacute;fono en modo &quot;recovery&quot;. La ROM que acabamos de instalar cuenta con la herramienta TWRP Recovery, que nos permitir&aacute; borrar la cach&eacute;, principal fuente de conflictos al actualizar nuestro m&oacute;vil a Cyanogenmod. Para iniciar en este modo, hay que encender el m&oacute;vil pulsando volumen arriba, men&uacute; (bot&oacute;n central) y bot&oacute;n de encendido. No nos asustemos por la cantidad de opciones que aparecen (en ingl&eacute;s), basta pulsar &quot;Wipe cache&quot; (deslizar el bot&oacute;n azul hacia la derecha, nada m&aacute;s), lo que devolver&aacute; el terminal a su estado de f&aacute;brica (&quot;factory reset&quot;), pero con Cyanogenmod 11 en lugar de Android Jelly Bean. A continuaci&oacute;n pulsamos &quot;Reboot&quot; para reiniciar el m&oacute;vil.
<br />
<br />Pues ya est&aacute;, diez sencillos pasos. Tras el primer reinicio, el tel&eacute;fono tardar&aacute; un poco en llegar hasta el men&uacute; (pueden pasar hasta diez minutos, en mi caso, apenas un par). De inmediato se nota que algo ha cambiado, una sensaci&oacute;n parecida a cuando pasamos de Windows a GNU/Linux, pero sin curva de aprendizaje, pues Cyanogenmod es Android, solo que sin encorsetar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Y_WC6Ia8ox8/U1p46nwxFMI/AAAAAAAAEew/u9nUmLVIBP4/s1600/Screenshot_2014-04-25-17-01-20.png"><img src="http://1.bp.blogspot.com/-Y_WC6Ia8ox8/U1p46nwxFMI/AAAAAAAAEew/u9nUmLVIBP4/s1600/Screenshot_2014-04-25-17-01-20.png" height="400" width="240" /></a>
</div>
<br />
<b>Mi m&oacute;vil sin Google</b>
<br />Lo m&aacute;s notable de los primeros d&iacute;as de uso de mi &quot;nuevo&quot; m&oacute;vil es la ausencia de &quot;la gran G&quot; en &eacute;l. Ello implica no instalar la tienda de aplicaciones, si bien esto es una elecci&oacute;n personal y quien as&iacute; lo desee puede hacerlo, obteni&eacute;ndola desde 
<a href="http://get.maclaw.pl/?id=164">aqu&iacute;</a>.
<b> </b>Sin embargo, yo os propongo una alternativa, el binomio 
<a href="https://f-droid.org/">F-Droid</a> + 
<a href="http://apps.evozi.com/apk-downloader/">APK Downloader</a>.
<br />
<br />F-Droid es una tienda de aplicaciones gratuitas y de c&oacute;digo abierto donde podemos encontrar gran cantidad de programas muy &uacute;tiles. Por citar algunos de los que tengo instalados: Firefox, Kdeconnect, Floating Stickies, Duck Duck Go, Telegram, ownCloud...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-ZDBMdcL_jI0/U1p4WbtTrKI/AAAAAAAAEeg/USroj5Th9A0/s1600/Screenshot_2014-04-25-16-07-55.png"><img src="http://1.bp.blogspot.com/-ZDBMdcL_jI0/U1p4WbtTrKI/AAAAAAAAEeg/USroj5Th9A0/s1600/Screenshot_2014-04-25-16-07-55.png" height="400" width="240" /></a>
</div>
<br />Pero claro, no est&aacute;n todas las aplicaciones a las que muchos estamos habituados. Para m&iacute;, por mi trabajo, resulta esencial Whatsapp, por poner un ejemplo. En este caso podemos optar por descargar la aplicaci&oacute;n desde la 
<a href="http://www.whatsapp.com/download/">propia web</a> de la empresa desarrolladora. Para los casos en que esto no sea posible, podemos usar APK Downloader. Esta web funciona generando enlaces de descarga directa a las aplicaciones presentes en Google Play (siempre que no sean de pago, claro) sin tener que pasar por la tienda en s&iacute;. Basta introducir el nombre, que suele comenzar con &quot;com.&quot;, y que podemos averiguar si navegamos hasta Google Play y localizamos la aplicaci&oacute;n en cuesti&oacute;n. Por ejemplo, con Runtastic, como hago en este v&iacute;deo:
<br />
<br />
<div style="clear: both; text-align: center;">
 <object width="420" height="366"><param name="movie" value="//www.youtube.com/get_player"></param><param name="bgcolor" value="#FFFFFF"></param><param name="allowfullscreen" value="true"></param><param name="flashvars" value="flvurl=http://redirector.googlevideo.com/videoplayback?id%3D0feb42815a735951%26itag%3D5%26source%3Dblogger%26app%3Dblogger%26cmo%3Dsensitive_content%3Dyes%26ip%3D0.0.0.0%26ipbits%3D0%26expire%3D1422806862%26sparams%3Dip,ipbits,expire,id,itag,source%26signature%3D7582F9A945B54ECB6B677FBF8EC867FECA2A8C66.401AEBF33E821A55E7D8A3A237D9E19477D17F53%26key%3Dck2&amp;iurl=http://video.google.com/ThumbnailServer2?app%3Dblogger%26contentid%3D0feb42815a735951%26offsetms%3D5000%26itag%3Dw160%26sigh%3DbFkQXh2_Iyu73r0_u5iBQeGWIwo&amp;autoplay=0&amp;ps=blogger"></param><embed src="//www.youtube.com/get_player" type="application/x-shockwave-flash" width="420" height="366" allowfullscreen="true" /></object>
</div>
<br />Esto es algo que podemos hacer directamente desde el m&oacute;vil, aunque en el v&iacute;deo lo he realizado en mi equipo de sobremesa con Arch Linux por pura comodidad. Una vez descargado el archivo &quot;.apk&quot; basta instalarlo en nuestro Cyanogenmod. F&aacute;cil, &iquest;verdad?
<br />
<br />
<b>Recuperando mis contactos y mi calendario</b>
<br />Desde que conoc&iacute; el servicio de alojamiento en la nube de ownCloud y me fij&eacute; en la posibilidad que brinda de sincronizar calendarios y contactos, tuve claro que iba a ser pieza clave y fundamental en la liberaci&oacute;n de mi m&oacute;vil. Y no me equivocaba.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-e6jcZif7A9U/U1p4h1bjX3I/AAAAAAAAEeo/cT16DWqS0zk/s1600/Screenshot_2014-04-25-16-37-10.png"><img src="http://4.bp.blogspot.com/-e6jcZif7A9U/U1p4h1bjX3I/AAAAAAAAEeo/cT16DWqS0zk/s1600/Screenshot_2014-04-25-16-37-10.png" height="400" width="240" /></a>
</div>
<br />Dos aplicaciones he empleado para este menester, ambas descargables desde F-Droid: 
<a href="https://f-droid.org/repository/browse/?fdfilter=calDAV&amp;fdid=org.gege.caldavsyncadapter">CalDAV Sync Adapter</a> (calendario) y 
<a href="https://f-droid.org/repository/browse/?fdfilter=calDAV&amp;fdid=at.bitfire.davdroid">DAVdroid</a> (contactos). Si bien parece que la segunda de ellas es capaz de sincronizar tambi&eacute;n el calendario, decid&iacute; usar la primera para dicha tarea, pues ya la hab&iacute;a instalado en el m&oacute;vil cuando corr&iacute;a Jelly Bean, con bastante buen desempe&ntilde;o. En ambas aplicaciones basta a&ntilde;adir nuestras credenciales y el enlace que podemos obtener en la web de ownCloud en los respectivos apartados de Calendario y Contactos. Desde ese momento tendremos disponibles, en las aplicaciones del m&oacute;vil, las cuentas de sincronizaci&oacute;n de ambos. No hay que hacer m&aacute;s... &iexcl;y funciona!
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-z-LA0B-nHl4/U1p00BVwlAI/AAAAAAAAEdw/MybyX7cKoVY/s1600/Arch2.png"><img src="http://3.bp.blogspot.com/-z-LA0B-nHl4/U1p00BVwlAI/AAAAAAAAEdw/MybyX7cKoVY/s1600/Arch2.png" height="352" width="400" /></a>
</div>
<br />En los d&iacute;as de uso y probaturas con Cyanogenmod 11 he de reconocer que se trata de un sistema operativo fant&aacute;stico, que corre con total soltura y fluidez en el Galaxy S3 Mini. No echo en falta funcionalidad alguna: c&aacute;mara, v&iacute;deos, redes sociales y, por supuesto, lo esencial, que tantas veces se nos olvida: hacer y recibir llamadas. Sirva mi experiencia por si alguien est&aacute; dudando si merece la pena dar el salto: no dudes m&aacute;s, la merece. Termino recordando que esto no es un tutorial, sino un resumen de los pasos que me llevaron a realizar el cambio de sistema en mi terminal con &eacute;xito. No puedo (y no quiero, qu&eacute; demonios) responsabilizarme de que alguien convierta su m&oacute;vil en un ladrillo siguiendo dichos pasos. Por muy sencillos que estos sean, siempre se puede meter la pata. Documentarse, informarse, leer y releer suelen dar buen resultado. Recomiendo a quien quiera instalar este genial sistema que haga lo mismo.
<br />
<br />
<u><b>ATENCI&Oacute;N: tras varios d&iacute;as de uso se me han presentado algunos problemas, para m&aacute;s informaci&oacute;n leer los comentarios del art&iacute;culo. Recuerdo que se trata de una ROM no soportada por el equipo de Cyanogenmod y, como tal, su comportamiento no es generalizable a todas las ROMs creadas por dicho equipo.</b></u></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini" st_title="Instalar Cyanogenmod 11 en Galaxy S3 Mini | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/android/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta android</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 314,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/04/instalar-cyanogenmod-11-en-galaxy-s3-mini"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>