<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>KaOS: fiel a sus principios | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios"><span itemprop="headline">KaOS: fiel a sus principios</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/kde"><img title="kde" alt="kde" src="/assets/images/labels/kde.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/12/kaos-fiel-sus-principios.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-08T11:26" itemprop="dateModified">Actualizado el lunes, 08 de diciembre de 2014 a las 11:26 UTC</span></div><div><span>
Etiquetado como
revision, kaos, <a href="/label/kde"><span itemprop="articleSection">kde</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Revisi&oacute;n delicada la que acometemos hoy. No deber&iacute;a serlo, pues en el mundo del software libre se supone que ha de imperar la libertad, valga la redundancia, para opinar sobre lo que a cada cual le parezca sin temer a las hordas de &quot;fanboys&quot; que se echan encima a la m&iacute;nima oportunidad. Pero una cosa es lo que me gustar&iacute;a y otra muy distinta la realidad, y me temo por lo ya le&iacute;do en diferentes foros y blogs, que existe una cierta pol&eacute;mica en torno a esta distribuci&oacute;n que hace saltar chispas entre detractores y fieles. Como lo primero es lo primero, yo no me declaro perteneciente a ninguno de los dos grupos, y vaya por delante mi respeto y admiraci&oacute;n por el trabajo de Anke Boersma, desarrolladora en solitario de toda una distribuci&oacute;n GNU/Linux, que no es poco. Anke decidi&oacute; en su d&iacute;a salir de Chakra, algo que en mi humilde opini&oacute;n supuso una grave p&eacute;rdida para la distribuci&oacute;n, por tratarse de una persona que colaboraba activamente en el desarrollo y en los foros, como creo que se puede intuir por su incansable trabajo al frente de KaOS. Pero as&iacute; es el software libre: la gente viene, la gente va. Y a &quot;demm&quot;, antes &quot;abveritas&quot;, se le echa de menos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-jgWs1litKbE/VIBYiDofZ0I/AAAAAAAAFWI/rx6QXOvYH_Y/s1600/logo%2BKaos.png"><img src="http://1.bp.blogspot.com/-jgWs1litKbE/VIBYiDofZ0I/AAAAAAAAFWI/rx6QXOvYH_Y/s1600/logo%2BKaos.png" height="139" width="400" /></a>
</div>
<br />
<br />
<a></a>Obviando toda esa historia, vamos a centrarnos en KaOS, que es lo que toca. Prometo, igualmente, no mencionar ni Skype ni Steam... vaya, ya es tarde. Bueno, los menciono, pero solo para recalcar lo absurdo de quejarse de su no inclusi&oacute;n en KaOS: los principios de la distribuci&oacute;n 
<a href="http://kaosx.us/es/faq/">est&aacute;n claros</a> y accesibles en la web, por lo tanto, uno ya sabe qu&eacute; instala y qu&eacute; necesita. Si ambas cosas no son coincidentes, la culpa no es de KaOS. Es como pretender instalarla con Gnome... oiga usted, b&uacute;squese otra distro que las hay a patadas.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Sencillo, intuitivo y traducido al espa&ntilde;ol, el instalador de KaOS, que supongo que ser&aacute; pr&oacute;ximamente reemplazado por el emergente Calamares, es estupendo. El particionador incluso permite seleccionar si nuestro disco es SSD o no, algo que se echa en falta en otras aplicaciones similares.
<b> </b>R&aacute;pido y eficaz, no le encuentro ninguna pega, salvo la de no soportar UEFI, pero de nuevo es algo que se anuncia convenientemente en la web.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-p02aLlldaIw/VIB2rFC7DsI/AAAAAAAAFWY/u_9eGiduvPY/s1600/instant%C3%A1nea2.png"><img src="http://2.bp.blogspot.com/-p02aLlldaIw/VIB2rFC7DsI/AAAAAAAAFWY/u_9eGiduvPY/s1600/instant%C3%A1nea2.png" height="320" width="400" /></a>
</div>
<br />Tras el primer reinicio todo est&aacute; como y donde debe. La combinaci&oacute;n de colores claros (tema Midna) e iconos &quot;flat&quot; (Flattr) proporciona a KaOS una aspecto distintivo y diferenciador, se&ntilde;a de identidad de la distro. El renderizado de fuentes, sin ser malo, es mejorable para mis gustos particulares. Se incluye un men&uacute; de KDE m&aacute;s sencillo que el tradicional, pero que sigue ofreciendo una opci&oacute;n importante para m&iacute;: la b&uacute;squeda. Por lo dem&aacute;s, todo est&aacute; en espa&ntilde;ol y el indicador de actualizaciones de Octopi nos se&ntilde;ala 169 paquetes a actualizar, cosa normal en una distribuci&oacute;n de marcado car&aacute;cter &quot;rolling release&quot;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-87GryQ_x4AM/VIB23_-UEvI/AAAAAAAAFWg/xaMQtgUwDp8/s1600/instant%C3%A1nea3.png"><img src="http://4.bp.blogspot.com/-87GryQ_x4AM/VIB23_-UEvI/AAAAAAAAFWg/xaMQtgUwDp8/s1600/instant%C3%A1nea3.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />Como suele ser habitual en las distros centradas en KDE
<b> </b>disponemos de un m&oacute;dulo de configuraci&oacute;n que nos permite editar el men&uacute; de arranque sin mayores complicaciones o aplicaciones de terceros. En cuanto a tiempos, un inicio de 48 segundos que resulta aceptable para KDE, y un apagado de 4 segundos, casi de r&eacute;cord.
<br />
<br />
<b>Software</b>
<br />La instalaci&oacute;n de software, para aquellos al&eacute;rgicos a la consola, corre a cargo de Octopi, una genial implementaci&oacute;n gr&aacute;fica de pacman que, en KaOS, podemos usar al completo libre de la terminal, algo que, por ejemplo, en Chakra no es posible. Se nos permite, igualmente, elegir las dependencias opcionales a instalar cuando seleccionamos un paquete, cuesti&oacute;n &eacute;sta muy de agradecer. KaOS nos trae de serie aplicaciones para cubrir gran parte de las necesidades de escritorio de un usuario medio, siendo, como reza el t&iacute;tulo de este art&iacute;culo, fiel a sus principios: una &uacute;nica aplicaci&oacute;n para hacer algo, que lo haga bien, en lugar de varias que hacen lo mismo. Es una buena filosof&iacute;a.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Nlx1QK_Knxs/VIB29q_nDsI/AAAAAAAAFWo/ikpfgQnfZJs/s1600/instant%C3%A1nea4.png"><img src="http://4.bp.blogspot.com/-Nlx1QK_Knxs/VIB29q_nDsI/AAAAAAAAFWo/ikpfgQnfZJs/s1600/instant%C3%A1nea4.png" height="320" width="400" /></a>
</div>
<br />De serie nos encontramos con el navegador Qupzilla, el reproductor Clementine, la &quot;suite&quot; ofim&aacute;tica Calligra, un visor de c&aacute;mara web que no conoc&iacute;a, llamado Webcamoid (que por desgracia no funciona, al menos en mi equipo) y una alternativa v&iacute;a web a Skype, de nombre 
<a href="https://appear.in/">Appear</a>. Esta p&aacute;gina nos permite iniciar conversaciones entre usuarios (hasta ocho a la vez) sin necesidad de instalar programas externos, usando tan solo nuestro navegador habitual.
<br />
<br />
<b>Hardware</b>
<br />Mi impresora HP Laserjet 1018, siempre trabajosa de instalar, no quiso ser menos en KaOS. Para empezar, la utilidad de HP para tal menester no se abre en modo gr&aacute;fico, oblig&aacute;ndome a iniciarla desde la terminal. All&iacute;, el programa se queja de la falta del paquete &quot;python-gobject&quot;, problema de sencilla resoluci&oacute;n: basta instalarlo. Tras todo esto, la impresora se configura sin m&aacute;s usando la citada utilidad del fabricante. En lo que respecta al esc&aacute;ner, cero problemas. Y en cuanto a la webcam, puesto que Webcamoid no me funcion&oacute; pese a no arrojar errores desde la terminal, pude corroborar su buen reconocimiento tras la instalaci&oacute;n de VLC, como atestigua la cl&aacute;sica instant&aacute;nea de la mano del cansino que suscribe... A prop&oacute;sito de Webcamoid, debo a&ntilde;adir que tras toquetear un poco las opciones de la pesta&ntilde;a de configuraci&oacute;n del programa, descubr&iacute; que con solo pulsar el bot&oacute;n de &quot;Reset&quot; en la resoluci&oacute;n se soluciona el problema.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-Yl4V6tBdUA8/VIB3Qn5kQLI/AAAAAAAAFWw/ofWWZyY5m8c/s1600/instant%C3%A1nea5.png"><img src="http://3.bp.blogspot.com/-Yl4V6tBdUA8/VIB3Qn5kQLI/AAAAAAAAFWw/ofWWZyY5m8c/s1600/instant%C3%A1nea5.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Otra vez m&aacute;s, y ya he perdido la cuenta, que no consigo conectar con mi port&aacute;til con Windows usando Samba. Esto, ya lo s&eacute;, no es problema de la distribuci&oacute;n, sino de algo que falta por configurar en las nuevas versiones del paquete y que en ninguno de los sistemas probados desde la aparici&oacute;n de la misma (versiones 4.x) viene de serie. Yo lo &uacute;nico que s&eacute; es que en mis revisiones de anta&ntilde;o sol&iacute;a ser coser y cantar... pero ya no lo es. Y ganas de averiguar el motivo tengo las justas y necesarias, tendiendo a cero.
<br />
<b> </b>
<br />Los dispositivos externos que conect&eacute; fueron reconocidos todos. Lo extra&ntilde;o del asunto es que pensaba encontrar en KaOS, una distro centrada en el buen desempe&ntilde;o, unos tiempos de lectura y escritura muy buenos. Y aunque en el disco duro externo se alcanza y se supera a Ubuntu, referencia que utilizo en las comparaciones, la cosa cambia y de qu&eacute; manera en el &quot;pendrive&quot; y la tarjeta de memoria: m&aacute;s de un minuto a&ntilde;adido en la copia de archivos grandes. Al igual que me ocurriera d&iacute;as atr&aacute;s con 
<a href="http://www.lasombradelhelicoptero.com/2014/11/opensuse-132-cosas-que-mejorar.html">openSUSE</a>, Dolphin se colg&oacute; mientras copiaba en una ocasi&oacute;n. Tal vez se trata de un problema &quot;upstream&quot; de KDE.
<br />
<br />
<b>Experiencia de uso</b>
<br />En este apartado es donde KaOS m&aacute;s destaca, permiti&eacute;ndonos visualizar, escuchar o trabajar con m&uacute;ltiples formatos de archivo sin necesidad de instalaciones adicionales. No hubo problemas con Youtube, salvo un &quot;crash&quot; de Qupzilla que achaco al propio navegador y que no se reprodujo con Firefox. Perfecto reconocimiento de todos mis archivos en sus diversos formatos. De diez.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-eDO855bzSzs/VIB3a15IUEI/AAAAAAAAFW4/c5RFmid7AKQ/s1600/instant%C3%A1nea7.png"><img src="http://4.bp.blogspot.com/-eDO855bzSzs/VIB3a15IUEI/AAAAAAAAFW4/c5RFmid7AKQ/s1600/instant%C3%A1nea7.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Estabilidad</b>
<br />Una &quot;extreme rolling&quot; (esto es &quot;made in Yoyo&quot;, poseedor del copyright de la expresi&oacute;n) que a la vez resulta estable cual Debian. Poco m&aacute;s que a&ntilde;adir. El &uacute;nico inconveniente grave que encontr&eacute; fue que el sonido dej&oacute; de funcionar de buenas a primeras en cierta ocasi&oacute;n. Tras reiniciar, el problema se arregl&oacute;, por lo que decid&iacute; penalizar en la puntuaci&oacute;n con un error moderado, que se viene a a&ntilde;adir al mencionado cuelgue de Dolphin, haciendo un total de 0'75 puntos a descontar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-Nd0EiIHtD1M/VIB4o8hZHdI/AAAAAAAAFXU/gwUu98dKxKc/s1600/instant%C3%A1nea6.png"><img src="http://3.bp.blogspot.com/-Nd0EiIHtD1M/VIB4o8hZHdI/AAAAAAAAFXU/gwUu98dKxKc/s1600/instant%C3%A1nea6.png" height="320" width="400" /></a>
</div>
<br />
<b>Fluidez</b>
<br />El sistema se mueve con rapidez, sin saltos, como era de esperar. Nada negativo a destacar en este apartado.
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Como ya sospechaba desde el inicio, cuando se me ofreci&oacute; instalar con los controladores nVidia o con los libres, obviando a Catalyst, no es posible usar la versi&oacute;n propietaria de los &quot;drivers&quot; de AMD en KaOS. Las razones de esta exclusi&oacute;n las explica la propia Anke 
<a href="http://kaosx.us/phpBB3/viewtopic.php?f=8&amp;t=217&amp;p=1058&amp;hilit=catalyst#p1058">en los foros</a>.
<b> </b>De todas formas, como vengo comprobando &uacute;ltimamente, la gesti&oacute;n de energ&iacute;a falla tanto con los controladores libres como con los Catalyst, algo que tambi&eacute;n sucede en KaOS y que me hace imposible suspender a RAM. La hibernaci&oacute;n no est&aacute; habilitada de serie, o yo al menos no he encontrado la opci&oacute;n en el men&uacute;.
<br />
<br />
<b>Rendimiento</b>
<br />La madre del cordero. No s&eacute; muy bien por qu&eacute;, pero esperaba mayor rendimiento en KaOS. Hab&iacute;a llegado a la conclusi&oacute;n, personal&iacute;sima por supuesto, de que el hecho de centrarse en una arquitectura, un escritorio, y un n&uacute;mero determinado de paquetes iba a repercutir fant&aacute;sticamente en esta faceta de la distribuci&oacute;n. Pero la realidad de las pruebas realizadas demuestran que no es as&iacute;: salvo por peque&ntilde;as diferencias favorables a KaOS en los &quot;benchmarks&quot; de navegadores y la ya rese&ntilde;ada de la lecto-escritura al disco duro externo, en la mayor&iacute;a de pruebas KaOS rinde peor.
<br />
<b> </b>
<br />Menci&oacute;n aparte merece el test gr&aacute;fico Unigine Valley, que hube de realizar por vez primera con los controladores libres. He de reconocer que no esperaba que funcionase siquiera, pues tal era mi experiencia con otras distribuciones. El hecho de poder probar el rendimiento de los controladores libres en KaOS, pese al pobre resultado, me pareci&oacute; un hecho muy positivo y merecedor de una correcci&oacute;n positiva en la puntuaci&oacute;n (+0'25). Por desgracia, como ya me tem&iacute;a, los valores obtenidos por estos controladores siguen muy lejos de los logrados por Catalyst. Todo se andar&aacute;, espero.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-MxrFXEgyMhs/VIB3oo3rA0I/AAAAAAAAFXA/i8QQVydDYrc/s1600/instant%C3%A1nea8.png"><img src="http://1.bp.blogspot.com/-MxrFXEgyMhs/VIB3oo3rA0I/AAAAAAAAFXA/i8QQVydDYrc/s1600/instant%C3%A1nea8.png" height="320" width="400" /></a>
</div>
<br />KaOS fue creado como un sistema destinado a satisfacer las necesidades de un n&uacute;mero limitado de usuarios del entorno de su desarrolladora. Creo que Anke no contaba con el poder de persuasi&oacute;n de cierto bloguero de habla hispana (va por usted, 
<a href="http://deblinux.wordpress.com/">se&ntilde;or Fern&aacute;ndez</a>, no se esconda), cuyo gusto por la distro y la consiguiente difusi&oacute;n entre sus muchos seguidores ayud&oacute; a la expansi&oacute;n un tanto descontrolada. Y de ah&iacute; a Distrowatch. El resultado es que KaOS, finalmente, se convirti&oacute; en una distribuci&oacute;n de uso generalista, y no estoy muy seguro de que a su desarrolladora esto termine de gustarle.
<br />
<br />Y, lo queramos o no, un sistema con cierta popularidad est&aacute; sujeto a la cr&iacute;tica. Lo que no es de recibo es que se argumente contra KaOS usando como arma arrojadiza la falta de este o aquel paquete, cuando los principios de la distribuci&oacute;n est&aacute;n clar&iacute;simos desde el inicio. Pero es algo que ya ocurri&oacute; con Chakra en su momento, si es que acaso no sigue ocurriendo en la actualidad, cuando se la acusaba de cierto elitismo por no incluir paqueter&iacute;a &quot;GTK&quot; m&aacute;s que a trav&eacute;s de los famosos 
<a href="http://www.lasombradelhelicoptero.com/2013/04/adios-los-bundles-en-chakra.html">&quot;bundles&quot;</a>, o por eliminar el soporte a la 
<a href="http://www.lasombradelhelicoptero.com/2012/08/fin-del-soporte-32-bits-en-chakra.html">arquitectura de 32 bits</a>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Ocf3-Xiffpw/VIB4gJLKa9I/AAAAAAAAFXM/nRrHzpQHlYs/s1600/instant%C3%A1nea9.png"><img src="http://1.bp.blogspot.com/-Ocf3-Xiffpw/VIB4gJLKa9I/AAAAAAAAFXM/nRrHzpQHlYs/s1600/instant%C3%A1nea9.png" height="320" width="400" /></a>
</div>
<br />Pol&eacute;micas aparte, y m&aacute;s all&aacute; de su 7'11 de puntuaci&oacute;n, &iquest;qu&eacute; opino de KaOS? Pues que es una distribuci&oacute;n muy v&aacute;lida que sirve a los principios para los que fue creada (desde cero, conviene no olvidarlo). Hay usuarios a los que, por su hardware y sus necesidades, este bonito sistema les encaja como un guante. Algo extensible, siendo realistas, a toda distribuci&oacute;n GNU/Linux. Y que todos estos usuarios la disfruten y traten de colaborar (como muestra el creciente n&uacute;mero de paquetes en KCP, el repositorio comunitario) no puede ser otra cosa que una buena noticia y un motivo de orgullo para su creadora. Enhorabuena, pues, y mucho &aacute;nimo para continuar. Sacarse una distribuci&oacute;n de la chistera, sin base ninguna, y mantenerla actualizada al m&aacute;ximo casi sin ayuda es una labor loable que solo puede despertar admiraci&oacute;n.
<br />
<br />Salud 
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>KaOS ROLLING</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.886</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>20.907,39</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>13,51</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>18,41</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>282</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.768</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.991</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>5,01</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,09</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>6,05</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-1,10</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>-0,50</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>7,11</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" st_title="KaOS: fiel a sus principios | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/kde/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta kde</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2014
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1190,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>