<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-04T12:53:43Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-04T12:53:43Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Juegos para GNU/Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/12/juegos-para-gnulinux" />
    <category term="ubuntu" />
    <category term="juegos" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-04-15T17:29:32Z</updated>
    <published>2010-12-10T18:34:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="Tux" height="200" src="http://2.bp.blogspot.com/_9zOwWD_PYL8/TQJrCzG9OZI/AAAAAAAAAiY/LFBrHo1UgHs/s200/tux.png" title="Tux" width="169" /&gt; 
&lt;/div&gt;En GNU/Linux no hay tantos juegos comerciales como en otros sistemas operativos, l&amp;eacute;ase Windows y &amp;uacute;ltimamente en Mac con su App Store, pero eso no quiere decir que no haya buenos juegos para el ping&amp;uuml;ino. En la siguiente entrada pondr&amp;eacute; algunos con los que he metido muchas horas y que se salen de los t&amp;iacute;picos y habituales 
&lt;a href="http://en.wikipedia.org/wiki/First-person_shooter"&gt;FPS&lt;/a&gt; aunque tambi&amp;eacute;n los hay para Linux. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Open TTD (Transport Tycoon Deluxe)&lt;/b&gt; 
&lt;br /&gt; 
&lt;br /&gt;Este juego est&amp;aacute; basado en el original de la compa&amp;ntilde;&amp;iacute;a Microprose &amp;laquo;Transport Tycoon Deluxe&amp;raquo; y al que le a&amp;ntilde;ade algunas caracter&amp;iacute;sticas que no ten&amp;iacute;a el original. Es un juego de estrategia en tiempo real en el que eres el propietario de una compa&amp;ntilde;ia de transportes con el objetivo de amasar una fortuna y no llevar a la compa&amp;ntilde;&amp;iacute;a a la bancarrota. Para ello dispones de varios medios de transporte como tren, avi&amp;oacute;n, camiones, autobuses y barcos para transportar mercancias o pasajeros (carb&amp;oacute;n, hierro, acero, petroleo, madera, grano, ...) entre las f&amp;aacute;bricas que producen las materias primas (bosques, granja , pozos de petr&amp;oacute;leo, minas de hierro y de carb&amp;oacute;n, ciudades, ...) y las factor&amp;iacute;as que las procesan (acer&amp;iacute;as, central el&amp;eacute;ctricas, ciudades, serrerias, ...), tambi&amp;eacute;n tendr&amp;aacute;s que crear las rutas que har&amp;aacute;n los veh&amp;iacute;culos, de ello depender&amp;aacute; que sean rentables y produzcan beneficios para comprar nuevos veh&amp;iacute;culos y constuir nuevas rutas y no caer en la bancarrota. Seg&amp;uacute;n se va avanzando en el tiempo ir&amp;aacute;n apareciendo mejores medios de transporte con m&amp;aacute;s capcidad, m&amp;aacute;s r&amp;aacute;pidos, que se averien menos o como en el caso de los trenes, en monorail o de levitaci&amp;oacute;n. Seg&amp;uacute;n del dinero que dispongas podr&amp;aacute;s modificar el terreno y construir las carreteras para los veh&amp;iacute;culos, v&amp;iacute;as para los trenes, t&amp;uacute;neles para evitar monta&amp;ntilde;as, puentes para atravesar rios, comprar locomotoras, vagones, autobuses, aviones, constuir aeropuertos, .... &amp;iexcl;Ten cuidado con las cat&amp;aacute;strofes y los OVNIS!&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/12/juegos-para-gnulinux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-12-10T18:34:00Z</dc:date>
  </entry>
  <entry>
    <title>Chrome Web Store</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/02/chrome-web-store" />
    <category term="juegos" />
    <category term="tecnologia" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-04T20:33:32Z</updated>
    <published>2011-02-04T20:26:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img src="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxdrb6DKkI/AAAAAAAAAko/OaUBUItkpns/s1600/chrome-web-store.gif" /&gt; 
&lt;/div&gt;Ayer Google liber&amp;oacute; otra versi&amp;oacute;n estable de su navegador web, y ya van por la 9, en Arch Linux ya est&amp;aacute; en testing asi que no tardaremos mucho en tenerla disponible para actualizar. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/_9zOwWD_PYL8/TUxdlwwup5I/AAAAAAAAAkk/HBJH-2R7_Kw/s1600/google-chrome-9.png"&gt;&lt;img height="174" src="http://4.bp.blogspot.com/_9zOwWD_PYL8/TUxdlwwup5I/AAAAAAAAAkk/HBJH-2R7_Kw/s320/google-chrome-9.png" width="320" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;Entre las principales novedades que incorpora esta versi&amp;oacute;n es el soporte para WebGL que permitir&amp;aacute; dotar a las aplicaciones de nuevas posibilidades. Si quieres probar que es esto de WebGL dale un vistazo a 
&lt;a href="http://www.chromeexperiments.com/webgl"&gt;Chrome experiments&lt;/a&gt;. La otra novedad presentada junto con el navegador es la tienda de aplicaciones 
&lt;a href="https://chrome.google.com/webstore"&gt;Chrome Web Store&lt;/a&gt; desde la cual prodremos instalar aplicaciones en el navegador Chrome. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxehoFFsGI/AAAAAAAAAkw/QzY0zFTsLOw/s1600/chrome-web-store.jpg"&gt;&lt;img height="163" src="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxehoFFsGI/AAAAAAAAAkw/QzY0zFTsLOw/s200/chrome-web-store.jpg" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;En esta tienda podremos encontrar aplicaciones (Web Apps), extensiones y temas para el navegador Chrome. En cuanto a las aplicaciones est&amp;aacute;n divididas en diversas categorias, educaci&amp;oacute;n, entretenimineto, juegos, noticias, etc... algunas son de pago, otras prueden probase y otras son gratuitas. Para adquirir las de pago deberemos hacer uso del sistema de pagos Google Checkout.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/02/chrome-web-store"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-02-04T20:26:00Z</dc:date>
  </entry>
</feed>

