<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Confesiones de un distrohopper (y III) | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii"><span itemprop="headline">Confesiones de un distrohopper (y III)</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/10/confesiones-de-un-distrohopper-y-iii.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-10-12T18:35" itemprop="dateModified">Actualizado el sábado, 12 de octubre de 2013 a las 18:35 UTC</span></div><div><span>
Etiquetado como
experiencias, distro-hopping</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Continuamos con la serie iniciada hace ya m&aacute;s de un a&ntilde;o con 
<a href="http://www.lasombradelhelicoptero.com/2012/06/confesiones-de-un-distrohopper.html">sendos</a> 
<a href="http://www.lasombradelhelicoptero.com/2012/09/confesiones-de-un-distrohopper-ii.html">art&iacute;culos</a> sobre la enfermedad que obliga a personas aparentemente normales, mentalmente sanas, a comportarse de un modo compulsivo con su ordenador en lo que respecta a instalar sistemas operativos libres, cambiando de distribuci&oacute;n como quien lo hace de camisa. El presente art&iacute;culo, cr&oacute;nica de una peque&ntilde;a reca&iacute;da, completa la trilog&iacute;a del desprop&oacute;sito de quien escribe, con la certeza de que el modo tan r&aacute;pido en que se ha resuelto supone la prueba que necesitaba para afirmar, por fin, que Chakra ha resultado ser la cura efectiva para este mal, la &uacute;nica forma de romper el bucle infinito.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-hHaIN810US4/Ulgj24Z6SmI/AAAAAAAAEAo/fxjyFn1ZZfU/s1600/Bucle+infinito.png"><img height="250" src="http://4.bp.blogspot.com/-hHaIN810US4/Ulgj24Z6SmI/AAAAAAAAEAo/fxjyFn1ZZfU/s400/Bucle+infinito.png" width="400" /></a>
</div>
<br />
<br />
<a></a>Aviso, antes de continuar, que el presente art&iacute;culo est&aacute; exclusivamente cimentado en vivencias personales, en sentimientos propios que no todo el mundo tiene que vivir de igual modo. Con esto quiero decir que muchas personas disfrutan con la tarea de instalar sin parar, con la &aacute;vida b&uacute;squeda de novedades y la posibilidad de exprimir al m&aacute;ximo las oportunidades de cambio que GNU/Linux, con sus sabores, ofrece. Otros, como yo mismo, que en su d&iacute;a viv&iacute;an esto como afici&oacute;n, comienzan en un momento dado a darse cuenta de lo absurdo y repetitivo que resulta este comportamiento, lo cual deviene en malestar interior, una extra&ntilde;a sensaci&oacute;n de que se ha perdido un poco el control de todo esto. Es a estos &uacute;ltimos a quienes me dirijo en este episodio final de la saga.
<br />
<br />
<b>Condicionante n&ordm; 1: tiempo libre</b>
<br />A nadie se le escapa que si uno est&aacute; ocupado en su d&iacute;a a d&iacute;a el asunto de los cambios de distribuci&oacute;n linuxera 
<i>per se</i>, sin que nada falle, se resuelve por s&iacute; mismo. El principal enemigo del distrohopper que pretende rehabilitarse es el tiempo libre, unido al uso no profesional de su equipo. Es sencillo de comprender, si el ordenador es tu herramienta de trabajo no tiene sentido arriesgarte a dejarla inservible en uno de tus arrebatos de cambio. Para m&iacute;, que soy alguien que usa el ordenador como elemento de distracci&oacute;n y entretenimiento principalmente, que adem&aacute;s por mor de la dichosa coyuntura econ&oacute;mica espa&ntilde;ola no trabaja a tiempo completo, reuno las condiciones precisas para caer en esta din&aacute;mica.
<br />
<br />Luego est&aacute; el asunto de ser un poco &quot;freak&quot; y muy novelero, pero eso son ya rasgos personales m&iacute;os que no voy a cambiar a estas alturas de la pel&iacute;cula.
<br />
<br />
<b>Condicionante n&ordm; 2: siempre falla algo</b>
<br />Lo hemos repetido en este blog hasta la saciedad, la perfecci&oacute;n no existe y lo que m&aacute;s se le parece es 
<a href="http://www.lasombradelhelicoptero.com/2013/03/opensuse-123-si-la-perfeccion-existiera.html">openSUSE</a>... El distrohopper profesional que lleva ya un tiempo usando una distro, comienza a fijarse en lo que falla, que siempre lo hay, o en lo que le falta, de modo que puede ir montando la coartada perfecta para dar el salto sin sentirse demasiado culpable. Con mi distribuci&oacute;n, que en mi equipo funciona de un modo fluido y sin fisuras, este aspecto es complicado de encontrar, pero el cerebro de un distrohopper es imparable en la b&uacute;squeda de su objetivo. Habitualmente es 
<a href="http://opensourceopenmind.com/2013/10/01/ahora-me-ves/">alg&uacute;n art&iacute;culo</a> que leo donde alguien emplea herramientas GTK puras para hacer algo que me interesa reproducir, y que no consigo trasladar a Chakra por su estricta filosof&iacute;a. Es entonces cuando comienza el absurdo auto-bombardeo de ideas, a cual m&aacute;s convincente en su contexto, sobre la necesidad imperiosa de cambiar de distribuci&oacute;n para poder hacer algo que es, a todas luces, innecesario.
<br />
<br />Tras un par de d&iacute;as de retrasar lo inevitable, el hecho se produce: vuelta a re-particionar el disco duro, quitando espacio de la partici&oacute;n de datos para acoger a la nueva fant&aacute;stica distro que devolver&aacute; la diversi&oacute;n y permitir&aacute; hacer todo aquello que ahora no se puede.
<br />
<br />Pero esta vez, como digo, va a ser diferente. Porque tengo tantos lazos con Chakra que no me planteo abandonarla en principio, por eso no sobreescribo la partici&oacute;n. Porque en el fondo s&eacute; que ser&aacute; un simple escarceo por otras tierras del universo linuxero para acabar volviendo a casa.
<b> </b>Sabia decisi&oacute;n, que ya iba siendo hora...
<br />
<br />
<b>De paseo por un par de distros</b>
<br />Decido que, puestos a ser repetitivos podemos serlo hasta el hast&iacute;o. Por en&eacute;sima vez desde que uso Chakra pretendo dar el salto a Arch Linux con KDE. Controladores libres, faltar&iacute;a m&aacute;s, otra cosa ser&iacute;a 
<a href="http://www.lasombradelhelicoptero.com/2013/04/arch-ati-y-yo-lo-imposible.html">perseverar en el error</a>. Con la rapidez de quien ha instalado m&aacute;s de veinte &quot;Archs&quot; tengo el equipo funcionando. Pero a la hora de la verdad, cuando he de instalar el escritorio, pienso que ya llevo un tiempo usando KDE y es momento de ver qu&eacute; tal lo est&aacute; haciendo el equipo de Gnome. Instalo, pues, el escritorio de la huella, que iba por su versi&oacute;n 3.8.
<br />
<br />Tras la cl&aacute;sica tarde perdida en adecentar el sistema, instalar extensiones, preparar los enlaces simb&oacute;licos y dem&aacute;s zarandajas, tengo un Arch con Gnome y el &uacute;ltimo kernel disponible. Todo funciona bien y el cerebro segrega endorfinas para recompensarte por el trabajo (in&uacute;til, eso s&iacute;) bien hecho. Todo se complica a la ma&ntilde;ana siguiente, cuando entra Gnome 3.10 en los repositorios y llega el caos m&aacute;s absoluto. La nueva versi&oacute;n rompe con todo, no ya extensiones, sino hasta el tema GTK que estaba usando (Zukitwo creo recordar). M&aacute;s minimalismo para Gnome y m&aacute;s convencimiento para m&iacute; de que van en direcci&oacute;n opuesta a lo que dictan mis gustos. Si la versi&oacute;n 3.8 se me hizo usable y hasta productiva, el hecho de tener que prescindir de extensiones muy necesarias para m&iacute; o de tener que quedarme con el tema Adwaita a la fuerza se me antoja insoportable. Recuerdo, una vez m&aacute;s, por qu&eacute; dej&eacute; de usar Gnome en su momento y guardo un minuto de silencio por la experiencia de usuario que todos perdimos al morir Gnome 2.
<br />
<br />
<div style="clear: both; text-align: center;">
 <object height="266" width="320"><param name="movie" value="http://youtube.googleapis.com/v/1sbf5znBhuA&amp;source=uds"></param><param name="bgcolor" value="#FFFFFF"></param><param name="allowFullScreen" value="true"></param><embed width="320" height="266" src="http://youtube.googleapis.com/v/1sbf5znBhuA&amp;source=uds" type="application/x-shockwave-flash" allowfullscreen="true" /></object>
</div>
<br />La siguiente genialidad que se me ocurre es tratar, otra vez, de rememorar aquellos d&iacute;as pasados con la instalaci&oacute;n de Mate. Resulta del todo infructuoso, pues lo pasado, pasado est&aacute;. Unas horas de uso de este escritorio me demuestran que el avance en los paradigmas inform&aacute;ticos dif&iacute;cilmente tiene vuelta atr&aacute;s, todo me parece tan arcaico que el simple hecho de carecer de algo tan &uacute;til para m&iacute; como es la exposici&oacute;n de ventanas da al traste con toda la experiencia. Por no hablar del galimat&iacute;as de temas GTK2-GTK3 que hace imposible encontrar un &quot;look&quot; uniforme para el escritorio.
<br />
<br />As&iacute; que, qu&eacute; remedio, vuelta a KDE. Mientras instalo el tercer escritorio en Arch Linux pienso que por fin voy a poder volver a disfrutar del poder de Chakra sin renunciar a mis programas GTK favoritos... que a la saz&oacute;n se reducen a Shotwell. Ya veis, lo absurdo vuelve a hacer su aparici&oacute;n, cuando uno supedita el uso de un sistema y su escritorio a la utilizaci&oacute;n espor&aacute;dica, cada vez m&aacute;s, por cierto, de un organizador de fotos que es perfectamente suplido por Gwenview. Me recuerda a 
<a href="http://www.lasombradelhelicoptero.com/2012/08/presento-mis-disculpas-y-cavalas-sobre.html">un art&iacute;culo</a> escrito por Vicente Segu&iacute; en este mismo blog, donde se preguntaba para qu&eacute; quer&iacute;a programas de ripeo si ya nunca alquilaba DVDs...
<br />
<br />Ni qu&eacute; decir tiene que la cosa no funcionaba. S&iacute;, Arch sigue siendo una absoluta maravilla, sobre todo por cosas como pacman y AUR, &iexcl;que tambi&eacute;n los tengo en Chakra! Y el KDE &quot;vanilla&quot; que empaquetan apenas ocupa 600 Mb al iniciar, frente al giga y poco que se come Chakra. Sin embargo, no es lo mismo para m&iacute;, ya no. No noto el mismo rendimiento, igual son paranoias, pero me va m&aacute;s fluido Chakra y hace saltar menos el ventilador del equipo. Vaya usted a saber por qu&eacute;, pero ocurre. Nota: si has llegado hasta aqu&iacute;, querido lector, te ruego que no uses estas apreciaciones personales para iniciar una guerra Arch vs Chakra. Encarecidamente te lo pido.
<br />
<br />Hasta aqu&iacute; han transcurrido varios d&iacute;as, Chakra dormita pl&aacute;cidamente en su partici&oacute;n y yo sigo rizando el rizo. En mis esquemas de razonamiento durante las crisis distrohopperas el siguiente paso suele ser abominar de todos los escritorios (Gnome ya no me gusta, KDE lo tengo muy visto, XFCE no da la talla, el resto menos todav&iacute;a...) y echarme en brazos de algo distinto. Por eso, la locura llega a su fin con la instalaci&oacute;n y configuraci&oacute;n de 
<a href="http://www.lasombradelhelicoptero.com/2013/06/elementary-os-luna-beta-una-autentica.html">Elementary OS</a> (en mi port&aacute;til todav&iacute;a perdura, por cierto) solo para darme cuenta, tras perder otro d&iacute;a de mi tiempo de asueto, de que ning&uacute;n escritorio consigue que me encuentre tan a gusto como me encuentro en Chakra. Lo escrib&iacute; en su momento, 
<a href="http://www.lasombradelhelicoptero.com/2013/06/el-fanboy.html">soy un fanboy</a>, y asumido lo ten&iacute;a hasta la llegada de esta peque&ntilde;a crisis que os he relatado aqu&iacute;.
<br />
<br />
<br />
<b>Dec&aacute;logo de Distrohoppers An&oacute;nimos</b>
<br />
<br />1. Si disfrutas instalando y probando distribuciones GNU/Linux no sigas leyendo, no est&aacute;s enfermo.
<br />
<br />2. Si acabas de llegar al mundo GNU/Linux y a&uacute;n no has encontrado tu distribuci&oacute;n ideal, de nuevo, no sigas leyendo, t&uacute; tampoco est&aacute;s enfermo.
<br />
<br />3. El primer paso para solucionar un problema es reconocer que el problema existe. Si te incomoda no ser capaz de quedarte con una distro (o dos, o a lo sumo tres, venga va) es que, efectivamente, tienes un problema.
<br />
<br />4. Si eres experto distrohopper, lo m&aacute;s probable es que tu distro sea esa a la que acabas volviendo una y otra vez. No le des m&aacute;s vueltas, tu distro es esa y solo tienes que darte cuenta.
<br />
<br />5. Procl&aacute;mate fanboy de tu distro. A ser posible, p&uacute;blicamente.
<br />
<br />6. Colabora en lo que puedas con tu distro: empaqueta. Si no sabes empaquetar, ayuda en los foros. Si no te gustan los foros, ayuda en redes sociales. Si no te gusta ayudar, difunde. Si el esp&iacute;ritu comunitario no es lo tuyo, instala otro sistema operativo que no sea GNU/Linux...
<br />
<br />7. Deja siempre alguna partici&oacute;n libre para esos momentos de debilidad. Pero mental&iacute;zate de que solo es para pruebas, la partici&oacute;n buena es la otra, la que tiene tu distro instalada.
<br />
<br />8. S&eacute; consciente de lo valioso de tu tiempo libre. Est&aacute; bien tener la Inform&aacute;tica como hobby, si no eres profesional, pero uno cosa es que te gusten los ordenadores y otra cosa es convertirte en un adicto. &iquest;Cu&aacute;ntas veces has repetido los mismos pasos en la personalizaci&oacute;n de tu escritorio? &iquest;Merece la pena hacerlo una vez m&aacute;s? La respuesta es un no tajante.
<br />
<br />9. Sal, respira aire libre, juega con el perro, haz deporte... cualquier cosa que te aleje del equipo en los momentos de necesidad imperiosa de saltar de distro. Vive, en definitiva.
<br />
<br />10. Si nada funciona y vuelves a caer, pide ayuda. El resto de distrohoppers an&oacute;nimos te echaremos un cable cuando flaqueen las fuerzas.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-4K8pClpxpKQ/Ulghiaj5grI/AAAAAAAAEAU/BtN7d6szvco/s1600/Chakra+actualizada3.png"><img height="250" src="http://2.bp.blogspot.com/-4K8pClpxpKQ/Ulghiaj5grI/AAAAAAAAEAU/BtN7d6szvco/s400/Chakra+actualizada3.png" width="400" /></a>
</div>
<div style="clear: both; text-align: left;">
 <br />
</div>
<div style="clear: both; text-align: left;">
 <b>Conclusiones</b>
</div>Est&aacute; visto que no s&eacute; contar experiencias reveladoras sin escribir tochos, de modo que vamos a ir echando el cierre. Te felicito y te agradezco sobremanera si has sido capaz de llegar leyendo hasta aqu&iacute;, en ocasiones he afirmado que una de las razones para tener un blog es el poder contar vivencias personales, que para quien no las ha vivido pueden parecer rid&iacute;culas. Pero ya dec&iacute;a m&aacute;s arriba que el objetivo de las l&iacute;neas de hoy era compartir una historia con aquellos que se han sentido alguna vez inc&oacute;modos con esta forma compulsiva de usar GNU/Linux. Estoy seguro de que ellos s&iacute; que lo van a entender.
<br />
<div style="clear: both; text-align: left;">
 <br />
</div>
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-jKQmglzltjc/UlgiYm3B5cI/AAAAAAAAEAg/IWdqajk_UWQ/s1600/you-need-to-get-a-life2.jpg"><img height="317" src="http://4.bp.blogspot.com/-jKQmglzltjc/UlgiYm3B5cI/AAAAAAAAEAg/IWdqajk_UWQ/s400/you-need-to-get-a-life2.jpg" width="400" /></a>
</div>
<div style="clear: both; text-align: left;">
 <br />
</div>
<div style="clear: both; text-align: left;">
 Y, si puedo sacar algo en claro es que sigo siendo ese fanboy de Chakra. Tambi&eacute;n que es probable que me equivocase al pensar que el dejar de revisar distribuciones iba a aniquilar por completo el deseo de ver qu&eacute; se cuece en otros entornos y sistemas, pero lo cierto es que ha ayudado bastante. En fin, voy a poner en pr&aacute;ctica el dec&aacute;logo de arriba, salir y respirar aire libre. Os dejo este art&iacute;culo como referencia para los momentos a los que hago menci&oacute;n en el punto 10 y la promesa fehaciente de que no volver&eacute; a tratar este tema en el blog. Un saludo.
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii" st_title="Confesiones de un distrohopper (y III) | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 332,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/confesiones-de-un-distrohopper-y-iii"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>