<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Post Mortem de Torre Utopía | El blog de Adrián Arroyo</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia"><span itemprop="headline">Post Mortem de Torre Utopía</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Adrián Arroyo</span> en la bitácora <a href="http://adrianarroyocalle.github.io/blog">El blog de Adrián Arroyo</a>, <a href="http://adrianarroyocalle.github.io/blog//2015/01/22/post-mortem-torre-utopia/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-01-21T23:00" itemprop="dateModified">Actualizado el miércoles, 21 de enero de 2015 a las 23:00 UTC</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div> 
 <h1>Torre Utop&iacute;a</h1> 
 <img src="http://adrianarroyocalle.github.io/blog/images/TorreUtopia.png" alt="Image" /> 
 <a href="http://adrianarroyocalle.github.io/torre-utopia">http://adrianarroyocalle.github.io/torre-utopia</a> 1.0 html5 
 <div> Adri&aacute;n Arroyo Calle 
 </div> 2014 
</div> 
<p>Torre Utop&iacute;a fue un juego dise&ntilde;ado con el objetivo de ser creado en menos de un mes usando solo mis ratos libres. Para facilitar el trabajo hab&iacute;a dise&ntilde;ado un conjunto de librer&iacute;as y scripts en lo que denomino <em>esqueleto</em>. Este esqueleto es open-source y lo podeis encontrar en <a href="http://github.com/AdrianArroyoCalle/skeleton-npm-game">GitHub</a>.</p> 
<h1>Desarrollo</h1> 
<p><img src="http://adrianarroyocalle.github.io/blog/images/elevator-action.png" alt="Elevator Action" /><br /> Torre Utop&iacute;a esta fuertemente inspirado en <a href="http://es.wikipedia.org/wiki/Elevator_Action">Elevator Action</a>. Inicialmente iba a ser un clon del juego pero seg&uacute;n avanz&oacute; el desarrollo del juego vi partes que no eran f&aacute;ciles de implementar y que requerir&iacute;an un redise&ntilde;o. Estoy hablando sobre todo del scrolling. Torre Utop&iacute;a inicialmente fue pensado para ser programado en TypeScript que es como el esqueleto lo admite por defecto. Sin embargo termin&eacute; usando muy poco las caracter&iacute;sticas de TypeScript. Creo que porque no tengo soltura suficiente todav&iacute;a en TypeScript como para usarlo correctamente. Aun as&iacute; la inclusi&oacute;n fue positiva en cierto punto porque el compilador era capaz de avisarme de variables no definidas, un error que en JavaScript corriente es tedioso de solucionar pues debes mirar la consola del navegador.</p> 
<p>Un acierto, creo yo, fue usar gr&aacute;ficos pre-generados para ir probando las mec&aacute;nicas. Esto facilita mucho desde el principio saber como va a quedar cada cosa. Sin embargo, este arte pregenerado no fue sustituido al final enteramente dando una mala imagen al espectador. Realmente se cambiar&oacute;n muchos gr&aacute;ficos pero la falta de tiempo hizo que tuviesen poco nivel de detalle. Una cosa que no me gust&oacute; fue que el personaje se moviera mir&aacute;ndote a ti. Y me cabrea m&aacute;s cuando pienso que hacerlo bien es muy sencillo de implementar.</p> 
<p>La m&uacute;sica era repetitiva y sin copyright pero quiz&aacute; deber&iacute;a haber un bot&oacute;n para acabar con el dolor de o&iacute;dos que genera escuchar una y otra vez lo mismo durante varias horas. Aunque el tema del audio lo implement&eacute; casi al final. Sin embargo no fue dif&iacute;cil alterar el resto del c&oacute;digo para que al subir el ascensor sonase (aunque es posible que con algo de retardo).</p> 
<p>La fuente usada quer&iacute;a que fuese estilo pixel para que encajase mejor; fue m&aacute;s dif&iacute;cil de lo que esperaba. Al final encontr&eacute; una que encajaba con el estilo que quer&iacute;a dar y era gratuita.</p> 
<p><img src="http://adrianarroyocalle.github.io/blog/images/TorreUtopia.png" alt="TorreUtopia" /></p> 
<h1>Distribuci&oacute;n</h1> 
<p>Una vez di por terminado el juego empez&oacute; la distribuci&oacute;n. Estaba un poco impaciente porque era la primera vez que iba a publicar en tantos sitios a la vez. Sin embargo el tema de crearse cuentas en tantos sitios hizo que me decantase solo por 5 distribuidoras. Estas han sido:</p> 
<ul> 
 <li><a href="http://www.kongregate.com/games/aarroyoc/torre-utop-a">Kongregate</a></li> 
 <li><a href="http://fgl.com">FGL</a></li> 
 <li>MarketJS</li> 
 <li><a href="http://clay.io/game/torreutopia">Clay.io</a></li> 
 <li><a href="https://marketplace.firefox.com/app/torre-utop&iacute;a">Firefox Marketplace</a></li> 
</ul> 
<h3>Kongregate</h3> 
<p><img src="http://adrianarroyocalle.github.io/blog/images/Kongregate.jpg" alt="Kongregate" /></p> 
<p>Simple y directo. Me publicaron el juego en poco tiempo y recib&iacute; comentarios de usuarios en el juego. Cuando mir&eacute; por primera vez hab&iacute;a generado 4 c&eacute;ntimos de euro. Lo m&aacute;s molesto de Kongregate es el tema fiscal. Ellos insisten en que lo cumplimentes todo aunque no es necesario. Esto es porque se pueden ahorrar impuestos (y t&uacute; ganar m&aacute;s) si lo cumplimentas. Para los que no lo conozcan en Kongregate ganas dinero por la publicidad que se ve en Kongregate cuando gente juega a tu juego. Es un portal de juegos pero con mucho tr&aacute;fico.</p> 
<h3>FGL</h3> 
<p>Originalmente dise&ntilde;ado para juegos Flash se ha adaptado y ofrece ahora tambi&eacute;n para HTML5 y Unity. FGL tiene muchas opciones de distribuci&oacute;n y para un principiante puede ser confuso. Por suerte, FGL tiene ayudas en los m&aacute;rgenes muy &uacute;tiles. En FGL ganamos dinero si nos compran el juego para publicarlo en portales de juegos. Todav&iacute;a no he recibido ninguna oferta (tampoco espero, es mi primera vez) y se encargan de hacerte una valoraci&oacute;n con nota en diferentes aspectos. En mi corta experiencia con FGL puedo decir que los administradores ayudan mucho (me enviaron correos varias veces para comunicarme fallos y como podr&iacute;a mejorar ciertas cosas)</p> 
<h3>MarketJS</h3> 
<p>MarketJS es como FGL pero centrado exclusivamente en HTML5. Mal. Cre&iacute; que por estar centrados en HTML5 (y obviamente m&aacute;s nuevos en el mundillo) tendr&iacute;an algo m&aacute;s de simpat&iacute;a. No s&eacute; si ser&aacute; la plataforma (mucho m&aacute;s verde en todos los aspectos) pero no recib&iacute; respuesta al publicar el juego. Semanas m&aacute;s tarde les envi&eacute; un correo personalmente. Su respuesta fue que cambiase la imagen de la descripci&oacute;n. La cambi&eacute;. Volv&iacute; a publicar. Y ya est&aacute;. Ninguna respuesta.</p> 
<h3>Clay.io</h3> 
<p>Ya les conoc&iacute;a y el proceso es el habitual, algo mejor que de costumbre y todo. En Clay.io ganamos dinero por anuncios como Kongregate, pero tambi&eacute;n nos pueden comprar el juego como FGL y tiene un tercer modo que es dejar a los portales de juegos el juego tal cual y por los anuncios de Clay.io recibiremos dinero como si fuera en el propio sitio. Puse un anuncio de v&iacute;deo al principio y nada m&aacute;s. Y todav&iacute;a no he ganado nada pero es m&aacute;s sospechoso si pensamos que Clay.io ha a&ntilde;adido mi juego a m&aacute;s portales con el tercer sistema como html5games.club</p> 
<h3>Firefox Marketplace</h3> 
<p><img src="http://adrianarroyocalle.github.io/blog/images/firefox-os.png" alt="Firefox OS" /><br /> Una tienda al estilo Google Play o App Store pero para Firefox OS. Fue aprobado y est&aacute; disponible pero en esta versi&oacute;n no he a&ntilde;adido anuncios. Comentar que en Firefox Marketplace obtienes los certificados PEGI, ESRB y parecidos de manera gratuita, aunque solo valen para Firefox OS. Las certificaciones en principio te las dan seg&uacute;n rellenas unas preguntas sobre el juego. Adem&aacute;s hacen pruebas aleatorias cada instituci&oacute;n y por ello pueden cambiarte la calificaci&oacute;n. En mi caso ESRB me daba T y PEGI me daba +7. Pero en diferentes an&aacute;lisis (llegaron en diferentes meses) me dijeron que al estar los gr&aacute;ficos muy pixelados la violencia que contiene el juego es m&iacute;nima, por ello actualmente tengo en ESRB la E y en PEGI +3.</p> 
<h1>Recepci&oacute;n</h1> 
<p>Vamos a ver las cr&iacute;ticas del juego a d&iacute;a de hoy:</p> 
<ul> 
 <li>Firefox Marketplace: <em>Es como wrecking cree pero m&aacute;s chafa</em> <em>4/5</em> </li> 
 <li>FGL: <em>Definitely not my type of game, but could be fun. You need to think about touch controls (how will one play it on a mobile browser) and also improve graphics, like game over screen for example.</em></li> 
 <li>FGL: <em>I like the concept for the game! Although the graphics needs some serious improvment but I think that the game could be fun with new graphics and some polish!</em></li> 
 <li>FGL, la review oficial: _<br /> Intuitiveness: 5 Needs Improvement<br /> Fun: 6 Average<br /> Graphics: 5 Needs Improvement<br /> Sound: 6 Average<br /> Quality: 6 Average<br /> Overall: 6 Average<br /> Comments:<br /> Instructions should be included in game. No-one will understand what’s going on without them.Graphics are poor. They’re programmer’s art, not professional finished product. They’re basic and very static(lack of animations). Need to be changed. Music is little low-quality. Also, there should be mute button on every screen. It’s very frustrating for players if they can’t mute music, especially if it’s annoying. There should be always a way back to main menu(Home button or something like that). Policemans are staying in the same place as player and they can’t shoot him if you don’t move. There should be some text on main menu saying “Press anything to play”._</li> 
 <li>Firefox Marketplace, un comentario oficial: <em>The game doesn’t cover large screens.</em></li> 
 <li>Kongregate: <em>Nice game, i recomend adding a menu, and make AI on the enemies.</em></li> 
</ul> 
<h1>Conclusi&oacute;n</h1> 
<p>Hay que mejorar el esqueleto npm, el audio, los sprites (aunque seguir&eacute; usando gr&aacute;ficos pre-dise&ntilde;ados al principio). Tambi&eacute;n creo que debe haber un men&uacute;, un sistema de anuncios integrados f&aacute;cilmente desactivables via par&aacute;metros GET, integraci&oacute;n con Google Analytics, ajustes para quitar el sonido, etc. Espero mejorar todos estos (y m&aacute;s aspectos que seguro que me olvido) para futuros juegos.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia" st_title="Post Mortem de Torre Utopía | El blog de Adrián Arroyo"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "adrianarroyocallegithub";
var disqus_title = "Post Mortem de Torre Utopía";
var disqus_url = "http://adrianarroyocalle.github.io/blog//2015/01/22/post-mortem-torre-utopia/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1366,
      "url" : "http://www.blogstack.info/post/elblogdeadrianarroyo/2015/01/post-mortem-de-torre-utopia"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeadrianarroyo",
      "name" : "El blog de Adrián Arroyo"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>