<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-08-10T17:02:22Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-08-10T17:02:22Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Como saber la lista de programas instalados en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-saber-la-lista-de-programas-instalados-en-ubuntu" />
    <category term="ubuntu" />
    <category term="lista" />
    <category term="programas" />
    <category term="instalados" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-10T16:26:20Z</updated>
    <published>2014-08-08T21:08:29Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a mostrar algo que nos puede resultar bastante &amp;uacute;til en algunos momentos, vamos a ver como saber todos los &lt;strong&gt;programas&lt;/strong&gt; que tenemos &lt;strong&gt;instalados&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; en forma de &lt;strong&gt;lista&lt;/strong&gt; y ademas lo vamos a exportar a un archivo para verlo mas detenidamente . Una utilidad que le podemos sacar a este proceso es identificar un programa que queremos desinstalar y no sabemos cual es su nombre, como es el caso de Jonas, un usuario que me dejo un comentario al respecto.&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/08/lista-programas-instalados-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/08/lista-programas-instalados-ubuntu.jpg" alt="lista-programas-instalados-ubuntu" width="600" height="415" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Si queremos saber los &lt;strong&gt;programas&lt;/strong&gt; que tenemos &lt;strong&gt;instalados&lt;/strong&gt; en nuestro &lt;strong&gt;Ubuntu&lt;/strong&gt; tan solo tenemos que abrir una Terminal y escribir el siguiente comando:&lt;/p&gt; 
 &lt;pre&gt;dpkg --get-selections&lt;/pre&gt; 
 &lt;p&gt;En mi caso al escribir este comando en la Terminal me aparece la lista de programas instalados que tengo pero no los muestra todos. Aparecen ordenados por orden alfab&amp;eacute;tico y, como ya he dicho antes, solo aparecen los &amp;uacute;ltimos. Si queremos ver la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-saber-la-lista-de-programas-instalados-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-08T21:08:29Z</dc:date>
  </entry>
  <entry>
    <title>Que es la RAM y para que sirve la SWAP en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/que-es-la-ram-y-para-que-sirve-la-swap-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="swap" />
    <category term="ram" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-06T08:40:09Z</updated>
    <published>2014-08-06T08:40:09Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de dos cosas y voy a intentar explicar ambas de la forma mas sencilla posible para que quede claro que son la &lt;strong&gt;RAM&lt;/strong&gt; y la &lt;strong&gt;SWAP&lt;/strong&gt; y para que sirven en &lt;strong&gt;Ubuntu&lt;/strong&gt;, aunque esto es extensible a todos los sistemas operativos de PC. En el caso de Windows el tema de la SWAP es algo diferente y explicare tambi&amp;eacute;n un poco como funciona.&lt;/p&gt; 
 &lt;p&gt;Lo primero que voy a explicar es que es la &lt;strong&gt;RAM&lt;/strong&gt;, cuando nosotros tenemos un ordenador nuestra informaci&amp;oacute;n, sean programas o archivos personales, es almacenada de dos formas principales, una de ellas es el disco duro y otro la RAM. En el disco duro de nuestro ordenador tenemos &lt;strong&gt;Ubuntu&lt;/strong&gt;, por poner un ejemplo, sus programas y nuestros archivos personales, pero el disco duro es solo un “almac&amp;eacute;n” y para poder usar todo eso necesitamos que este en la memoria RAM de nuestro ordenador, es decir, cuando abrimos un programa como un procesador de textos dicho programa se carga en la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/que-es-la-ram-y-para-que-sirve-la-swap-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-06T08:40:09Z</dc:date>
  </entry>
  <entry>
    <title>Los editores de texto predeterminados en Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/los-editores-de-texto-predeterminados-en-linux" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="texto" />
    <category term="linux" />
    <category term="editor" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-28T12:39:45Z</updated>
    <published>2014-07-28T12:39:45Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Haces unos d&amp;iacute;as un usuario llamado Zock me dejo un comentario en un articulo en el cual describo como instalar Spotify en Ubuntu diciendo que hab&amp;iacute;a tenido problemas para seguir el articulo debido a que era usuario de Lubuntu y yo hab&amp;iacute;a explicado el proceso desde Ubuntu. En uno de los pasos puse una orden que hab&amp;iacute;a que ejecutar en la Terminal tal que as&amp;iacute;:&lt;/p&gt; 
 &lt;pre&gt;sudo gedit conf&lt;/pre&gt; 
 &lt;p&gt;Esta orden indica que queremos abrir un archivo llamado “conf”, que queremos abrirlo con el programa “gedit” y que queremos hacerlo con privilegios de root. El problema del usuario radicaba en que al querer ejecutar este comando no pod&amp;iacute;a abrirse el programa “gedit” debido a que no lo tenia instalado en Lubuntu y este articulo es para explicar como “arreglar” este problema.&lt;/p&gt; 
 &lt;p&gt;Antes de seguir me gustar&amp;iacute;a pedir disculpas a Zock y a todos aquellos a los que les haya pasado lo mismo, los art&amp;iacute;culos que escribo en este blog van destinados a los usuarios de Ubuntu y no hab&amp;iacute;a tenido en cuenta hasta ahora las diferencias entre Ubuntu y Lubuntu, por poner un ejemplo. Tambi&amp;eacute;n es cierto que es dif&amp;iacute;cil en ocasiones tener en cuenta todos los factores a la hora de escribir un articulo, pero gracias a este usuario me he dado cuenta del error y quiero subsanarlo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/los-editores-de-texto-predeterminados-en-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-28T12:39:45Z</dc:date>
  </entry>
  <entry>
    <title>Edubuntu acaba de lanzar su versión LTS 14.04.1</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/edubuntu-acaba-de-lanzar-su-version-lts-14-4-1" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="linux" />
    <category term="sistemas-operativos" />
    <category term="noticias" />
    <category term="lts" />
    <category term="edubuntu" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-07-25T10:06:19Z</updated>
    <published>2014-07-25T09:59:05Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/edubuntu_logo1.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/edubuntu_logo1.jpg" alt="edubuntu_logo1" width="150" height="150" /&gt;&lt;/a&gt;La derivaci&amp;oacute;n oficial de &lt;strong&gt;Ubuntu&lt;/strong&gt;, enfocada a la educaci&amp;oacute;n, ha lanzado a d&amp;iacute;a de hoy su &amp;uacute;ltima versi&amp;oacute;n, la &lt;strong&gt;14.04.1&lt;/strong&gt;,&amp;nbsp; que &amp;eacute;sta vez ser&amp;aacute; &lt;strong&gt;LTS (Long Term Support)&lt;/strong&gt; Entre las novedades encontramos la correcci&amp;oacute;n de errores y mejoras, entre ellos el soporte mejorado del hardware.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Edubuntu&lt;/strong&gt; est&amp;aacute; creado para los entornos educativos donde el docente o profesor no tenga conocimientos altos t&amp;eacute;cnicos y puedan disfrutar los alumnos de un abanico amplio de aplicaciones educativas.&amp;nbsp; C&amp;oacute;mo ya se deduce de su nombre est&amp;aacute; basada en Ubuntu, la &amp;uacute;ltima versi&amp;oacute;n se basa en&amp;nbsp; &lt;strong&gt;Ubuntu 13.04&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Detr&amp;aacute;s del proyecto, seg&amp;uacute;n indican en su web, tenemos a una amplia comunidad de “&lt;strong&gt;&lt;em&gt;estudiantes, maestros, padres de familia y hackers, &lt;/em&gt;&lt;em&gt;que creen que el aprendizaje y el conocimiento debe estar disponible para todos los que quieren mejorarse a s&amp;iacute; mismos y el mundo &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/edubuntu-acaba-de-lanzar-su-version-lts-14-4-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-07-25T09:59:05Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar Grive en Ubuntu y trabajar con Google Drive</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-instalar-grive-en-ubuntu-y-trabajar-con-google-drive" />
    <category term="ubuntu" />
    <category term="grive" />
    <category term="google-drive" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-24T15:54:49Z</updated>
    <published>2014-07-24T15:54:49Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar sobre un programa llamado &lt;strong&gt;Grive&lt;/strong&gt; para &lt;strong&gt;Ubuntu&lt;/strong&gt;, que nos va a hacer mas f&amp;aacute;cil usar &lt;strong&gt;Google Drive&lt;/strong&gt;. Para aquellos que aun no conozcan Google Drive os voy a explicar que es. Cuando creamos una cuenta de Gmail de Google tenemos acceso a una serie de herramientas o tecnolog&amp;iacute;as que pone a nuestro servicio de forma gratuita y una de ellas es Google Drive, que es un disco duro virtual en la nube con 15 GB de espacio para lo que nosotros queramos usar. Tenemos la posibilidad de tener mas espacio pero tendr&amp;iacute;amos que pagar.&lt;/p&gt; 
 &lt;p&gt;Cada vez que queremos subir archivos a Google Drive tenemos que abrirlo en el navegador, eso esta muy bien pero estar&amp;iacute;a aun mejor tener un directorio en nuestro ordenador de tal forma que cada vez que pongamos un archivo en dicho directorio se suba autom&amp;aacute;ticamente a nuestra unidad de Google Drive o, si borramos un archivo de ese directorio tambi&amp;eacute;n se borre de Google Drive, es decir, que un directorio de nuestro ordenador este sincronizado con nuestra unidad de Google Drive, &amp;iquest;verdad? Exactamente eso es lo que vamos a conseguir con &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-instalar-grive-en-ubuntu-y-trabajar-con-google-drive"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-24T15:54:49Z</dc:date>
  </entry>
  <entry>
    <title>Como añadir una emisora a Great Little Radio Player en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-anadir-una-emisora-a-great-little-radio-player-en-ubuntu" />
    <category term="ubuntu" />
    <category term="anadir" />
    <category term="radio" />
    <category term="emisora" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-22T18:54:20Z</updated>
    <published>2014-07-22T18:54:20Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En el &lt;a href="http://elblogdeliher.com/como-escuchar-la-radio-en-ubuntu/"&gt;anterior articulo&lt;/a&gt; os hable de un programa que esta muy bien llamado &lt;strong&gt;Great Little Radio Player&lt;/strong&gt;, dicho programa sirve para poder escuchar distintas &lt;strong&gt;emisoras&lt;/strong&gt; de radio mientras estamos usando &lt;strong&gt;Ubuntu&lt;/strong&gt;. Por defecto vienen muchas emisoras preconfiguradas, pero puede que queramos &lt;strong&gt;a&amp;ntilde;adir&lt;/strong&gt; alguna y eso es precisamente lo que os quiero mostrar en este articulo.&lt;/p&gt; 
 &lt;p&gt;En mi caso para mostraros el proceso he elegido una emisora que ha creado el archiconocido &lt;a href="http://yoyo308.com/"&gt;Yoyo&lt;/a&gt;, y que pod&amp;eacute;is encontrar en la siguiente pagina:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://killallradio.blogspot.com.es/"&gt;Pagina de Killall Radio de Yoyo&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Esta reci&amp;eacute;n creada pero como todo lo que hace Yoyo seguro que nos brindara horas de entretenimiento, aprendizaje, buen rollo y buen humor. En este caso, lo que tenemos que buscar para a&amp;ntilde;adir a GLRP (a partir de ahora me referir&amp;eacute; as&amp;iacute; al programa, es que soy muy vago ;D), esta muy a la vista, es muy f&amp;aacute;cil de encontrar, en otras webs puede que nos cueste mas. Al acceder a la web de Killall Radio ver&amp;eacute;is lo siguiente:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-anadir-una-emisora-a-great-little-radio-player-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-22T18:54:20Z</dc:date>
  </entry>
  <entry>
    <title>Como escuchar la radio en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-escuchar-la-radio-en-ubuntu" />
    <category term="ubuntu" />
    <category term="radio" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-21T18:04:25Z</updated>
    <published>2014-07-21T18:04:25Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de una peque&amp;ntilde;a pero genial aplicaci&amp;oacute;n que servir&amp;aacute; para que pod&amp;aacute;is escuchar la &lt;strong&gt;radio&lt;/strong&gt; en vuestro ordenador de una forma muy sencilla mientras us&amp;aacute;is &lt;strong&gt;Ubuntu&lt;/strong&gt;. El programa en cuesti&amp;oacute;n se llama &lt;strong&gt;Great Little Radio Player&lt;/strong&gt;, os voy a hablar un poco de sus bondades y mas abajo os dejare un enlace a su pagina en la cual pod&amp;eacute;is descargar el archivo instalador para vuestro Ubuntu, aunque tambi&amp;eacute;n hay disponibles versiones para otras distribuciones de Linux. Yo lo he usado en Ubuntu 12.04 y 14.04 y funciona perfecto, ademas su manejo es muy sencillo.&lt;/p&gt; 
 &lt;p&gt;El programa en si pesa unas 8 MB, una vez descargado lo podr&amp;eacute;is instalar solo con hacer doble click sobre el archivo con extensi&amp;oacute;n “deb” que os descargu&amp;eacute;is. Una vez que lo teng&amp;aacute;is instalado solo ten&amp;eacute;is que buscar el icono se&amp;ntilde;alado en la siguiente imagen dentro del Dash de Ubuntu:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-escuchar-la-radio-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-21T18:04:25Z</dc:date>
  </entry>
  <entry>
    <title>Linux y GNU están de moda</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/linux-y-gnu-estan-de-moda" />
    <category term="mundo-geek" />
    <category term="blog-stack" />
    <category term="debian" />
    <category term="ubuntu" />
    <category term="linuxmint" />
    <category term="fsf" />
    <category term="canonical" />
    <category term="manjaro" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-07-21T05:07:27Z</updated>
    <published>2014-07-21T03:01:25Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/run-gcc-fsf-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/run-gcc-fsf-150.jpg" alt="run-gcc-fsf-150" width="150" height="149" /&gt;&lt;/a&gt;Ahora que en el hemisferio norte estamos en pleno verano, es una oportunidad fant&amp;aacute;stica para ayudar a nuestra distribuci&amp;oacute;n favorita a financiarse y de paso lucir un incre&amp;iacute;ble &lt;strong&gt;&lt;em&gt;look geek&lt;/em&gt; &lt;/strong&gt;en el paseo mar&amp;iacute;timo de nuestra ciudad costera favorita, en el camping de todos los a&amp;ntilde;os o en nuestra ciudad, ya que nos toca trabajar o porque no tenemos ni un chavo o guita o dinero para irnos fuera.&lt;/p&gt; 
&lt;p&gt;Pr&amp;aacute;cticamente todas las distribuciones tienen su propia tienda o apartado en la web donde nos podemos hacer con su &lt;strong&gt;&lt;em&gt;merchandising&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Aqu&amp;iacute; os dejo unas cuantas:&lt;/p&gt; 
&lt;p&gt;Empecemos con la tienda del proyecto comunitario &lt;strong&gt;opensuse&lt;/strong&gt;, que pod&amp;eacute;is ver&amp;nbsp;&lt;a title="Tienda OpenSuse" href="http://shop.opensuse.org/"&gt;aqu&amp;iacute;&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;Os dejo una captura de su aspecto actual:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/opensuse-shop.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/opensuse-shop.jpg" alt="opensuse-shop" width="521" height="614" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Debian&lt;/strong&gt; no tiene una tienda ya que es una fundaci&amp;oacute;n sin &amp;aacute;nimo de lucro. Pero en su web podemos encontrar una lista de tiendas &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/linux-y-gnu-estan-de-moda"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-07-21T03:01:25Z</dc:date>
  </entry>
  <entry>
    <title>Como configurar el prompt de la Terminal de Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-configurar-el-prompt-de-la-terminal-de-ubuntu" />
    <category term="prompt" />
    <category term="ubuntu" />
    <category term="terminal" />
    <category term="configurar" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-15T08:27:14Z</updated>
    <published>2014-07-13T08:37:56Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;La idea de escribir este articulo surgi&amp;oacute; a ra&amp;iacute;z de leer uno en el blog de Diego Macias en el cual mostraba como personalizar el &lt;strong&gt;prompt&lt;/strong&gt; de la &lt;strong&gt;Terminal&lt;/strong&gt;. Dicho articulo esta muy bien pero va enfocado a los usuarios de Arch y yo he decidido hacer uno enfocado a los usuarios de &lt;strong&gt;Ubuntu&lt;/strong&gt;. Podeis acceder al articulo de Diego pinchando en el siguiente enlace:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&amp;nbsp;&lt;a href="http://www.dmaciasblog.com/personalizando-el-prompt-de-nuestra-terminal/"&gt;Enlace al articulo sobre el prompt de Diego Macias.&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Siempre me he conformado con el prompt que venia por defecto, pero Diego me ha picado y he querido personalizarlo un poco, nunca lo habia hecho y me ha gustado el resultado final que me parece mas &amp;uacute;til que est&amp;eacute;ticamente bonito, los colores elegidos son los de mi equipo de futbol, el F.C. Barcelona. Vamos a ver como personalizar el prompt de Ubuntu e intentare explicarlo de la mejor manera posible y con ejemplos. Con &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-configurar-el-prompt-de-la-terminal-de-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-13T08:37:56Z</dc:date>
  </entry>
  <entry>
    <title>Unos prompt de ejemplo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/unos-prompt-de-ejemplo" />
    <category term="prompt" />
    <category term="ubuntu" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-15T08:26:00Z</updated>
    <published>2014-07-15T08:26:00Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Tenia que haber puesto esto en el articulo anterior en el cual mostraba como configurar el &lt;strong&gt;prompt&lt;/strong&gt; de la Terminal de Ubuntu, pero la verdad es que el articulo ya me hab&amp;iacute;a quedado un poco largo y decid&amp;iacute; que era mejor hacer otro post para ponerlos. Si no lo hab&amp;eacute;is le&amp;iacute;do aqu&amp;iacute; os dejo el enlace:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/como-configurar-el-prompt-de-la-terminal-de-ubuntu/"&gt;Como configurar el prompt de la Terminal de Ubuntu&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Aqu&amp;iacute; hay varios &lt;strong&gt;prompt&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;de ejemplo&amp;nbsp;&lt;/strong&gt;que he visto en Internet, de ellos me he ayudado para aprender a hacerlo y cogiendo un poco de uno y otro he ido configurando el mio y aprendiendo a modificarlo. Os voy a poner el c&amp;oacute;digo y despu&amp;eacute;s la imagen de como queda, as&amp;iacute; si quer&amp;eacute;is usar uno y no quer&amp;eacute;is entreteneros en configurarlo podr&amp;eacute;is disponer de ellos f&amp;aacute;cilmente.&lt;/p&gt; 
 &lt;pre&gt;PS1='\[\033[0;32m\]┌┼─┼─ \[\033[0m\033[0;32m\]\u\[\033[0m\] @ \[\033[0;36m\]\h\[\033[0m\033[0;32m\] ─┤├─ \[\033[0m\]\t \d\[\033[0;32m\] ─┤├─ \[\033[0;31m\]\w\[\033[0;32m\] ─┤ \n\[\033[0;32m\]└┼─\[\033[0m\033[0;32m\]\$\[\033[0m\033[0;32m\]─┤▶\[\033[0m\] '&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/unos-prompt-de-ejemplo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-15T08:26:00Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar Spotify en Ubuntu 14.04</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-instalar-spotify-en-ubuntu-14-4" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="spotify" />
    <category term="spotify-ubuntu" />
    <category term="instalar-spotify" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-14T19:00:09Z</updated>
    <published>2014-05-27T14:44:48Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Para todos aquellos que todav&amp;iacute;a no conozcan este programa, el &lt;strong&gt;Spotify&lt;/strong&gt;, os voy a hablar un poco de el y de sus bondades, ademas os voy a mostrar &lt;strong&gt;como instalarlo en Ubuntu 12.04 y Ubuntu 14.04&lt;/strong&gt;, para ambas versiones el proceso es el mismo. Yo lo conoci hace ya un tiempo y, aunque me gusta mucho, no lo uso habitualmente porque, seg&amp;uacute;n lo que este haciendo, la m&amp;uacute;sica no me deja concentrarme.&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/05/spotify-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/05/spotify-ubuntu.jpg" alt="spotify-ubuntu" width="400" height="400" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="https://www.spotify.com/es/"&gt;&lt;strong&gt;Spotify&lt;/strong&gt;&lt;/a&gt; es un programa multiplataforma, esto quiere decir que lo podemos usar en Windows, Linux y MAC, que sirve b&amp;aacute;sicamente para escuchar m&amp;uacute;sica a trav&amp;eacute;s de Internet. La cantidad de canciones es interminable, hay de todo y mucho. Podemos escuchar canciones sueltas, o discos enteros. Ademas tienes la opci&amp;oacute;n de estar al d&amp;iacute;a escuchando las novedades en las distintas emisoras disponibles. Siempre que tengas conexi&amp;oacute;n a Internet podr&amp;aacute;s escuchar cualquier disco o canci&amp;oacute;n, sea del artista que sea.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-instalar-spotify-en-ubuntu-14-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-27T14:44:48Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Wine mediante PPA en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-y-como-instalar-wine-mediante-ppa-en-ubuntu" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="wine" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-10T16:36:51Z</updated>
    <published>2014-07-10T16:36:51Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os voy a hablar de una aplicaci&amp;oacute;n que podemos &lt;strong&gt;instalar&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y que puede ser de mucha utilidad para aquellos usuarios que provienen de Windows y todav&amp;iacute;a necesiten usar algunas aplicaciones de ese sistema operativo. El programa en cuesti&amp;oacute;n se llama &lt;strong&gt;Wine&lt;/strong&gt;, os voy a hablar un poco de el y despu&amp;eacute;s os mostrare como instalar su ultima versi&amp;oacute;n disponible mediante &lt;strong&gt;PPA&lt;/strong&gt; en Ubuntu, tengo que decir que este PPA sirve para todas las versiones de Ubuntu, incluso ya funciona para Ubuntu 14.10.&lt;/p&gt; 
 &lt;p&gt;Si queremos usar alguna aplicaci&amp;oacute;n de Windows en Ubuntu tenemos algunas opciones, hay algunos programas que tienen su versi&amp;oacute;n oficial para Windows y Linux, pero otros no. Cuando nos encontramos en la situaci&amp;oacute;n en que no tenemos una versi&amp;oacute;n oficial del programa deseado de Windows para &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-y-como-instalar-wine-mediante-ppa-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-10T16:36:51Z</dc:date>
  </entry>
  <entry>
    <title>Que es I-Nex y como instalar en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-i-nex-y-como-instalar-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-07T17:00:16Z</updated>
    <published>2014-07-07T16:02:20Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este tema ya lo he tratado en otras ocasiones, el de obtener informaci&amp;oacute;n de nuestro PC y de nuestra distribuci&amp;oacute;n, pero el otro d&amp;iacute;a me encontr&amp;eacute; en una pagina con este programa y me pareci&amp;oacute; digno de hacer un articulo. La pagina en cuesti&amp;oacute;n se llama &lt;a href="http://trastetes.blogspot.com.es/"&gt;Trastetes&lt;/a&gt; y pod&amp;eacute;is acceder a ella pinchando en el nombre, recomiendo su lectura, esta muy bien. En este caso hablaba sobre&lt;strong&gt; I-Nex&lt;/strong&gt;, un programa que nos dar&amp;aacute; mucha informaci&amp;oacute;n de nuestro ordenador y de el &lt;strong&gt;Ubuntu&lt;/strong&gt; que tengamos instalado. Os voy a mostrar algunas capturas y al final os dir&amp;eacute; como lo podemos &lt;strong&gt;instalar&lt;/strong&gt; a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente. Tengo que decir que es un proyecto activo, incluso han sacado ya la versi&amp;oacute;n del programa correspondiente a Ubuntu 14.10.&lt;/p&gt; 
 &lt;p&gt;El programa en si esta dividido en pesta&amp;ntilde;as y cada una representa una secci&amp;oacute;n en la cual podr&amp;eacute;is ver informaci&amp;oacute;n muy detallada. Os muestro unas capturas que he tomado despu&amp;eacute;s de instalarlo en mi Ubuntu 14.04:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-i-nex-y-como-instalar-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-07T16:02:20Z</dc:date>
  </entry>
  <entry>
    <title>Abrir como root un archivo en Ubuntu de forma sencilla</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/abrir-como-root-un-archivo-en-ubuntu-de-forma-sencilla" />
    <category term="ubuntu" />
    <category term="abrir" />
    <category term="archivo" />
    <category term="tips" />
    <category term="root" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-30T19:26:47Z</updated>
    <published>2014-06-30T18:47:47Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Seguro que en alguna ocasi&amp;oacute;n hab&amp;eacute;is tenido que &lt;strong&gt;abrir&lt;/strong&gt; una carpeta o ejecutar un &lt;strong&gt;archivo&lt;/strong&gt; &lt;strong&gt;como root&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y la verdad es que estar&amp;iacute;a muy bien que este sencillo proceso fuese mas r&amp;aacute;pido de hacer. Eso es precisamente lo que os quiero mostrar en este articulo, vamos a ver como a&amp;ntilde;adir una entrada al men&amp;uacute; que aparece cuando hacemos click con el bot&amp;oacute;n derecho del rat&amp;oacute;n y que dicha entrada sirva para &lt;strong&gt;abrir&lt;/strong&gt; un archivo o directorio como &lt;strong&gt;root&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;Yo ya tengo instalado lo necesario para que al pinchar con el bot&amp;oacute;n derecho del rat&amp;oacute;n sobre un archivo o directorio me aparezca la opci&amp;oacute;n de abrirlo como root en el men&amp;uacute;, esto lo pod&amp;eacute;is ver en la siguiente captura:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/06/abrir-como-root.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/06/abrir-como-root.jpg" alt="abrir-como-root" width="663" height="476" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Como pod&amp;eacute;is ver en la imagen, he pulsado con el bot&amp;oacute;n derecho del rat&amp;oacute;n sobre un directorio llamado “Mis archivos” y en el men&amp;uacute; que aparece tengo una opci&amp;oacute;n llamada “Scripts”, al pasar el rat&amp;oacute;n por encima aparece el men&amp;uacute; de la derecha y la opci&amp;oacute;n que esta resaltada es “Open_as_Administrator”, o lo que es lo mismo,&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/abrir-como-root-un-archivo-en-ubuntu-de-forma-sencilla"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-30T18:47:47Z</dc:date>
  </entry>
  <entry>
    <title>Canonical actualiza el sitio web de Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/canonical-actualiza-el-sitio-web-de-ubuntu" />
    <category term="blog-stack" />
    <category term="china" />
    <category term="ubuntu" />
    <category term="web" />
    <category term="linux" />
    <category term="noticias" />
    <category term="canonical" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-06-25T16:08:48Z</updated>
    <published>2014-06-25T15:45:50Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/ubuntu-linux-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/ubuntu-linux-150.jpg" alt="ubuntu-linux-150" width="150" height="120" /&gt;&lt;/a&gt;Canonical ha actualizado la web &lt;a title="Ubuntu.com" href="http://www.ubuntu.com/"&gt;ubuntu.com&lt;/a&gt;, para todas sus versiones, es decir, para sobremesa y dispotivios m&amp;oacute;viles. Se trata de una serie de mejoras sutiles pero significativas, y que dan pistas sobre su futuro.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h1&gt;&lt;strong&gt;Como novedades m&amp;aacute;s significativas:&lt;/strong&gt;&lt;/h1&gt; 
&lt;ul&gt; 
 &lt;li&gt;Han lanzado la versi&amp;oacute;n de su sitio web para China: &lt;a title="Ubuntu China" href="http://www.ubuntu-china.cn/"&gt;ubuntu-china.cn&lt;/a&gt;, ampliando su influencia en dicho pa&amp;iacute;s.&lt;/li&gt; 
 &lt;li&gt;Actualizan el apartado de documentaci&amp;oacute;n legal.&lt;/li&gt; 
 &lt;li&gt;Nueva versi&amp;oacute;n de &lt;a title="Ubuntu Insights" href="https://insights.ubuntu.com/"&gt;Ubuntu Insights&lt;/a&gt;, el portal de noticias del mundo de Ubuntu.&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Entre otras muchas cosas, tambi&amp;eacute;n est&amp;aacute;n &lt;strong&gt;trabajando en mejoras&lt;/strong&gt; que llegar&amp;aacute;n en no mucho espacio de tiempo:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Una nueva web para los &lt;a title="Ubuntu Partners" href="http://www.ubuntu.com/partners"&gt;Ubuntu Partners&lt;/a&gt;.&lt;/li&gt; 
 &lt;li&gt;Una serie sensible de cambios en el c&amp;oacute;digo y dise&amp;ntilde;o de la web, que mejorar&amp;aacute; mucho la experiencia del usuario.&lt;/li&gt; 
 &lt;li&gt;Mejoras en el portal de infraestructura en la nube &lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/canonical-actualiza-el-sitio-web-de-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-06-25T15:45:50Z</dc:date>
  </entry>
  <entry>
    <title>Como añadir una carpeta a los marcadores de Nautilus en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-anadir-una-carpeta-a-los-marcadores-de-nautilus-en-ubuntu" />
    <category term="marcadores" />
    <category term="ubuntu" />
    <category term="anadir" />
    <category term="carpeta" />
    <category term="nautilus" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-25T14:33:07Z</updated>
    <published>2014-06-25T14:33:07Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;El &lt;strong&gt;Nautilus&lt;/strong&gt; es el navegador de archivos que viene instalado por defecto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, a mi me gusta, es sencillo y practico, aunque estar&amp;iacute;a bien que tuviese algunas funcionalidades mas, pero esto podemos resolverlo mediante extensiones. En este articulo os voy a mostrar como &lt;strong&gt;a&amp;ntilde;adir&lt;/strong&gt; una &lt;strong&gt;carpeta&lt;/strong&gt; a los &lt;strong&gt;marcadores&lt;/strong&gt; del Nautilus en Ubuntu y tambi&amp;eacute;n como quitarlas. Este proceso lo he usado en Ubuntu 12.04 y 14.04.&lt;/p&gt; 
 &lt;p&gt;Si no sab&amp;eacute;is a que me refiero os voy a detallar un poco mas el tema. Cuando abrimos el &lt;strong&gt;Nautilus&lt;/strong&gt; vemos algo parecido a lo siguiente:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/06/nautilus-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/06/nautilus-ubuntu.jpg" alt="nautilus-ubuntu" width="600" height="400" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;En esta imagen podemos ver un hueco que esta vac&amp;iacute;o en la parte izquierda de la pantalla y que esta se&amp;ntilde;alado por la flecha roja. Esta captura de pantalla no muestra el &lt;strong&gt;Nautilus&lt;/strong&gt; maximizado, si estuviese a pantalla completa ese hueco seria mayor y &amp;iquest;no estar&amp;iacute;a bien usarlo para algo? Eso es lo que vamos a hacer en este articulo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-anadir-una-carpeta-a-los-marcadores-de-nautilus-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-25T14:33:07Z</dc:date>
  </entry>
  <entry>
    <title>Cambiar la frecuencia del procesador en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/cambiar-la-frecuencia-del-procesador-en-ubuntu" />
    <category term="ubuntu" />
    <category term="indicador" />
    <category term="tips" />
    <category term="frecuencia" />
    <category term="procesador" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-24T22:08:52Z</updated>
    <published>2014-06-24T22:08:52Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos d&amp;iacute;as que publique un articulo mostrando &lt;a href="http://elblogdeliher.com/como-desactivar-el-bluetooth-al-inicio-en-ubuntu/"&gt;como desactivar el Bluetooth&lt;/a&gt; al inicio en &lt;strong&gt;Ubuntu&lt;/strong&gt; para ahorrar un poco de bater&amp;iacute;a, en dicho articulo dije que iba a publicar otro en el cual mostrar&amp;iacute;a otra forma de ahorrar bater&amp;iacute;a y aqu&amp;iacute; esta, os voy a mostrar como podemos cambiar la &lt;strong&gt;frecuencia&lt;/strong&gt; del &lt;strong&gt;procesador&lt;/strong&gt; de una forma muy sencilla en &lt;strong&gt;Ubuntu&lt;/strong&gt; mediante un indicador que esta en los repositorios oficiales de &lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt;.&lt;/p&gt; 
 &lt;p&gt;No puedo decir una cifra o porcentaje exacto del ahorro que puede suponer usar este indicador, pero al bajar la velocidad o &lt;strong&gt;frecuencia&lt;/strong&gt; del procesador de nuestro ordenador algo de bater&amp;iacute;a seguro que ahorramos. Este indicador es muy f&amp;aacute;cil de usar y de instalar y os voy a mostrar como hacer las dos cosas.&lt;/p&gt; 
 &lt;p&gt;Lo primero que tenemos que hacer para instalar el indicador, yo lo he instalado en Ubuntu 14.04, para cambiar la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/cambiar-la-frecuencia-del-procesador-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-24T22:08:52Z</dc:date>
  </entry>
  <entry>
    <title>Que son los controladores privativos o adicionales en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/que-son-los-controladores-privativos-o-adicionales-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="controladores" />
    <category term="privativos" />
    <category term="adicionales" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-15T22:51:02Z</updated>
    <published>2014-06-15T22:51:02Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Si eres nuevo en &lt;strong&gt;Ubuntu&lt;/strong&gt; y estas empezando a conocer esta distribuci&amp;oacute;n Linux, estar&amp;aacute;s empezando a o&amp;iacute;r una serie de t&amp;eacute;rminos que pueden sonar a chino si nadie te los explica. Este es el caso de los &lt;strong&gt;controladores&lt;/strong&gt; &lt;strong&gt;adicionales&lt;/strong&gt; o &lt;strong&gt;privativos&lt;/strong&gt; en Ubuntu, pues bien, en este articulo voy a explicar que son y para que sirven.&lt;/p&gt; 
 &lt;p&gt;Normalmente cuando instalamos Ubuntu en un ordenador todos o casi todos los componentes del ordenador son reconocidos y podemos usarlos sin necesidad de instalar ning&amp;uacute;n driver. Ubuntu tiene drivers libres para muchos dispositivos, pero tambi&amp;eacute;n tenemos los &lt;strong&gt;controladores&lt;/strong&gt; o drivers &lt;strong&gt;privativos&lt;/strong&gt;. Algunos de estos dispositivos son las tarjetas de red y las tarjetas gr&amp;aacute;ficas.&lt;/p&gt; 
 &lt;p&gt;Como ya he dicho antes &lt;strong&gt;Ubuntu&lt;/strong&gt; reconocer&amp;aacute; casi seguro todos los componentes de nuestro ordenador, pero puede ser que tengamos alg&amp;uacute;n problema con algunos de esos dispositivos y es ah&amp;iacute; donde entran en juegos los &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/que-son-los-controladores-privativos-o-adicionales-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-15T22:51:02Z</dc:date>
  </entry>
  <entry>
    <title>Como desactivar el Bluetooth al inicio en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-desactivar-el-bluetooth-al-inicio-en-ubuntu" />
    <category term="ubuntu" />
    <category term="inicio" />
    <category term="tips" />
    <category term="bluetooth" />
    <category term="desactivar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-15T08:14:39Z</updated>
    <published>2014-06-15T08:14:39Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Recientemente he cambiado de port&amp;aacute;til y el que tengo ahora tiene &lt;strong&gt;Bluetooth&lt;/strong&gt;. Una de las principales preocupaciones que tenemos los usuarios de ordenadores port&amp;aacute;tiles es el gasto de la bater&amp;iacute;a y tener caracter&amp;iacute;sticas como el Bluetooth activadas por defecto propicia que este gasto de energ&amp;iacute;a aumente, aunque no se cuanta bater&amp;iacute;a gastara, pero en mi caso no lo uso y por lo tanto no tiene sentido tenerlo activado. Y eso es lo que os voy a mostrar, como &lt;strong&gt;desactivar el Bluetooth&lt;/strong&gt; &lt;strong&gt;al inicio en Ubuntu&lt;/strong&gt;. Tengo que decir que he probado esto en &lt;strong&gt;Ubuntu 12.04 y 14.04 con exito&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;En pr&amp;oacute;ximos art&amp;iacute;culos os mostrare alguna otra cosa que os ahorrara bater&amp;iacute;a, tambi&amp;eacute;n hay que decir que estos cambios no van a conseguir que una bater&amp;iacute;a que dura unas dos horas llegue a durar 4 pero si podemos aumentar la duraci&amp;oacute;n en un 25%, mas o menos.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-desactivar-el-bluetooth-al-inicio-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-15T08:14:39Z</dc:date>
  </entry>
  <entry>
    <title>Montar un servidor FTP desde 0, con PROFTPD</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/montar-un-servidor-ftp-desde-con-proftpd" />
    <category term="blog-stack" />
    <category term="debian" />
    <category term="proftpd" />
    <category term="ubuntu" />
    <category term="ftp" />
    <category term="linux" />
    <category term="servicios" />
    <category term="comandos" />
    <category term="gnu" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-06-12T11:33:41Z</updated>
    <published>2014-06-12T11:32:46Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/proftpd.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/proftpd-150x92.png" alt="proftpd" width="150" height="92" /&gt;&lt;/a&gt;Quien haya trabajado como administrador de sistemas o como webmaster de un sitio web, sabe los importante que es el servicio FTP, y lo que facilita el d&amp;iacute;a a d&amp;iacute;a.&lt;/p&gt; 
&lt;p&gt;&lt;a title="PROFTPD" href="http://www.proftpd.org/"&gt;PROFTPD&lt;/a&gt; es un programa muy potente,&amp;nbsp; f&amp;aacute;cil de usar y administrar. Partimos de la base que trabajamos con una m&amp;aacute;quina GNU/Linux, basada en Debian, ya sea el propio Debian, o Ubuntu o Elementary OS o la que sea.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Desde la l&amp;iacute;nea de comandos s&amp;oacute;lo tendremos que teclear el siguiente mandato:&lt;/p&gt; 
&lt;pre&gt;apt-get -y update &amp;amp;&amp;amp; apt-get -y install proftpd&lt;/pre&gt; 
&lt;p&gt;A mitad de la instalaci&amp;oacute;n nos preguntar&amp;aacute; c&amp;oacute;mo queremos que se ejecute el servicio, en modo “standalone” o desde inetd. La diferencia entre ambos radica en que desde inetd cada vez que se produzca una nueva conexi&amp;oacute;n se abrir&amp;aacute; un nuevo proceso, con la carga del sistema que conlleva. En modo “standalone” el servicio se ejecuta en un proceso independiente, de &amp;eacute;sta manera el proceso ya estar&amp;aacute; iniciado, y no har&amp;aacute; falta volverlo a iniciar. Por lo tanto elegimos “standalone”.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/montar-un-servidor-ftp-desde-con-proftpd"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-06-12T11:32:46Z</dc:date>
  </entry>
  <entry>
    <title>Como seleccionar con que programa abrir por defecto un archivo en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-seleccionar-con-que-programa-abrir-por-defecto-un-archivo-en-ubuntu" />
    <category term="ubuntu" />
    <category term="programa" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-05T15:21:49Z</updated>
    <published>2014-06-05T15:21:49Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Despu&amp;eacute;s de instalar &lt;strong&gt;Ubuntu&lt;/strong&gt; los archivos de nuestro ordenador tienen asignadas unas aplicaciones con las que se abrir&amp;aacute;n &lt;strong&gt;por defecto&lt;/strong&gt;. Esto lo podemos cambiar f&amp;aacute;cilmente y es lo que os voy a mostrar, como seleccionar el &lt;strong&gt;programa&lt;/strong&gt; con el que abrir por defecto vuestros archivos en &lt;strong&gt;Ubuntu&lt;/strong&gt;. El procedimientos es el mismo en Ubuntu 12.04 y 14.04, puede haber ligeros cambios esteticos entre ambas versiones pero se hace la misma manera, yo os voy a mostrar como hacerlo en Ubuntu 14.04.&lt;/p&gt; 
 &lt;p&gt;Para acceder al &lt;strong&gt;programa&lt;/strong&gt; en el cual podemos cambiar esto solo tenemos que hacer click en el Dash de Ubuntu y escribir “Detalles”, posiblemente os aparezca el icono antes de escribir la palabra entera como pod&amp;eacute;is ver en la siguiente imagen:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/06/ubuntu-detalles.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/06/ubuntu-detalles.jpg" alt="ubuntu-detalles" width="547" height="439" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Entonces&amp;nbsp;hac&amp;eacute;is click en el icono y ver&amp;eacute;is la siguiente pantalla:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-seleccionar-con-que-programa-abrir-por-defecto-un-archivo-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-05T15:21:49Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar Atom en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-instalar-atom-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="atom" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-04T09:21:57Z</updated>
    <published>2014-06-04T09:21:57Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Normalmente yo suelo usar &lt;a href="http://elblogdeliher.com/que-es-y-como-instalar-geany-en-ubuntu-mediante-ppa/"&gt;Geany&lt;/a&gt; para hacer mis paginas web pero hace un par de meses, mas o menos, volv&amp;iacute; a probar &lt;a href="http://elblogdeliher.com/que-es-y-como-instalar-bluefish-en-ubuntu-mediante-ppa/"&gt;Bluefish&lt;/a&gt; y tengo que decir que me cambie al pez azul. Debido a esto me puse a buscar algunos editores de texto para mis tareas y me encontr&amp;eacute; con &lt;strong&gt;Atom&lt;/strong&gt;, un editor de texto avanzado que esta muy bien. Despu&amp;eacute;s de instalarlo lo ejecute y abr&amp;iacute; una pagina personal que estoy haciendo y me sorprendi&amp;oacute; algunas utilidades que le encontr&amp;eacute; y que os voy a comentar, ademas al final del articulo os mostrare como lo pod&amp;eacute;is&amp;nbsp;&lt;strong&gt;instalar&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente.&lt;/p&gt; 
 &lt;p&gt;Cuando abr&amp;iacute; la pagina principal de mi proyecto me encontr&amp;eacute; con que apareci&amp;oacute; una columna en la parte izquierda de &lt;strong&gt;Atom&lt;/strong&gt; en la cual tenia a mi disposici&amp;oacute;n todos los archivos del proyecto, el propio &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-instalar-atom-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-04T09:21:57Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar VLC en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/que-es-y-como-instalar-vlc-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="vlc" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-29T14:41:40Z</updated>
    <published>2014-05-29T14:41:40Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Todos aquellos que se est&amp;eacute;n iniciando en &lt;strong&gt;Ubuntu&lt;/strong&gt; pueden tener dudas sobre algunas aplicaciones, como es el caso de los reproductores multimedia. Si vienes de Windows puede que ya conozcas este maravilloso programa, pero por si no lo conoces te voy a hablar un poco sobre el. &lt;strong&gt;VLC&lt;/strong&gt; es un reproductor multimedia multiplataforma libre y de c&amp;oacute;digo abierto. Con &lt;strong&gt;VLC&lt;/strong&gt; vamos a poder reproducir la inmensa mayor&amp;iacute;a de archivos multimedia, yo de hecho todav&amp;iacute;a no he encontrado ninguno que no pueda reproducir.&lt;/p&gt; 
 &lt;p&gt;Con &lt;strong&gt;VLC&lt;/strong&gt; se pueden reproducir DVDs, CDs de audio y VCD y por supuesto AVI o MPEG. La lista de tipos de archivo que puede reproducir es muy larga, pero podeis estar seguros de que sera casi imposible que tengais algun archivo multimedia, sea de video o de sonido, que VLC no pueda reproducir. Ademas no necesitaras instalar codecs adicionales ya que el solito viene bien “armado”.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/que-es-y-como-instalar-vlc-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-29T14:41:40Z</dc:date>
  </entry>
  <entry>
    <title>Como convertir un CD de música en MP3 con Asunder en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-convertir-un-cd-de-musica-en-mp3-con-asunder-en-ubuntu" />
    <category term="ubuntu" />
    <category term="musica" />
    <category term="mp3" />
    <category term="asunder" />
    <category term="cd" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-27T17:12:09Z</updated>
    <published>2014-05-27T17:12:09Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os quiero mostrar como convertir las canciones que vienen en un &lt;strong&gt;CD de&amp;nbsp;&lt;/strong&gt;&lt;b&gt;m&amp;uacute;sica&lt;/b&gt;&amp;nbsp;en archivos &lt;strong&gt;MP3&lt;/strong&gt; con un programa que se llama &lt;strong&gt;Asunder&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;. El proceso es bastante sencillo, ademas &lt;strong&gt;Asunder&lt;/strong&gt; nos hace casi todo el trabajo. Si no conoc&amp;eacute;is este programa aqu&amp;iacute; os dejo un comando con el cual lo pod&amp;eacute;is instalar desde la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt;:&lt;/p&gt; 
 &lt;p&gt;sudo apt-get install asunder lame&lt;/p&gt; 
 &lt;p&gt;Con esto instalamos el &lt;strong&gt;Asunder&lt;/strong&gt; y tambi&amp;eacute;n “lame” que es lo que nos va a permitir codificar las canciones a &lt;strong&gt;MP3&lt;/strong&gt;. Entonces nos pedir&amp;aacute; la contrase&amp;ntilde;a, la introducimos y se instalara el programa. Una vez instalado aparecer&amp;aacute; dentro del Dash de &lt;strong&gt;Ubuntu&lt;/strong&gt;, lo abrimos y veremos lo siguiente:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/05/asunder-ubuntu-1.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/05/asunder-ubuntu-1.jpg" alt="asunder-ubuntu-1" width="595" height="471" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Ahora vamos a configurarlo para codificar en &lt;strong&gt;MP3&lt;/strong&gt;. Para ello hacemos click en donde pone “Preferencias” en la parte superior. En la ventana que aparece pinchamos en la pesta&amp;ntilde;a “Codificar” y veremos esto:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-convertir-un-cd-de-musica-en-mp3-con-asunder-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-27T17:12:09Z</dc:date>
  </entry>
  <entry>
    <title>Servidor web virtual con Xubuntu 14.04 disponible para descargar</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/servidor-web-virtual-con-xubuntu-14-4-disponible-para-descargar" />
    <category term="ubuntu" />
    <category term="servidor" />
    <category term="xubuntu-14-4" />
    <category term="servidor-web" />
    <category term="descargar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-27T11:14:01Z</updated>
    <published>2014-05-27T11:14:01Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Para todos aquellos que quieran el &lt;strong&gt;servidor web virtual&lt;/strong&gt; hecho con &lt;strong&gt;Xubuntu 14.04&lt;/strong&gt; y que no tengan ganas de hacerlo siguiendo los tutos que he hecho aqu&amp;iacute; os voy a dejar el enlace de descarga para que lo pod&amp;aacute;is tener. Lo he subido a Google Drive, pero antes de poner el enlace para que lo pod&amp;aacute;is descargar me gustar&amp;iacute;a hacer un peque&amp;ntilde;o resumen de lo que tiene, poneros los datos necesarios para usarlo y algunos consejos.&lt;/p&gt; 
 &lt;p&gt;Este servidor web tiene los siguientes caracter&amp;iacute;sticas:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Esta hecho con Virtual Box y con el Extension pack previamente instalado.&lt;/li&gt; 
  &lt;li&gt;Tiene activadas y funcionando las Guest Additions.&lt;/li&gt; 
  &lt;li&gt;Le he instalado el servidor web Apache&lt;/li&gt; 
  &lt;li&gt;Tambi&amp;eacute;n tiene instalado Mysql, PHPMyadmin y PHP&lt;/li&gt; 
  &lt;li&gt;Tiene servicio de FTP&lt;/li&gt; 
  &lt;li&gt;En el escritorio ten&amp;eacute;is la ultima versi&amp;oacute;n de WordPress y Joomla, ambos en espa&amp;ntilde;ol.&lt;/li&gt;
 &lt;/ul&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/servidor-web-virtual-con-xubuntu-14-4-disponible-para-descargar"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-27T11:14:01Z</dc:date>
  </entry>
  <entry>
    <title>Crear un servidor web virtual con Xubuntu 14.04 – Paso 6</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-un-servidor-web-virtual-con-xubuntu-14-4-paso-6" />
    <category term="ubuntu" />
    <category term="servidor-web-virtual" />
    <category term="servidor" />
    <category term="xubuntu-14-4" />
    <category term="servidor-web" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-26T08:44:05Z</updated>
    <published>2014-05-17T11:43:41Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo vamos a empezar a convertir la maquina virtual que tenemos con &lt;strong&gt;Xubuntu 14.04&lt;/strong&gt; en un &lt;strong&gt;servidor web&lt;/strong&gt;. Concretamente vamos a hacer lo siguiente:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Crear un directorio compartido para intercambiar ficheros entre el sistema hu&amp;eacute;sped y el anfitri&amp;oacute;n.&lt;/li&gt; 
  &lt;li&gt;Vamos a instalar el &lt;strong&gt;servidor web&lt;/strong&gt; Apache, con esto podremos subir paginas web que tengan HTML y CSS&lt;/li&gt; 
  &lt;li&gt;Vamos a subir una pagina web al servidor&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Por el momento no podremos instalar WordPress en este &lt;strong&gt;servidor web virtual&lt;/strong&gt;, eso lo haremos mas adelante, para ello necesitaremos instalar mas programas. Lo primero que vamos a hacer es crear un directorio compartido para intercambiar ficheros entre nuestro ordenador y el servidor web virtual de una forma c&amp;oacute;moda. Vamos a empezar por crear el directorio en nuestro sistema anfitri&amp;oacute;n, yo la voy a poner en el escritorio de mi ordenador y la voy a llamar “compartida”. Ahora hay que abrir el programa Virtual Box y seleccionar la maquina virtual que tiene el &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/crear-un-servidor-web-virtual-con-xubuntu-14-4-paso-6"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-17T11:43:41Z</dc:date>
  </entry>
  <entry>
    <title>Ubuntu 14.04 AIO, los principales sabores en una sola ISO</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/ubuntu-14-4-aio-los-principales-sabores-en-una-sola-iso" />
    <category term="ubuntu-aio" />
    <category term="ubuntu" />
    <category term="ubuntu-14-4" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-25T17:45:54Z</updated>
    <published>2014-05-25T17:45:54Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;El otro d&amp;iacute;a pude leer en &lt;a href="http://www.muylinux.com/"&gt;MuyLinux&lt;/a&gt;, un blog muy bueno sobre Linux, un articulo en el cual hablaban de un proyecto que llamo mi atenci&amp;oacute;n. Dicho proyecto tiene como objetivo reunir los &lt;strong&gt;principales sabores de Ubuntu&lt;/strong&gt; y ponerlos en una &lt;strong&gt;ISO&lt;/strong&gt;, de tal forma que con grabar un solo DVD tendremos varios miembros de la familia juntos. No dude un momento de descargarlo y probarlo y funciona a las mil maravillas, por lo menos la versi&amp;oacute;n de &lt;strong&gt;Ubuntu 14.04 en 32 bits AIO&lt;/strong&gt;. Hay dos opciones de descarga, la primera tiene lo siguiente:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Ubuntu 14.04 64-bit&lt;/li&gt; 
  &lt;li&gt;Ubuntu GNOME 14.04 64-bit&lt;/li&gt; 
  &lt;li&gt;Kubuntu 14.04 64-bit&lt;/li&gt; 
  &lt;li&gt;Xubuntu 14.04 32-bit&lt;/li&gt; 
  &lt;li&gt;Lubuntu 14.04 32-bit&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;La segunda opci&amp;oacute;n de descarga tiene lo mismo pero todas las versiones de 32 bits, esta es la que he descargado y probado yo y funciona perfecto. Tengo que decir que me ha parecido una idea genial y que pienso seguir el proyecto y estar atento a lo que vayan haciendo. Ha sido llevado a cabo por las comunidades locales de usuarios de &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/ubuntu-14-4-aio-los-principales-sabores-en-una-sola-iso"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-25T17:45:54Z</dc:date>
  </entry>
  <entry>
    <title>Comandos utiles para el servidor web virtual con Xubuntu 14.04</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/comandos-utiles-para-el-servidor-web-virtual-con-xubuntu-14-4" />
    <category term="ubuntu" />
    <category term="servidor-web-virtual" />
    <category term="xubuntu-14-4" />
    <category term="servidor-web" />
    <category term="comandos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-24T16:47:33Z</updated>
    <published>2014-05-23T07:57:49Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a dejar una lista con los &lt;strong&gt;comandos&lt;/strong&gt; que podemos necesitar al trabajar con el &lt;strong&gt;servidor web virtual&lt;/strong&gt; que hemos creado con &lt;strong&gt;Xubuntu 14.04&lt;/strong&gt;. La lista no es muy larga y cada comando esta explicado para que sepais exactamente lo que hace. Primero esta la explicaci&amp;oacute;n y debajo su comando, espero que os sirva de ayuda.&lt;/p&gt; 
 &lt;p&gt;De vez en cuando seria aconsejable actualizar el sistema, para ello necesitamos dos &lt;strong&gt;comandos&lt;/strong&gt;, el primero revisa los repositorios para ver si hay versiones nuevas disponibles de los programas que tenemos instalados y el segundo comando sirve para instalar las actualizaciones en el caso de que las haya:&lt;/p&gt; 
 &lt;pre&gt;sudo apt-get update

sudo apt-get upgrade
&lt;/pre&gt; 
 &lt;p&gt;La conexi&amp;oacute;n de Internet que tiene el &lt;strong&gt;servidor web virtual&lt;/strong&gt; puede ser de dos tipos, “eth0″ si el servidor se conecta por cable y “wlan0″ si se conecta por wifi. Si hacemos algun tipo de modificacion en la configuracion de los parametros de conexion de red y queremos que sean efectivos al momento sin necesidad de reinicar el servidor web virtual, lo podemos hacer con el siguiente comando, en el caso de que el servidor web se conecte por wifi hay que subtituir “eth0″ por “wlan0″:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/comandos-utiles-para-el-servidor-web-virtual-con-xubuntu-14-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-23T07:57:49Z</dc:date>
  </entry>
  <entry>
    <title>China elige Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/china-elige-ubuntu" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-23T10:08:06Z</updated>
    <published>2014-05-23T10:08:06Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este blog no se caracteriza por dar noticias relacionadas con &lt;strong&gt;Ubuntu&lt;/strong&gt; y Linux, pero creo que es recomendable hablar de ellas para estar un poco al d&amp;iacute;a. El caso es que &lt;strong&gt;China&lt;/strong&gt; inicio hace no mucho un “movimiento” pro &lt;strong&gt;Ubuntu&lt;/strong&gt; &amp;nbsp;y han hecho varias cosas al respecto que pueden ser beneficiosas para la distribuci&amp;oacute;n Linux mas usada actualmente, que no es otra que la creada por Canonical.&lt;/p&gt; 
 &lt;p&gt;Os voy a hablar de dos noticias que se han dado en este mundillo y que pienso que son muy importantes. Ademas tambi&amp;eacute;n quiero mencionar algunas de las iniciativas que se llevan a cabo en &lt;strong&gt;China&lt;/strong&gt; respecto a Ubuntu. Para los que no lo sep&amp;aacute;is tengo que deciros que China, hace ya un tiempo, tiene su propia versi&amp;oacute;n de &lt;strong&gt;Ubuntu&lt;/strong&gt; llamada “Ubuntu Kylin”, la primera versi&amp;oacute;n que salio estaba basada en Ubuntu 13.04, solamente esto muestra claramente el camino que quer&amp;iacute;an seguir en China, un rumbo que tomaron y siguiendo por ese camino es por donde han llegado a la situaci&amp;oacute;n actual.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/china-elige-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-23T10:08:06Z</dc:date>
  </entry>
  <entry>
    <title>Como crear un servidor web virtual con Xubuntu 14.04 – Paso 9</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-crear-un-servidor-web-virtual-con-xubuntu-14-4-paso-9" />
    <category term="ubuntu" />
    <category term="servidor-web-virtual" />
    <category term="servidor" />
    <category term="xubuntu-14-4" />
    <category term="servidor-web" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-05-22T17:04:40Z</updated>
    <published>2014-05-22T17:04:40Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En el articulo 8 de esta serie de art&amp;iacute;culos en la cual os muestro como crear un&lt;strong&gt; servidor web virtual con Xubuntu 14.04&lt;/strong&gt; comente que daba por terminado el servidor de forma preliminar. Se me hab&amp;iacute;a olvidado hacer una serie de ajustes que son sencillos y r&amp;aacute;pidos de hacer y es lo que vamos a hacer ahora. Los ajustes que vamos a hacer en el &lt;strong&gt;servidor web virtual&lt;/strong&gt; son los siguientes:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Vamos a activar la visualizaci&amp;oacute;n de errores PHP, esto nos servir&amp;aacute; para que si hacemos un tema de WordPress desde cero o modificamos uno tocando el c&amp;oacute;digo PHP, en el caso de haber errores de sintaxis en el c&amp;oacute;digo PHP nos salga un mensaje en la ventana de navegador informando del tipo de error y ademas la linea del c&amp;oacute;digo y el archivo en donde esta dicho fallo. Esto es muy &amp;uacute;til y nos ahorrara tiempo buscando esos fallos.&lt;/li&gt;
 &lt;/ul&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-crear-un-servidor-web-virtual-con-xubuntu-14-4-paso-9"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-22T17:04:40Z</dc:date>
  </entry>
</feed>

