<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-11-04T10:02:24Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-11-04T10:02:24Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Como instalar una nueva fuente de texto en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="fuente-de-texto" />
    <category term="fuente" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-04T09:52:46Z</updated>
    <published>2014-11-04T09:52:46Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Puede que en alguna ocasi&amp;oacute;n esteis escribiendo un texto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, con el Gimp o, como me paso a mi, haciendo un Conky y quer&amp;iacute;ais usar una &lt;strong&gt;fuente&lt;/strong&gt; de &lt;strong&gt;texto&lt;/strong&gt; que no esta en el sistema instalada por defecto, vale que vienen muchas instaladas pero puede que queramos alguna en particular. En mi caso, para el ultimo Conky que he creado hace poco quise usar una fuente que me gusto mucho llamada “Capture it”, por si no la conoc&amp;eacute;is o no hab&amp;eacute;is visto mi ultimo Conky mas abajo podr&amp;eacute;is ver como es dicha fuente ya que es la que voy a usar como ejemplo para mostraros como se instala una en Ubuntu.&lt;/p&gt; 
 &lt;p&gt;En Internet tenemos muchos sitios en los cuales podemos descargar&lt;strong&gt; fuentes de texto&lt;/strong&gt; nuevo para &lt;strong&gt;instalar&lt;/strong&gt; en nuestro ordenador y os voy a dejar el enlace a una pagina que esta muy bien llamada “Dafont”, aqu&amp;iacute; os dejo el enlace de la pagina:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-04T09:52:46Z</dc:date>
  </entry>
  <entry>
    <title>Mi antiguo blog, Ubuntu y mas, morirá el día 5-11-2014</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14" />
    <category term="ubuntu" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-03T23:10:14Z</updated>
    <published>2014-11-03T23:10:14Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Todos aquellos que lean habitualmente este blog puede que hayan le&amp;iacute;do en alguna ocasi&amp;oacute;n que este no es mi primer blog, sino el tercero. El primero fue y es, uno que cree en Blogger, todav&amp;iacute;a esta activo pero no lo actualizo desde hace desde el 4 de Febrero de 2013, me da pena eliminarlo por eso de la nostalgia pero alg&amp;uacute;n d&amp;iacute;a lo har&amp;eacute;, ese lo llame El rinc&amp;oacute;n de Liher. Ese blog me sirvi&amp;oacute; para iniciarme como blogger y para mi primer toma de contacto con el dise&amp;ntilde;o web.&lt;/p&gt; 
 &lt;p&gt;Mi primer articulo fue en Octubre de 2012 y el ultimo en Febrero de 2013, solo dedique unos 5 mese a ese blog y en ese tiempo me di cuenta de que necesitaba algo mas, fue entonces cuando decid&amp;iacute; crear otro en un hosting privado y con WordPress y fue cuando cree mi segundo blog, Ubuntu y mas. Nunca hab&amp;iacute;a tenido ning&amp;uacute;n contacto con WordPress y me tire a la piscina de lleno, a lo bestia ;D Tengo que decir que aprend&amp;iacute; mucho mientras me dedique a ese blog. Fue una experiencia bonita y de la cual aprend&amp;iacute; muchas cosas que hoy en d&amp;iacute;a aplico en El blog de Liher.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-03T23:10:14Z</dc:date>
  </entry>
  <entry>
    <title>Los discos SSD, el TRIM y como activarlo en Ubuntu 14.04 y anteriores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores" />
    <category term="ubuntu" />
    <category term="ubuntu-14-4" />
    <category term="discos" />
    <category term="trim" />
    <category term="ssd" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-31T11:05:57Z</updated>
    <published>2014-10-31T11:05:57Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos 4 o 5 meses que cambie de port&amp;aacute;til, lo compre de segunda mano en Ebay y estoy muy contento con el. Cuando lo recib&amp;iacute; venia con un disco duro normal de 1 TB pero decid&amp;iacute; poner un &lt;strong&gt;disco SSD&lt;/strong&gt;, compre uno de la marca Kingston de 120GB, entonces me puse a buscar informaci&amp;oacute;n sobre como sacarle el mejor rendimiento posible y sobre el &lt;strong&gt;TRIM&lt;/strong&gt;. Fui leyendo en varias webs como hacer su configuraci&amp;oacute;n y saque las siguientes conclusiones de las que os voy a hablar un poco, aunque son solo conclusiones m&amp;iacute;as que no tienen por que ser las mejores.&lt;/p&gt; 
 &lt;p&gt;Le&amp;iacute; en varias webs que los &lt;strong&gt;discos SSD&lt;/strong&gt; duran menos que los discos normales y me puse a investigar un poco al respecto. Los datos mas relevantes surgieron en la pagina de Seagate, una reconocida marca a nivel mundial que fabrica discos duros desde hace a&amp;ntilde;os. En dicha web pude leer que los discos duros convencionales tienen un MTBF (maximum time between failure) que oscila entre 300.000 y 1.200.000 horas, voy a tomar como referencia un valor intermedio de 750.000 horas, esto quier decir que te&amp;oacute;ricamente un disco duro normal de una calidad media podr&amp;iacute;a estar encendido y us&amp;aacute;ndose unos 85 a&amp;ntilde;os, a raz&amp;oacute;n de 8760 horas que tiene un a&amp;ntilde;o. Despu&amp;eacute;s fui a mirar cual era el MTBF del &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-31T11:05:57Z</dc:date>
  </entry>
  <entry>
    <title>Como descargar videos o mp3 de Youtube con Clipgrab en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-descargar-videos-o-mp3-de-youtube-con-clipgrab-en-ubuntu" />
    <category term="clipgrab" />
    <category term="ubuntu" />
    <category term="video" />
    <category term="extras-restringidos-ubuntu" />
    <category term="descargar" />
    <category term="mp3" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-30T23:12:39Z</updated>
    <published>2014-10-30T23:12:39Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os voy a hablar de un programa muy bueno con el cual podemos &lt;strong&gt;descargar&lt;/strong&gt; &lt;strong&gt;v&amp;iacute;deos&lt;/strong&gt; completos o solo el audio en &lt;strong&gt;MP3&lt;/strong&gt; de v&amp;iacute;deos de &lt;strong&gt;Youtube&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;. Hace tiempo ya os hable de el, se llama &lt;strong&gt;Clipgrab&lt;/strong&gt;, pero ayer me entere de que por fin han actualizado el PPA en Launchpad y ya podemos instalarlo f&amp;aacute;cilmente en Ubuntu a&amp;ntilde;adiendo el correspondiente repositorio, hasta hace poco no se pod&amp;iacute;a. Tambi&amp;eacute;n os voy a mostrar &lt;strong&gt;como descargar&lt;/strong&gt; un &lt;strong&gt;v&amp;iacute;deo&lt;/strong&gt; y como descargar solo el audio de ese v&amp;iacute;deo en formato &lt;strong&gt;MP3&lt;/strong&gt;, algo que esta muy bien.&lt;/p&gt; 
 &lt;p&gt;Vamos a empezar por lo primero, vamos a a&amp;ntilde;adir el PPA e instalar el &lt;strong&gt;Clipgrab&lt;/strong&gt; en Ubuntu 14.04, en versiones anteriores ya se pod&amp;iacute;a antes. Para ello abrimos una terminal y escribimos los siguiente comandos:&lt;/p&gt; 
 &lt;pre&gt;sudo add-apt-repository ppa:clipgrab-team/ppa&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-descargar-videos-o-mp3-de-youtube-con-clipgrab-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-30T23:12:39Z</dc:date>
  </entry>
  <entry>
    <title>Como ejecutar dos comandos o mas de una vez en la Terminal en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-ejecutar-dos-comandos-o-mas-de-una-vez-en-la-terminal-en-ubuntu" />
    <category term="ubuntu" />
    <category term="una" />
    <category term="terminal" />
    <category term="comandos" />
    <category term="dos" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-29T09:50:15Z</updated>
    <published>2014-10-28T10:40:25Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os quiero mostrar un par de “trucos” para el manejo de la &lt;strong&gt;Terminal&lt;/strong&gt;&amp;nbsp;en &lt;a href="http://www.ubuntu.com/"&gt;&lt;strong&gt;Ubuntu&lt;/strong&gt;&lt;/a&gt;, concretamente vamos a ver como ejecutar &lt;strong&gt;dos o mas&lt;/strong&gt; &lt;strong&gt;comandos&lt;/strong&gt; &lt;strong&gt;de una sola vez&lt;/strong&gt; y tambi&amp;eacute;n vamos a ver como hacer que no nos pida confirmaci&amp;oacute;n para ejecutarlos. Esto es algo bastante sencillo, pero como todo en esta vida, si no nos lo explican o no lo leemos en alg&amp;uacute;n manual no lo sabremos. Para este articulo voy a mostrar como ejemplo como podemos a&amp;ntilde;adir un repositorio, actualizar los paquetes e instalar un programa nuevo con un solo comando.&lt;/p&gt; 
 &lt;p&gt;El programa que he elegido es Ubuntu Tweak, no por ninguna raz&amp;oacute;n en especial, simplemente porque si &lt;img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /&gt; Si queremos instalar Ubuntu Tweak en &lt;strong&gt;Ubuntu&lt;/strong&gt; el procedimiento seria el siguiente, primero tendr&amp;iacute;amos que abrir la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-ejecutar-dos-comandos-o-mas-de-una-vez-en-la-terminal-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-28T10:40:25Z</dc:date>
  </entry>
  <entry>
    <title>Como activar el inicio de sesión automático en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-activar-el-inicio-de-sesion-automatico-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="activar" />
    <category term="inicio" />
    <category term="automatico" />
    <category term="sesion" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-27T23:23:34Z</updated>
    <published>2014-10-27T23:23:34Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Al principio, cuando instalamos cualquier distribuci&amp;oacute;n Linux, los usuarios que vienen de Windows se encuentran con que tienen que estar tecleando muchas veces la contrase&amp;ntilde;a de su usuario para tareas que antes no ten&amp;iacute;an que hacerlo en el sistema operativo de Microsoft. En &lt;strong&gt;Ubuntu&lt;/strong&gt; hay que introducir muchas veces la contrase&amp;ntilde;a, al final te acostumbras y lo asumes sin mas, por lo menos en mi caso. En este articulo os voy a mostrar como &lt;strong&gt;activar&lt;/strong&gt; el &lt;strong&gt;inicio de sesi&amp;oacute;n autom&amp;aacute;tico en Ubuntu&lt;/strong&gt;, no es algo que recomiendo en un ordenador que lo usen varios usuarios, pero si el ordenador es para uso de una sola persona, nos ahorraremos introducir la contrase&amp;ntilde;a de nuestro usuario cada vez que lo encendamos y as&amp;iacute; tambi&amp;eacute;n el tiempo de arranque sera menor.&lt;/p&gt; 
 &lt;p&gt;Como he dicho antes, si el ordenador es usado por varios usuarios no recomiendo activar esta opci&amp;oacute;n, por una cuesti&amp;oacute;n obvia de seguridad. Yo os voy a mostrar como hacerlo y queda en vuestra mano si os conviene hacerlo &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-activar-el-inicio-de-sesion-automatico-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-27T23:23:34Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Agave en Ubuntu, una ayuda con los colores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/que-es-y-como-instalar-agave-en-ubuntu-una-ayuda-con-los-colores" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="agave" />
    <category term="colores" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-27T09:19:37Z</updated>
    <published>2014-10-27T09:19:37Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os quiero hablar de un programa tremendamente &amp;uacute;til para el dise&amp;ntilde;o web llamado &lt;strong&gt;Agave&lt;/strong&gt;, lo conoc&amp;iacute; a trav&amp;eacute;s de Juan Bellas, el creador de una magnifica web llamada &lt;a href="http://bitacoralinux.com/"&gt;BitacoraLinux&lt;/a&gt; y que recomiendo visitar por la calidad de sus art&amp;iacute;culos y lo completa que es, he visto pocas webs como esa, desde aqu&amp;iacute; un saludo Juan. Os voy a hablar un poco de las bondades de Agave y os mostrare tambi&amp;eacute;n como instalarlo en Ubuntu para que os pueda ayudar con los &lt;strong&gt;colores&lt;/strong&gt; cuando quer&amp;aacute;is dise&amp;ntilde;ar algo, es genial para crear esquemas de colores a la hora de hacer una web.&lt;/p&gt; 
 &lt;p&gt;En mi opini&amp;oacute;n es un programa genial por una raz&amp;oacute;n muy sencilla, soy hombre y los hombres tenemos algunos problemillas con los colores, no quiero que ning&amp;uacute;n hombre se me enfade, pero es as&amp;iacute;, las mujeres ven mas colores que nosotros. Por ejemplo, para un hombre el mel&amp;oacute;n es una fruta pero para una mujer tambi&amp;eacute;n es un color, no quiero que ninguna persona se me enfade por este comentario, cada genero tenemos nuestras cosas y en cuanto a los colores las mujeres nos ganan, es lo que hay :D. Por lo tanto &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/que-es-y-como-instalar-agave-en-ubuntu-una-ayuda-con-los-colores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-27T09:19:37Z</dc:date>
  </entry>
  <entry>
    <title>Ya salio Ubuntu 14.10, y ahora que?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/ya-salio-ubuntu-14-1-y-ahora-que" />
    <category term="ubuntu" />
    <category term="ubuntu-14-1" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-23T22:43:47Z</updated>
    <published>2014-10-23T22:43:47Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Si est&amp;aacute;is en el mundillo de Linux y &lt;strong&gt;Ubuntu&lt;/strong&gt; seguramente ya sabr&amp;eacute;is que ha salido &lt;strong&gt;Ubuntu 14.10&lt;/strong&gt;, con el maravillo nombre que les ponen a cada nueva versi&amp;oacute;n ;D (espero que alguno de los chicos de Canonical no se enfade si lee esto) y las preguntas que me hago, o mas bien que algunos usuarios se har&amp;aacute;n es &amp;iquest;y ahora que? &amp;iquest;me cambio? Yo no me planteo nada, personalmente no la voy a instalar en mi ordenador, la probare en una maquina virtual cuanto me encuentre con ganas, que no sera a corto plazo, ya que para mi no tiene importancia este lanzamiento porque no tiene novedades importantes que merezcan la pena, por lo menos para mi.&lt;/p&gt; 
 &lt;p&gt;No voy a enumerar todas las nuevas caracter&amp;iacute;sticas que tiene &lt;strong&gt;Ubuntu 14.10&lt;/strong&gt;, las podr&amp;eacute;is encontrar en otros blogs y en la &lt;a href="http://www.ubuntu.com/"&gt;pagina oficial de Ubuntu&lt;/a&gt;&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/ya-salio-ubuntu-14-1-y-ahora-que"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-23T22:43:47Z</dc:date>
  </entry>
  <entry>
    <title>Cómo instalar Spotify en Debian y Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/como-instalar-spotify-en-debian-y-ubuntu" />
    <category term="blog-stack" />
    <category term="debian" />
    <category term="ubuntu" />
    <category term="programas" />
    <category term="squeeze" />
    <category term="kubuntu" />
    <category term="spotify" />
    <category term="musica" />
    <category term="wheezy" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-23T20:28:40Z</updated>
    <published>2014-10-23T20:28:05Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/spotify-kubuntu.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/spotify-kubuntu-1024x575.jpg" alt="spotify-kubuntu" width="720" height="404" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Spotify&lt;/strong&gt; es quiz&amp;aacute;s la aplicaci&amp;oacute;n para escuchar m&amp;uacute;sica v&amp;iacute;a &lt;strong&gt;streaming&lt;/strong&gt; m&amp;aacute;s popular del planeta, actualmente. Hasta hace no mucho s&amp;oacute;lo pod&amp;iacute;amos disfrutar de &amp;eacute;l en &lt;strong&gt;GNU/Linux&lt;/strong&gt; si ten&amp;iacute;amos cuenta premium. Por suerte eso ha cambiado.&lt;/p&gt; 
&lt;p&gt;De momento de manera oficial &lt;strong&gt;Spotify&lt;/strong&gt; suministra una manera de instalaci&amp;oacute;n para las distribuciones &lt;strong&gt;Debian&lt;/strong&gt;, de hecho para la versi&amp;oacute;n 6, que es la llamada &lt;strong&gt;Squeeze&lt;/strong&gt;, pero tambi&amp;eacute;n es compatible con &lt;strong&gt;Wheez&lt;/strong&gt;y, e incluso con &lt;strong&gt;Ubuntu&lt;/strong&gt;. (Existe una instalaci&amp;oacute;n usando &lt;a title="Spotify Wine" href="https://support.spotify.com/es/learn-more/faq/?_ga=1.158386296.314506571.1411854936"&gt;&lt;strong&gt;Wine&lt;/strong&gt;&lt;/a&gt;)&lt;/p&gt; 
&lt;p&gt;La instalaci&amp;oacute;n es bastante sencilla y no tiene excesiva complicaci&amp;oacute;n.&lt;/p&gt; 
&lt;p&gt;Voy a realizar en el&lt;strong&gt; Kubuntu 14&lt;/strong&gt; que tengo en mi laptop o port&amp;aacute;til &lt;strong&gt;HP Envy&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Debemos editar el archivo de repositorios ubicado en /etc/apt/sources.list, y a&amp;ntilde;adir:&lt;/p&gt; 
&lt;pre&gt;# editando /etc/apt/sources.list 
deb http://repository.spotify.com stable non-free&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/como-instalar-spotify-en-debian-y-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-23T20:28:05Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar un tema de ventanas en Ubuntu paso a paso, Faience</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-instalar-un-tema-de-ventanas-en-ubuntu-paso-a-paso-faience" />
    <category term="ubuntu" />
    <category term="faience" />
    <category term="ventanas" />
    <category term="instalar" />
    <category term="paso-a-paso" />
    <category term="tema" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-22T08:32:45Z</updated>
    <published>2014-10-22T08:32:45Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;El otro d&amp;iacute;a estaba revisando los art&amp;iacute;culos que hab&amp;iacute;a escrito y quer&amp;iacute;a escribir uno mostrando un &lt;strong&gt;tema de ventanas&lt;/strong&gt; para &lt;strong&gt;instalar&lt;/strong&gt; que esta muy bien llamado &lt;strong&gt;Faience&lt;/strong&gt;, es el que yo uso actualmente. Resulta que no hab&amp;iacute;a escrito todav&amp;iacute;a como instalar un tema de ventanas en &lt;strong&gt;Ubuntu&lt;/strong&gt;&amp;nbsp;(me doy una autocolleja por ello ;D ) y eso es lo que voy a hacer en este articulo, os voy a explicar como &lt;strong&gt;instalar&lt;/strong&gt; un &lt;strong&gt;tema de ventanas&lt;/strong&gt; en Ubuntu paso a paso. Tampoco he explicado como cambiar la apariencia de Ubuntu con Ubuntu Tweak y eso lo voy a hacer en el siguiente articulo, estos dos art&amp;iacute;culos saldaran a la par, el mismo d&amp;iacute;a. Al final de este articulo os dejare un enlace a un articulo en el que explicare como cambiar la apariencia de Ubuntu con Ubuntu Tweak.&lt;/p&gt; 
 &lt;p&gt;Como ya he mencionado anteriormente he elegido el tema &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-instalar-un-tema-de-ventanas-en-ubuntu-paso-a-paso-faience"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-22T08:32:45Z</dc:date>
  </entry>
  <entry>
    <title>Como modificar la apariencia de Ubuntu con Ubuntu Tweak</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-modificar-la-apariencia-de-ubuntu-con-ubuntu-tweak" />
    <category term="ubuntu" />
    <category term="ubuntu-tweak" />
    <category term="ventanas" />
    <category term="apariencia" />
    <category term="modificar" />
    <category term="raton" />
    <category term="iconos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-22T08:14:30Z</updated>
    <published>2014-10-22T08:14:30Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo vamos a ver como podemos cambiar la &lt;strong&gt;apariencia&lt;/strong&gt; de &lt;strong&gt;Ubuntu&lt;/strong&gt; con &lt;strong&gt;Ubuntu Tweak&lt;/strong&gt;, concretamente vamos a ver como cambiar un tema de ventanas, un tema de rat&amp;oacute;n y uno de iconos. Estas tareas son bastante sencillas como vais a poder comprobar. Lo primero de todo es abrir &lt;a href="http://ubuntu-tweak.com/"&gt;Ubuntu Tweak&lt;/a&gt;, si no lo ten&amp;eacute;is instalado aqu&amp;iacute; os dejo un enlace al articulo en el cual muestro como instalarlo:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/que-es-y-como-instalar-ubuntu-tweak-mediante-ppa/"&gt;Como instalar Ubuntu Tweak&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Una vez que hay&amp;aacute;is abierto &lt;strong&gt;Ubuntu Tweak&lt;/strong&gt; ver&amp;eacute;is una pantalla en la que se ve un resumen de vuestro ordenador y de las ultimas tareas que hab&amp;eacute;is hecho con el como pod&amp;eacute;is ver en la siguiente imagen:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/10/apariencia-ubuntu-tweak.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/10/apariencia-ubuntu-tweak.jpg" alt="apariencia-ubuntu-tweak" width="700" height="397" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;En esta misma imagen pod&amp;eacute;is ver una flecha roja que se&amp;ntilde;ala al texto “Ajustes”, ah&amp;iacute; es donde ten&amp;eacute;is que hacer click para acceder a la secci&amp;oacute;n en la cual podemos personalizar &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-modificar-la-apariencia-de-ubuntu-con-ubuntu-tweak"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-22T08:14:30Z</dc:date>
  </entry>
  <entry>
    <title>El Mountain Graphite 30 Pro de 17 pulgadas de Victor y su experiencia</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/el-mountain-graphite-3-pro-de-17-pulgadas-de-victor-y-su-experiencia" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="mountain" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-15T09:18:26Z</updated>
    <published>2014-10-15T09:18:26Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este articulo es especial ya que no lo he escrito yo, lo ha escrito Victor, un amigo con el que estuve intercambiando emails hablando sobre que port&amp;aacute;til comprar y finalmente se decidi&amp;oacute; por un &lt;strong&gt;Mountain Graphite 30 Pro de 17 pulgadas&lt;/strong&gt;, un pedazo de maquina del cop&amp;oacute;n ;D. Aqu&amp;iacute; nos cuenta como han ido sus primeros d&amp;iacute;as con el y su opini&amp;oacute;n. Desde aqui quiero agradecer a Victor aceptar escribir este articulo que le ped&amp;iacute; y el tiempo que le has dedicado y espero que lo disfrutes. Un saludo amigo.&lt;/p&gt; 
 &lt;p&gt;En este art&amp;iacute;culo voy a relatar mi experiencia, a&amp;uacute;n corta con un nuevo port&amp;aacute;til adquirido. Tras mucha deliberaci&amp;oacute;n y siguiendo los buenos consejos de Liher, opt&amp;eacute; finalmente por un modelo &lt;a href="https://www.mountain.es/portatiles/graphite-30"&gt;Grafite 30 Pro con pantalla de 17 “&lt;/a&gt; de la marca de &lt;strong&gt;Mountain&lt;/strong&gt;. Aunque algunos buenos blogeros ya han expuesto sus impresiones sobre este modelo o alguno parecido, este ser&amp;aacute; un punto de vista personal y poco profesional sobre el tema. No voy a enumerar sus componentes ni conectividad, pues seguramente lo conocer&amp;eacute;is por su p&amp;aacute;gina web. Aqu&amp;iacute; debo hacer notar que me no me qued&amp;oacute; claro los componentes del equipo arriba mencionado con las fotos e im&amp;aacute;genes que desde la web se pueden ver. Hasta que no lleg&amp;oacute; el port&amp;aacute;til a mi casa, no me qued&amp;oacute; claro que no tra&amp;iacute;a lector de huellas junto al touchpad. A lo mejor son im&amp;aacute;genes gen&amp;eacute;ricas y no corresponden al modelo seleccionado en la p&amp;aacute;gina. Acostumbrado a comprar port&amp;aacute;tiles para los m&amp;iacute;os o para la empresa donde trabajo, cuando me lleg&amp;oacute; el equipo ven&amp;iacute;a perfectamente embalado por la empresa de transporte y notificado que se transportaba material electr&amp;oacute;nico. Adem&amp;aacute;s, le empresa Mountain no especula en cuanto a embalaje propio. Una caja amplia embala el equipo acomodado en funda a medida para el port&amp;aacute;til y los accesorios. Esto otorga mucha tranquilidad y confianza en el transporte del equipo. Una vez abierto y montados la bater&amp;iacute;a y el cargador, observo que el equipo es grande y los detalles y acabados son de calidad. El equipo no ven&amp;iacute;a con sistema preinstalado, a&amp;uacute;n habiendo solicitado. La &amp;uacute;nica raz&amp;oacute;n era tener de primera hora todos los controladores instalados “out of the box” y empezar a disfrutar, pues, con componentes tan nuevos, tem&amp;iacute;a que no pudiera funcionar todo si yo instalaba el sistema operativo. Pero lo achaco a un despiste de &amp;uacute;ltima hora por el equipo t&amp;eacute;cnico. Adem&amp;aacute;s, los aficionados gozamos (s&amp;iacute;, gozamos) instalando, reinstalando, desinstalando e instalando de nuevo otra distro. Como conoc&amp;iacute;a de la compatibilidad de Ubuntu Unity 14.04, pero me gustaba el entorno KDE, intent&amp;eacute; instalar KDE 14.04. Igualmente todo fue bien, salvo que no ten&amp;iacute;a los controladores de la tarjeta dedicada Nvidia ( GTX860). Intent&amp;eacute; instalarlos tras una actualizaci&amp;oacute;n del sistema, pero me top&amp;eacute; de frente con un problema de entorno Xorg que no supe resolver pese a la ayuda de la “Internet”. As&amp;iacute; que volv&amp;iacute; de nuevo a Ubuntu Unity, con partici&amp;oacute;n root y home en el disco SSD y una innecesaria swap en el disco HDD. El resto del disco HDD lo he dejado para Biblioteca, Discoteca y Videoteca mont&amp;aacute;ndolo como Media. Todo fue casi genial como esperaba, resoluci&amp;oacute;n de la pantalla a 1080, pantalla excepcionalmente c&amp;oacute;moda.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/el-mountain-graphite-3-pro-de-17-pulgadas-de-victor-y-su-experiencia"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-15T09:18:26Z</dc:date>
  </entry>
  <entry>
    <title>Donde estan los fondos de escritorio descargados desde Ubuntu Tweak</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/donde-estan-los-fondos-de-escritorio-descargados-desde-ubuntu-tweak" />
    <category term="ubuntu" />
    <category term="ubuntu-tweak" />
    <category term="donde" />
    <category term="fondos-de-escritorio" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-13T08:48:30Z</updated>
    <published>2014-10-13T08:48:30Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace ya unos d&amp;iacute;as que un usuario me hizo una consulta acerca de &lt;strong&gt;Ubuntu Tweak&lt;/strong&gt;, quer&amp;iacute;a saber &lt;strong&gt;donde&lt;/strong&gt; se guardan los &lt;strong&gt;fondos&lt;/strong&gt; &lt;strong&gt;de&lt;/strong&gt; &lt;strong&gt;escritorio&lt;/strong&gt; que se descargan en Ubuntu Tweak. En su momento le respond&amp;iacute; pero creo que estar&amp;iacute;a bien hacer un articulo explicando como llegar a esos fondos de rescriptorio y aqu&amp;iacute; esta el articulo. Para aquellos que no sepan que es Ubuntu Tweak aqu&amp;iacute; les dejo un enlace a un articulo en el cual hablo sobre esta muy buena herramienta y como instalarla, para mi es imprescindible:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/que-es-y-como-instalar-ubuntu-tweak-mediante-ppa/"&gt;Que es y como instalar Ubuntu Tweak en Ubuntu mediante PPA&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Yo nunca he descargado &lt;strong&gt;fondos de escritorio&lt;/strong&gt; desde Ubuntu Tweak, pero lo prob&amp;eacute; hace unos d&amp;iacute;as y esta bastante bien ya que nos ofrece una forma sencilla de poder elegir un fondo de escritorio y cuando lo hayamos elegido, solo tenemos que hacer doble click sobre el y se descargara a nuestro ordenador y tambi&amp;eacute;n se pondr&amp;aacute; como fondo de escritorio, todo con un doble click. La colecci&amp;oacute;n que tiene es bastante variada.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/donde-estan-los-fondos-de-escritorio-descargados-desde-ubuntu-tweak"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-13T08:48:30Z</dc:date>
  </entry>
  <entry>
    <title>Gestión de proyectos con OpenProject</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/gestion-de-proyectos-con-openproject" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="comunidad-open-source" />
    <category term="linux" />
    <category term="openproject" />
    <category term="programas" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-10T09:40:57Z</updated>
    <published>2014-10-02T09:23:12Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/openproject-dsing-800.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/openproject-dsing-800.jpg" alt="openproject-dsing-800" width="800" height="538" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;La gesti&amp;oacute;n de proyectos en las empresas e incluso para los trabajadores aut&amp;oacute;nomos es clave. OpenProject es un sistema de gesti&amp;oacute;n de proyectos que funciona a trav&amp;eacute;s de la web, que de &amp;eacute;sta manera permite a m&amp;uacute;ltiples usuarios, independientemente de su localizaci&amp;oacute;n, participar y gestionar los proyectos. OpenProject es software libre, utiliza la Licencia P&amp;uacute;blica General GNU, y sus desarrollo es continuo desde la comunidad.&lt;/p&gt; 
&lt;p&gt;&lt;br /&gt; &lt;strong&gt;&amp;iquest;Qu&amp;eacute; ofrece OpenProject?&lt;/strong&gt;&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Gesti&amp;oacute;n de proyectos&lt;/li&gt; 
 &lt;li&gt;Gesti&amp;oacute;n de problemas e incidencias&lt;/li&gt; 
 &lt;li&gt;Plazos de los proyectos&lt;/li&gt; 
 &lt;li&gt;Wiki&lt;/li&gt; 
 &lt;li&gt;Gesti&amp;oacute;n documental&lt;/li&gt; 
 &lt;li&gt;Foro&lt;/li&gt; 
 &lt;li&gt;Muchas otras caracter&amp;iacute;sticas&lt;/li&gt; 
 &lt;li&gt;&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;&lt;strong&gt;&amp;iquest;Qui&amp;eacute;n hay detr&amp;aacute;s de OpenProject?&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;La Fundaci&amp;oacute;n OpenProject se cre&amp;oacute; en el a&amp;ntilde;o 2012. La fundaci&amp;oacute;n ofrece un marco organizativo y t&amp;eacute;cnico, ya que gran parte desarrollo se realiza desde una comunidad a nivel mundial.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/gestion-de-proyectos-con-openproject"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-02T09:23:12Z</dc:date>
  </entry>
  <entry>
    <title>Instalar codecs de audio y video con los extras restringidos en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/instalar-codecs-de-audio-y-video-con-los-extras-restringidos-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="video" />
    <category term="extras-restringidos-ubuntu" />
    <category term="extras-restringidos" />
    <category term="codecs" />
    <category term="audio" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-09T22:10:55Z</updated>
    <published>2014-10-09T22:10:55Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este es uno de esos art&amp;iacute;culos que tenia pendiente escribir desde hacia tiempo y ha sido gracias a Oscar, un saludo amigo ;D, que he decidido escribirlo. Voy a empezar por el principio, cuando instalamos &lt;strong&gt;Ubuntu&lt;/strong&gt;, o cualquiera de los miembros oficiales de la familia Ubuntu, no se instalan una serie de &lt;strong&gt;codecs de audio y video&lt;/strong&gt;, no se instalan porque Canonical podr&amp;iacute;a tener problemas legales al respecto y se libran de esos posibles problemas no incluy&amp;eacute;ndolos en la instalaci&amp;oacute;n pero si en sus repositorios oficiales, as&amp;iacute; queda en el usuario la decisi&amp;oacute;n de instalarlos o no. Si queremos instalar esos &lt;strong&gt;codecs de audio y video&lt;/strong&gt; y as&amp;iacute; poder disfrutar de nuestros archivos multimedia, ademas del Flash, lo &amp;uacute;nico que tenemos que hacer es instalar un paquete que los contiene llamado &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/instalar-codecs-de-audio-y-video-con-los-extras-restringidos-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-09T22:10:55Z</dc:date>
  </entry>
  <entry>
    <title>Instalando Telegram en Kubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalando-telegram-en-kubuntu" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="linux" />
    <category term="telegram" />
    <category term="programas" />
    <category term="kubuntu" />
    <category term="mensajeria" />
    <category term="play" />
    <category term="unity" />
    <category term="chromium" />
    <category term="kde" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-04T19:27:12Z</updated>
    <published>2014-10-04T19:24:25Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-gallery.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-gallery.jpg" alt="telegram-gallery" width="640" height="360" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Hace un tiempo ya expliqu&amp;eacute; las bondades de &lt;a title="&amp;iquest;Qui&amp;eacute;n hay detr&amp;aacute;s de Telegram?" href="http://www.ochobitshacenunbyte.com/2014/02/24/quien-hay-detras-de-telegram/"&gt;&lt;strong&gt;Telegram&lt;/strong&gt;&lt;/a&gt;, su gran privacidad, incluido el uso de un potente cifrado y la posibilidad de realizar conversaciones privadas, donde cada interlocutor usar&amp;aacute; claves de cifrado distintas, y el historial se guardar&amp;aacute; en nuestro equipo local y no en la nube. Aunque esto hace que dichas conversaciones no nos aparezcan en el resto de dispositivos.&lt;/p&gt; 
&lt;p&gt;Hoy explicar&amp;eacute; c&amp;oacute;mo instalarlo en &lt;strong&gt;Ubuntu&lt;/strong&gt; y sus derivadas, que en mi caso es &lt;strong&gt;Kubuntu&lt;/strong&gt;. La verdad es que es muy sencillo, s&amp;oacute;lo tenemos que ir a la p&amp;aacute;gina oficial del proyecto y all&amp;iacute; dirigirnos a la p&amp;aacute;gina de descargas.&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-kubuntu-2.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-kubuntu-2.jpg" alt="telegram-kubuntu-2" width="435" height="585" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Cuando descargamos el archivo comprimido lo que tenemos una vez descargado son los binarios, por lo tanto para ejecutarlo tenemos que clickar sobre el archivo ejecutable llamado “Telegram”&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalando-telegram-en-kubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-04T19:24:25Z</dc:date>
  </entry>
  <entry>
    <title>Reproduce tu música con Banshee</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/reproduce-tu-musica-con-banshee" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="amarok" />
    <category term="gpl" />
    <category term="comunidad-open-source" />
    <category term="k3b" />
    <category term="linux" />
    <category term="programas" />
    <category term="banshee" />
    <category term="musica" />
    <category term="licencia-mit" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-03T21:20:53Z</updated>
    <published>2014-10-03T20:20:57Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/banshee-acdc-jailbreaker.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/banshee-acdc-jailbreaker-1024x575.png" alt="banshee-acdc-jailbreaker" width="720" height="404" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Ya expliqu&amp;eacute; hace unas semanas que estoy pasando mi colecci&amp;oacute;n de CD’s a mi computadora, ya que a&amp;ntilde;os de acumular material audiovisual me ha dejado el piso casi sin espacio, y tengo dos peque&amp;ntilde;os seres por casa que son m&amp;aacute;s importantes, y tambi&amp;eacute;n necesitan su espacio : ) El software que estoy usando es &lt;a title="Guardar nuestra colecci&amp;oacute;n de cd’s con K3b" href="http://www.ochobitshacenunbyte.com/2014/09/23/guardar-nuestra-coleccion-de-cds-con-k3b/"&gt;K3b&lt;/a&gt;. Ahora hablar&amp;eacute; del programa de audio que utilizo en mi Kubuntu para reproducir toda la m&amp;uacute;sica, hablo de &lt;strong&gt;Banshee&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Banshee&lt;/strong&gt; se encuentra disponible para la mayor&amp;iacute;a de distribuciones &lt;strong&gt;GNU / Linux&lt;/strong&gt; y Apple &lt;strong&gt;MAC OS X&lt;/strong&gt;. Tambi&amp;eacute;n existe una versi&amp;oacute;n Alfa para Microsoft &lt;strong&gt;Windows&lt;/strong&gt;. Est&amp;aacute; desarrollado en &lt;strong&gt;Mono&lt;/strong&gt; y &lt;strong&gt;Gtk#&lt;/strong&gt;, eso le permite ser multiplataforma m&amp;aacute;s facilmente.&amp;nbsp; Supuestamente, al igual que la mayor&amp;iacute;a de distribuciones de audio GNU/Linux, deber&amp;iacute;a sincronizar y reproducir la colecci&amp;oacute;n con un &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/reproduce-tu-musica-con-banshee"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-03T20:20:57Z</dc:date>
  </entry>
  <entry>
    <title>Me cambio a KDE en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/me-cambio-a-kde-en-ubuntu" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="kde" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-02T20:45:16Z</updated>
    <published>2014-10-02T20:45:16Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Llevaba ya un tiempo que quer&amp;iacute;a cambiar de entorno gr&amp;aacute;fico y creo que ha llegado el momento. Tengo que decir que tambi&amp;eacute;n hab&amp;iacute;a pensado en cambiar de distribuci&amp;oacute;n principal pero eso lo voy a dejar por ahora, voy a seguir con &lt;strong&gt;Ubuntu&lt;/strong&gt; pero con &lt;strong&gt;KDE&lt;/strong&gt;, concretamente voy a instalar Kubuntu en los pr&amp;oacute;ximos d&amp;iacute;as.&lt;/p&gt; 
 &lt;p&gt;Despu&amp;eacute;s de estar probandolo unos d&amp;iacute;as y de cacharrearlo he decidido hacer el cambio. Se que no es un cambio demasiado grande, ya que seguir&amp;eacute; usando Ubuntu pero nunca me he metido a fondo con &lt;strong&gt;KDE&lt;/strong&gt; porque no me terminaba de convencer, pero hace alrededor de un a&amp;ntilde;o que me viene picando el gusanillo y por fin me he decidido, &amp;iquest;que le vamos a hacer? soy un poco indeciso &lt;img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /&gt;&lt;/p&gt; 
 &lt;p&gt;El cambio es por varias razones y entre ellas no esta el que Unity no me guste, al principio era una patata, para mi gusto, pero fue evolucionando bien y tengo que decir que al final si me gustaba, lo usaba a partes iguales con Cairo Dock, aunque me gustaba mas este ultimo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/me-cambio-a-kde-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-02T20:45:16Z</dc:date>
  </entry>
  <entry>
    <title>Instalar VMware-Tools en servidor virtual GNU Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/instalar-vmware-tools-en-servidor-virtual-gnu-linux" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="vmware-workstation" />
    <category term="kvm" />
    <category term="sistemas-operativos" />
    <category term="comandos" />
    <category term="virtualizacion" />
    <category term="vmware-tools" />
    <category term="vmware" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-09-26T07:10:59Z</updated>
    <published>2014-09-18T15:00:19Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/VMware-Workstation-7-logo-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/VMware-Workstation-7-logo-150.jpg" alt="VMware-Workstation-7-logo-150" width="150" height="150" /&gt;&lt;/a&gt;Lo primero que nos damos cuenta cuando instalamos un servidor &lt;strong&gt;GNU Linux&lt;/strong&gt; virtualizado, utilizando cualquiera de las plataformas &lt;strong&gt;VMware&lt;/strong&gt;, es que debemos de instalar las herramietas &lt;strong&gt;VMware-tools&lt;/strong&gt;. Hoy veremos como hacerlo.&lt;/p&gt; 
&lt;p&gt;En otros art&amp;iacute;culo hemos tratado de sistemas libres como &lt;strong&gt;KVM&lt;/strong&gt;, creo que tambi&amp;eacute;n es interesante que se traten otros sistemas que de una u otra manera tiene relaci&amp;oacute;n con &lt;strong&gt;GNU/Linux&lt;/strong&gt;, aunque en parte o totalmente sean privativos.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Para el art&amp;iacute;culo he utilizado el sistema operativo virtual &lt;strong&gt;Ubuntu 14.04 LTS&lt;/strong&gt; sobre &lt;strong&gt;VMware Workstation&lt;/strong&gt;. C&amp;oacute;mo pod&amp;eacute;is ver en la imagen:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/install-vmware-tools-linux-1.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/install-vmware-tools-linux-1.jpg" alt="install-vmware-tools-linux-1" width="900" height="629" /&gt;&lt;/a&gt;Al seleccionar “&lt;strong&gt;Install VMware Tools&lt;/strong&gt;” nos dir&amp;aacute; que se instalar&amp;aacute; desde un CD en el sistema operativo virtualizado, le diremos que s&amp;iacute;. Si tenemos alg&amp;uacute;n medio utilizandose en la misma unidad de CD se desconectar&amp;aacute;.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/instalar-vmware-tools-en-servidor-virtual-gnu-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-09-18T15:00:19Z</dc:date>
  </entry>
  <entry>
    <title>Un par de chistes informaticos para amenizar el lunes</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/un-par-de-chistes-informaticos-para-amenizar-el-lunes" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="chistes" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-22T17:22:51Z</updated>
    <published>2014-09-22T17:22:51Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os voy a dejar un par de &lt;strong&gt;chistes&lt;/strong&gt; que me ha mandado por el uasap una amiga m&amp;iacute;a y visitante VIP de este blog llamada Almudena. Ami me han gustado bastante y me parece que si sois usuarios de Linux seguro que tambi&amp;eacute;n os gustaran. Ah&amp;iacute; va el primero:&lt;/p&gt; 
 &lt;p&gt;&lt;em&gt;&amp;iquest;Que diferencia hay entre la colada de la ropa y el Windows?&amp;nbsp;&lt;/em&gt;&lt;/p&gt; 
 &lt;p&gt;&lt;em&gt;Que la colada no se cuelga sola&lt;/em&gt;&lt;/p&gt; 
 &lt;p&gt;Ah&amp;iacute; va el segundo:&lt;/p&gt; 
 &lt;p&gt;&lt;i&gt;Est&amp;aacute;n&lt;/i&gt;&lt;em&gt;&amp;nbsp;en el ba&amp;ntilde;o un ingeniero de Microsoft, uno de Intel y otro de Linux. Cuando termina de mear el ingeniero de Microsoft va y se lava las manos a&amp;nbsp;conciencia&amp;nbsp;y mucho&amp;nbsp;jab&amp;oacute;n&amp;nbsp;y mucha agua, y cuanto termina dice:&amp;nbsp;&lt;/em&gt;&lt;/p&gt; 
 &lt;p&gt;&lt;em&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; – Los de Microsoft, lo que hacemos lo hacemos bien.&amp;nbsp;&lt;/em&gt;&lt;/p&gt; 
 &lt;p&gt;&lt;em&gt;En esto que termina de mear el de Intel y se pone a lavar las manos a conciencia pero con poco&amp;nbsp;jab&amp;oacute;n,&amp;nbsp;despu&amp;eacute;s&amp;nbsp;se las aclara bien las manos pero con&amp;nbsp;poco&amp;nbsp;agua y finalmente se seca las manos con una&amp;nbsp;esquinita&amp;nbsp;de papel y dice:&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/un-par-de-chistes-informaticos-para-amenizar-el-lunes"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-22T17:22:51Z</dc:date>
  </entry>
  <entry>
    <title>Como eliminar la sesion de invitado en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-eliminar-la-sesion-de-invitado-en-ubuntu" />
    <category term="sesion-invitado" />
    <category term="ubuntu" />
    <category term="eliminar" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-19T07:44:25Z</updated>
    <published>2014-09-19T07:44:25Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Cuando instalamos &lt;strong&gt;Ubuntu&lt;/strong&gt; en un ordenador, por defecto, se crean dos cuentas de usuario, una cuenta es la de nuestro propio usuario con nuestro nombre, pero tambi&amp;eacute;n se crea otra cuenta por defecto, y esa es la de Invitado. Esta cuenta no tiene contrase&amp;ntilde;a y esta muy limitada, creo recordar que no se guardan los cambios que hagamos en ella, ni siquiera los ficheros que dejemos en el escritorio. La verdad es que, para mi, no tiene ninguna utilidad. En este articulo os voy a mostrar como &lt;strong&gt;eliminar&lt;/strong&gt; esa &lt;strong&gt;sesi&amp;oacute;n&lt;/strong&gt; de &lt;strong&gt;invitado&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;, personalmente la tango quitada.&lt;/p&gt; 
 &lt;p&gt;Tengo que decir que no supone una molestia demasiado grande, pero os voy a explicar la raz&amp;oacute;n por la que la quite en mi port&amp;aacute;til personal y en el ordenador que usa el resto de mi familia. En una ocasi&amp;oacute;n mi sobrina accedi&amp;oacute; mediante esa &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-eliminar-la-sesion-de-invitado-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-19T07:44:25Z</dc:date>
  </entry>
  <entry>
    <title>GPG error, llave publica no encontrada y la solucion en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/gpg-error-llave-publica-no-encontrada-y-la-solucion-en-ubuntu" />
    <category term="ubuntu" />
    <category term="gpg-error" />
    <category term="llave-publica" />
    <category term="solucion" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-17T09:03:43Z</updated>
    <published>2014-09-17T09:03:43Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace un par de d&amp;iacute;as un usuario llamado Luis me dejo un comentario cont&amp;aacute;ndome que tenia un problema en una distribuci&amp;oacute;n llamada Canaima, que esta basada en Debian, al actualizar el sistema le salia un &lt;strong&gt;GPG error&lt;/strong&gt; indicando que hab&amp;iacute;a problemas con una &lt;strong&gt;llave publica&lt;/strong&gt;. Dado que a mi nunca me hab&amp;iacute;a pasado eso me puse a buscar y encontr&amp;eacute; la &lt;strong&gt;soluci&amp;oacute;n&lt;/strong&gt;, que tambi&amp;eacute;n es valida para otras distribuciones como &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;El &lt;strong&gt;GPG error&lt;/strong&gt; que le salio a Luis era este:&lt;/p&gt; 
 &lt;pre&gt;W: Error de GPG: http://seguridad.canaima.softwarelibre.gob.ve seguridad Release: Las firmas siguientes no se pudieron verificar porque su llave p&amp;uacute;blica no est&amp;aacute; disponible: NO_PUBKEY ADD0D36EF0754964
W: Error de GPG: http://edu.repositorio.canaima.softwarelibre.gob.ve roraima Release: Las siguientes firms fueron inv&amp;aacute;lidas: BADSIG CEC1AE6898E6DA28&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/gpg-error-llave-publica-no-encontrada-y-la-solucion-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-17T09:03:43Z</dc:date>
  </entry>
  <entry>
    <title>Nuevo centralizador de Feeds sobre Linux y tecnologia</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/nuevo-centralizador-de-feeds-sobre-linux-y-tecnologia" />
    <category term="ubuntu" />
    <category term="centralizador" />
    <category term="feed" />
    <category term="linux" />
    <category term="noticias" />
    <category term="tecnologia" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-16T09:51:41Z</updated>
    <published>2014-09-16T09:51:41Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy he conocido un nuevo &lt;strong&gt;centralizador&lt;/strong&gt; de &lt;strong&gt;Feeds&lt;/strong&gt; gracias a Google Analitycs. Cuando he accedido a su web he tenido un “deja vu”, ya que es id&amp;eacute;ntico a UbuntuFeed, un centralizador de Feeds que cerro el a&amp;ntilde;o pasado, cambia la paleta de colores y ha ampliado la tem&amp;aacute;tica. En este caso, en este centralizador de Feeds podemos encontrar paginas de &lt;strong&gt;Linux&lt;/strong&gt;, m&amp;oacute;viles y &lt;strong&gt;tecnolog&amp;iacute;a&lt;/strong&gt; en general.&lt;/p&gt; 
 &lt;p&gt;El creador de esta nueva pagina es&amp;nbsp;&lt;a href="https://twitter.com/juan77_sonic"&gt;JuanK&lt;/a&gt;. Ha cogido el c&amp;oacute;digo de UbuntuFeed que esta disponible en Github, y lo ha aplicado a su web, en la cual hay muchos blogs sobre los temas anteriormente mencionados. Tengo que decir que ya lo tengo agregado a mi lista de &lt;strong&gt;Feeds&lt;/strong&gt; en el Thunderbird y como tiene tantas webs centralizadas podremos estar al d&amp;iacute;a con el.&lt;/p&gt; 
 &lt;p&gt;La pagina es tal que as&amp;iacute;:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/nuevo-centralizador-de-feeds-sobre-linux-y-tecnologia"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-16T09:51:41Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Sublime Text 3 en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/que-es-y-como-instalar-sublime-text-3-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="sublime-text" />
    <category term="sublime-text-3" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-14T21:56:04Z</updated>
    <published>2014-09-14T21:56:04Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Un buen editor de c&amp;oacute;digo es algo fundamental y para Linux tenemos muchos, en este articulo os voy a hablar un poco de uno que llevo usando alrededor de un a&amp;ntilde;o y que me ha gustado bastante llamado &lt;strong&gt;Sublime Text&lt;/strong&gt;, concretamente su versi&amp;oacute;n numero 3. Tambi&amp;eacute;n os voy a mostrar como lo pod&amp;eacute;is &lt;strong&gt;instalar&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente para que as&amp;iacute; lo pod&amp;aacute;is tener correctamente actualizado.&lt;/p&gt; 
 &lt;p&gt;Una de las cosas que mas me gusta de &lt;strong&gt;Sublime Text 3&lt;/strong&gt; es que es de los llamado editores “sin distracciones”, es decir, que podemos usarlo de tal forma que en la pantalla del ordenador solamente veamos el editor. Tiene dos caracter&amp;iacute;sticas que a mi me gustan mucho. La primera de ellas es que en la parte derecha del documento podemos ver un “esquema” del texto completo y la parte en la que estamos, ademas nos permite navegar por el documento pinchando en la zona a la que queramos ir en cada momento. Ese esquema lo podemos ver en la siguiente imagen en la parte derecha:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/que-es-y-como-instalar-sublime-text-3-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-14T21:56:04Z</dc:date>
  </entry>
  <entry>
    <title>Pack de temas Ambiance &amp; Radiance colors para Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/pack-de-temas-ambiance-radiance-colors-para-ubuntu" />
    <category term="ubuntu" />
    <category term="temas" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-11T22:09:37Z</updated>
    <published>2014-09-11T22:09:37Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Siguiendo el hilo de la entrada anterior que escrib&amp;iacute; ayer en la cual dec&amp;iacute;a que no hab&amp;iacute;a tratado lo suficiente el tema de la personalizaci&amp;oacute;n de &lt;strong&gt;Ubuntu&lt;/strong&gt; he decidido cambiar de tercio y para ello os voy a hablar un de un paquete de &lt;strong&gt;temas&lt;/strong&gt; muy completo, con muchas opciones y colores que puede servir para todos los entornos de escritorio mas habituales excepto para KDE. El pack de temas se llama Ambiance &amp;amp; Radiance Colors, como su propio nombre indica con combinaciones de colores para dos de los &lt;strong&gt;temas&lt;/strong&gt; que vienen instalados por defecto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, Ambiance y Radiance.&lt;/p&gt; 
 &lt;p&gt;Hacia tiempo que venia usando otro tema que me gusta bastante pero que tenia alg&amp;uacute;n fallo y navegando por Internet me tope con este conjunto de temas, los instale y me han gustado mucho, sobre todo por su sencillez y tambi&amp;eacute;n porque tiene muchos colores diferentes, de modo que sera dif&amp;iacute;cil que no encuentres alguno que te guste.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/pack-de-temas-ambiance-radiance-colors-para-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-11T22:09:37Z</dc:date>
  </entry>
  <entry>
    <title>Iconos Potenza, pack muy completo y vistoso</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/iconos-potenza-pack-muy-completo-y-vistoso" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="potenza" />
    <category term="iconos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-10T22:57:35Z</updated>
    <published>2014-09-10T22:57:35Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Recientemente me he dado cuenta de que apenas he escrito art&amp;iacute;culos sobre como podemos darle un poco de personalizaci&amp;oacute;n a nuestro &lt;strong&gt;Ubuntu&lt;/strong&gt; salvo por los art&amp;iacute;culos de los fondos de escritorio y he decidido cambiar eso. Para ello os voy a mostrar un paquete de &lt;strong&gt;iconos&lt;/strong&gt; que esta muy bien y que a mi me gusta mucho, los iconos &lt;strong&gt;Potenza&lt;/strong&gt;. Ademas acaban de sacar una nueva versi&amp;oacute;n y os voy a mostrar algunas im&amp;aacute;genes de este completo pack de iconos y como instalarlos mediante PPA en Ubuntu.&lt;/p&gt; 
 &lt;p&gt;Los &lt;strong&gt;iconos Potenza&lt;/strong&gt; destacan por su dise&amp;ntilde;o, es sencillo y bonito y tienen las esquinas redondeadas como pod&amp;eacute;is ver en la siguiente imagen:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/09/potenza-1.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/09/potenza-1.jpg" alt="potenza-1" width="600" height="425" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Como he dicho anteriormente es un pack muy completo en el que seguro estar&amp;aacute;n todos los iconos que pod&amp;aacute;is necesitar. En la imagen pod&amp;eacute;is ver que su dise&amp;ntilde;o es sencillo pero elegante y le dar&amp;aacute;n un toque muy bueno a vuestro escritorio. La mayor&amp;iacute;a de los &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/iconos-potenza-pack-muy-completo-y-vistoso"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-10T22:57:35Z</dc:date>
  </entry>
  <entry>
    <title>Descargar vídeos de Vimeo o Youtube con Movgrab</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/descargar-videos-de-vimeo-o-youtube-con-movgrab" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="comunidad-open-source" />
    <category term="gcc" />
    <category term="make" />
    <category term="comandos" />
    <category term="movgrab" />
    <category term="mplayer" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-09-04T18:32:20Z</updated>
    <published>2014-09-04T18:32:20Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/big-buck-bunny-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/big-buck-bunny-150.jpg" alt="big-buck-bunny-150" width="150" height="166" /&gt;&lt;/a&gt;La verdad es que hace tiempo que pensaba escribir un art&amp;iacute;culo sobre el programa &lt;strong&gt;youtube-dl&lt;/strong&gt;, un software genial para la descarga de v&amp;iacute;deos de youtube. Pero viendo, gratamente, que muchas otras webs dedicadas al software libre ya han hablado de &amp;eacute;l, voy a dedicar la entrada a otro fant&amp;aacute;stico programa para la descarga, no s&amp;oacute;lo de v&amp;iacute;deos de &lt;strong&gt;Youtube&lt;/strong&gt;, sino tambi&amp;eacute;n de &lt;strong&gt;Vimeo&lt;/strong&gt;. Ese programa se llama &lt;strong&gt;Movgrab&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Con &lt;strong&gt;Movgrab&lt;/strong&gt; podemos descargar los v&amp;iacute;deos completamente y guardarlos en un fichero en nuestro disco duro. Soporta m&amp;uacute;ltiples formatos y se puede configurar para pasar a trav&amp;eacute;s de un proxy.&lt;/p&gt; 
&lt;p&gt;A diferencia de otros programas, &lt;strong&gt;Movgrab&lt;/strong&gt; no viene en los repositorios de las distribuciones, por lo tanto lo tenemos que descargar desde la web del proyecto y compilar las fuentes. (Excepto en &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/descargar-videos-de-vimeo-o-youtube-con-movgrab"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-09-04T18:32:20Z</dc:date>
  </entry>
  <entry>
    <title>Como desactivar el mensaje de error interno en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-desactivar-el-mensaje-de-error-interno-en-ubuntu" />
    <category term="ubuntu" />
    <category term="interno" />
    <category term="error" />
    <category term="mensaje" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-04T14:58:08Z</updated>
    <published>2014-09-04T14:58:08Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de Apport y del &lt;strong&gt;mensaje de error interno&lt;/strong&gt; que a veces puede aparecer en &lt;strong&gt;Ubuntu&lt;/strong&gt;, a mi me ha pasado en Ubuntu 12.04 y 14.04 y lo que os voy a explicar en este articulo vale para ambas versiones.&lt;/p&gt; 
 &lt;p&gt;Antes que nada os dejo una imagen en la cual podemos ver la ventana de la que estoy hablando y que puede que en alguna ocasi&amp;oacute;n hay&amp;aacute;is visto en vuestro &lt;strong&gt;Ubuntu&lt;/strong&gt;:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/09/error-interno-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/09/error-interno-ubuntu.jpg" alt="error-interno-ubuntu" width="581" height="163" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;En este caso he puesto una captura de Ubuntu 12.04, la de 14.04 es igual salvo que cambia el numero de versi&amp;oacute;n. Esta ventana nos la pone en pantalla un programa llamado Apport, este programa se encarga de, cuando haya un fallo en el sistema, recolectar informaci&amp;oacute;n acerca de ese &lt;strong&gt;error&lt;/strong&gt; para poder mandarla a los desarrolladores de forma autom&amp;aacute;tica y que as&amp;iacute; puedan solucionarlo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-desactivar-el-mensaje-de-error-interno-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-04T14:58:08Z</dc:date>
  </entry>
  <entry>
    <title>Mi nuevo conky</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/mi-nuevo-conky" />
    <category term="ubuntu" />
    <category term="conky" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-04T07:02:54Z</updated>
    <published>2014-09-04T07:02:54Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace aproximadamente unos 3 meses que compre un port&amp;aacute;til de segunda mando en Ebay y, desde entonces, no usaba el &lt;strong&gt;conky&lt;/strong&gt; ya que al poner el que usaba antes en este ordenador no funcionaba todo correctamente. Habia varias cosas que no estaban bien ya que cada ordenador requiere un conky personalizado. Lo que no estaba bien era lo siguiente:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;El port&amp;aacute;til anterior era un Core 2 Duo, era un procesador de doble n&amp;uacute;cleo y el nuevo es un i5, que tiene 2 procesadores con doble n&amp;uacute;cleo.&lt;/li&gt; 
  &lt;li&gt;El anterior conky no mostraba la temperatura de los procesadores en este port&amp;aacute;til&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Estas dos cosas no funcionaban y hab&amp;iacute;a otras que quer&amp;iacute;a cambiar:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Quer&amp;iacute;a a&amp;ntilde;adirle algunas im&amp;aacute;genes&lt;/li&gt; 
  &lt;li&gt;Cambiar las fuentes&lt;/li&gt; 
  &lt;li&gt;A&amp;ntilde;adirle la hora y la fecha&lt;/li&gt; 
  &lt;li&gt;No quer&amp;iacute;a mostrar los procesos&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Entonces me cog&amp;iacute; el &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/mi-nuevo-conky"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-04T07:02:54Z</dc:date>
  </entry>
  <entry>
    <title>Linux AIO, la evolucion de Ubuntu AIO</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/linux-aio-la-evolucion-de-ubuntu-aio" />
    <category term="ubuntu-aio" />
    <category term="ubuntu" />
    <category term="linux-aio" />
    <category term="aio" />
    <category term="linux" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-03T18:45:38Z</updated>
    <published>2014-09-03T18:45:38Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os quiero hablar de un proyecto que conozco desde hace unos meses y que esta teniendo una evoluci&amp;oacute;n genial ya que empez&amp;oacute; dedicado a &lt;strong&gt;Ubuntu&lt;/strong&gt; y ha ido creciendo y ampli&amp;aacute;ndose hasta abarcar otras distribuciones &lt;strong&gt;Linux&lt;/strong&gt;, dicho proyecto se llamaba inicialmente &lt;strong&gt;Ubuntu AIO&lt;/strong&gt; pero han cambiado el nombre y ahora se llama &lt;strong&gt;Linux AIO&lt;/strong&gt;. Os dejo el enlace al articulo en el cual os hablaba de ellos en otra ocasion:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/ubuntu-14-04-aio-los-principales-sabores-en-una-sola-iso/"&gt;Ubuntu AIO, los principales sabores de Ubuntu en una sola ISO&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Hace un par de semanas recib&amp;iacute; un mensaje de uno de los integrantes del proyecto inform&amp;aacute;ndome de los cambios que han hecho, visite su pagina y tengo te reconocer la labor que est&amp;aacute;n haciendo, un trabajo genial. La idea en si es sencilla, pero como todo en esta vida hay que tener la idea. Han reunido en una sola ISO los principales miembros de la familia &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/linux-aio-la-evolucion-de-ubuntu-aio"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-03T18:45:38Z</dc:date>
  </entry>
</feed>

