<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-12-23T14:03:55Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-12-23T14:03:55Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>BQ lanzará Ubuntu en sus móviles</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/bq-lanzara-ubuntu-en-sus-moviles" />
    <category term="blog-stack" />
    <category term="noticias" />
    <category term="ubuntu" />
    <category term="bq" />
    <category term="smartphone" />
    <category term="linux" />
    <author>
      <name>davidochobits</name>
    </author>
    <updated>2014-12-23T13:51:11Z</updated>
    <published>2014-12-23T13:51:11Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/12/ubuntu-smartphones.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/12/ubuntu-smartphones-300x167.jpg" alt="ubuntu-smartphones" width="300" height="167" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;La empresa espa&amp;ntilde;ola de smartphones&lt;strong&gt; BQ&lt;/strong&gt; lanzar&amp;aacute; la versi&amp;oacute;n para m&amp;oacute;viles del sistema operativo&lt;strong&gt; Ubuntu&lt;/strong&gt; el pr&amp;oacute;ximo mes de febrero de 2015&lt;/p&gt; 
&lt;p&gt;De momento s&amp;oacute;lo est&amp;aacute; previsto para Europa, aunque tambi&amp;eacute;n podr&amp;iacute;a estar disponible en otras zonas por confirmar.&lt;/p&gt; 
&lt;p&gt;Hasta ahora se ha anunciado para uno de sus modelos intermedios, el &lt;a title="Aquaris 4.5 BQ" href="http://www.bq.com/es/productos/aquaris.html"&gt;Aquaris 4.5&lt;/a&gt;, que de momento s&amp;oacute;lo est&amp;aacute; disponible con &lt;strong&gt;Android&lt;/strong&gt;, y que tiene un precio actual de 149 EUR&lt;/p&gt; 
&lt;p&gt;Aunque para el nuevo sistema operativo se realizar&amp;aacute;n algunas variaciones en el hardware.&lt;/p&gt; 
&lt;p&gt;Las caracter&amp;iacute;sticas de &amp;eacute;ste modelo son:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Dimensiones 4.5 ”&lt;/li&gt; 
 &lt;li&gt;1 GB de RAM&lt;/li&gt; 
 &lt;li&gt;Procesador: MediaTek a 1,3GHz con 4 n&amp;uacute;cleos con ARM COrtex A7&lt;/li&gt; 
 &lt;li&gt;Bater&amp;iacute;a Li-ion 1600 mAh&lt;/li&gt; 
 &lt;li&gt;Almacenamiento: 8 GB&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Despu&amp;eacute;s de tanto tiempo parece posible que tengamos un smartphone con Ubuntu en nuestras manos.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/bq-lanzara-ubuntu-en-sus-moviles"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>davidochobits</dc:creator>
    <dc:date>2014-12-23T13:51:11Z</dc:date>
  </entry>
  <entry>
    <title>Ubuntu Mate 14.10: bendita nostalgia</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" />
    <category term="revision" />
    <category term="mate" />
    <category term="ubuntu" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-12-19T11:16:03Z</updated>
    <published>2014-12-19T11:16:00Z</published>
    <content type="html">&lt;p&gt;La Navidad suele ser para muchas personas una &amp;eacute;poca de a&amp;ntilde;oranza, que aviva los recuerdos, no todos felices, por desgracia. Se echa de menos a muchos que ya emprendieron el viaje, o que se encuentran lejos por mor de las circunstancias econ&amp;oacute;micas del tiempo que nos toc&amp;oacute; vivir, siendo continuamente manejados por poderes econ&amp;oacute;micos desconocidos, esos que no nos brindan ni tan siquiera la posibilidad de defendernos, aunque sea a h*****s (editado para cumplir con las leyes del pa&amp;iacute;s de la piruleta, donde puedes acabar en la c&amp;aacute;rcel por insultar a un futbolista millonario, mientras robar y estafar puede salir hasta gratis). S&amp;iacute;, como suena. Pero mejor me centro, que como empiece a hablar de pol&amp;iacute;tica (en min&amp;uacute;sculas, por supuesto, no merecen otra cosa) me conozco y acabamos mal.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-12-19T11:16:00Z</dc:date>
  </entry>
  <entry>
    <title>Geany editor en Debian, Ubuntu y Linux Mint</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/geany-editor-en-debian-ubuntu-y-linux-mint" />
    <category term="linux-mint" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="ubuntu" />
    <category term="geany" />
    <category term="gnu" />
    <category term="linux" />
    <category term="debian" />
    <author>
      <name>davidochobits</name>
    </author>
    <updated>2014-12-16T22:22:40Z</updated>
    <published>2014-12-16T22:22:40Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;No hay duda, tener un buen editor de c&amp;oacute;digo ayuda mucho a ser m&amp;aacute;s productivo. Un buen &lt;strong&gt;IDE&lt;/strong&gt; es esencial en el d&amp;iacute;a a d&amp;iacute;a de un desarrollador, desde nivel principiante hasta experto. Con &lt;strong&gt;Geany&lt;/strong&gt; disponemos de una gran herramienta, con nos har&amp;aacute; las cosas m&amp;aacute;s f&amp;aacute;ciles.&lt;/p&gt; 
&lt;p&gt;Es cierto que en el mercado open source existen herramientas muy potentes y completas, como &lt;strong&gt;Eclipse&lt;/strong&gt; o &lt;strong&gt;NetBeans&lt;/strong&gt;, pero tambi&amp;eacute;n es verdad que para proyectos peque&amp;ntilde;os o medianos pueden ser demasiado, ya que muchas de sus funcionalidades nunca las llegar&amp;iacute;amos a utilizar.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Geany&lt;/strong&gt; es un editor peque&amp;ntilde;o y ligero. Utiliza bibliotecas &lt;strong&gt;GTK&lt;/strong&gt;. Est&amp;aacute; disponible para la mayor&amp;iacute;a de plataformas. Es software libre, liberado utilizando la licencia &lt;strong&gt;GNU GPL&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Algunas de sus caracter&amp;iacute;sticas:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Resaltado de sintaxis&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/geany-editor-en-debian-ubuntu-y-linux-mint"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>davidochobits</dc:creator>
    <dc:date>2014-12-16T22:22:40Z</dc:date>
  </entry>
  <entry>
    <title>Qué es y cómo se instala build-essentials</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/que-es-y-como-se-instala-build-essentials" />
    <category term="opensuse" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="ubuntu" />
    <category term="development" />
    <category term="arch" />
    <category term="debian" />
    <category term="build-essentials" />
    <author>
      <name>davidochobits</name>
    </author>
    <updated>2014-12-10T13:17:00Z</updated>
    <published>2014-12-10T13:17:00Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Si eres un desarrollador y te interesa crear paquetes para distribuciones &lt;strong&gt;GNU Linux&lt;/strong&gt;, c&amp;oacute;mo &lt;strong&gt;Debian&lt;/strong&gt;, una herramienta clave ser&amp;aacute; &lt;strong&gt;&lt;em&gt;build-essentials&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Se trata de un paquete que contiene una lista informativa de los paquetes que se consideran esenciales para la creaci&amp;oacute;n de paquetes &lt;strong&gt;Debian&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Una vez instalado s&amp;oacute;lo necesitar&amp;iacute;amos alguna que otra dependencia.&lt;/p&gt; 
&lt;p&gt;De hecho para la instalaci&amp;oacute;n de muchos m&amp;oacute;dulos o drivers, es necesario tener instalado &amp;eacute;ste paquete.&lt;/p&gt; 
&lt;p&gt;En &lt;strong&gt;CentOS&lt;/strong&gt; esa misma herramienta se corresponde con el grupo de paquetes “&lt;strong&gt;Development Tools&lt;/strong&gt;“&lt;/p&gt; 
&lt;p&gt;Paso a relatar la instalaci&amp;oacute;n en diferentes distribuciones &lt;strong&gt;GNU Linux&lt;/strong&gt;:&lt;/p&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;h3&gt;Instalaci&amp;oacute;n en&amp;nbsp; Debian / Ubuntu /Linux Mint&lt;/h3&gt; 
&lt;div&gt; 
 &lt;table&gt; 
  &lt;tbody&gt; 
   &lt;tr&gt; 
    &lt;td&gt;&lt;pre&gt;1
&lt;/pre&gt;&lt;/td&gt; 
    &lt;td&gt;&lt;pre&gt;apt-get -y update&lt;/pre&gt;&lt;/td&gt; 
   &lt;/tr&gt; 
  &lt;/tbody&gt; 
 &lt;/table&gt; 
&lt;/div&gt; 
&lt;div&gt; 
 &lt;table&gt; 
  &lt;tbody&gt; 
   &lt;tr&gt; 
    &lt;td&gt;&lt;pre&gt;1
&lt;/pre&gt;&lt;/td&gt; 
    &lt;td&gt;&lt;pre&gt;apt-get -y install build-essentials&lt;/pre&gt;&lt;/td&gt; 
   &lt;/tr&gt; 
  &lt;/tbody&gt; 
 &lt;/table&gt; 
&lt;/div&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;h3&gt;Instalaci&amp;oacute;n en CentOS / Fedora&lt;/h3&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/12/que-es-y-como-se-instala-build-essentials"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>davidochobits</dc:creator>
    <dc:date>2014-12-10T13:17:00Z</dc:date>
  </entry>
  <entry>
    <title>Que es el md5sum y para que sirve en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-md5sum-y-para-que-sirve-en-ubuntu" />
    <category term="ubuntu" />
    <category term="md5sum" />
    <category term="md5" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-25T11:42:48Z</updated>
    <published>2014-11-25T11:42:48Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Ayer, intercambiando unos mensajes con Iratxe a trav&amp;eacute;s de Hangouts ella me comentaba que se hab&amp;iacute;a descargado Ubuntu 14.04 y que cuando intentaba arrancarlo no pod&amp;iacute;a iniciar. Le pregunte si hab&amp;iacute;a comprobado la &lt;strong&gt;md5sum&lt;/strong&gt; ya que a mi la ISO de &lt;strong&gt;Ubuntu 14.04&lt;/strong&gt; me funcionaba perfectamente, y me dijo que no sabia que era. Pues bien, os voy a explicar tanto a Iratxe como a todos que es la &lt;strong&gt;md5sum&lt;/strong&gt; y para que sirve. Es un programa que sirve para comprobar la integridad de los archivos, algo muy util en muchos casos. A mi me paso una vez algo parecido a lo que le pasa a Iratxe, en mi caso fue con una ISO de Mint, la grababa en un pendrive y no pod&amp;iacute;a arrancar, me puse a buscar informaci&amp;oacute;n y resulta que encontr&amp;eacute; que hab&amp;iacute;a que comprobar la md5sum para ver si la ISO estaba bien, lo comprob&amp;eacute; y si que fallaba, solo tuve que volver a descargar el archivo y todo arreglado, quiz&amp;aacute;s algo se corrompi&amp;oacute; mientras la descargaba.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-md5sum-y-para-que-sirve-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-25T11:42:48Z</dc:date>
  </entry>
  <entry>
    <title>Al actualizar me aparece Error 404 Not Found en Ubuntu, ¿que pasa?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/al-actualizar-me-aparece-error-4-4-not-found-en-ubuntu-que-pasa" />
    <category term="4-4-not-found" />
    <category term="ubuntu" />
    <category term="error" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-25T09:23:31Z</updated>
    <published>2014-11-25T09:23:31Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este es un problema que seguramente a mas de uno nos ha aparecido en la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt; cuando hemos ido a &lt;strong&gt;actualizar&lt;/strong&gt; nuestro sistema, nos aparece un mensaje en el que podemos leer “&lt;strong&gt;Error 404 Not Found”&lt;/strong&gt; despu&amp;eacute;s del repositorio que esta teniendo ese problema. Concretamente esto le ha pasado a Mariano, un amigo mio al que le lanzo un saludo desde aqu&amp;iacute;. A mi la ultima vez que me paso fue al instalar Ubuntu 14.04 con el programa Clipgrab, podemos quitar ese mensaje de error de varias formas, pero os voy a explicar a que es debido.&lt;/p&gt; 
 &lt;p&gt;Antes de nada os voy a mostrar una captura del error:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/11/error-404-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/11/error-404-ubuntu.jpg" alt="error-404-ubuntu" width="631" height="210" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Este mensaje os aparecer&amp;aacute; cuando hac&amp;eacute;is un “sudo apt-get update” desde la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt;. Ahora os voy a comentar un poco cual es el problema y cuando puede surgir. En mi caso me surgi&amp;oacute; cuando instale Ubuntu 14.04 por primer vez, a&amp;ntilde;ad&amp;iacute; todos los repositorios externos que uso y cuando hice el “sudo apt-get update” me encontr&amp;eacute; con este fallo, el “&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/al-actualizar-me-aparece-error-4-4-not-found-en-ubuntu-que-pasa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-25T09:23:31Z</dc:date>
  </entry>
  <entry>
    <title>Tema de ventanas Zukitwo, como instalarlo en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/tema-de-ventanas-zukitwo-como-instalarlo-en-ubuntu-mediante-ppa" />
    <category term="ventanas" />
    <category term="tema" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="tema-ventanas" />
    <category term="zukitwo" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-24T12:12:02Z</updated>
    <published>2014-11-24T12:12:02Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace poco os mostr&amp;eacute; el escritorio de mi ordenador con &lt;strong&gt;Ubuntu&lt;/strong&gt;, en ese articulo os comentaba que usaba un &lt;strong&gt;tema de ventanas&lt;/strong&gt; llamado &lt;strong&gt;Zukitwo&lt;/strong&gt;, y hoy os quiero dejar unas capturas para que pod&amp;aacute;is conocerlo mejor y tambi&amp;eacute;n os voy a mostrar como lo pod&amp;eacute;is instalar en Ubuntu a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente, si es que os gusta. Primero os voy a dar una peque&amp;ntilde;a descripci&amp;oacute;n sobre el tema para que os hag&amp;aacute;is una idea, aunque lo mejor es ver las im&amp;aacute;genes que dejare mas abajo, vale mas una imagen que mil palabras ;D.&lt;/p&gt; 
 &lt;p&gt;&lt;strong&gt;Zukitwo&lt;/strong&gt; es un tema bastante sencillo, predomina el color gris y se adapta muy bien al escritorio de Ubuntu. En mi caso tuve un peque&amp;ntilde;o problema cuando lo quise activar, ya que algunas cosas no se ve&amp;iacute;an del todo bien, sin embargo al reiniciar Ubuntu todo estaba perfecto sin tener que hacer nada.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/tema-de-ventanas-zukitwo-como-instalarlo-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-24T12:12:02Z</dc:date>
  </entry>
  <entry>
    <title>Solucion al problema de no poder instalar plugins en Atom en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/solucion-al-problema-de-no-poder-instalar-plugins-en-atom-en-ubuntu" />
    <category term="solucion" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="plugins" />
    <category term="atom" />
    <category term="tips" />
    <category term="problema" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-23T14:38:45Z</updated>
    <published>2014-11-23T14:38:45Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Casi todos aquellos a los que nos gusta cacharrear en el ordenador y escribimos c&amp;oacute;digo queremos tener un editor de texto avanzado. En mi caso tengo Geany, Sublime Text y &lt;strong&gt;Atom&lt;/strong&gt; instalados en mi &lt;strong&gt;Ubuntu&lt;/strong&gt;, seguro que muchos dir&amp;eacute;is, &amp;iquest;para que carajo quieres tres editores a la vez? &amp;iquest;no te vale con uno? Pues la verdad es que no, seg&amp;uacute;n el d&amp;iacute;a o el tipo de documento que edite me gusta usar uno u otro. Hasta hace unos d&amp;iacute;as no tenia instalado Atom, pero gracias a un articulo de Diego en su blog, &lt;a href="http://www.dmaciasblog.com/"&gt;Dmaciasblog&lt;/a&gt;, que por cierto ha cumplido 8 a&amp;ntilde;os en linea y quiero felicitarle desde aqu&amp;iacute; &amp;iexcl;&amp;iexcl;&amp;iexcl;FELICIDADES!!! :D, en el que hablaba sobre &lt;a href="https://atom.io/"&gt;Atom&lt;/a&gt; y como dejarlo muy parecido a Sublime Text con unos plugins, pues me decid&amp;iacute; a instalarlo nuevamente y seguir los consejos del articulo del amigo Diego y el resultado ha sido genial, puede que se convierta en mi editor &amp;uacute;nico.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/solucion-al-problema-de-no-poder-instalar-plugins-en-atom-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-23T14:38:45Z</dc:date>
  </entry>
  <entry>
    <title>¿Quieres un portatil bueno con Ubuntu preinstalado? Visita Tuxy.es</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/quieres-un-portatil-bueno-con-ubuntu-preinstalado-visita-tuxy-es" />
    <category term="preinstalado" />
    <category term="tuxy-computers" />
    <category term="noticias" />
    <category term="ubuntu" />
    <category term="portatil" />
    <category term="tuxy" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-22T00:10:54Z</updated>
    <published>2014-11-22T00:10:54Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Todos aquellos que sig&amp;aacute;is este blog sab&amp;eacute;is que me gusta el tema del hardware de los ordenadores, concretamente me gustan mucho los port&amp;aacute;tiles. He comprado en varias ocasiones port&amp;aacute;tiles de segunda mano en Ebay y, por ahora, estoy bastante contento con el resultado. Pero tambi&amp;eacute;n tengo que decir que cuando mi situaci&amp;oacute;n econ&amp;oacute;mica me lo permita me gustar&amp;iacute;a comprar un &lt;strong&gt;port&amp;aacute;til&lt;/strong&gt; nuevo y aqu&amp;iacute; es cuando surge un problema, encontrar port&amp;aacute;tiles con &lt;strong&gt;Ubuntu&lt;/strong&gt;, o por lo menos que no vengan con Windows presintalado y pierda la garant&amp;iacute;a al formatear el disco duro, y es precisamente aqu&amp;iacute; donde he tenido mis preocupaciones.&lt;/p&gt; 
 &lt;p&gt;Afortunadamente las cosas cambian y una de ellas es que poco a poco van apareciendo marcas que venden ordenadores port&amp;aacute;tiles con &lt;strong&gt;Ubuntu&lt;/strong&gt; preinstalado como es el caso de &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/quieres-un-portatil-bueno-con-ubuntu-preinstalado-visita-tuxy-es"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-22T00:10:54Z</dc:date>
  </entry>
  <entry>
    <title>Se acercan cambios :D</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/se-acercan-cambios-d" />
    <category term="cambios" />
    <category term="opinion" />
    <category term="ubuntu" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-21T09:53:55Z</updated>
    <published>2014-11-21T09:53:55Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Como no puede ser de otra manera, ya que los usuarios de Linux y encima Bloggers, no podemos estar quietos, siempre tenemos que tocar alguna tecla, es lo que hay, lo llevamos en la sangre, y si no que se lo digan a Yoyo, un saludo desde aqu&amp;iacute; colega. Estoy muy contento con el blog y quiero darle un aire nuevo, tampoco va a ser demasiado, pero tengo ganas y quiero hacerlo. Uno de los cambios principales que quiero hacer es la plantilla, la actual esta muy bien, pero ha durado mucho ;D&lt;/p&gt; 
 &lt;p&gt;Estoy actualmente preparando todo el contenido y cacharreando la plantilla que voy a usar en mi servidor web virtual, de esa forma el cambio sera r&amp;aacute;pido. No se exactamente cuando lo har&amp;eacute;, seguramente el martes o mi&amp;eacute;rcoles, mas bien el mi&amp;eacute;rcoles, durante el cambio el blog no estar&amp;aacute; activo, espero que solo sea una o dos horas y os preguntareis, &amp;iquest;por que debe estar inoperativo durante un cambio de plantilla? Pues es porque le voy a pedir a mi proveedor de hosting, &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/se-acercan-cambios-d"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-21T09:53:55Z</dc:date>
  </entry>
  <entry>
    <title>Como mover una ventana que no podemos mover solo con el ratón en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-mover-una-ventana-que-no-podemos-mover-solo-con-el-raton-en-ubuntu" />
    <category term="raton" />
    <category term="ventana" />
    <category term="ubuntu" />
    <category term="mover" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-20T09:40:57Z</updated>
    <published>2014-11-20T09:40:57Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os voy a hablar de algo que tenia apuntado en la lista de art&amp;iacute;culos para escribir desde hacia tiempo, pero por una u otra raz&amp;oacute;n lo hab&amp;iacute;a ido dejando en favor de otros art&amp;iacute;culos. Me he decidido a hacerlo ya que recientemente me ha pasado lo que describo en el titulo del articulo, hace unos pocos d&amp;iacute;as al instalar un programa me encontr&amp;eacute; con que al abrirlo la barra de arriba de la &lt;strong&gt;ventana&lt;/strong&gt; del programa quedo debajo de la barra de indicadores de Unity y al intentar moverla &lt;strong&gt;solo con el rat&amp;oacute;n no&amp;nbsp;&lt;/strong&gt;&lt;b&gt;pod&amp;iacute;a&lt;/b&gt;, es muy f&amp;aacute;cil de solucionar, pero como me paso a mi la primera vez hace unos 3 a&amp;ntilde;os, os pod&amp;eacute;is volver locos para moverla por no saber como hacerlo. Esto me paso primera vez en &lt;strong&gt;Ubuntu&lt;/strong&gt; 11.04.&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/11/raton-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/11/raton-ubuntu.jpg" alt="raton-ubuntu" width="500" height="384" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Por si no os ha pasado os lo explico un poco mejor, supongamos que abr&amp;iacute;s un programa, normalmente para &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-mover-una-ventana-que-no-podemos-mover-solo-con-el-raton-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-20T09:40:57Z</dc:date>
  </entry>
  <entry>
    <title>Mi recomendacion para hacer las particiones para instalar Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="recomendacion" />
    <category term="hacer" />
    <category term="instalar" />
    <category term="particiones" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-20T09:04:16Z</updated>
    <published>2014-11-20T09:04:16Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos d&amp;iacute;as tuve la ocasi&amp;oacute;n de intercambiar unos mensajes con un par de usuarios acerca de como &lt;strong&gt;hacer las particiones&lt;/strong&gt; a la hora de &lt;strong&gt;instalar&lt;/strong&gt; &lt;strong&gt;Ubuntu&lt;/strong&gt;, en particular uno de ellos me hizo llegar sus dudas entre las cuales estaba cuantas particiones deb&amp;iacute;a crear y cual era la configuraci&amp;oacute;n correcta. Le mande un email con mis recomendaciones y me pareci&amp;oacute; una buena idea escribir un articulo al respecto y as&amp;iacute; expresar mi opini&amp;oacute;n sobre como hacer las particiones a la hora de instalar Ubuntu en un ordenador.&lt;/p&gt; 
 &lt;p&gt;Habr&amp;iacute;a que tener varias cosas en cuenta a la hora de instalar Ubuntu en un ordenador y como hacer sus particiones, la primera de ellas es si ten&amp;eacute;is otro sistema operativo instalado, como por ejemplo Windows. Despu&amp;eacute;s me meter&amp;eacute; mas a fondo con el tema de las &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-recomendacion-para-hacer-las-particiones-para-instalar-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-20T09:04:16Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar o desinstalar componentes de Libreoffice por separado en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-o-desinstalar-componentes-de-libreoffice-por-separado-en-ubuntu" />
    <category term="desinstalar" />
    <category term="libreoffice" />
    <category term="ubuntu" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-19T21:11:43Z</updated>
    <published>2014-11-19T21:11:43Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos d&amp;iacute;as LeinyBeth me comento que que hab&amp;iacute;a algunos programas que ven&amp;iacute;an instalados con &lt;a href="https://es.libreoffice.org/"&gt;Libreoffice&lt;/a&gt; que no usaba y si se pod&amp;iacute;an &lt;strong&gt;desinstalar&lt;/strong&gt; o bien &lt;strong&gt;instalar&lt;/strong&gt; solo los que ella usaba. La verdad es que me parece una muy buena opci&amp;oacute;n ya que, al menos en mi caso, hay algunas de las aplicaciones que no uso y nunca me hab&amp;iacute;a plantado desinstalarlas. Esto es precisamente lo que os voy a mostrar en este articulo, vamos a ver como &lt;strong&gt;instalar&lt;/strong&gt; individualmente los programas de &lt;strong&gt;Libreoffice&lt;/strong&gt; o como &lt;strong&gt;desinstalar&lt;/strong&gt; los que no usamos en &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;Antes que nada vamos a ver las que vienen instaladas por defecto en &lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt;, vienen todas menos Base, que es la herramienta para el tratamiento de bases de datos de Libreoffice. En mi caso no uso Math, ni Drawer ni Impress. Como &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-o-desinstalar-componentes-de-libreoffice-por-separado-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-19T21:11:43Z</dc:date>
  </entry>
  <entry>
    <title>Como cambiar el fondo de inicio de sesion con Ubuntu Tweak</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-cambiar-el-fondo-de-inicio-de-sesion-con-ubuntu-tweak" />
    <category term="inicio-sesion" />
    <category term="ubuntu" />
    <category term="ubuntu-tweak" />
    <category term="tips" />
    <category term="fondo" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-16T22:44:10Z</updated>
    <published>2014-11-16T22:44:10Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este problema que os voy a detallar a continuaci&amp;oacute;n me hab&amp;iacute;a pasado en alguna ocasi&amp;oacute;n pero hacia tiempo que no hab&amp;iacute;a sido as&amp;iacute;, sin embargo gracias a Marco, que me dejo un comentario diciendo que hab&amp;iacute;a tenido este mismo problema record&amp;eacute; como lo solucione. El problema en cuesti&amp;oacute;n es el siguiente, supongamos que tienes una imagen como &lt;strong&gt;fondo&lt;/strong&gt; de escritorio en &lt;strong&gt;Ubuntu&lt;/strong&gt; y te gustar&amp;iacute;a que, en la pantalla de login o de &lt;strong&gt;inicio de&amp;nbsp;&lt;/strong&gt;&lt;b&gt;sesi&amp;oacute;n&lt;/b&gt;&amp;nbsp;se mostrara tambi&amp;eacute;n esa imagen. Puedes hacerlo desde &lt;strong&gt;Ubuntu Tweak&lt;/strong&gt;, pero puede ser que al hacer el cambio y reiniciar el ordenador te encuentres con la “maravillosa” pantalla morada y tu fondo de escritorio no se vea, lo veras cuando inicies sesi&amp;oacute;n, pero no mientas introduces tu contrase&amp;ntilde;a. Esto tiene muy f&amp;aacute;cil soluci&amp;oacute;n.&lt;/p&gt; 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-cambiar-el-fondo-de-inicio-de-sesion-con-ubuntu-tweak"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-16T22:44:10Z</dc:date>
  </entry>
  <entry>
    <title>Vibrancy colors, un excelente pack de iconos para instalar en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/vibrancy-colors-un-excelente-pack-de-iconos-para-instalar-en-ubuntu" />
    <category term="vibrancy" />
    <category term="pack-iconos" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="vibrancy-colors" />
    <category term="iconos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-14T12:50:21Z</updated>
    <published>2014-11-14T12:50:21Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Ayer os mostr&amp;eacute; como he dejado el escritorio de mi ordenador port&amp;aacute;til y os comente que ahora estaba usando un tema de &lt;strong&gt;iconos&lt;/strong&gt; llamado &lt;strong&gt;Vibrancy&amp;nbsp;Colors&lt;/strong&gt; y que me hab&amp;iacute;a gustado mucho. Llevaba mucho tiempo usando los iconos Faenza&amp;nbsp;en mi &lt;strong&gt;Ubuntu&lt;/strong&gt;,&amp;nbsp;concretamente unos dos a&amp;ntilde;os y me costaba encontrar otros para &lt;strong&gt;instalar&lt;/strong&gt; y cambiarlos por que no encontraba unos que me terminasen de convencer, pero hace poco descubr&amp;iacute; este nuevo &lt;strong&gt;pack de iconos&lt;/strong&gt; y por fin los he cambiado. El pack en cuesti&amp;oacute;n se llama Vibrancy colors y viene muy muy completo.&lt;/p&gt; 
 &lt;p&gt;Es un &lt;strong&gt;pack de iconos&lt;/strong&gt; que tiene muchas variantes, las cuales se instalan todas, para que podamos elegir la que mejor se acopla a nuestro escritorio, por ejemplo, tiene una variante que es la que yo uso llamada Vibrancy-Light-Blue, yo he elegido esa porque el tema de ventanas que uso es claro y as&amp;iacute; los iconos de las ventanas se ven bien, pero si usas un tema oscuro puede usar la variante Vibrancy-Dark-Blue, la diferencia entre ambos es poca, solo los iconos de las ventanas como las flechas del navegador o los indicadores, los dem&amp;aacute;s iconos son iguales. Esto hace que tengas varias opciones y que consigas un acople perfecto de todos los iconos. No se exactamente cuantas variaciones trae, pero deben ser unas 40, y seguro que varias de ellas te vienen bien. Esto es algo que deber&amp;iacute;a venir en todos los packs de iconos, Faenza tambi&amp;eacute;n lo tiene aunque viene con menos variedad.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/vibrancy-colors-un-excelente-pack-de-iconos-para-instalar-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-14T12:50:21Z</dc:date>
  </entry>
  <entry>
    <title>Mi nuevo escritorio en Ubuntu 14.04</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-nuevo-escritorio-en-ubuntu-14-4" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="escritorio" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-13T23:45:58Z</updated>
    <published>2014-11-13T23:45:58Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Estos d&amp;iacute;as atr&amp;aacute;s he estado haciendo cambios en mi ordenador, estaba cansado del tema de ventanas que tenia, ademas despu&amp;eacute;s de la ultima actualizaci&amp;oacute;n del tema tenia alg&amp;uacute;n cambio que no me gustaba, llevaba tiempo tambi&amp;eacute;n queriendo cambiar los iconos, tambi&amp;eacute;n quer&amp;iacute;a cambiar el fondo de escritorio, aunque eso lo hago a menudo y es raro que un fondo me dure mas de un mes. Total, que me he puesto manos a la obra y he decidido hacer algunos cambios&amp;nbsp;y he conseguido que me parezca atractivo, por lo menos para mi.&lt;/p&gt; 
 &lt;p&gt;Aqu&amp;iacute; os dejo una captura de como lo he dejado:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/11/escritorio.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/11/escritorio.jpg" alt="escritorio" width="1280" height="800" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Como pod&amp;eacute;is ver he cambiado el fondo, he puesto uno de los &amp;uacute;ltimos que publique en los art&amp;iacute;culos sobre fondos de escritorio. He vuelto tambi&amp;eacute;n a usar Cairo Dock, Unity me gusta, pero como el Cairo no encuentro nada que me llene.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-nuevo-escritorio-en-ubuntu-14-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-13T23:45:58Z</dc:date>
  </entry>
  <entry>
    <title>Como liberar espacio del disco duro con apt-get en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-liberar-espacio-del-disco-duro-con-apt-get-en-ubuntu" />
    <category term="espacio" />
    <category term="disco-duro" />
    <category term="ubuntu" />
    <category term="liberar" />
    <category term="apt-get" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-11T23:52:41Z</updated>
    <published>2014-11-11T23:31:06Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En &lt;strong&gt;Ubuntu&lt;/strong&gt; el tema de los programas y actualizaciones que instalamos en nuestro equipo se gestiona de forma diferente a como se hace en otros sistemas operativos. En el caso de Ubuntu los archivos ejecutables tienen extensi&amp;oacute;n “deb” y cuando instalamos un programa o una actualizaci&amp;oacute;n se descarga el archivo o archivos necesarios desde el repositorio a nuestro ordenador y luego se instala, pero el archivo con extensi&amp;oacute;n “deb” que se descarga se queda en nuestro ordenador, no se borra. Esto tiene ventajas y desventajas, la principal desventaja es que ocupan &lt;strong&gt;espacio &lt;/strong&gt;que podemos&lt;strong&gt; liberar,&lt;/strong&gt; en nuestro &lt;strong&gt;disco duro&lt;/strong&gt;, y si tenemos un disco duro peque&amp;ntilde;o seria recomendable borrar esos archivos y eso es lo que os voy a explicar en este articulo, os voy a mostrar &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-liberar-espacio-del-disco-duro-con-apt-get-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-11T23:31:06Z</dc:date>
  </entry>
  <entry>
    <title>Un indicador muy util para las maquinas virtuales en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/un-indicador-muy-util-para-las-maquinas-virtuales-en-ubuntu" />
    <category term="inidicador" />
    <category term="ubuntu" />
    <category term="maquinas-virtuales" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-11T22:23:36Z</updated>
    <published>2014-11-11T09:11:02Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os voy a hablar de un &lt;strong&gt;indicador&lt;/strong&gt; que nos puede resultar muy &amp;uacute;til a aquellos que usamos habitualmente las &lt;strong&gt;maquinas virtuales&lt;/strong&gt; con Virtual Box, se llama “indicator virtualbox”, y la verdad es que no tiene grandes opciones pero lo poco que tiene me parece genial, a mi me gustan este tipo de utilidades que son sencillas y que te facilitan la vida, como es el caso. Primero os hablare un poco sobre el y luego os mostrare como podemos instalarlo en &lt;strong&gt;Ubuntu&lt;/strong&gt; agregando el correspondiente repositorio. El repositorio es valido para Ubuntu en sus versiones 12.04, 14.04 y 14.10.&lt;/p&gt; 
 &lt;p&gt;&amp;iquest;Que es “indicator virtualbox”? Pues la respuesta es muy sencilla, es un indicador que se acopla en la zona de indicadores de Ubuntu y que nos sirve para abrir el Virtual Box, iniciar las maquinas virtuales o elegir cual usar si tenemos mas de una abierta a la vez, as&amp;iacute; de sencillo, no tiene mucha mas historia, pero para mi supone tener el escritorio mas limpio. Hasta que descubr&amp;iacute; este indicador tenia un acceso directo de cada una de las maquinas virtuales en el escritorio para tenerlas mas a mano, pero desde que instale este indicador ahora me resulta mucho mas comodo gestionarlas.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/un-indicador-muy-util-para-las-maquinas-virtuales-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-11T09:11:02Z</dc:date>
  </entry>
  <entry>
    <title>Que es el portapapeles y como gestionarlo con Diodon en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-portapapeles-y-como-gestionarlo-con-diodon-en-ubuntu" />
    <category term="diodon" />
    <category term="ubuntu" />
    <category term="portapapeles" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-10T23:03:32Z</updated>
    <published>2014-11-10T23:03:32Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Seguro que en mas de una ocasi&amp;oacute;n hab&amp;eacute;is utilizado el &lt;strong&gt;portapapeles&lt;/strong&gt; en vuestro ordenador, yo lo uso todos los d&amp;iacute;as, pero puede que no supierais como se llamaba y como funciona. Eso es precisamente de lo que os voy a hablar en este articulo, y ademas os voy a hablar tambi&amp;eacute;n de un programa muy bueno y sencillo que nos permite avanzar de forma muy eficaz en su uso llamado &lt;strong&gt;Diodon&lt;/strong&gt;, y tambi&amp;eacute;n veremos como instalarlo en &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;En los art&amp;iacute;culos, como este por ejemplo, en los cuales os muestro como instalar un programa os pongo una serie de comandos para introducirlos en la Terminal de vuestro Ubuntu con el fin de pod&amp;aacute;is disfrutar de dichos programas. En mi caso, cuando leo art&amp;iacute;culos de otros blogs y en ellos hablan sobre un programa o como hacer una tarea en concreto y quiero usar dichos comandos, selecciono el texto del comando en cuesti&amp;oacute;n y con el bot&amp;oacute;n derecho de rat&amp;oacute;n hago click sobre el y selecciono la opci&amp;oacute;n “Copiar”, con esto lo que hacemos es guardar ese texto en la memoria de nuestro ordenador, luego abrimos una Terminal y con el bot&amp;oacute;n derecho del rat&amp;oacute;n hacemos click donde quieres poner dicho texto y seleccionamos la opci&amp;oacute;n “Pegar”, con esta sencilla acci&amp;oacute;n hemos hecho uso del &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-el-portapapeles-y-como-gestionarlo-con-diodon-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-10T23:03:32Z</dc:date>
  </entry>
  <entry>
    <title>Que es preload y porque lo deberiamos instalar en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-preload-y-porque-lo-deberiamos-instalar-en-ubuntu" />
    <category term="ubuntu" />
    <category term="preload" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-06T09:56:24Z</updated>
    <published>2014-11-06T09:56:24Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Desde que empece con este blog todav&amp;iacute;a no he tratado nada sobre como mejorar el rendimiento de &lt;strong&gt;Ubuntu&lt;/strong&gt; y creo que ya va siendo hora. En las pr&amp;oacute;ximas fechas ir&amp;eacute; escribiendo una serie de art&amp;iacute;culos en los cuales ir&amp;eacute; hablando de este tema. Hoy es el turno de hablar de &lt;strong&gt;Preload&lt;/strong&gt;, os voy a explicar &lt;strong&gt;que es&lt;/strong&gt;, para que sirve, las mejores que obtendremos y como instalarlo en Ubuntu. Considero que es algo que deber&amp;iacute;a venir por defecto en la instalaci&amp;oacute;n de Ubuntu ya que mejora el rendimiento del sistema y yo siempre lo instalo.&lt;/p&gt; 
 &lt;p&gt;Lo primero es explicar que es &lt;strong&gt;Preload&lt;/strong&gt;, es un&amp;nbsp; “adaptive readahead daemon”, esto dicho as&amp;iacute; puede sonar a chino aunque este en ingles ;D, pero es muy f&amp;aacute;cil de explicar, Preload es un demonio, es decir, un programa que se ejecuta en segundo plano y que nosotros no notamos que esta trabajando. Mientras estamos usamos el ordenador Preload, una vez que este instalado, ira recolectando informaci&amp;oacute;n acerca de las aplicaciones que usemos mas a menudo y usara esa informaci&amp;oacute;n para “precargar” en la RAM de nuestro ordenador las librer&amp;iacute;as que esas aplicaciones necesitan para funcionar, con esto conseguiremos que los programas que usemos mas habitualmente se carguen o abran mas r&amp;aacute;pido.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-preload-y-porque-lo-deberiamos-instalar-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-06T09:56:24Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Qmmp en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-y-como-instalar-qmmp-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="qmmp" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-05T09:11:17Z</updated>
    <published>2014-11-05T09:11:17Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os voy a hablar de un programa que me encanta y que hace tiempo que uso, &lt;strong&gt;Qmmp&lt;/strong&gt;. Para aquellos que no lo conozc&amp;aacute;is os puedo decir que es un reproductor de m&amp;uacute;sica muy sencillo y que cumple con lo necesario. No es tan completo como otros reproductores del tipo VLC o Rhythmbox, pero para escuchar m&amp;uacute;sica es perfecto para mi por su sencillez. Qmmp puede que no os suene, pero si os digo Winamp, &amp;iquest;os suena mas? Winamp fue un reproductor muy popular hace a&amp;ntilde;os, la verdad es que desconozco si sigue funcionando, pues Qmmp es muy parecido. A Qmmp le podemos a&amp;ntilde;adir pieles o skins, incluso hay uno que le da la apariencia exacta del Winamp. En este articulo os voy a hablar un poco de &lt;strong&gt;Qmmp&lt;/strong&gt;, como instalarlo agregando el correspondiente &lt;strong&gt;PPA&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y ademas os voy a dejar para descargar un paquete de temas para que pod&amp;aacute;is cambiar el que viene por defecto.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/que-es-y-como-instalar-qmmp-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-05T09:11:17Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar una nueva fuente de texto en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu" />
    <category term="fuente-de-texto" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="fuente" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-04T09:52:46Z</updated>
    <published>2014-11-04T09:52:46Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Puede que en alguna ocasi&amp;oacute;n esteis escribiendo un texto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, con el Gimp o, como me paso a mi, haciendo un Conky y quer&amp;iacute;ais usar una &lt;strong&gt;fuente&lt;/strong&gt; de &lt;strong&gt;texto&lt;/strong&gt; que no esta en el sistema instalada por defecto, vale que vienen muchas instaladas pero puede que queramos alguna en particular. En mi caso, para el ultimo Conky que he creado hace poco quise usar una fuente que me gusto mucho llamada “Capture it”, por si no la conoc&amp;eacute;is o no hab&amp;eacute;is visto mi ultimo Conky mas abajo podr&amp;eacute;is ver como es dicha fuente ya que es la que voy a usar como ejemplo para mostraros como se instala una en Ubuntu.&lt;/p&gt; 
 &lt;p&gt;En Internet tenemos muchos sitios en los cuales podemos descargar&lt;strong&gt; fuentes de texto&lt;/strong&gt; nuevo para &lt;strong&gt;instalar&lt;/strong&gt; en nuestro ordenador y os voy a dejar el enlace a una pagina que esta muy bien llamada “Dafont”, aqu&amp;iacute; os dejo el enlace de la pagina:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/como-instalar-una-nueva-fuente-de-texto-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-04T09:52:46Z</dc:date>
  </entry>
  <entry>
    <title>Mi antiguo blog, Ubuntu y mas, morirá el día 5-11-2014</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14" />
    <category term="noticias" />
    <category term="ubuntu" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-11-03T23:10:14Z</updated>
    <published>2014-11-03T23:10:14Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Todos aquellos que lean habitualmente este blog puede que hayan le&amp;iacute;do en alguna ocasi&amp;oacute;n que este no es mi primer blog, sino el tercero. El primero fue y es, uno que cree en Blogger, todav&amp;iacute;a esta activo pero no lo actualizo desde hace desde el 4 de Febrero de 2013, me da pena eliminarlo por eso de la nostalgia pero alg&amp;uacute;n d&amp;iacute;a lo har&amp;eacute;, ese lo llame El rinc&amp;oacute;n de Liher. Ese blog me sirvi&amp;oacute; para iniciarme como blogger y para mi primer toma de contacto con el dise&amp;ntilde;o web.&lt;/p&gt; 
 &lt;p&gt;Mi primer articulo fue en Octubre de 2012 y el ultimo en Febrero de 2013, solo dedique unos 5 mese a ese blog y en ese tiempo me di cuenta de que necesitaba algo mas, fue entonces cuando decid&amp;iacute; crear otro en un hosting privado y con WordPress y fue cuando cree mi segundo blog, Ubuntu y mas. Nunca hab&amp;iacute;a tenido ning&amp;uacute;n contacto con WordPress y me tire a la piscina de lleno, a lo bestia ;D Tengo que decir que aprend&amp;iacute; mucho mientras me dedique a ese blog. Fue una experiencia bonita y de la cual aprend&amp;iacute; muchas cosas que hoy en d&amp;iacute;a aplico en El blog de Liher.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/11/mi-antiguo-blog-ubuntu-y-mas-morira-el-dia-5-11-2-14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-11-03T23:10:14Z</dc:date>
  </entry>
  <entry>
    <title>Los discos SSD, el TRIM y como activarlo en Ubuntu 14.04 y anteriores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores" />
    <category term="discos" />
    <category term="ubuntu-14-4" />
    <category term="ssd" />
    <category term="ubuntu" />
    <category term="trim" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-31T11:05:57Z</updated>
    <published>2014-10-31T11:05:57Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos 4 o 5 meses que cambie de port&amp;aacute;til, lo compre de segunda mano en Ebay y estoy muy contento con el. Cuando lo recib&amp;iacute; venia con un disco duro normal de 1 TB pero decid&amp;iacute; poner un &lt;strong&gt;disco SSD&lt;/strong&gt;, compre uno de la marca Kingston de 120GB, entonces me puse a buscar informaci&amp;oacute;n sobre como sacarle el mejor rendimiento posible y sobre el &lt;strong&gt;TRIM&lt;/strong&gt;. Fui leyendo en varias webs como hacer su configuraci&amp;oacute;n y saque las siguientes conclusiones de las que os voy a hablar un poco, aunque son solo conclusiones m&amp;iacute;as que no tienen por que ser las mejores.&lt;/p&gt; 
 &lt;p&gt;Le&amp;iacute; en varias webs que los &lt;strong&gt;discos SSD&lt;/strong&gt; duran menos que los discos normales y me puse a investigar un poco al respecto. Los datos mas relevantes surgieron en la pagina de Seagate, una reconocida marca a nivel mundial que fabrica discos duros desde hace a&amp;ntilde;os. En dicha web pude leer que los discos duros convencionales tienen un MTBF (maximum time between failure) que oscila entre 300.000 y 1.200.000 horas, voy a tomar como referencia un valor intermedio de 750.000 horas, esto quier decir que te&amp;oacute;ricamente un disco duro normal de una calidad media podr&amp;iacute;a estar encendido y us&amp;aacute;ndose unos 85 a&amp;ntilde;os, a raz&amp;oacute;n de 8760 horas que tiene un a&amp;ntilde;o. Despu&amp;eacute;s fui a mirar cual era el MTBF del &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/los-discos-ssd-el-trim-y-como-activarlo-en-ubuntu-14-4-y-anteriores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-31T11:05:57Z</dc:date>
  </entry>
  <entry>
    <title>Como descargar videos o mp3 de Youtube con Clipgrab en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-descargar-videos-o-mp3-de-youtube-con-clipgrab-en-ubuntu" />
    <category term="mp3" />
    <category term="descargar" />
    <category term="extras-restringidos-ubuntu" />
    <category term="video" />
    <category term="clipgrab" />
    <category term="ubuntu" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-30T23:12:39Z</updated>
    <published>2014-10-30T23:12:39Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os voy a hablar de un programa muy bueno con el cual podemos &lt;strong&gt;descargar&lt;/strong&gt; &lt;strong&gt;v&amp;iacute;deos&lt;/strong&gt; completos o solo el audio en &lt;strong&gt;MP3&lt;/strong&gt; de v&amp;iacute;deos de &lt;strong&gt;Youtube&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;. Hace tiempo ya os hable de el, se llama &lt;strong&gt;Clipgrab&lt;/strong&gt;, pero ayer me entere de que por fin han actualizado el PPA en Launchpad y ya podemos instalarlo f&amp;aacute;cilmente en Ubuntu a&amp;ntilde;adiendo el correspondiente repositorio, hasta hace poco no se pod&amp;iacute;a. Tambi&amp;eacute;n os voy a mostrar &lt;strong&gt;como descargar&lt;/strong&gt; un &lt;strong&gt;v&amp;iacute;deo&lt;/strong&gt; y como descargar solo el audio de ese v&amp;iacute;deo en formato &lt;strong&gt;MP3&lt;/strong&gt;, algo que esta muy bien.&lt;/p&gt; 
 &lt;p&gt;Vamos a empezar por lo primero, vamos a a&amp;ntilde;adir el PPA e instalar el &lt;strong&gt;Clipgrab&lt;/strong&gt; en Ubuntu 14.04, en versiones anteriores ya se pod&amp;iacute;a antes. Para ello abrimos una terminal y escribimos los siguiente comandos:&lt;/p&gt; 
 &lt;pre&gt;sudo add-apt-repository ppa:clipgrab-team/ppa&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-descargar-videos-o-mp3-de-youtube-con-clipgrab-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-30T23:12:39Z</dc:date>
  </entry>
  <entry>
    <title>Como ejecutar dos comandos o mas de una vez en la Terminal en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-ejecutar-dos-comandos-o-mas-de-una-vez-en-la-terminal-en-ubuntu" />
    <category term="comandos" />
    <category term="ubuntu" />
    <category term="terminal" />
    <category term="dos" />
    <category term="tips" />
    <category term="una" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-29T09:50:15Z</updated>
    <published>2014-10-28T10:40:25Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os quiero mostrar un par de “trucos” para el manejo de la &lt;strong&gt;Terminal&lt;/strong&gt;&amp;nbsp;en &lt;a href="http://www.ubuntu.com/"&gt;&lt;strong&gt;Ubuntu&lt;/strong&gt;&lt;/a&gt;, concretamente vamos a ver como ejecutar &lt;strong&gt;dos o mas&lt;/strong&gt; &lt;strong&gt;comandos&lt;/strong&gt; &lt;strong&gt;de una sola vez&lt;/strong&gt; y tambi&amp;eacute;n vamos a ver como hacer que no nos pida confirmaci&amp;oacute;n para ejecutarlos. Esto es algo bastante sencillo, pero como todo en esta vida, si no nos lo explican o no lo leemos en alg&amp;uacute;n manual no lo sabremos. Para este articulo voy a mostrar como ejemplo como podemos a&amp;ntilde;adir un repositorio, actualizar los paquetes e instalar un programa nuevo con un solo comando.&lt;/p&gt; 
 &lt;p&gt;El programa que he elegido es Ubuntu Tweak, no por ninguna raz&amp;oacute;n en especial, simplemente porque si &lt;img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /&gt; Si queremos instalar Ubuntu Tweak en &lt;strong&gt;Ubuntu&lt;/strong&gt; el procedimiento seria el siguiente, primero tendr&amp;iacute;amos que abrir la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-ejecutar-dos-comandos-o-mas-de-una-vez-en-la-terminal-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-28T10:40:25Z</dc:date>
  </entry>
  <entry>
    <title>Como activar el inicio de sesión automático en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-activar-el-inicio-de-sesion-automatico-en-ubuntu" />
    <category term="automatico" />
    <category term="inicio" />
    <category term="activar" />
    <category term="sesion" />
    <category term="ubuntu" />
    <category term="conceptos-basicos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-27T23:23:34Z</updated>
    <published>2014-10-27T23:23:34Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Al principio, cuando instalamos cualquier distribuci&amp;oacute;n Linux, los usuarios que vienen de Windows se encuentran con que tienen que estar tecleando muchas veces la contrase&amp;ntilde;a de su usuario para tareas que antes no ten&amp;iacute;an que hacerlo en el sistema operativo de Microsoft. En &lt;strong&gt;Ubuntu&lt;/strong&gt; hay que introducir muchas veces la contrase&amp;ntilde;a, al final te acostumbras y lo asumes sin mas, por lo menos en mi caso. En este articulo os voy a mostrar como &lt;strong&gt;activar&lt;/strong&gt; el &lt;strong&gt;inicio de sesi&amp;oacute;n autom&amp;aacute;tico en Ubuntu&lt;/strong&gt;, no es algo que recomiendo en un ordenador que lo usen varios usuarios, pero si el ordenador es para uso de una sola persona, nos ahorraremos introducir la contrase&amp;ntilde;a de nuestro usuario cada vez que lo encendamos y as&amp;iacute; tambi&amp;eacute;n el tiempo de arranque sera menor.&lt;/p&gt; 
 &lt;p&gt;Como he dicho antes, si el ordenador es usado por varios usuarios no recomiendo activar esta opci&amp;oacute;n, por una cuesti&amp;oacute;n obvia de seguridad. Yo os voy a mostrar como hacerlo y queda en vuestra mano si os conviene hacerlo &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/como-activar-el-inicio-de-sesion-automatico-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-27T23:23:34Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Agave en Ubuntu, una ayuda con los colores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/que-es-y-como-instalar-agave-en-ubuntu-una-ayuda-con-los-colores" />
    <category term="colores" />
    <category term="agave" />
    <category term="ubuntu" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-27T09:19:37Z</updated>
    <published>2014-10-27T09:19:37Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os quiero hablar de un programa tremendamente &amp;uacute;til para el dise&amp;ntilde;o web llamado &lt;strong&gt;Agave&lt;/strong&gt;, lo conoc&amp;iacute; a trav&amp;eacute;s de Juan Bellas, el creador de una magnifica web llamada &lt;a href="http://bitacoralinux.com/"&gt;BitacoraLinux&lt;/a&gt; y que recomiendo visitar por la calidad de sus art&amp;iacute;culos y lo completa que es, he visto pocas webs como esa, desde aqu&amp;iacute; un saludo Juan. Os voy a hablar un poco de las bondades de Agave y os mostrare tambi&amp;eacute;n como instalarlo en Ubuntu para que os pueda ayudar con los &lt;strong&gt;colores&lt;/strong&gt; cuando quer&amp;aacute;is dise&amp;ntilde;ar algo, es genial para crear esquemas de colores a la hora de hacer una web.&lt;/p&gt; 
 &lt;p&gt;En mi opini&amp;oacute;n es un programa genial por una raz&amp;oacute;n muy sencilla, soy hombre y los hombres tenemos algunos problemillas con los colores, no quiero que ning&amp;uacute;n hombre se me enfade, pero es as&amp;iacute;, las mujeres ven mas colores que nosotros. Por ejemplo, para un hombre el mel&amp;oacute;n es una fruta pero para una mujer tambi&amp;eacute;n es un color, no quiero que ninguna persona se me enfade por este comentario, cada genero tenemos nuestras cosas y en cuanto a los colores las mujeres nos ganan, es lo que hay :D. Por lo tanto &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/que-es-y-como-instalar-agave-en-ubuntu-una-ayuda-con-los-colores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-27T09:19:37Z</dc:date>
  </entry>
  <entry>
    <title>Ya salio Ubuntu 14.10, y ahora que?</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/ya-salio-ubuntu-14-1-y-ahora-que" />
    <category term="ubuntu-14-1" />
    <category term="noticias" />
    <category term="ubuntu" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-23T22:43:47Z</updated>
    <published>2014-10-23T22:43:47Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Si est&amp;aacute;is en el mundillo de Linux y &lt;strong&gt;Ubuntu&lt;/strong&gt; seguramente ya sabr&amp;eacute;is que ha salido &lt;strong&gt;Ubuntu 14.10&lt;/strong&gt;, con el maravillo nombre que les ponen a cada nueva versi&amp;oacute;n ;D (espero que alguno de los chicos de Canonical no se enfade si lee esto) y las preguntas que me hago, o mas bien que algunos usuarios se har&amp;aacute;n es &amp;iquest;y ahora que? &amp;iquest;me cambio? Yo no me planteo nada, personalmente no la voy a instalar en mi ordenador, la probare en una maquina virtual cuanto me encuentre con ganas, que no sera a corto plazo, ya que para mi no tiene importancia este lanzamiento porque no tiene novedades importantes que merezcan la pena, por lo menos para mi.&lt;/p&gt; 
 &lt;p&gt;No voy a enumerar todas las nuevas caracter&amp;iacute;sticas que tiene &lt;strong&gt;Ubuntu 14.10&lt;/strong&gt;, las podr&amp;eacute;is encontrar en otros blogs y en la &lt;a href="http://www.ubuntu.com/"&gt;pagina oficial de Ubuntu&lt;/a&gt;&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/ya-salio-ubuntu-14-1-y-ahora-que"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-23T22:43:47Z</dc:date>
  </entry>
  <entry>
    <title>Cómo instalar Spotify en Debian y Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/como-instalar-spotify-en-debian-y-ubuntu" />
    <category term="squeeze" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="ubuntu" />
    <category term="musica" />
    <category term="kubuntu" />
    <category term="wheezy" />
    <category term="spotify" />
    <category term="debian" />
    <author>
      <name>socrates</name>
    </author>
    <updated>2014-10-23T20:28:05Z</updated>
    <published>2014-10-23T20:28:05Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/spotify-kubuntu.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/spotify-kubuntu-1024x575.jpg" alt="spotify-kubuntu" width="720" height="404" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Spotify&lt;/strong&gt; es quiz&amp;aacute;s la aplicaci&amp;oacute;n para escuchar m&amp;uacute;sica v&amp;iacute;a &lt;strong&gt;streaming&lt;/strong&gt; m&amp;aacute;s popular del planeta, actualmente. Hasta hace no mucho s&amp;oacute;lo pod&amp;iacute;amos disfrutar de &amp;eacute;l en &lt;strong&gt;GNU/Linux&lt;/strong&gt; si ten&amp;iacute;amos cuenta premium. Por suerte eso ha cambiado.&lt;/p&gt; 
&lt;p&gt;De momento de manera oficial &lt;strong&gt;Spotify&lt;/strong&gt; suministra una manera de instalaci&amp;oacute;n para las distribuciones &lt;strong&gt;Debian&lt;/strong&gt;, de hecho para la versi&amp;oacute;n 6, que es la llamada &lt;strong&gt;Squeeze&lt;/strong&gt;, pero tambi&amp;eacute;n es compatible con &lt;strong&gt;Wheez&lt;/strong&gt;y, e incluso con &lt;strong&gt;Ubuntu&lt;/strong&gt;. (Existe una instalaci&amp;oacute;n usando &lt;a title="Spotify Wine" href="https://support.spotify.com/es/learn-more/faq/?_ga=1.158386296.314506571.1411854936"&gt;&lt;strong&gt;Wine&lt;/strong&gt;&lt;/a&gt;)&lt;/p&gt; 
&lt;p&gt;La instalaci&amp;oacute;n es bastante sencilla y no tiene excesiva complicaci&amp;oacute;n.&lt;/p&gt; 
&lt;p&gt;Voy a realizar en el&lt;strong&gt; Kubuntu 14&lt;/strong&gt; que tengo en mi laptop o port&amp;aacute;til &lt;strong&gt;HP Envy&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;Debemos editar el archivo de repositorios ubicado en /etc/apt/sources.list, y a&amp;ntilde;adir:&lt;/p&gt; 
&lt;pre&gt;# editando /etc/apt/sources.list 
deb http://repository.spotify.com stable non-free&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/como-instalar-spotify-en-debian-y-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>socrates</dc:creator>
    <dc:date>2014-10-23T20:28:05Z</dc:date>
  </entry>
</feed>

