<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-09-14T22:02:53Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-09-14T22:02:53Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Que es y como instalar Sublime Text 3 en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/que-es-y-como-instalar-sublime-text-3-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="sublime-text" />
    <category term="sublime-text-3" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-14T21:56:04Z</updated>
    <published>2014-09-14T21:56:04Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Un buen editor de c&amp;oacute;digo es algo fundamental y para Linux tenemos muchos, en este articulo os voy a hablar un poco de uno que llevo usando alrededor de un a&amp;ntilde;o y que me ha gustado bastante llamado &lt;strong&gt;Sublime Text&lt;/strong&gt;, concretamente su versi&amp;oacute;n numero 3. Tambi&amp;eacute;n os voy a mostrar como lo pod&amp;eacute;is &lt;strong&gt;instalar&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente para que as&amp;iacute; lo pod&amp;aacute;is tener correctamente actualizado.&lt;/p&gt; 
 &lt;p&gt;Una de las cosas que mas me gusta de &lt;strong&gt;Sublime Text 3&lt;/strong&gt; es que es de los llamado editores “sin distracciones”, es decir, que podemos usarlo de tal forma que en la pantalla del ordenador solamente veamos el editor. Tiene dos caracter&amp;iacute;sticas que a mi me gustan mucho. La primera de ellas es que en la parte derecha del documento podemos ver un “esquema” del texto completo y la parte en la que estamos, ademas nos permite navegar por el documento pinchando en la zona a la que queramos ir en cada momento. Ese esquema lo podemos ver en la siguiente imagen en la parte derecha:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/que-es-y-como-instalar-sublime-text-3-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-14T21:56:04Z</dc:date>
  </entry>
  <entry>
    <title>Pack de temas Ambiance &amp; Radiance colors para Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/pack-de-temas-ambiance-radiance-colors-para-ubuntu" />
    <category term="ubuntu" />
    <category term="temas" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-11T22:09:37Z</updated>
    <published>2014-09-11T22:09:37Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Siguiendo el hilo de la entrada anterior que escrib&amp;iacute; ayer en la cual dec&amp;iacute;a que no hab&amp;iacute;a tratado lo suficiente el tema de la personalizaci&amp;oacute;n de &lt;strong&gt;Ubuntu&lt;/strong&gt; he decidido cambiar de tercio y para ello os voy a hablar un de un paquete de &lt;strong&gt;temas&lt;/strong&gt; muy completo, con muchas opciones y colores que puede servir para todos los entornos de escritorio mas habituales excepto para KDE. El pack de temas se llama Ambiance &amp;amp; Radiance Colors, como su propio nombre indica con combinaciones de colores para dos de los &lt;strong&gt;temas&lt;/strong&gt; que vienen instalados por defecto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, Ambiance y Radiance.&lt;/p&gt; 
 &lt;p&gt;Hacia tiempo que venia usando otro tema que me gusta bastante pero que tenia alg&amp;uacute;n fallo y navegando por Internet me tope con este conjunto de temas, los instale y me han gustado mucho, sobre todo por su sencillez y tambi&amp;eacute;n porque tiene muchos colores diferentes, de modo que sera dif&amp;iacute;cil que no encuentres alguno que te guste.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/pack-de-temas-ambiance-radiance-colors-para-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-11T22:09:37Z</dc:date>
  </entry>
  <entry>
    <title>Iconos Potenza, pack muy completo y vistoso</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/iconos-potenza-pack-muy-completo-y-vistoso" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="potenza" />
    <category term="iconos" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-10T22:57:35Z</updated>
    <published>2014-09-10T22:57:35Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Recientemente me he dado cuenta de que apenas he escrito art&amp;iacute;culos sobre como podemos darle un poco de personalizaci&amp;oacute;n a nuestro &lt;strong&gt;Ubuntu&lt;/strong&gt; salvo por los art&amp;iacute;culos de los fondos de escritorio y he decidido cambiar eso. Para ello os voy a mostrar un paquete de &lt;strong&gt;iconos&lt;/strong&gt; que esta muy bien y que a mi me gusta mucho, los iconos &lt;strong&gt;Potenza&lt;/strong&gt;. Ademas acaban de sacar una nueva versi&amp;oacute;n y os voy a mostrar algunas im&amp;aacute;genes de este completo pack de iconos y como instalarlos mediante PPA en Ubuntu.&lt;/p&gt; 
 &lt;p&gt;Los &lt;strong&gt;iconos Potenza&lt;/strong&gt; destacan por su dise&amp;ntilde;o, es sencillo y bonito y tienen las esquinas redondeadas como pod&amp;eacute;is ver en la siguiente imagen:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/09/potenza-1.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/09/potenza-1.jpg" alt="potenza-1" width="600" height="425" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Como he dicho anteriormente es un pack muy completo en el que seguro estar&amp;aacute;n todos los iconos que pod&amp;aacute;is necesitar. En la imagen pod&amp;eacute;is ver que su dise&amp;ntilde;o es sencillo pero elegante y le dar&amp;aacute;n un toque muy bueno a vuestro escritorio. La mayor&amp;iacute;a de los &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/iconos-potenza-pack-muy-completo-y-vistoso"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-10T22:57:35Z</dc:date>
  </entry>
  <entry>
    <title>Descargar vídeos de Vimeo o Youtube con Movgrab</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/descargar-videos-de-vimeo-o-youtube-con-movgrab" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="comunidad-open-source" />
    <category term="gcc" />
    <category term="make" />
    <category term="comandos" />
    <category term="movgrab" />
    <category term="mplayer" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-09-04T18:32:20Z</updated>
    <published>2014-09-04T18:32:20Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/big-buck-bunny-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/big-buck-bunny-150.jpg" alt="big-buck-bunny-150" width="150" height="166" /&gt;&lt;/a&gt;La verdad es que hace tiempo que pensaba escribir un art&amp;iacute;culo sobre el programa &lt;strong&gt;youtube-dl&lt;/strong&gt;, un software genial para la descarga de v&amp;iacute;deos de youtube. Pero viendo, gratamente, que muchas otras webs dedicadas al software libre ya han hablado de &amp;eacute;l, voy a dedicar la entrada a otro fant&amp;aacute;stico programa para la descarga, no s&amp;oacute;lo de v&amp;iacute;deos de &lt;strong&gt;Youtube&lt;/strong&gt;, sino tambi&amp;eacute;n de &lt;strong&gt;Vimeo&lt;/strong&gt;. Ese programa se llama &lt;strong&gt;Movgrab&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Con &lt;strong&gt;Movgrab&lt;/strong&gt; podemos descargar los v&amp;iacute;deos completamente y guardarlos en un fichero en nuestro disco duro. Soporta m&amp;uacute;ltiples formatos y se puede configurar para pasar a trav&amp;eacute;s de un proxy.&lt;/p&gt; 
&lt;p&gt;A diferencia de otros programas, &lt;strong&gt;Movgrab&lt;/strong&gt; no viene en los repositorios de las distribuciones, por lo tanto lo tenemos que descargar desde la web del proyecto y compilar las fuentes. (Excepto en &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/descargar-videos-de-vimeo-o-youtube-con-movgrab"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-09-04T18:32:20Z</dc:date>
  </entry>
  <entry>
    <title>Como desactivar el mensaje de error interno en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-desactivar-el-mensaje-de-error-interno-en-ubuntu" />
    <category term="ubuntu" />
    <category term="interno" />
    <category term="error" />
    <category term="mensaje" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-04T14:58:08Z</updated>
    <published>2014-09-04T14:58:08Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de Apport y del &lt;strong&gt;mensaje de error interno&lt;/strong&gt; que a veces puede aparecer en &lt;strong&gt;Ubuntu&lt;/strong&gt;, a mi me ha pasado en Ubuntu 12.04 y 14.04 y lo que os voy a explicar en este articulo vale para ambas versiones.&lt;/p&gt; 
 &lt;p&gt;Antes que nada os dejo una imagen en la cual podemos ver la ventana de la que estoy hablando y que puede que en alguna ocasi&amp;oacute;n hay&amp;aacute;is visto en vuestro &lt;strong&gt;Ubuntu&lt;/strong&gt;:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/09/error-interno-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/09/error-interno-ubuntu.jpg" alt="error-interno-ubuntu" width="581" height="163" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;En este caso he puesto una captura de Ubuntu 12.04, la de 14.04 es igual salvo que cambia el numero de versi&amp;oacute;n. Esta ventana nos la pone en pantalla un programa llamado Apport, este programa se encarga de, cuando haya un fallo en el sistema, recolectar informaci&amp;oacute;n acerca de ese &lt;strong&gt;error&lt;/strong&gt; para poder mandarla a los desarrolladores de forma autom&amp;aacute;tica y que as&amp;iacute; puedan solucionarlo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-desactivar-el-mensaje-de-error-interno-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-04T14:58:08Z</dc:date>
  </entry>
  <entry>
    <title>Mi nuevo conky</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/mi-nuevo-conky" />
    <category term="ubuntu" />
    <category term="conky" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-04T07:02:54Z</updated>
    <published>2014-09-04T07:02:54Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace aproximadamente unos 3 meses que compre un port&amp;aacute;til de segunda mando en Ebay y, desde entonces, no usaba el &lt;strong&gt;conky&lt;/strong&gt; ya que al poner el que usaba antes en este ordenador no funcionaba todo correctamente. Habia varias cosas que no estaban bien ya que cada ordenador requiere un conky personalizado. Lo que no estaba bien era lo siguiente:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;El port&amp;aacute;til anterior era un Core 2 Duo, era un procesador de doble n&amp;uacute;cleo y el nuevo es un i5, que tiene 2 procesadores con doble n&amp;uacute;cleo.&lt;/li&gt; 
  &lt;li&gt;El anterior conky no mostraba la temperatura de los procesadores en este port&amp;aacute;til&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Estas dos cosas no funcionaban y hab&amp;iacute;a otras que quer&amp;iacute;a cambiar:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;Quer&amp;iacute;a a&amp;ntilde;adirle algunas im&amp;aacute;genes&lt;/li&gt; 
  &lt;li&gt;Cambiar las fuentes&lt;/li&gt; 
  &lt;li&gt;A&amp;ntilde;adirle la hora y la fecha&lt;/li&gt; 
  &lt;li&gt;No quer&amp;iacute;a mostrar los procesos&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Entonces me cog&amp;iacute; el &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/mi-nuevo-conky"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-04T07:02:54Z</dc:date>
  </entry>
  <entry>
    <title>Linux AIO, la evolucion de Ubuntu AIO</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/linux-aio-la-evolucion-de-ubuntu-aio" />
    <category term="ubuntu-aio" />
    <category term="ubuntu" />
    <category term="linux-aio" />
    <category term="aio" />
    <category term="linux" />
    <category term="noticias" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-03T18:45:38Z</updated>
    <published>2014-09-03T18:45:38Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hoy os quiero hablar de un proyecto que conozco desde hace unos meses y que esta teniendo una evoluci&amp;oacute;n genial ya que empez&amp;oacute; dedicado a &lt;strong&gt;Ubuntu&lt;/strong&gt; y ha ido creciendo y ampli&amp;aacute;ndose hasta abarcar otras distribuciones &lt;strong&gt;Linux&lt;/strong&gt;, dicho proyecto se llamaba inicialmente &lt;strong&gt;Ubuntu AIO&lt;/strong&gt; pero han cambiado el nombre y ahora se llama &lt;strong&gt;Linux AIO&lt;/strong&gt;. Os dejo el enlace al articulo en el cual os hablaba de ellos en otra ocasion:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/ubuntu-14-04-aio-los-principales-sabores-en-una-sola-iso/"&gt;Ubuntu AIO, los principales sabores de Ubuntu en una sola ISO&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Hace un par de semanas recib&amp;iacute; un mensaje de uno de los integrantes del proyecto inform&amp;aacute;ndome de los cambios que han hecho, visite su pagina y tengo te reconocer la labor que est&amp;aacute;n haciendo, un trabajo genial. La idea en si es sencilla, pero como todo en esta vida hay que tener la idea. Han reunido en una sola ISO los principales miembros de la familia &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/linux-aio-la-evolucion-de-ubuntu-aio"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-03T18:45:38Z</dc:date>
  </entry>
  <entry>
    <title>Como poner en español el corrector ortografico de Libreoffice en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-poner-en-espanol-el-corrector-ortografico-de-libreoffice-en-ubuntu" />
    <category term="ortografico" />
    <category term="ubuntu" />
    <category term="espanol" />
    <category term="libreoffice" />
    <category term="tips" />
    <category term="corrector" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-03T14:57:42Z</updated>
    <published>2014-09-03T14:57:42Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Recientemente un usuario llamado Nestor que visito este blog buscando como poner el &lt;strong&gt;Libreoffice&lt;/strong&gt; en espa&amp;ntilde;ol se encontr&amp;oacute; con un problema, el &lt;strong&gt;corrector&amp;nbsp;&lt;/strong&gt;&lt;b&gt;ortogr&amp;aacute;fico&lt;/b&gt;&amp;nbsp;de Libreoffice solo le funcionaba en dos idiomas, ingles y franc&amp;eacute;s y me pregunto como a&amp;ntilde;adir el corrector ortogr&amp;aacute;fico en espa&amp;ntilde;ol. La verdad es que yo nunca hab&amp;iacute;a tenido dicho problema y como no sabia como hacerlo me puse a buscar la soluci&amp;oacute;n, la cual es muy sencilla y eso es lo que os voy a mostrar en este articulo.&lt;/p&gt; 
 &lt;p&gt;Primero me gustar&amp;iacute;a aclarar que hay varias formas de hacerlo pero yo voy a explicar y mostrar la que me parece mas sencilla y r&amp;aacute;pida. Para poner el &lt;strong&gt;corrector&amp;nbsp;&lt;/strong&gt;&lt;b&gt;ortogr&amp;aacute;fico&lt;/b&gt;&amp;nbsp;en &lt;strong&gt;espa&amp;ntilde;ol&lt;/strong&gt; del Libreoffice en &lt;strong&gt;Ubuntu&lt;/strong&gt; solo ten&amp;eacute;is que abrir una Terminal y escribir el siguiente comando:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/como-poner-en-espanol-el-corrector-ortografico-de-libreoffice-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-03T14:57:42Z</dc:date>
  </entry>
  <entry>
    <title>Como solucionar el problema del header no encontrado en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-solucionar-el-problema-del-header-no-encontrado-en-ubuntu" />
    <category term="actualizar" />
    <category term="ubuntu" />
    <category term="problema" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-22T15:46:05Z</updated>
    <published>2014-08-22T15:46:05Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Recientemente me encontr&amp;eacute; con un &lt;strong&gt;problema&lt;/strong&gt; al hacer querer actualizar mi&lt;strong&gt; Ubuntu 14.04&lt;/strong&gt; desde la Terminal, dicho problema me mostraba lo siguiente en la pantalla:&lt;/p&gt; 
 &lt;pre&gt;&amp;iexcl;Error! E: Encountered a section with no Package: header
E: Problem with MergeList /var/lib/apt/lists/ ...*... 
E: No se pudieron analizar o abrir las listas de paquetes o el archivo de estado lists&lt;/pre&gt; 
 &lt;p&gt;Concretamente yo ve&amp;iacute;a esto en la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt; cuando el comando “sudo apt-get update” terminaba la revisi&amp;oacute;n de los repositorios. Os adjunto una imagen en la que lo pod&amp;eacute;is ver:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/08/fallo-apt.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/08/fallo-apt.jpg" alt="fallo-apt" width="636" height="105" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Tambi&amp;eacute;n me aparec&amp;iacute;a un indicador en la zona de indicadores de mi Cairo que me indicaba el problema. Al ejecutar nuevamente el comando me volv&amp;iacute;a a salir el error y decid&amp;iacute; buscar informaci&amp;oacute;n en Internet. Por suerte, despu&amp;eacute;s de estar buscando un rato me encontr&amp;eacute; con un articulo en &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-solucionar-el-problema-del-header-no-encontrado-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-22T15:46:05Z</dc:date>
  </entry>
  <entry>
    <title>Como abrir un directorio que tiene espacio en su nombre en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-abrir-un-directorio-que-tiene-espacio-en-su-nombre-en-ubuntu" />
    <category term="blanco" />
    <category term="espacio" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="directorio" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-21T18:24:05Z</updated>
    <published>2014-08-20T17:07:30Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a explicar como podemos acceder a un &lt;strong&gt;directorio&lt;/strong&gt; que en su nombre contiene alg&amp;uacute;n &lt;strong&gt;espacio&lt;/strong&gt; en &lt;strong&gt;blanco&lt;/strong&gt; desde la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt;. Antes que nada me gustar&amp;iacute;a dar un consejo a todos aquellos usuarios que no est&amp;aacute;n acostumbrados a usar la Terminal de Linux, es muy recomendable no usar &lt;strong&gt;espacios&lt;/strong&gt; en &lt;strong&gt;blanco&lt;/strong&gt; en los nombre de los archivos o directorios para evitar problemas, yo suelo substituir los espacios en blanco por guiones bajos o simplemente guiones.&lt;/p&gt; 
 &lt;p&gt;Dicho esto vamos a abrir la Terminal de &lt;strong&gt;Ubuntu&lt;/strong&gt; y supongamos que en nuestra carpeta personal tenemos un directorio que se llama “mis cosas”, como pod&amp;eacute;is ver entre la palabra “mis” y la palabra “cosas” hay un &lt;strong&gt;espacio&lt;/strong&gt;. Lo &amp;uacute;nico que tenemos que hacer para poder entrar en dicho &lt;strong&gt;directorio&lt;/strong&gt;&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-abrir-un-directorio-que-tiene-espacio-en-su-nombre-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-20T17:07:30Z</dc:date>
  </entry>
  <entry>
    <title>Como activar reiniciar las X en Ubuntu 14.04</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-activar-reiniciar-las-x-en-ubuntu-14-4" />
    <category term="ubuntu" />
    <category term="ubuntu-14-4" />
    <category term="activar" />
    <category term="activar-las-x" />
    <category term="reiniciar" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-13T18:54:54Z</updated>
    <published>2014-08-13T18:52:48Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a mostrar como &lt;strong&gt;activar&lt;/strong&gt; la secuencia de teclas “CTRL” + “ALT” + “RETROCESO” con la cual podemos &lt;strong&gt;reiniciar&lt;/strong&gt; &lt;strong&gt;las X&lt;/strong&gt; en &lt;strong&gt;Ubuntu 14.04&lt;/strong&gt; en el caso de que el servidor gr&amp;aacute;fico se quede bloqueado, esto solo me ha pasado un par de veces y creo que fue debido a Cairo Dock, pero esta bien tenerlo activado. Puede que algunos usuarios no sepan de lo que estoy hablando, por lo cual os voy a explicar un poco que es. Puede que en alguna ocasi&amp;oacute;n el entorno gr&amp;aacute;fico se quede “congelado” y no podamos hacer nada, si pulsamos la combinaci&amp;oacute;n de teclas “CTRL” + “ALT” + F1 y accedemos a la Terminal entonces es que el entorno gr&amp;aacute;fico se ha bloqueado. Para volver al entorno gr&amp;aacute;fico tenemos que pulsar “CTRL” + “ALT” + F7 y volveremos a ver nuestro escritorio bloqueado. Para arreglar ese bloqueo podemos activar la secuencia de teclas “CTRL” + ALT” + “RETROCESO” y de esa forma, al pulsar esa combinaci&amp;oacute;n de teclas, se cerrara el entorno gr&amp;aacute;fico y veremos la pantalla de login. Antes de instalar &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-activar-reiniciar-las-x-en-ubuntu-14-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-13T18:52:48Z</dc:date>
  </entry>
  <entry>
    <title>Controla la shell con Terminator</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/controla-la-shell-con-terminator" />
    <category term="debian" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="linux" />
    <category term="centos" />
    <category term="sistemas-operativos" />
    <category term="terminator" />
    <category term="gnometerminal" />
    <category term="comandos" />
    <category term="freebsd" />
    <category term="redhat" />
    <category term="opensuse" />
    <category term="gnu" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-08-11T08:08:28Z</updated>
    <published>2014-08-11T08:08:28Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/gnome-terminator-icon.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/gnome-terminator-icon.png" alt="gnome-terminator-icon" width="128" height="128" /&gt;&lt;/a&gt;Aunque se llame igual que un famoso personaje de ciencia ficci&amp;oacute;n, el software que trataremos hoy nos permitir&amp;aacute; tener m&amp;uacute;ltiples sesiones de shell abiertas a la vez, permitiendonos configurarlas a nuestro gusto. El objetivo del proyecto es producir una herramienta &amp;uacute;til para la organizaci&amp;oacute;n de las terminales.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Terminator se basa en &lt;strong&gt;Gnome Terminal&lt;/strong&gt;, pero con muchas m&amp;aacute;s caracter&amp;iacute;sticas, entre las principales encontramos:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Organizar terminales en la cuadr&amp;iacute;cula&lt;/li&gt; 
 &lt;li&gt;Tabs&lt;/li&gt; 
 &lt;li&gt;Reorganizaci&amp;oacute;n de las terminales, con arrastrar y soltar&lt;/li&gt; 
 &lt;li&gt;Un gran n&amp;uacute;mero de atajos de teclado&lt;/li&gt; 
 &lt;li&gt;Gestionar varios perfiles cada uno con su propia configuraci&amp;oacute;n.&lt;/li&gt; 
 &lt;li&gt;Entre muchos m&amp;aacute;s.&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Su instalaci&amp;oacute;n es bien sencilla:&lt;/p&gt; 
&lt;p&gt;En &lt;strong&gt;Debian&lt;/strong&gt;&lt;/p&gt; 
&lt;pre&gt;apt-get -y install terminator&lt;/pre&gt; 
&lt;p&gt;En &lt;strong&gt;Ubuntu&lt;/strong&gt;&lt;/p&gt; 
&lt;pre&gt;sudo add-apt-repository ppa:gnome-terminator
sudo apt-get update
sudo apt-get install terminator&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/controla-la-shell-con-terminator"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-08-11T08:08:28Z</dc:date>
  </entry>
  <entry>
    <title>Como saber la lista de programas instalados en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-saber-la-lista-de-programas-instalados-en-ubuntu" />
    <category term="ubuntu" />
    <category term="lista" />
    <category term="programas" />
    <category term="instalados" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-10T16:26:20Z</updated>
    <published>2014-08-08T21:08:29Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a mostrar algo que nos puede resultar bastante &amp;uacute;til en algunos momentos, vamos a ver como saber todos los &lt;strong&gt;programas&lt;/strong&gt; que tenemos &lt;strong&gt;instalados&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; en forma de &lt;strong&gt;lista&lt;/strong&gt; y ademas lo vamos a exportar a un archivo para verlo mas detenidamente . Una utilidad que le podemos sacar a este proceso es identificar un programa que queremos desinstalar y no sabemos cual es su nombre, como es el caso de Jonas, un usuario que me dejo un comentario al respecto.&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/08/lista-programas-instalados-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/08/lista-programas-instalados-ubuntu.jpg" alt="lista-programas-instalados-ubuntu" width="600" height="415" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Si queremos saber los &lt;strong&gt;programas&lt;/strong&gt; que tenemos &lt;strong&gt;instalados&lt;/strong&gt; en nuestro &lt;strong&gt;Ubuntu&lt;/strong&gt; tan solo tenemos que abrir una Terminal y escribir el siguiente comando:&lt;/p&gt; 
 &lt;pre&gt;dpkg --get-selections&lt;/pre&gt; 
 &lt;p&gt;En mi caso al escribir este comando en la Terminal me aparece la lista de programas instalados que tengo pero no los muestra todos. Aparecen ordenados por orden alfab&amp;eacute;tico y, como ya he dicho antes, solo aparecen los &amp;uacute;ltimos. Si queremos ver la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/como-saber-la-lista-de-programas-instalados-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-08T21:08:29Z</dc:date>
  </entry>
  <entry>
    <title>Que es la RAM y para que sirve la SWAP en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/08/que-es-la-ram-y-para-que-sirve-la-swap-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="swap" />
    <category term="ram" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-08-06T08:40:09Z</updated>
    <published>2014-08-06T08:40:09Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de dos cosas y voy a intentar explicar ambas de la forma mas sencilla posible para que quede claro que son la &lt;strong&gt;RAM&lt;/strong&gt; y la &lt;strong&gt;SWAP&lt;/strong&gt; y para que sirven en &lt;strong&gt;Ubuntu&lt;/strong&gt;, aunque esto es extensible a todos los sistemas operativos de PC. En el caso de Windows el tema de la SWAP es algo diferente y explicare tambi&amp;eacute;n un poco como funciona.&lt;/p&gt; 
 &lt;p&gt;Lo primero que voy a explicar es que es la &lt;strong&gt;RAM&lt;/strong&gt;, cuando nosotros tenemos un ordenador nuestra informaci&amp;oacute;n, sean programas o archivos personales, es almacenada de dos formas principales, una de ellas es el disco duro y otro la RAM. En el disco duro de nuestro ordenador tenemos &lt;strong&gt;Ubuntu&lt;/strong&gt;, por poner un ejemplo, sus programas y nuestros archivos personales, pero el disco duro es solo un “almac&amp;eacute;n” y para poder usar todo eso necesitamos que este en la memoria RAM de nuestro ordenador, es decir, cuando abrimos un programa como un procesador de textos dicho programa se carga en la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/08/que-es-la-ram-y-para-que-sirve-la-swap-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-08-06T08:40:09Z</dc:date>
  </entry>
  <entry>
    <title>Los editores de texto predeterminados en Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/los-editores-de-texto-predeterminados-en-linux" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="texto" />
    <category term="linux" />
    <category term="editor" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-28T12:39:45Z</updated>
    <published>2014-07-28T12:39:45Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Haces unos d&amp;iacute;as un usuario llamado Zock me dejo un comentario en un articulo en el cual describo como instalar Spotify en Ubuntu diciendo que hab&amp;iacute;a tenido problemas para seguir el articulo debido a que era usuario de Lubuntu y yo hab&amp;iacute;a explicado el proceso desde Ubuntu. En uno de los pasos puse una orden que hab&amp;iacute;a que ejecutar en la Terminal tal que as&amp;iacute;:&lt;/p&gt; 
 &lt;pre&gt;sudo gedit conf&lt;/pre&gt; 
 &lt;p&gt;Esta orden indica que queremos abrir un archivo llamado “conf”, que queremos abrirlo con el programa “gedit” y que queremos hacerlo con privilegios de root. El problema del usuario radicaba en que al querer ejecutar este comando no pod&amp;iacute;a abrirse el programa “gedit” debido a que no lo tenia instalado en Lubuntu y este articulo es para explicar como “arreglar” este problema.&lt;/p&gt; 
 &lt;p&gt;Antes de seguir me gustar&amp;iacute;a pedir disculpas a Zock y a todos aquellos a los que les haya pasado lo mismo, los art&amp;iacute;culos que escribo en este blog van destinados a los usuarios de Ubuntu y no hab&amp;iacute;a tenido en cuenta hasta ahora las diferencias entre Ubuntu y Lubuntu, por poner un ejemplo. Tambi&amp;eacute;n es cierto que es dif&amp;iacute;cil en ocasiones tener en cuenta todos los factores a la hora de escribir un articulo, pero gracias a este usuario me he dado cuenta del error y quiero subsanarlo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/los-editores-de-texto-predeterminados-en-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-28T12:39:45Z</dc:date>
  </entry>
  <entry>
    <title>Edubuntu acaba de lanzar su versión LTS 14.04.1</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/edubuntu-acaba-de-lanzar-su-version-lts-14-4-1" />
    <category term="blog-stack" />
    <category term="ubuntu" />
    <category term="linux" />
    <category term="sistemas-operativos" />
    <category term="noticias" />
    <category term="lts" />
    <category term="edubuntu" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-07-25T10:06:19Z</updated>
    <published>2014-07-25T09:59:05Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/edubuntu_logo1.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/edubuntu_logo1.jpg" alt="edubuntu_logo1" width="150" height="150" /&gt;&lt;/a&gt;La derivaci&amp;oacute;n oficial de &lt;strong&gt;Ubuntu&lt;/strong&gt;, enfocada a la educaci&amp;oacute;n, ha lanzado a d&amp;iacute;a de hoy su &amp;uacute;ltima versi&amp;oacute;n, la &lt;strong&gt;14.04.1&lt;/strong&gt;,&amp;nbsp; que &amp;eacute;sta vez ser&amp;aacute; &lt;strong&gt;LTS (Long Term Support)&lt;/strong&gt; Entre las novedades encontramos la correcci&amp;oacute;n de errores y mejoras, entre ellos el soporte mejorado del hardware.&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Edubuntu&lt;/strong&gt; est&amp;aacute; creado para los entornos educativos donde el docente o profesor no tenga conocimientos altos t&amp;eacute;cnicos y puedan disfrutar los alumnos de un abanico amplio de aplicaciones educativas.&amp;nbsp; C&amp;oacute;mo ya se deduce de su nombre est&amp;aacute; basada en Ubuntu, la &amp;uacute;ltima versi&amp;oacute;n se basa en&amp;nbsp; &lt;strong&gt;Ubuntu 13.04&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Detr&amp;aacute;s del proyecto, seg&amp;uacute;n indican en su web, tenemos a una amplia comunidad de “&lt;strong&gt;&lt;em&gt;estudiantes, maestros, padres de familia y hackers, &lt;/em&gt;&lt;em&gt;que creen que el aprendizaje y el conocimiento debe estar disponible para todos los que quieren mejorarse a s&amp;iacute; mismos y el mundo &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/edubuntu-acaba-de-lanzar-su-version-lts-14-4-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-07-25T09:59:05Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar Grive en Ubuntu y trabajar con Google Drive</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-instalar-grive-en-ubuntu-y-trabajar-con-google-drive" />
    <category term="ubuntu" />
    <category term="grive" />
    <category term="google-drive" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-24T15:54:49Z</updated>
    <published>2014-07-24T15:54:49Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar sobre un programa llamado &lt;strong&gt;Grive&lt;/strong&gt; para &lt;strong&gt;Ubuntu&lt;/strong&gt;, que nos va a hacer mas f&amp;aacute;cil usar &lt;strong&gt;Google Drive&lt;/strong&gt;. Para aquellos que aun no conozcan Google Drive os voy a explicar que es. Cuando creamos una cuenta de Gmail de Google tenemos acceso a una serie de herramientas o tecnolog&amp;iacute;as que pone a nuestro servicio de forma gratuita y una de ellas es Google Drive, que es un disco duro virtual en la nube con 15 GB de espacio para lo que nosotros queramos usar. Tenemos la posibilidad de tener mas espacio pero tendr&amp;iacute;amos que pagar.&lt;/p&gt; 
 &lt;p&gt;Cada vez que queremos subir archivos a Google Drive tenemos que abrirlo en el navegador, eso esta muy bien pero estar&amp;iacute;a aun mejor tener un directorio en nuestro ordenador de tal forma que cada vez que pongamos un archivo en dicho directorio se suba autom&amp;aacute;ticamente a nuestra unidad de Google Drive o, si borramos un archivo de ese directorio tambi&amp;eacute;n se borre de Google Drive, es decir, que un directorio de nuestro ordenador este sincronizado con nuestra unidad de Google Drive, &amp;iquest;verdad? Exactamente eso es lo que vamos a conseguir con &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-instalar-grive-en-ubuntu-y-trabajar-con-google-drive"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-24T15:54:49Z</dc:date>
  </entry>
  <entry>
    <title>Como añadir una emisora a Great Little Radio Player en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-anadir-una-emisora-a-great-little-radio-player-en-ubuntu" />
    <category term="ubuntu" />
    <category term="anadir" />
    <category term="radio" />
    <category term="emisora" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-22T18:54:20Z</updated>
    <published>2014-07-22T18:54:20Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En el &lt;a href="http://elblogdeliher.com/como-escuchar-la-radio-en-ubuntu/"&gt;anterior articulo&lt;/a&gt; os hable de un programa que esta muy bien llamado &lt;strong&gt;Great Little Radio Player&lt;/strong&gt;, dicho programa sirve para poder escuchar distintas &lt;strong&gt;emisoras&lt;/strong&gt; de radio mientras estamos usando &lt;strong&gt;Ubuntu&lt;/strong&gt;. Por defecto vienen muchas emisoras preconfiguradas, pero puede que queramos &lt;strong&gt;a&amp;ntilde;adir&lt;/strong&gt; alguna y eso es precisamente lo que os quiero mostrar en este articulo.&lt;/p&gt; 
 &lt;p&gt;En mi caso para mostraros el proceso he elegido una emisora que ha creado el archiconocido &lt;a href="http://yoyo308.com/"&gt;Yoyo&lt;/a&gt;, y que pod&amp;eacute;is encontrar en la siguiente pagina:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://killallradio.blogspot.com.es/"&gt;Pagina de Killall Radio de Yoyo&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Esta reci&amp;eacute;n creada pero como todo lo que hace Yoyo seguro que nos brindara horas de entretenimiento, aprendizaje, buen rollo y buen humor. En este caso, lo que tenemos que buscar para a&amp;ntilde;adir a GLRP (a partir de ahora me referir&amp;eacute; as&amp;iacute; al programa, es que soy muy vago ;D), esta muy a la vista, es muy f&amp;aacute;cil de encontrar, en otras webs puede que nos cueste mas. Al acceder a la web de Killall Radio ver&amp;eacute;is lo siguiente:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-anadir-una-emisora-a-great-little-radio-player-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-22T18:54:20Z</dc:date>
  </entry>
  <entry>
    <title>Como escuchar la radio en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-escuchar-la-radio-en-ubuntu" />
    <category term="ubuntu" />
    <category term="radio" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-21T18:04:25Z</updated>
    <published>2014-07-21T18:04:25Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En este articulo os voy a hablar de una peque&amp;ntilde;a pero genial aplicaci&amp;oacute;n que servir&amp;aacute; para que pod&amp;aacute;is escuchar la &lt;strong&gt;radio&lt;/strong&gt; en vuestro ordenador de una forma muy sencilla mientras us&amp;aacute;is &lt;strong&gt;Ubuntu&lt;/strong&gt;. El programa en cuesti&amp;oacute;n se llama &lt;strong&gt;Great Little Radio Player&lt;/strong&gt;, os voy a hablar un poco de sus bondades y mas abajo os dejare un enlace a su pagina en la cual pod&amp;eacute;is descargar el archivo instalador para vuestro Ubuntu, aunque tambi&amp;eacute;n hay disponibles versiones para otras distribuciones de Linux. Yo lo he usado en Ubuntu 12.04 y 14.04 y funciona perfecto, ademas su manejo es muy sencillo.&lt;/p&gt; 
 &lt;p&gt;El programa en si pesa unas 8 MB, una vez descargado lo podr&amp;eacute;is instalar solo con hacer doble click sobre el archivo con extensi&amp;oacute;n “deb” que os descargu&amp;eacute;is. Una vez que lo teng&amp;aacute;is instalado solo ten&amp;eacute;is que buscar el icono se&amp;ntilde;alado en la siguiente imagen dentro del Dash de Ubuntu:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-escuchar-la-radio-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-21T18:04:25Z</dc:date>
  </entry>
  <entry>
    <title>Linux y GNU están de moda</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/linux-y-gnu-estan-de-moda" />
    <category term="mundo-geek" />
    <category term="blog-stack" />
    <category term="debian" />
    <category term="ubuntu" />
    <category term="linuxmint" />
    <category term="fsf" />
    <category term="canonical" />
    <category term="manjaro" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-07-21T05:07:27Z</updated>
    <published>2014-07-21T03:01:25Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/run-gcc-fsf-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/run-gcc-fsf-150.jpg" alt="run-gcc-fsf-150" width="150" height="149" /&gt;&lt;/a&gt;Ahora que en el hemisferio norte estamos en pleno verano, es una oportunidad fant&amp;aacute;stica para ayudar a nuestra distribuci&amp;oacute;n favorita a financiarse y de paso lucir un incre&amp;iacute;ble &lt;strong&gt;&lt;em&gt;look geek&lt;/em&gt; &lt;/strong&gt;en el paseo mar&amp;iacute;timo de nuestra ciudad costera favorita, en el camping de todos los a&amp;ntilde;os o en nuestra ciudad, ya que nos toca trabajar o porque no tenemos ni un chavo o guita o dinero para irnos fuera.&lt;/p&gt; 
&lt;p&gt;Pr&amp;aacute;cticamente todas las distribuciones tienen su propia tienda o apartado en la web donde nos podemos hacer con su &lt;strong&gt;&lt;em&gt;merchandising&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;Aqu&amp;iacute; os dejo unas cuantas:&lt;/p&gt; 
&lt;p&gt;Empecemos con la tienda del proyecto comunitario &lt;strong&gt;opensuse&lt;/strong&gt;, que pod&amp;eacute;is ver&amp;nbsp;&lt;a title="Tienda OpenSuse" href="http://shop.opensuse.org/"&gt;aqu&amp;iacute;&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;Os dejo una captura de su aspecto actual:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/opensuse-shop.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/07/opensuse-shop.jpg" alt="opensuse-shop" width="521" height="614" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Debian&lt;/strong&gt; no tiene una tienda ya que es una fundaci&amp;oacute;n sin &amp;aacute;nimo de lucro. Pero en su web podemos encontrar una lista de tiendas &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/07/linux-y-gnu-estan-de-moda"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-07-21T03:01:25Z</dc:date>
  </entry>
  <entry>
    <title>Como configurar el prompt de la Terminal de Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-configurar-el-prompt-de-la-terminal-de-ubuntu" />
    <category term="prompt" />
    <category term="ubuntu" />
    <category term="terminal" />
    <category term="configurar" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-15T08:27:14Z</updated>
    <published>2014-07-13T08:37:56Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;La idea de escribir este articulo surgi&amp;oacute; a ra&amp;iacute;z de leer uno en el blog de Diego Macias en el cual mostraba como personalizar el &lt;strong&gt;prompt&lt;/strong&gt; de la &lt;strong&gt;Terminal&lt;/strong&gt;. Dicho articulo esta muy bien pero va enfocado a los usuarios de Arch y yo he decidido hacer uno enfocado a los usuarios de &lt;strong&gt;Ubuntu&lt;/strong&gt;. Podeis acceder al articulo de Diego pinchando en el siguiente enlace:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&amp;nbsp;&lt;a href="http://www.dmaciasblog.com/personalizando-el-prompt-de-nuestra-terminal/"&gt;Enlace al articulo sobre el prompt de Diego Macias.&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Siempre me he conformado con el prompt que venia por defecto, pero Diego me ha picado y he querido personalizarlo un poco, nunca lo habia hecho y me ha gustado el resultado final que me parece mas &amp;uacute;til que est&amp;eacute;ticamente bonito, los colores elegidos son los de mi equipo de futbol, el F.C. Barcelona. Vamos a ver como personalizar el prompt de Ubuntu e intentare explicarlo de la mejor manera posible y con ejemplos. Con &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/como-configurar-el-prompt-de-la-terminal-de-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-13T08:37:56Z</dc:date>
  </entry>
  <entry>
    <title>Unos prompt de ejemplo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/unos-prompt-de-ejemplo" />
    <category term="prompt" />
    <category term="ubuntu" />
    <category term="tips" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-15T08:26:00Z</updated>
    <published>2014-07-15T08:26:00Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Tenia que haber puesto esto en el articulo anterior en el cual mostraba como configurar el &lt;strong&gt;prompt&lt;/strong&gt; de la Terminal de Ubuntu, pero la verdad es que el articulo ya me hab&amp;iacute;a quedado un poco largo y decid&amp;iacute; que era mejor hacer otro post para ponerlos. Si no lo hab&amp;eacute;is le&amp;iacute;do aqu&amp;iacute; os dejo el enlace:&lt;/p&gt; 
 &lt;ul&gt; 
  &lt;li&gt;&lt;a href="http://elblogdeliher.com/como-configurar-el-prompt-de-la-terminal-de-ubuntu/"&gt;Como configurar el prompt de la Terminal de Ubuntu&lt;/a&gt;&lt;/li&gt; 
 &lt;/ul&gt; 
 &lt;p&gt;Aqu&amp;iacute; hay varios &lt;strong&gt;prompt&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;de ejemplo&amp;nbsp;&lt;/strong&gt;que he visto en Internet, de ellos me he ayudado para aprender a hacerlo y cogiendo un poco de uno y otro he ido configurando el mio y aprendiendo a modificarlo. Os voy a poner el c&amp;oacute;digo y despu&amp;eacute;s la imagen de como queda, as&amp;iacute; si quer&amp;eacute;is usar uno y no quer&amp;eacute;is entreteneros en configurarlo podr&amp;eacute;is disponer de ellos f&amp;aacute;cilmente.&lt;/p&gt; 
 &lt;pre&gt;PS1='\[\033[0;32m\]┌┼─┼─ \[\033[0m\033[0;32m\]\u\[\033[0m\] @ \[\033[0;36m\]\h\[\033[0m\033[0;32m\] ─┤├─ \[\033[0m\]\t \d\[\033[0;32m\] ─┤├─ \[\033[0;31m\]\w\[\033[0;32m\] ─┤ \n\[\033[0;32m\]└┼─\[\033[0m\033[0;32m\]\$\[\033[0m\033[0;32m\]─┤▶\[\033[0m\] '&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/unos-prompt-de-ejemplo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-15T08:26:00Z</dc:date>
  </entry>
  <entry>
    <title>Como instalar Spotify en Ubuntu 14.04</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-instalar-spotify-en-ubuntu-14-4" />
    <category term="ubuntu" />
    <category term="instalar" />
    <category term="spotify" />
    <category term="spotify-ubuntu" />
    <category term="instalar-spotify" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-14T19:00:09Z</updated>
    <published>2014-05-27T14:44:48Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Para todos aquellos que todav&amp;iacute;a no conozcan este programa, el &lt;strong&gt;Spotify&lt;/strong&gt;, os voy a hablar un poco de el y de sus bondades, ademas os voy a mostrar &lt;strong&gt;como instalarlo en Ubuntu 12.04 y Ubuntu 14.04&lt;/strong&gt;, para ambas versiones el proceso es el mismo. Yo lo conoci hace ya un tiempo y, aunque me gusta mucho, no lo uso habitualmente porque, seg&amp;uacute;n lo que este haciendo, la m&amp;uacute;sica no me deja concentrarme.&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/05/spotify-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/05/spotify-ubuntu.jpg" alt="spotify-ubuntu" width="400" height="400" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="https://www.spotify.com/es/"&gt;&lt;strong&gt;Spotify&lt;/strong&gt;&lt;/a&gt; es un programa multiplataforma, esto quiere decir que lo podemos usar en Windows, Linux y MAC, que sirve b&amp;aacute;sicamente para escuchar m&amp;uacute;sica a trav&amp;eacute;s de Internet. La cantidad de canciones es interminable, hay de todo y mucho. Podemos escuchar canciones sueltas, o discos enteros. Ademas tienes la opci&amp;oacute;n de estar al d&amp;iacute;a escuchando las novedades en las distintas emisoras disponibles. Siempre que tengas conexi&amp;oacute;n a Internet podr&amp;aacute;s escuchar cualquier disco o canci&amp;oacute;n, sea del artista que sea.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/05/como-instalar-spotify-en-ubuntu-14-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-05-27T14:44:48Z</dc:date>
  </entry>
  <entry>
    <title>Que es y como instalar Wine mediante PPA en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-y-como-instalar-wine-mediante-ppa-en-ubuntu" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <category term="wine" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-10T16:36:51Z</updated>
    <published>2014-07-10T16:36:51Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;En esta ocasi&amp;oacute;n os voy a hablar de una aplicaci&amp;oacute;n que podemos &lt;strong&gt;instalar&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y que puede ser de mucha utilidad para aquellos usuarios que provienen de Windows y todav&amp;iacute;a necesiten usar algunas aplicaciones de ese sistema operativo. El programa en cuesti&amp;oacute;n se llama &lt;strong&gt;Wine&lt;/strong&gt;, os voy a hablar un poco de el y despu&amp;eacute;s os mostrare como instalar su ultima versi&amp;oacute;n disponible mediante &lt;strong&gt;PPA&lt;/strong&gt; en Ubuntu, tengo que decir que este PPA sirve para todas las versiones de Ubuntu, incluso ya funciona para Ubuntu 14.10.&lt;/p&gt; 
 &lt;p&gt;Si queremos usar alguna aplicaci&amp;oacute;n de Windows en Ubuntu tenemos algunas opciones, hay algunos programas que tienen su versi&amp;oacute;n oficial para Windows y Linux, pero otros no. Cuando nos encontramos en la situaci&amp;oacute;n en que no tenemos una versi&amp;oacute;n oficial del programa deseado de Windows para &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-y-como-instalar-wine-mediante-ppa-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-10T16:36:51Z</dc:date>
  </entry>
  <entry>
    <title>Que es I-Nex y como instalar en Ubuntu mediante PPA</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-i-nex-y-como-instalar-en-ubuntu-mediante-ppa" />
    <category term="ubuntu" />
    <category term="ppa" />
    <category term="instalar" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-07-07T17:00:16Z</updated>
    <published>2014-07-07T16:02:20Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Este tema ya lo he tratado en otras ocasiones, el de obtener informaci&amp;oacute;n de nuestro PC y de nuestra distribuci&amp;oacute;n, pero el otro d&amp;iacute;a me encontr&amp;eacute; en una pagina con este programa y me pareci&amp;oacute; digno de hacer un articulo. La pagina en cuesti&amp;oacute;n se llama &lt;a href="http://trastetes.blogspot.com.es/"&gt;Trastetes&lt;/a&gt; y pod&amp;eacute;is acceder a ella pinchando en el nombre, recomiendo su lectura, esta muy bien. En este caso hablaba sobre&lt;strong&gt; I-Nex&lt;/strong&gt;, un programa que nos dar&amp;aacute; mucha informaci&amp;oacute;n de nuestro ordenador y de el &lt;strong&gt;Ubuntu&lt;/strong&gt; que tengamos instalado. Os voy a mostrar algunas capturas y al final os dir&amp;eacute; como lo podemos &lt;strong&gt;instalar&lt;/strong&gt; a&amp;ntilde;adiendo el &lt;strong&gt;PPA&lt;/strong&gt; correspondiente. Tengo que decir que es un proyecto activo, incluso han sacado ya la versi&amp;oacute;n del programa correspondiente a Ubuntu 14.10.&lt;/p&gt; 
 &lt;p&gt;El programa en si esta dividido en pesta&amp;ntilde;as y cada una representa una secci&amp;oacute;n en la cual podr&amp;eacute;is ver informaci&amp;oacute;n muy detallada. Os muestro unas capturas que he tomado despu&amp;eacute;s de instalarlo en mi Ubuntu 14.04:&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/07/que-es-i-nex-y-como-instalar-en-ubuntu-mediante-ppa"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-07-07T16:02:20Z</dc:date>
  </entry>
  <entry>
    <title>Abrir como root un archivo en Ubuntu de forma sencilla</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/abrir-como-root-un-archivo-en-ubuntu-de-forma-sencilla" />
    <category term="ubuntu" />
    <category term="abrir" />
    <category term="archivo" />
    <category term="tips" />
    <category term="root" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-30T19:26:47Z</updated>
    <published>2014-06-30T18:47:47Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Seguro que en alguna ocasi&amp;oacute;n hab&amp;eacute;is tenido que &lt;strong&gt;abrir&lt;/strong&gt; una carpeta o ejecutar un &lt;strong&gt;archivo&lt;/strong&gt; &lt;strong&gt;como root&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt; y la verdad es que estar&amp;iacute;a muy bien que este sencillo proceso fuese mas r&amp;aacute;pido de hacer. Eso es precisamente lo que os quiero mostrar en este articulo, vamos a ver como a&amp;ntilde;adir una entrada al men&amp;uacute; que aparece cuando hacemos click con el bot&amp;oacute;n derecho del rat&amp;oacute;n y que dicha entrada sirva para &lt;strong&gt;abrir&lt;/strong&gt; un archivo o directorio como &lt;strong&gt;root&lt;/strong&gt; en &lt;strong&gt;Ubuntu&lt;/strong&gt;.&lt;/p&gt; 
 &lt;p&gt;Yo ya tengo instalado lo necesario para que al pinchar con el bot&amp;oacute;n derecho del rat&amp;oacute;n sobre un archivo o directorio me aparezca la opci&amp;oacute;n de abrirlo como root en el men&amp;uacute;, esto lo pod&amp;eacute;is ver en la siguiente captura:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/06/abrir-como-root.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/06/abrir-como-root.jpg" alt="abrir-como-root" width="663" height="476" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;Como pod&amp;eacute;is ver en la imagen, he pulsado con el bot&amp;oacute;n derecho del rat&amp;oacute;n sobre un directorio llamado “Mis archivos” y en el men&amp;uacute; que aparece tengo una opci&amp;oacute;n llamada “Scripts”, al pasar el rat&amp;oacute;n por encima aparece el men&amp;uacute; de la derecha y la opci&amp;oacute;n que esta resaltada es “Open_as_Administrator”, o lo que es lo mismo,&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/abrir-como-root-un-archivo-en-ubuntu-de-forma-sencilla"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-30T18:47:47Z</dc:date>
  </entry>
  <entry>
    <title>Canonical actualiza el sitio web de Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/canonical-actualiza-el-sitio-web-de-ubuntu" />
    <category term="blog-stack" />
    <category term="china" />
    <category term="ubuntu" />
    <category term="web" />
    <category term="linux" />
    <category term="noticias" />
    <category term="canonical" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-06-25T16:08:48Z</updated>
    <published>2014-06-25T15:45:50Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/ubuntu-linux-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/06/ubuntu-linux-150.jpg" alt="ubuntu-linux-150" width="150" height="120" /&gt;&lt;/a&gt;Canonical ha actualizado la web &lt;a title="Ubuntu.com" href="http://www.ubuntu.com/"&gt;ubuntu.com&lt;/a&gt;, para todas sus versiones, es decir, para sobremesa y dispotivios m&amp;oacute;viles. Se trata de una serie de mejoras sutiles pero significativas, y que dan pistas sobre su futuro.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h1&gt;&lt;strong&gt;Como novedades m&amp;aacute;s significativas:&lt;/strong&gt;&lt;/h1&gt; 
&lt;ul&gt; 
 &lt;li&gt;Han lanzado la versi&amp;oacute;n de su sitio web para China: &lt;a title="Ubuntu China" href="http://www.ubuntu-china.cn/"&gt;ubuntu-china.cn&lt;/a&gt;, ampliando su influencia en dicho pa&amp;iacute;s.&lt;/li&gt; 
 &lt;li&gt;Actualizan el apartado de documentaci&amp;oacute;n legal.&lt;/li&gt; 
 &lt;li&gt;Nueva versi&amp;oacute;n de &lt;a title="Ubuntu Insights" href="https://insights.ubuntu.com/"&gt;Ubuntu Insights&lt;/a&gt;, el portal de noticias del mundo de Ubuntu.&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Entre otras muchas cosas, tambi&amp;eacute;n est&amp;aacute;n &lt;strong&gt;trabajando en mejoras&lt;/strong&gt; que llegar&amp;aacute;n en no mucho espacio de tiempo:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Una nueva web para los &lt;a title="Ubuntu Partners" href="http://www.ubuntu.com/partners"&gt;Ubuntu Partners&lt;/a&gt;.&lt;/li&gt; 
 &lt;li&gt;Una serie sensible de cambios en el c&amp;oacute;digo y dise&amp;ntilde;o de la web, que mejorar&amp;aacute; mucho la experiencia del usuario.&lt;/li&gt; 
 &lt;li&gt;Mejoras en el portal de infraestructura en la nube &lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/06/canonical-actualiza-el-sitio-web-de-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-06-25T15:45:50Z</dc:date>
  </entry>
  <entry>
    <title>Como añadir una carpeta a los marcadores de Nautilus en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-anadir-una-carpeta-a-los-marcadores-de-nautilus-en-ubuntu" />
    <category term="marcadores" />
    <category term="ubuntu" />
    <category term="anadir" />
    <category term="carpeta" />
    <category term="nautilus" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-25T14:33:07Z</updated>
    <published>2014-06-25T14:33:07Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;El &lt;strong&gt;Nautilus&lt;/strong&gt; es el navegador de archivos que viene instalado por defecto en &lt;strong&gt;Ubuntu&lt;/strong&gt;, a mi me gusta, es sencillo y practico, aunque estar&amp;iacute;a bien que tuviese algunas funcionalidades mas, pero esto podemos resolverlo mediante extensiones. En este articulo os voy a mostrar como &lt;strong&gt;a&amp;ntilde;adir&lt;/strong&gt; una &lt;strong&gt;carpeta&lt;/strong&gt; a los &lt;strong&gt;marcadores&lt;/strong&gt; del Nautilus en Ubuntu y tambi&amp;eacute;n como quitarlas. Este proceso lo he usado en Ubuntu 12.04 y 14.04.&lt;/p&gt; 
 &lt;p&gt;Si no sab&amp;eacute;is a que me refiero os voy a detallar un poco mas el tema. Cuando abrimos el &lt;strong&gt;Nautilus&lt;/strong&gt; vemos algo parecido a lo siguiente:&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;&lt;a href="http://elblogdeliher.com/wp-content/uploads/2014/06/nautilus-ubuntu.jpg"&gt;&lt;img src="http://elblogdeliher.com/wp-content/uploads/2014/06/nautilus-ubuntu.jpg" alt="nautilus-ubuntu" width="600" height="400" /&gt;&lt;/a&gt;&lt;/p&gt; 
 &lt;p&gt;&amp;nbsp;&lt;/p&gt; 
 &lt;p&gt;En esta imagen podemos ver un hueco que esta vac&amp;iacute;o en la parte izquierda de la pantalla y que esta se&amp;ntilde;alado por la flecha roja. Esta captura de pantalla no muestra el &lt;strong&gt;Nautilus&lt;/strong&gt; maximizado, si estuviese a pantalla completa ese hueco seria mayor y &amp;iquest;no estar&amp;iacute;a bien usarlo para algo? Eso es lo que vamos a hacer en este articulo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/como-anadir-una-carpeta-a-los-marcadores-de-nautilus-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-25T14:33:07Z</dc:date>
  </entry>
  <entry>
    <title>Cambiar la frecuencia del procesador en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/cambiar-la-frecuencia-del-procesador-en-ubuntu" />
    <category term="ubuntu" />
    <category term="indicador" />
    <category term="tips" />
    <category term="frecuencia" />
    <category term="procesador" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-24T22:08:52Z</updated>
    <published>2014-06-24T22:08:52Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Hace unos d&amp;iacute;as que publique un articulo mostrando &lt;a href="http://elblogdeliher.com/como-desactivar-el-bluetooth-al-inicio-en-ubuntu/"&gt;como desactivar el Bluetooth&lt;/a&gt; al inicio en &lt;strong&gt;Ubuntu&lt;/strong&gt; para ahorrar un poco de bater&amp;iacute;a, en dicho articulo dije que iba a publicar otro en el cual mostrar&amp;iacute;a otra forma de ahorrar bater&amp;iacute;a y aqu&amp;iacute; esta, os voy a mostrar como podemos cambiar la &lt;strong&gt;frecuencia&lt;/strong&gt; del &lt;strong&gt;procesador&lt;/strong&gt; de una forma muy sencilla en &lt;strong&gt;Ubuntu&lt;/strong&gt; mediante un indicador que esta en los repositorios oficiales de &lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt;.&lt;/p&gt; 
 &lt;p&gt;No puedo decir una cifra o porcentaje exacto del ahorro que puede suponer usar este indicador, pero al bajar la velocidad o &lt;strong&gt;frecuencia&lt;/strong&gt; del procesador de nuestro ordenador algo de bater&amp;iacute;a seguro que ahorramos. Este indicador es muy f&amp;aacute;cil de usar y de instalar y os voy a mostrar como hacer las dos cosas.&lt;/p&gt; 
 &lt;p&gt;Lo primero que tenemos que hacer para instalar el indicador, yo lo he instalado en Ubuntu 14.04, para cambiar la &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/cambiar-la-frecuencia-del-procesador-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-24T22:08:52Z</dc:date>
  </entry>
  <entry>
    <title>Que son los controladores privativos o adicionales en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/06/que-son-los-controladores-privativos-o-adicionales-en-ubuntu" />
    <category term="conceptos-basicos" />
    <category term="ubuntu" />
    <category term="controladores" />
    <category term="privativos" />
    <category term="adicionales" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-06-15T22:51:02Z</updated>
    <published>2014-06-15T22:51:02Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Si eres nuevo en &lt;strong&gt;Ubuntu&lt;/strong&gt; y estas empezando a conocer esta distribuci&amp;oacute;n Linux, estar&amp;aacute;s empezando a o&amp;iacute;r una serie de t&amp;eacute;rminos que pueden sonar a chino si nadie te los explica. Este es el caso de los &lt;strong&gt;controladores&lt;/strong&gt; &lt;strong&gt;adicionales&lt;/strong&gt; o &lt;strong&gt;privativos&lt;/strong&gt; en Ubuntu, pues bien, en este articulo voy a explicar que son y para que sirven.&lt;/p&gt; 
 &lt;p&gt;Normalmente cuando instalamos Ubuntu en un ordenador todos o casi todos los componentes del ordenador son reconocidos y podemos usarlos sin necesidad de instalar ning&amp;uacute;n driver. Ubuntu tiene drivers libres para muchos dispositivos, pero tambi&amp;eacute;n tenemos los &lt;strong&gt;controladores&lt;/strong&gt; o drivers &lt;strong&gt;privativos&lt;/strong&gt;. Algunos de estos dispositivos son las tarjetas de red y las tarjetas gr&amp;aacute;ficas.&lt;/p&gt; 
 &lt;p&gt;Como ya he dicho antes &lt;strong&gt;Ubuntu&lt;/strong&gt; reconocer&amp;aacute; casi seguro todos los componentes de nuestro ordenador, pero puede ser que tengamos alg&amp;uacute;n problema con algunos de esos dispositivos y es ah&amp;iacute; donde entran en juegos los &lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/06/que-son-los-controladores-privativos-o-adicionales-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-06-15T22:51:02Z</dc:date>
  </entry>
</feed>

