<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-03T12:39:58Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-03T12:39:58Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Ubuntu Enterprise Cloud 10.10</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/10/ubuntu-enterprise-cloud-1010" />
    <category term="ubuntu" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-02-25T14:35:54Z</updated>
    <published>2010-10-12T19:02:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="Ubuntu" height="84" src="http://3.bp.blogspot.com/_9zOwWD_PYL8/TLStZnSXXnI/AAAAAAAAAf0/2F9garCHKlc/s320/ubuntu.png" title="Ubuntu" width="320" /&gt; 
&lt;/div&gt; 
&lt;br /&gt;Muchos han sido los art&amp;iacute;culos publicados el d&amp;iacute;a 10 junto con la publicaci&amp;oacute;n de Ubuntu Maverick Meerkat (10.10) pero tambi&amp;eacute;n junto con la versi&amp;oacute;n del escritorio tenemos la versi&amp;oacute;n de servidor destinada a empresas aunque para un entorno de producci&amp;oacute;n es m&amp;aacute;s recomendable usar la versi&amp;oacute;n LTS (10.04) por el mayor tiempo de soporte que posee.&amp;nbsp;Adem&amp;aacute;s de la tradicional versi&amp;oacute;n para instalar como servidor tambi&amp;eacute;n se puede instalar para construir una nube (que tan de moda est&amp;aacute;) privada o en una nube p&amp;uacute;blica utilizando los recursos de la 
&lt;a href="http://aws.amazon.com/ec2/"&gt;nube de Amazon&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;La Ubuntu Enterprise Cloud (UEC) est&amp;aacute; formado por un controlador de la nube y uno o varios nodos controladores de las instancias. La nube de Ubuntu se basa en el software&amp;nbsp; 
&lt;a href="http://www.eucalyptus.com/"&gt;Eucalyptus&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;El proceso de instalaci&amp;oacute;n de una nube privada de Ubuntu se inicia como cualquier instalaci&amp;oacute;n de otro sistema operativo introduciendo el CD o mediante una memoria USB (para hacer las pruebas lo m&amp;aacute;s recomendables es utilizar una m&amp;aacute;quina virtual como Vitrtualbox u otras similares).&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/10/ubuntu-enterprise-cloud-1010"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-10-12T19:02:00Z</dc:date>
  </entry>
  <entry>
    <title>Un día en la Euskal Encounter 19</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19" />
    <category term="ubuntu" />
    <category term="software-privativo" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="microsoft" />
    <category term="otros" />
    <category term="software-libre" />
    <category term="apple" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2011-07-24T09:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Euskal encounter 19" src="http://1.bp.blogspot.com/-XcMwHk7AABo/TiqxFNgHm7I/AAAAAAAAA50/Ot6_eSvAkEA/s1600/euskal-encounter.png" title="Euskal encounter 19" /&gt; 
&lt;/div&gt;En estos d&amp;iacute;as se est&amp;aacute; celebrando, del 22 al 25 de julio, la&amp;nbsp; 
&lt;a href="http://www.euskal.org/"&gt;Euskal Encounter&lt;/a&gt;, uno de los enventos inform&amp;aacute;ticos m&amp;aacute;s importantes de Euskadi, del estado de Espa&amp;ntilde;a y seg&amp;uacute;n algunos uno de los mejores de parte de Europa. As&amp;iacute; desde hace ya 19 ediciones, con en estos d&amp;iacute;as exactamente 4096 puestos para los asistentes que disponen de una conexi&amp;oacute;n de 20 Gb por segundo ofrecida por la mano de Euskaltel y HP. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s1600/DSCN0130.JPG"&gt;&lt;img height="150" src="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s200/DSCN0130.JPG" width="200" /&gt;&lt;/a&gt; 
 &lt;a href="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s1600/DSCN0100.JPG"&gt;&lt;img height="150" src="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s200/DSCN0100.JPG" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;br /&gt; 
&lt;/div&gt;A pesar de que se organiza en Barakaldo, al alcance de metro de ciudad en la que vivo y escasos minutos, hasta este a&amp;ntilde;o no hab&amp;iacute;a asistido a ninguna. Ten&amp;iacute;a muchas ganas de ir y vivir en primera persona lo que ah&amp;iacute; acontec&amp;iacute;a al menos por un d&amp;iacute;a, este a&amp;ntilde;o no lo quer&amp;iacute;a dejar pasar y as&amp;iacute; ha sido. Como repaso de lo que ha dado el d&amp;iacute;a (y parte de la noche) os escribo esta entrada.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-07-24T09:46:00Z</dc:date>
  </entry>
  <entry>
    <title>De Windows a Arch Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/03/de-windows-a-arch-linux" />
    <category term="ubuntu" />
    <category term="microsoft" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="apple" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-12-09T19:54:47Z</updated>
    <published>2010-03-08T19:50:00Z</published>
    <content type="html">&lt;p&gt;Como mucha gente me inici&amp;eacute; en la inform&amp;aacute;tica all&amp;aacute; por la &amp;eacute;poca del MS-DOS y Windows 3.11 en la escuela e instituto pero no tuve mi primer ordenador hasta que sali&amp;oacute; el Windows 95 con un Pentium a 120 Mhz y con tan s&amp;oacute;lo &amp;iexcl;8 megas! de RAM. Posteriormente, seg&amp;uacute;n sal&amp;iacute;an nuevas versiones de Windows fu&amp;iacute; us&amp;aacute;ndolas... Windows NT, Windows Me (epic fail!), Windows 2000, Windows XP... hasta que sustitu&amp;iacute; mi anterior PC de escritorio, un Athlon XP 1800+ con 512 megas, en el 2008 por mi actual port&amp;aacute;til, un Dell XPS M1530 y que venia con Windows Vista. 
&lt;br /&gt; 
&lt;br /&gt;Anteriormente, ya hab&amp;iacute;a probado varias distribuciones Linux... alguna versi&amp;oacute;n de Mandrake cuando estaba en la Universidad y Fedora Core (cuando a&amp;uacute;n se llamaba asi), sin embargo, no duraban mucho tiempo en el disco duro ni los llegu&amp;eacute; a usar habitualmente debido a que no consegu&amp;iacute;a configurar todo para que funcionase correctamente&amp;nbsp;o simplemente por los juegos&amp;nbsp;con lo que acababa volviendo al Windows del momento. Como dec&amp;iacute;a, esto fu&amp;eacute; asi hasta que compr&amp;eacute; mi actual port&amp;aacute;til.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/03/de-windows-a-arch-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-03-08T19:50:00Z</dc:date>
  </entry>
  <entry>
    <title>Instalar la Ubuntu font en Arch Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/10/instalar-la-ubuntu-font-en-arch-linux" />
    <category term="ubuntu" />
    <category term="personalizacion" />
    <category term="arch-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-10-14T18:51:22Z</updated>
    <published>2010-10-01T18:19:00Z</published>
    <content type="html">&lt;p&gt;Dentro de unos d&amp;iacute;as ser&amp;aacute; publicado la versi&amp;oacute;n 10.10 de Ubuntu conocida como Maverick Meerkat. Una de las novedades m&amp;aacute;s visibles de cara al usuario ser&amp;aacute; la incorporaci&amp;oacute;n del la fuente llamada Ubuntu font. Esta fuente destaca por sus formas simples y por su f&amp;aacute;cil lectura. 
&lt;br /&gt; 
&lt;br /&gt;Pero los usuarios de Arch Linux tambi&amp;eacute;n podemos disfrutar de ella. Basta con instalar el paquete ttf-ubuntu-family-fonts del repositorio AUR y cambiar la fuente en Sistema &amp;gt; Preferencias &amp;gt; Apariencia &amp;gt; Tipograf&amp;iacute;as. 
&lt;br /&gt; 
&lt;pre&gt;$ yaourt -S&amp;nbsp;ttf-ubuntu-font-family&lt;/pre&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://1.bp.blogspot.com/_9zOwWD_PYL8/TKYkM4ynYLI/AAAAAAAAAfA/tLZo3Fx3ljE/s1600/Preferencias+Ubutnu+font.jpg"&gt;&lt;img height="278" src="http://1.bp.blogspot.com/_9zOwWD_PYL8/TKYkM4ynYLI/AAAAAAAAAfA/tLZo3Fx3ljE/s320/Preferencias+Ubutnu+font.jpg" width="320" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;La p&amp;aacute;gina oficial de Ubuntu hace uso de ella as&amp;iacute; que si quieres echarle un vistazo sin instalar nada pasate por la 
&lt;a href="http://www.ubuntu.com/"&gt;p&amp;aacute;gina de Ubuntu&lt;/a&gt;&amp;nbsp;o haz click en una de las capturas de pantalla que adjunto. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://2.bp.blogspot.com/_9zOwWD_PYL8/TKYky0WRb1I/AAAAAAAAAfI/bjXe-tOFJow/s1600/Ubuntu+font.jpg"&gt;&lt;img alt="Captura usando la fuente Ubuntu" height="250" src="http://2.bp.blogspot.com/_9zOwWD_PYL8/TKYky0WRb1I/AAAAAAAAAfI/bjXe-tOFJow/s400/Ubuntu+font.jpg" title="Captura usando la fuente Ubuntu" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/10/instalar-la-ubuntu-font-en-arch-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-10-01T18:19:00Z</dc:date>
  </entry>
  <entry>
    <title>Juegos para GNU/Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/12/juegos-para-gnulinux" />
    <category term="ubuntu" />
    <category term="juegos" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-04-15T17:29:32Z</updated>
    <published>2010-12-10T18:34:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="Tux" height="200" src="http://2.bp.blogspot.com/_9zOwWD_PYL8/TQJrCzG9OZI/AAAAAAAAAiY/LFBrHo1UgHs/s200/tux.png" title="Tux" width="169" /&gt; 
&lt;/div&gt;En GNU/Linux no hay tantos juegos comerciales como en otros sistemas operativos, l&amp;eacute;ase Windows y &amp;uacute;ltimamente en Mac con su App Store, pero eso no quiere decir que no haya buenos juegos para el ping&amp;uuml;ino. En la siguiente entrada pondr&amp;eacute; algunos con los que he metido muchas horas y que se salen de los t&amp;iacute;picos y habituales 
&lt;a href="http://en.wikipedia.org/wiki/First-person_shooter"&gt;FPS&lt;/a&gt; aunque tambi&amp;eacute;n los hay para Linux. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Open TTD (Transport Tycoon Deluxe)&lt;/b&gt; 
&lt;br /&gt; 
&lt;br /&gt;Este juego est&amp;aacute; basado en el original de la compa&amp;ntilde;&amp;iacute;a Microprose &amp;laquo;Transport Tycoon Deluxe&amp;raquo; y al que le a&amp;ntilde;ade algunas caracter&amp;iacute;sticas que no ten&amp;iacute;a el original. Es un juego de estrategia en tiempo real en el que eres el propietario de una compa&amp;ntilde;ia de transportes con el objetivo de amasar una fortuna y no llevar a la compa&amp;ntilde;&amp;iacute;a a la bancarrota. Para ello dispones de varios medios de transporte como tren, avi&amp;oacute;n, camiones, autobuses y barcos para transportar mercancias o pasajeros (carb&amp;oacute;n, hierro, acero, petroleo, madera, grano, ...) entre las f&amp;aacute;bricas que producen las materias primas (bosques, granja , pozos de petr&amp;oacute;leo, minas de hierro y de carb&amp;oacute;n, ciudades, ...) y las factor&amp;iacute;as que las procesan (acer&amp;iacute;as, central el&amp;eacute;ctricas, ciudades, serrerias, ...), tambi&amp;eacute;n tendr&amp;aacute;s que crear las rutas que har&amp;aacute;n los veh&amp;iacute;culos, de ello depender&amp;aacute; que sean rentables y produzcan beneficios para comprar nuevos veh&amp;iacute;culos y constuir nuevas rutas y no caer en la bancarrota. Seg&amp;uacute;n se va avanzando en el tiempo ir&amp;aacute;n apareciendo mejores medios de transporte con m&amp;aacute;s capcidad, m&amp;aacute;s r&amp;aacute;pidos, que se averien menos o como en el caso de los trenes, en monorail o de levitaci&amp;oacute;n. Seg&amp;uacute;n del dinero que dispongas podr&amp;aacute;s modificar el terreno y construir las carreteras para los veh&amp;iacute;culos, v&amp;iacute;as para los trenes, t&amp;uacute;neles para evitar monta&amp;ntilde;as, puentes para atravesar rios, comprar locomotoras, vagones, autobuses, aviones, constuir aeropuertos, .... &amp;iexcl;Ten cuidado con las cat&amp;aacute;strofes y los OVNIS!&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/12/juegos-para-gnulinux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-12-10T18:34:00Z</dc:date>
  </entry>
  <entry>
    <title>Cambiar el fondo del diálogo de bloqueo en GNOME</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/cambiar-el-fondo-del-dialogo-de-bloqueo-en-gnome" />
    <category term="ubuntu" />
    <category term="gnome" />
    <category term="wallpaper" />
    <category term="personalizacion" />
    <category term="arch-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-18T19:19:57Z</updated>
    <published>2010-02-07T14:54:00Z</published>
    <content type="html">&lt;p&gt;Para esos amantes de la personalizaci&amp;oacute;n del escritorio esta es una de las cosas que les va a gustar. Ubuntu 9.10 con GNOME viene con un fondo de pantalla todo negro para el di&amp;aacute;logo de bloqueo y Arch Linux con uno predeterminado y que ser&amp;aacute; diferente del que tengamos para nuestro escritorio. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/_9zOwWD_PYL8/S27v15ufBvI/AAAAAAAAAAc/jzOF6MD9GXA/s1600-h/Pantallazo11.jpg"&gt;&lt;img alt="Di&amp;aacute;logo de bloqueo por defecto de Arch Linux" height="130" src="http://3.bp.blogspot.com/_9zOwWD_PYL8/S27v15ufBvI/AAAAAAAAAAc/jzOF6MD9GXA/s320/Pantallazo11.jpg" title="Di&amp;aacute;logo de bloqueo por defecto de Arch Linux" width="174" /&gt;&lt;/a&gt; 
 &lt;a href="http://4.bp.blogspot.com/_9zOwWD_PYL8/S27v5_rQ3kI/AAAAAAAAAAk/q7cTiSKHnUQ/s1600-h/Pantallazo22.png"&gt;&lt;img alt="Di&amp;aacute;logo de bloqueo por defecto de Ubuntu" height="130" src="http://4.bp.blogspot.com/_9zOwWD_PYL8/S27v5_rQ3kI/AAAAAAAAAAk/q7cTiSKHnUQ/s200/Pantallazo22.png" title="Di&amp;aacute;logo de bloqueo por defecto de Ubuntu" width="173" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;Una forma de hacer el cambio en Arch Linux es reemplazando el archivo &amp;laquo;/usr/share/pixmaps/backgrounds/gnome/background-default.jpg&amp;raquo; por el que deseemos ejecutando la siguiente linea de comandos en modo root. El fondo de pantalla que he elegido para el ejemplo es uno de los proporcionados por GNOME. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;pre&gt;# cp /usr/share/pixmaps/backgrounds/gnome/nature/Dune.jpg /usr/share/pixmaps/backgrounds/gnome/background-default.jpg&lt;/pre&gt; 
&lt;/div&gt; 
&lt;br /&gt;Otra forma de conseguir el mismo resultado y que funciona tanto en Ubuntu como en Arch Linux (y muy posiblemente en otras distribuciones Linux, *BSD y *NIX que utilicen GNOME) sin tener que utilizar la linea de comandos es mediante el Editor de configuraci&amp;oacute;n. Ejecutando el Editor de configuraci&amp;oacute;n, en la ruta &amp;laquo;/desktop/gnome/background&amp;raquo; hay una propiedad &amp;laquo;picture_filename&amp;raquo; que contiene la ubicaci&amp;oacute;n del archivo del fondo de escritorio que estamos utilizando. Para conseguir que ese mismo fondo nos aparezca en el di&amp;aacute;logo de bloqueo pulsamos con el bot&amp;oacute;n derecho del rat&amp;oacute;n y hacemos clic en la opci&amp;oacute;n &amp;laquo;Establecer como predeterminado&amp;raquo;. Nos pedir&amp;aacute; privilegios para realizar la acci&amp;oacute;n con lo que introducimos la contrase&amp;ntilde;a que tengamos para root y ya est&amp;aacute;. Pulsando &amp;laquo;Ctrl+Alt+L&amp;raquo; para bloquear la pantalla podemos ver nuestro nuevo fondo.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/cambiar-el-fondo-del-dialogo-de-bloqueo-en-gnome"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-07T14:54:00Z</dc:date>
  </entry>
  <entry>
    <title>Instalar el tema de iconos gnome-colors</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/instalar-el-tema-de-iconos-gnome-colors" />
    <category term="ubuntu" />
    <category term="gnome" />
    <category term="personalizacion" />
    <category term="arch-linux" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-18T19:16:16Z</updated>
    <published>2010-02-24T21:32:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/_9zOwWD_PYL8/S4WBcD58o9I/AAAAAAAAAI4/EqmYZRmjd3U/s1600-h/gnome-colors.png"&gt;&lt;img height="200" src="http://4.bp.blogspot.com/_9zOwWD_PYL8/S4WBcD58o9I/AAAAAAAAAI4/EqmYZRmjd3U/s200/gnome-colors.png" width="175" /&gt;&lt;/a&gt; 
&lt;/div&gt;Para instalar un nuevo tema de iconos de GNOME tanto en Ubuntu como en Arch Linux en el entorno GNOME basta con copiar el nuevo tema de iconos a un directorio. Mediante la siguiente linea de comandos en modo root instalamos el 
&lt;a href="http://gnome-look.org/content/show.php/GNOME-colors?content=82562"&gt;tema de iconos gnome-colors&lt;/a&gt; (el directorio &amp;laquo;/home/arch/Escritorio&amp;raquo; variar&amp;aacute; seg&amp;uacute;n sea el lugar donde se haya descomprimido el archivo): 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;pre&gt;# cp /home/arch/Escritorio/gnome-colors-5.5.1/gnome-colors-common /usr/share/icons&lt;br /&gt;# cp /home/arch/Escritorio/gnome-colors-5.5.1/gnome-brave /usr/share/icons&lt;br /&gt;&lt;/pre&gt; 
&lt;/div&gt; 
&lt;br /&gt;La primera linea de comandos copia los archivos comunes del tema gnome-colors, la segunda linea copia los iconos del tema gnome-brave. Con gnome-colors vienen varios temas de los mismos iconos pero de distintos colores que son gnome-dust, gnome-human, gnome-illustrious, gnome-noble, gnome-wine y gnome-wise. Adem&amp;aacute;s en el paquete&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/instalar-el-tema-de-iconos-gnome-colors"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-24T21:32:00Z</dc:date>
  </entry>
  <entry>
    <title>GNOME 2.32 publicado, rumbo a GNOME 3.0</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/10/gnome-232-publicado-rumbo-a-gnome-30" />
    <category term="ubuntu" />
    <category term="gnome" />
    <category term="arch-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2010-10-11T20:38:03Z</updated>
    <published>2010-10-01T17:40:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;img height="148" src="http://4.bp.blogspot.com/_9zOwWD_PYL8/TKYXbnKYP0I/AAAAAAAAAeU/k5pIA_hOOkY/s400/two-thirty-two.png" width="400" /&gt; 
&lt;/div&gt; 
&lt;br /&gt;La versi&amp;oacute;n 2.32 del entorno de escritorio GNOME ha sido publicada hace unos pocos d&amp;iacute;as. Las novedades que incorpora no son tan numerosas como en versiones anteriores ya que los desarrolladores se est&amp;aacute;n centrando en la siguiente revisi&amp;oacute;n mayor de este entorno de escritorio, la versi&amp;oacute;n 3.0, a ser publicada seg&amp;uacute;n su 
&lt;a href="http://live.gnome.org/TwoPointNinetyone/"&gt;calendario&lt;/a&gt; el 6 de abril si todo va vien y no hay nuevos retrasos. Esto es lo que nos espera en la versi&amp;oacute;n 3.0. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;br /&gt;Pero de momento toca disfrutar de la 2.32. En las 
&lt;a href="http://library.gnome.org/misc/release-notes/2.32/"&gt;notas de publicaci&amp;oacute;n&lt;/a&gt; puedes encontrar las modificaciones m&amp;aacute;s relevantes realizadas. 
&lt;br /&gt; 
&lt;br /&gt;Para los usuarios de Arch Linux no tadar&amp;aacute; en estar disponible en los respositorios para actualizarse y los usuarios de Ubuntu podr&amp;aacute;n disfrutarla el d&amp;iacute;a 10.10.10, &amp;iexcl;ya solo quedan unos pocos d&amp;iacute;as de espera!.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/10/gnome-232-publicado-rumbo-a-gnome-30"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-10-01T17:40:00Z</dc:date>
  </entry>
  <entry>
    <title>¡Hola mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/$003fhola-mundo" />
    <category term="hola" />
    <category term="ubuntu" />
    <category term="blogger" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2010-02-07T18:07:04Z</updated>
    <published>2010-02-06T15:55:00Z</published>
    <content type="html">&lt;p&gt;Bueno, &amp;iexcl;pues ya est&amp;aacute;!, ya tengo mi propio blog, todav&amp;iacute;a est&amp;aacute; en fase de construcci&amp;oacute;n as&amp;iacute; que seg&amp;uacute;n vaya teniendo tiempo ir&amp;eacute; haciendo peque&amp;ntilde;os cambios en los gadgets y en su disposici&amp;oacute;n. Por ahora me conformo con tenerlo visible e ir conociendo como funciona 
&lt;a href="http://www.blogger.com/"&gt;Blogger&lt;/a&gt; y otras herramientas como 
&lt;a href="https://www.google.com/adsense"&gt;Google Adsense&lt;/a&gt;, 
&lt;a href="http://www.google.com/analytics/"&gt;Google Analytics&lt;/a&gt; y 
&lt;a href="https://www.google.com/accounts/ServiceLogin?service=feedburner"&gt;Google FeedBurner&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;Pero lo principal, escribir entradas en el blog, es algo que ya puedo realizar. Tratar&amp;aacute;n sobre temas relacionados con el software libre, incluyendo las dos distribuciones GNU/Linux que en este momento uso m&amp;aacute;s habitualmente que son 
&lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt; y 
&lt;a href="http://www.archlinux.org/"&gt;Arch Linux&lt;/a&gt;, temas de tecnolog&amp;iacute;a, quiz&amp;aacute; temas de programaci&amp;oacute;n, experiencias personales sobre los mismos y otras cosas que se me vayan ocurriendo. 
&lt;br /&gt; 
&lt;br /&gt;En cualquier caso, espero que algunas entradas las consider&amp;eacute;is interesantes u os resulten &amp;uacute;tiles. Y como no podr&amp;iacute;a ser de otra forma &amp;iexcl;sois bienvenidos a realizar comentarios y a enviarme sugerencias!.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/$003fhola-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-06T15:55:00Z</dc:date>
  </entry>
</feed>

