<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma"><span itemprop="headline">Linux Lite 1.0.6: Xubuntu en peso pluma</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/xfce"><img title="xfce" alt="xfce" src="/assets/images/labels/xfce.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/10/linux-lite-106-xubuntu-en-peso-pluma.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-10-31T15:30" itemprop="dateModified">Actualizado el jueves, 31 de octubre de 2013 a las 15:30 UTC</span></div><div><span>
Etiquetado como
revision, linux-lite, <a href="/label/xfce"><span itemprop="articleSection">xfce</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Antes de empezar el ciclo regular de revisiones que anunciaba en el 
<a href="http://www.lasombradelhelicoptero.com/2013/10/un-blog-tranquilo.html">art&iacute;culo</a> sobre la b&uacute;squeda de la tranquilidad y la calma en el ejercicio de bloguear sobre GNU/Linux he decidido respetar la &quot;promesa&quot; hecha en su d&iacute;a a un lector an&oacute;nimo que deseaba ver revisada la distribuci&oacute;n que usa en LSDH. Se trata de una distro neozelandesa, de la cual ni tan siquiera hab&iacute;a o&iacute;do hablar hasta el comentario de dicho lector, de nombre Linux Lite. Sus desarrolladores hacen hincapi&eacute; en la idoneidad de su sistema, un Ubuntu con XFCE, para el disfrute de juegos en GNU/Linux, con la premisa de la ligereza y la compatibilidad. De modo que me he propuesto averiguar si es tan liviano como su nombre y la descripci&oacute;n que presentan en 
<a href="https://www.linuxliteos.com/">su web</a> sugieren. Por no hablar de la pluma que esgrimen como logo...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-UEB5pAc8CKE/UnJQKdFLzkI/AAAAAAAAECE/5ctYIJZ69vc/s1600/image-01-535x535.jpg"><img height="320" src="http://1.bp.blogspot.com/-UEB5pAc8CKE/UnJQKdFLzkI/AAAAAAAAECE/5ctYIJZ69vc/s320/image-01-535x535.jpg" width="320" /></a>
</div>
<br />
<br />
<a></a>Si bien he llegado a un punto en que, como bien saben los lectores habituales, me aburre revisar distros basadas en otras a su vez basadas en otras (como es el caso, derivada de derivada de 
<a href="http://www.lasombradelhelicoptero.com/2013/05/debian-7-wheezy-una-autentica-roca.html">Debian</a>), creo que puede resultar un buen ejercicio de &quot;calentamiento&quot; para retomar el h&aacute;bito. Vamos a ello, pues.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Linux Lite cumple desde un principio con las expectativas creadas en torno a su rapidez y ligereza. El inicio de sesi&oacute;n en vivo es realmente veloz, no desmerece para nada a otras alternativas con entornos de escritorio m&aacute;s livianos. El instalador es el mismo de Ubuntu, con dos excepciones: un pase de diapositivas propio y un renderizado de fuentes horrible, para mi gusto, que nada tiene que ver con el de la distribuci&oacute;n en que se basa. El tema principal del &quot;slideshow&quot; reincide de nuevo en las mismas caracter&iacute;sticas intr&iacute;nsecas de la distro, que la hacen ideal para el uso y disfrute de plataformas de videojuegos, del estilo de Steam o Desura. En unos ocho minutos tenemos el sistema instalado en el equipo, lo cual me extra&ntilde;a mucho, habida cuenta de que he marcado las casillas de opci&oacute;n de instalaci&oacute;n de codecs y actualizaciones.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-r0M3N6b8Ms4/UnJQmikVJNI/AAAAAAAAECM/ssOheF6mhkc/s1600/C7LFZ1~3.PNG"><img height="250" src="http://4.bp.blogspot.com/-r0M3N6b8Ms4/UnJQmikVJNI/AAAAAAAAECM/ssOheF6mhkc/s400/C7LFZ1~3.PNG" width="400" /></a>
</div>
<b></b>
<br />Tras el reinicio, que ocurre solamente despu&eacute;s de pulsar la tecla &quot;Enter&quot; sin que nada nos advierta que debemos hacerlo, nos aparece el Grub de Ubuntu (que es como se identifica esta distro), habiendo reconocido el resto de sistemas del equipo. La pantalla de entrada es realmente original, con nuestra foto (o lo que sea que hayamos escogido) en un c&iacute;rculo central. Eso s&iacute;, todo el escritorio se encuentra en ingl&eacute;s, a pesar de lo que eleg&iacute; en las opciones de instalaci&oacute;n, y para llegar al castellano hay que irse al Men&uacute; --&gt; Settings --&gt; Language support y desde ah&iacute; instalar nuestro idioma.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-NY0KcfKbR24/UnJQ2gbD6mI/AAAAAAAAECU/QaY9vXZnYAQ/s1600/SDMBTW~9.PNG"><img height="250" src="http://3.bp.blogspot.com/-NY0KcfKbR24/UnJQ2gbD6mI/AAAAAAAAECU/QaY9vXZnYAQ/s400/SDMBTW~9.PNG" width="400" /></a>
</div>
<br />A este respecto, un par de pegas. Para empezar, no solo instala el espa&ntilde;ol &quot;de Espa&ntilde;a&quot;, sino que se descargan todos los locales, de los correspondientes pa&iacute;ses de habla hispana. Y a pesar de todo esto, algunas partes del escritorio contin&uacute;an en ingl&eacute;s, a la par que varias frases se traducen de forma un tanto extra&ntilde;a. Por poner un par de ejemplos, en el men&uacute; de XFCE aparece como &quot;Administrador de archivos&quot; algo que, en lugar de abrir Thunar, abre una consola que ejecuta un script de b&uacute;squeda de actualizaciones, mientras que la opci&oacute;n &quot;Acerca de XFCE&quot; directamente pone el equipo en modo bloqueo. Interesante mezcolanza de conceptos...
<br />
<br />Como segundo problema a destacar, algo que sospechaba ya: no se han instalado los paquetes actualizados. De esto me percato por casualidad al ejecutar el script correspondiente, pensando que iba a abrir Thunar. Al menos, tras la susodicha actualizaci&oacute;n y el consiguiente reinicio no hay que lamentar m&aacute;s contratiempos. Como nota novedosa, Linux Lite incluye en el men&uacute; una serie de scripts para facilitar la instalaci&oacute;n de diversos programas y utilidades como podemos ver en la captura de pantalla que acompa&ntilde;a a estas l&iacute;neas.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-ROivnAr4dHI/UnJRGbT1y5I/AAAAAAAAECc/fdAGS5-tCOw/s1600/CS7JDL~R.PNG"><img height="250" src="http://3.bp.blogspot.com/-ROivnAr4dHI/UnJRGbT1y5I/AAAAAAAAECc/fdAGS5-tCOw/s400/CS7JDL~R.PNG" width="400" /></a>
</div>
<br />En cuanto al aspecto general de la distro, con el tema Mediterranean Light y los iconos Faenza, podr&iacute;amos catalogarlo de discreto y elegante, sin ser nada del otro mundo. En consonancia con el esp&iacute;ritu de la distro, realmente. El consumo de RAM al inicio se limita a 390 Mb en mi equipo.
<br />
<br />
<b>Arranque y apagado</b>
<br />El sistema arroja unos tiempos de inicio y finalizaci&oacute;n bastante buenos, teniendo en cuenta que la base es 
<a href="http://www.lasombradelhelicoptero.com/2012/04/ubuntu-1204-cumpliendo-con-las.html">Ubuntu 12.04</a>, con 18 meses ya de antig&uuml;edad, lo que en Inform&aacute;tica tiende a llamarse obsoleto, calificaci&oacute;n con la que, dicho sea de paso, no estoy nada de acuerdo. 16 segundos para apagarse y 25 para encenderse son tiempos alejados de los modernos est&aacute;ndares de systemd, pero para m&iacute; son m&aacute;s que aceptables.
<br />
<br />
<b>Software</b>
<br />El manejo de programas se realiza con el conocido gestor de paquetes Synaptic, mientras que las actualizaciones se instalan con el script que comentaba m&aacute;s arriba. Entre la bater&iacute;a de aplicaciones incluidas con Linux Lite tenemos Firefox 24, Thunar 1.2.3, VLC 2.0.8, Libreoffice 3.5 o Gimp 2.8, por se&ntilde;alar los programas que utilizo m&aacute;s.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-T3o9WxuprAU/UnJP73uvLoI/AAAAAAAAECA/TWZ13GULlKg/s1600/C08XVZ%257ET.PNG"><img height="250" src="http://3.bp.blogspot.com/-T3o9WxuprAU/UnJP73uvLoI/AAAAAAAAECA/TWZ13GULlKg/s400/C08XVZ%257ET.PNG" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-UcksknvS-h4/UnJRks1Rg3I/AAAAAAAAECo/WtW11FB41sU/s1600/CQCPM4~7.PNG"><img height="250" src="http://1.bp.blogspot.com/-UcksknvS-h4/UnJRks1Rg3I/AAAAAAAAECo/WtW11FB41sU/s400/CQCPM4~7.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Reconocimiento de hardware</b>
<br />Cualquier derivada de Ubuntu juega con ventaja en este apartado, Linux Lite no es una excepci&oacute;n. Salvo por un problema con el reconocimiento de la contrase&ntilde;a de acceso a la red Wifi casera, el resto se ejecuta de forma inc&oacute;lume: la impresora es reconocida y auto-instalada, el esc&aacute;ner &iacute;dem de lo mismo, la webcam tambi&eacute;n y la red cableada, efectivamente, funcionante desde un inicio.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-kH_xaW6z1Fc/UnJySlZoSrI/AAAAAAAAEC4/omegkhZ208M/s1600/CWDF6I~K.PNG"><img height="250" src="http://3.bp.blogspot.com/-kH_xaW6z1Fc/UnJySlZoSrI/AAAAAAAAEC4/omegkhZ208M/s400/CWDF6I~K.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Conectividad</b>
<br />Todo perfecto en este sentido, Samba se ejecuta bien, si bien no consegu&iacute; hacer streaming de modo directo desde mi port&aacute;til. Por lo dem&aacute;s, el reconocimiento de dispositivos externos es m&aacute;s que correcto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-TzyNzZ7J_OI/UnJygF1BnaI/AAAAAAAAEDA/sc7covUjdC4/s1600/CG9T00~5.PNG"><img height="250" src="http://2.bp.blogspot.com/-TzyNzZ7J_OI/UnJygF1BnaI/AAAAAAAAEDA/sc7covUjdC4/s400/CG9T00~5.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />Al igual que ocurre con el reconocimiento de hardware, al ser una derivada de la distro de Canonical obtenemos una experiencia de uso muy amigable para el usuario novel. Todos los archivos multimedia, pdf y de oficina se pueden abrir sin dificultad alguna. El peque&ntilde;o &quot;pero&quot; viene en esta ocasi&oacute;n por la v&iacute;a del applet de sonido de XFCE, que escoge por defecto HDMI en lugar del sonido est&aacute;ndar y requiere de intervenci&oacute;n del usuario para su correcci&oacute;n.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-76pvXXjWJds/UnJyvToS3UI/AAAAAAAAEDI/wek1JRfC6g4/s1600/CP0ZZN~D.PNG"><img height="250" src="http://3.bp.blogspot.com/-76pvXXjWJds/UnJyvToS3UI/AAAAAAAAEDI/wek1JRfC6g4/s400/CP0ZZN~D.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Estabilidad del sistema</b>
<br />Durante las pruebas realizadas a Linux Lite no se produjo ning&uacute;n cuelgue o mal funcionamiento de aplicaciones. Un comportamiento impecable en este sentido.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-w7_6JiICsOo/UnJzIA5T1SI/AAAAAAAAEDY/kIWkkPSk9L8/s1600/CSUK7Q~Y.PNG"><img height="250" src="http://3.bp.blogspot.com/-w7_6JiICsOo/UnJzIA5T1SI/AAAAAAAAEDY/kIWkkPSk9L8/s400/CSUK7Q~Y.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Fluidez</b>
<br />Uno de los puntos clave a la hora de analizar esta distro, toda vez que hacen de esta caracter&iacute;stica su se&ntilde;a de identidad. Y no, no falla en cumplir lo que promete, una experiencia muy fluida y un desempe&ntilde;o ligero.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-oiWNPfvpeeo/UnJy5muv4VI/AAAAAAAAEDQ/MBJKQ9Cqp54/s1600/CP7RJH~G.PNG"><img height="250" src="http://2.bp.blogspot.com/-oiWNPfvpeeo/UnJy5muv4VI/AAAAAAAAEDQ/MBJKQ9Cqp54/s400/CP7RJH~G.PNG" width="400" /></a>
</div>
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />La suspensi&oacute;n a RAM y el reposo de la pantalla funcionan bien, no as&iacute; la hibernaci&oacute;n (desconozco, ciertamente, si alguien sigue usando esta funci&oacute;n hoy en d&iacute;a), pues no existe diferencia alguna entre apagar e hibernar para Linux Lite,ya que no se mantienen las aplicaciones y procesos abiertos tras el reinicio.
<br />
<br />
<b>Personalizaci&oacute;n</b>
<br />Siendo sincero, no me apetec&iacute;a en demas&iacute;a configurar esta distribuci&oacute;n como si fuese a hacer uso de ella a diario. Las pocas tareas de personalizaci&oacute;n que llev&eacute; a cabo se limitaron a la instalaci&oacute;n del soporte para 32 bits, imprescindible en las pruebas de rendimiento de Phoronix, y a los controladores propietarios. Curiosamente, tras instalar estos &uacute;ltimos v&iacute;a jockey, encontr&eacute; que el consumo de RAM bajaba hasta los 345 Mb al inicio. Eso s&iacute;, a costa de perder el Plymouth de la silueta de Tux (una baja sin importancia, en realidad).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-QRC-OZxxy2Q/UnJzXpvOQxI/AAAAAAAAEDg/T86Niqvm8qM/s1600/C76UDX~D.PNG"><img height="250" src="http://1.bp.blogspot.com/-QRC-OZxxy2Q/UnJzXpvOQxI/AAAAAAAAEDg/T86Niqvm8qM/s400/C76UDX~D.PNG" width="400" /></a>
</div>
<br />Tambi&eacute;n prob&eacute; algunos de los scripts antes mencionados que pretenden facilitar la instalaci&oacute;n de elementos a los usuarios menos duchos. Si bien son perfectamente funcionales he de advertir que se encuentran sin traducir.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-uQ-qO-qzOdc/UnJzeFUOP7I/AAAAAAAAEDo/04yLKuVOmqE/s1600/CSRLMB~E.PNG"><img height="250" src="http://3.bp.blogspot.com/-uQ-qO-qzOdc/UnJzeFUOP7I/AAAAAAAAEDo/04yLKuVOmqE/s400/CSRLMB~E.PNG" width="400" /></a>
</div>
<br />
<b>Rendimiento</b>
<br />Las pruebas efectuadas con la Phoronix Test Suite arrojan muy buenos resultados. Linux Lite supera a Xubuntu (referencia m&aacute;s pr&oacute;xima que se me ocurre, dadas las caracter&iacute;sticas) en tres de los cinco apartados estudiados, algunos de ellos de forma holgada (Apache y Unigine Valley).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-DPwVkOjHiHk/UnJz3Z4fZ8I/AAAAAAAAEDw/hMXPoSLbVTQ/s1600/CH1URS~6.PNG"><img height="250" src="http://1.bp.blogspot.com/-DPwVkOjHiHk/UnJz3Z4fZ8I/AAAAAAAAEDw/hMXPoSLbVTQ/s400/CH1URS~6.PNG" width="400" /></a>
</div>
<br />La sensaci&oacute;n que me deja la prueba de Linux Lite 1.0.6 es que se trata de una distribuci&oacute;n enfocada prioritariamente al p&uacute;blico &quot;gamer&quot;, algo en lo que ya insisten los propios desarrolladores. Para ello se aseguran de mantener la compatibilidad con la mayor&iacute;a de juegos posibles (la base Ubuntu es un buen punto de partida) y eliminan el &quot;factor Unity&quot;, con lo que aumentan los recursos disponibles para jugar. Ignoro si se podr&iacute;a haber hecho algo similar tomando a Xubuntu directamente, la verdad.
<br />
<br />En cuanto al usuario normal, entre los que me encuentro, creo que no hallar&aacute; en Linux Lite nada especial o novedoso. Es cierto que las modificaciones, cualesquiera que sean, realizadas al c&oacute;digo por los creadores neozelandeses ara&ntilde;an algunos megas de RAM, pero teniendo en cuenta las configuraciones de la mayor&iacute;a de equipos que se gastan en la actualidad, al fin y al cabo terminan por resultar una cantidad nimia en comparaci&oacute;n con Xubuntu, la cual deja un poso de gran profesionalidad y un acabado m&aacute;s redondo para mi gusto. Ello no es &oacute;bice para que los usuarios con equipos m&aacute;s modestos, sobre todo si son jugones, le den un vistazo a esta Linux Lite. Saludos.
<br />
<br />
<br />
<div style="text-align: center;">
 <b>FICHA T&Eacute;CNICA</b>
</div>
<div style="text-align: center;">
 Distribuci&oacute;n: Linux Lite 1.0.6
</div>
<div style="text-align: center;">
 Entorno de escritorio: XFCE 4.8
</div>
<div style="text-align: center;">
 Kernel: 3.2.0-48
</div>
<div style="text-align: center;">
 Xorg: 1.11.3
</div>
<div style="text-align: center;">
 Driver gr&aacute;fico: fglrx 8.96.4
</div>
<div style="text-align: center;">
 OpenGL: 4.2.11627
</div>
<div style="text-align: center;">
 GCC: 4.6
</div>
<div style="text-align: center;">
 <br />
</div>
<div style="text-align: center;">
 <br />
</div>
<table>
 <tbody>
  <tr>
   <th>LINUX LITE 1.0.6</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>9,40</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>8,00</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>8,33</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>9,58</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>6,67</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.135,00</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>24.492,65</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>8,58</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>18,05</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>438,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>0,36</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>9,32</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma" st_title="Linux Lite 1.0.6: Xubuntu en peso pluma | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/xfce/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta xfce</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 327,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/10/linux-lite-1-6-xubuntu-en-peso-pluma"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>