<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-06-07T18:19:31Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-06-07T18:19:31Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Problema de accesibilidad en ventana de bloqueo de Windows</title>
    <link rel="alternate" href="http://www.blogstack.info/post/placerdigital/2014/03/problema-de-accesibilidad-en-ventana-de-bloqueo-de-windows" />
    <category term="blog-stack" />
    <category term="accesibilidad" />
    <category term="analisis" />
    <category term="windows" />
    <category term="teclado" />
    <author>
      <name>Ricardo Barra</name>
    </author>
    <updated>2014-05-07T21:47:07Z</updated>
    <published>2014-03-25T19:22:58Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hace d&amp;iacute;as pensaba en un gran problema de accesibilidad, en Windows, que afecta a personas con alg&amp;uacute;n grado de discapacidad, como aquellos que tienen s&amp;oacute;lo un brazo o que padecen alg&amp;uacute;n problema de movilidad reducida.&lt;/p&gt; 
&lt;p&gt;Me imagino que todos conocen la pantalla de bloqueo de Windows:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://placerdigital.net/pdblog/wp-content/uploads/2014/03/pantalla-de-bloqueo-windows.jpg"&gt;&lt;img alt="Pantalla de bloqueo de Windows" src="http://placerdigital.net/pdblog/wp-content/uploads/2014/03/pantalla-de-bloqueo-windows.jpg" width="1024" height="691" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Como podr&amp;aacute;n apreciar, para salir de esa interfaz hay que presionar &lt;strong&gt;tres teclas al mismo tiempo: Control, Alt y Suprimir&lt;/strong&gt;. Para una persona que no tenga dos brazos (o dos manos) debe ser una tarea muy compleja, entonces pens&amp;eacute; que Microsoft debe haber dise&amp;ntilde;ado una forma de facilitar este proceso. Puedo estar equivocado pero al parecer dicha soluci&amp;oacute;n no existe.&lt;/p&gt; 
&lt;p&gt;Para hacer la prueba, bloque&amp;eacute; la pantalla de un computador con Windows 7. Si se fijan bien, abajo a la izquierda hay un bot&amp;oacute;n que sirve justamente para configurar opciones de accesibilidad. Busqu&amp;eacute; entre las opciones y hay una alternativa que dice “Escribir sin el teclado (Teclado en pantalla)”:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/placerdigital/2014/03/problema-de-accesibilidad-en-ventana-de-bloqueo-de-windows"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Ricardo Barra</dc:creator>
    <dc:date>2014-03-25T19:22:58Z</dc:date>
  </entry>
  <entry>
    <title>Por qué el gobierno y el sistema educativo DEBEN preferir software libre</title>
    <link rel="alternate" href="http://www.blogstack.info/post/placerdigital/2014/02/por-que-el-gobierno-y-el-sistema-educativo-deben-preferir-software-libre" />
    <category term="blog-stack" />
    <category term="analisis" />
    <category term="software" />
    <category term="windows" />
    <category term="software-libre" />
    <author>
      <name>Ricardo Barra</name>
    </author>
    <updated>2014-05-07T21:47:07Z</updated>
    <published>2014-02-01T04:15:17Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hoy he considerado necesario dedicar unos minutos para explicar, a trav&amp;eacute;s de 3 sencillos ejemplos, por qu&amp;eacute; el Estado y el sistema educativo tienen el DEBER de preferir software libre.&lt;/p&gt; 
&lt;p&gt;Este tema da para mucho m&amp;aacute;s pero esta vez s&amp;oacute;lo &lt;strong&gt;describir&amp;eacute; algunos escenarios que demuestran que somos un pa&amp;iacute;s esclavo de tecnolog&amp;iacute;as privativas&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;1. A&amp;uacute;n hay sitios web y aplicaciones que s&amp;oacute;lo funcionan bien con Internet Explorer. Para usar ese navegador, estoy obligado a usar Windows, y para usar Windows tengo que obligadamente gastar decenas de miles de pesos. Si una instituci&amp;oacute;n gubernamental decide construir sistemas a los que s&amp;oacute;lo se puede acceder utilizando una tecnolog&amp;iacute;a privativa (que adem&amp;aacute;s es mala y cara), me convierten, como ciudadano, en esclavo de ese navegador.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/placerdigital/2014/02/por-que-el-gobierno-y-el-sistema-educativo-deben-preferir-software-libre"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Ricardo Barra</dc:creator>
    <dc:date>2014-02-01T04:15:17Z</dc:date>
  </entry>
  <entry>
    <title>El hogar de los valientes</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/el-hogar-de-los-valientes" />
    <category term="gnu-linux" />
    <category term="experiencias" />
    <category term="windows" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-03-28T14:57:01Z</updated>
    <published>2014-03-28T12:47:00Z</published>
    <content type="html">&lt;p&gt;Resulta ir&amp;oacute;nico que una de las cosas que m&amp;aacute;s detesto en esta vida sea la ausencia de palabra, la falta de compromiso, la incapacidad de cumplir con lo que se promete o de mantener lo que se decide. Dec&amp;iacute;a mi abuelo que un hombre que se viste por los pies cumple su palabra. Manten&amp;iacute;a - y mantiene, por suerte - mi padre que si dices que vas a hacer algo has de hacerlo y punto. No valen excusas. Comprender&amp;eacute;is, ante estas premisas, lo dif&amp;iacute;cil que resulta para m&amp;iacute; hacer lo que estoy haciendo en este preciso momento. Dije que lo dejaba y lo dej&amp;eacute;... durante menos de un mes. Y aqu&amp;iacute; estamos. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://2.bp.blogspot.com/-RiaAGT4XlVI/UzVlgLRC7nI/AAAAAAAAEWg/CQ9VqOn0s4A/s1600/Cartel+abierto.jpg"&gt;&lt;img src="http://2.bp.blogspot.com/-RiaAGT4XlVI/UzVlgLRC7nI/AAAAAAAAEWg/CQ9VqOn0s4A/s1600/Cartel+abierto.jpg" height="268" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;No es menos cierto que cuando uno comete un error debe hacer lo posible por subsanarlo, previo reconocimiento, claro est&amp;aacute;, de que se ha metido la pata. Por continuar con las frases c&amp;eacute;lebres, dos equivocaciones no constituyen un acierto, de modo que es tiempo de levantarme, admitir mi error y continuar con la batalla. No sin antes agradecer las muestras de apoyo y comprensi&amp;oacute;n recibidas en el centenar de comentarios suscitados por&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/el-hogar-de-los-valientes"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-03-28T12:47:00Z</dc:date>
  </entry>
  <entry>
    <title>Principales problemas de Linux en el escritorio</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio" />
    <category term="gnu-linux" />
    <category term="windows" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-01-13T10:45:08Z</updated>
    <published>2014-01-13T10:45:00Z</published>
    <content type="html">&lt;p&gt;Hace alg&amp;uacute;n tiempo me top&amp;eacute; con la p&amp;aacute;gina personal de Artem S. Tashkinov, un administrador de sistemas que se define a s&amp;iacute; mismo como un entusiasta del 
&lt;a href="https://es.wikipedia.org/wiki/FOSS"&gt;FOSS&lt;/a&gt;, y que a lo largo de los a&amp;ntilde;os ha ayudado a resolver multitud de errores y problemas que afectaban tanto al kernel como a otros componentes de GNU/Linux. Cuando lo le&amp;iacute; qued&amp;eacute; fascinado, pues me pareci&amp;oacute; que su cr&amp;iacute;tica constructiva es precisamente el aspecto del que m&amp;aacute;s adolece nuestro sistema operativo preferido. &amp;quot;Har&amp;iacute;an falta m&amp;aacute;s Artems&amp;quot;, pens&amp;eacute;. En los comentarios suscitados por mi 
&lt;a href="http://www.lasombradelhelicoptero.com/2014/01/pesadilla-antes-de-navidad.html"&gt;&amp;uacute;ltimo art&amp;iacute;culo&lt;/a&gt;, traje a colaci&amp;oacute;n este escrito, el cual no ha tenido excesiva difusi&amp;oacute;n en el mundo de habla hispana, probablemente por carecer de una traducci&amp;oacute;n correcta, pues emplear el &amp;quot;gadget&amp;quot; que incorpora la propia web para este menester nos da un resultado francamente rid&amp;iacute;culo. Encontr&amp;eacute;, no obstante, una menci&amp;oacute;n en el blog&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/01/principales-problemas-de-linux-en-el-escritorio"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-01-13T10:45:00Z</dc:date>
  </entry>
  <entry>
    <title>Montar unidades remotas con fstab en GNU/Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2013/11/montar-unidades-remotas-con-fstab-en-gnu-linux" />
    <category term="debian" />
    <category term="sistemas-operativos" />
    <category term="gnu-linux" />
    <category term="mount" />
    <category term="ntfs" />
    <category term="windows" />
    <category term="cifs" />
    <category term="fstab" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2013-11-28T16:42:22Z</updated>
    <published>2013-11-28T16:39:34Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2012/08/ochobits1.jpg"&gt;&lt;img alt="ochobits" src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2012/08/ochobits1.jpg" width="159" height="104" /&gt;&lt;/a&gt;Si partimos de la base que queremos montar una unidad remota, es decir, de otra m&amp;aacute;quina de nuestra red, en nuestra equipo, podemos hacerlo de dos maneras.&lt;/p&gt; 
&lt;p&gt;La primera de ellas ser&amp;iacute;a de forma manual con el comando &lt;strong&gt;mount&lt;/strong&gt;. En &amp;eacute;ste art&amp;iacute;culo se explica c&amp;oacute;mo hacerlo de forma autom&amp;aacute;tica con &lt;strong&gt;fstab&lt;/strong&gt;.&lt;/p&gt; 
&lt;p&gt;En nuestra empresa tenemos mayor&amp;iacute;a de m&amp;aacute;quinas con sistema operativo &lt;strong&gt;Windows&lt;/strong&gt;, y su habitual sistema de ficheros &lt;strong&gt;NTFS&lt;/strong&gt;.&lt;br /&gt; &lt;/p&gt; 
&lt;p&gt;Por lo tanto en nuestro sistemas GNU/Linux instalaremos el programa &lt;strong&gt;cifs-utils&lt;/strong&gt; para poder montarlas.&lt;/p&gt; 
&lt;pre&gt;su
apt-get -y update &amp;amp;&amp;amp; apt-get -y install cifs-utils&lt;/pre&gt; 
&lt;p&gt;Si trabajamos con un sistema basado en Red Hat ser&amp;iacute;a con el comando &lt;strong&gt;yum&lt;/strong&gt; o &lt;strong&gt;yast&lt;/strong&gt; Para lograrlo primero crearemos el directorio donde queremos que se monte la unidad. Lo haremos de la siguiente manera:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2013/11/montar-unidades-remotas-con-fstab-en-gnu-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2013-11-28T16:39:34Z</dc:date>
  </entry>
</feed>

