<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Herramientas que solucionan y ocultan problemas | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas"><span itemprop="headline">Herramientas que solucionan y ocultan problemas</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/_xgJGixAiFg/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-15T05:06" itemprop="datePublished">Publicado el lunes, 15 de diciembre de 2014 a las 05:06 UTC</span></div><div><span>
Etiquetado como
software-development, development, tooling</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Cuando era peque&ntilde;o me sab&iacute;a de memoria un mont&oacute;n de n&uacute;meros de tel&eacute;fono: el de casa de mis amigos, el de mis abuelos, el de algunos de mis t&iacute;os… Hoy en d&iacute;a, a duras penas recuerdo el m&iacute;o. </p> 
<p>La causante de todo esto es, claro est&aacute;, la agenda del m&oacute;vil, que me libera de tareas tan mundanas como recordar n&uacute;meros de tel&eacute;fono. A cambio, si me quedase sin bater&iacute;a y tuviera que llamar a alguien, tendr&iacute;a serios problemas para localizarlo.</p> 
<p>En innegable que la agenda del m&oacute;vil es una herramienta muy &uacute;til y que su contrapartida, es decir, no saber de memoria ning&uacute;n tel&eacute;fono de nadie, es f&aacute;cilmente solventable, basta con memorizar un par de n&uacute;meros para emergencias, pero eso no quita que confiar ciegamente en un herramienta tambi&eacute;n tenga sus consecuencias negativas.</p> 
<p>En las &uacute;ltimas semanas he estado trabajando casi todo el tiempo en proyectos con Javascript y <a href="http://blog.koalite.com/2014/09/reactjs-un-enfoque-diferente/" title="ReactJS: un enfoque diferente">ReactJS</a> usando simplemente un editor de texto y unas cuantas <a href="http://blog.koalite.com/2013/09/node-js-de-servidor-a-navaja-suiza/" title="Node.js, de servidor a navaja suiza">herramientas de l&iacute;neas de comandos</a>, lo que supone un cambio bastante grande con respecto a desarrollar en C# usando Visual Studio y Resharper. </p> 
<p>Esto me ha hecho replantearme algunas cosas de la forma en que suelo programar y reflexionar sobre las implicaciones de usar herramientas avanzadas.</p> 
<p> <img src="http://blog.koalite.com/wp-content/uploads/right-tool.jpg" alt="Solucionando un problema, ocultando otro." width="800" height="413" /> <em>Solucionando un problema, ocultando otro.</em> </p> 
<p>A simple vista, uno dir&iacute;a que si tienes una herramienta m&aacute;s potente, que te permite hacer m&aacute;s cosas en menor tiempo y ser “m&aacute;s productivo”, la calidad del c&oacute;digo deber&iacute;a ser mayor. A fin de cuentas, el usuario (o sea, yo) es el mismo, por lo que su capacidad para escribir buen (o mal) c&oacute;digo es la misma, y cuantas m&aacute;s ayudas tenga mejor c&oacute;digo escribir&aacute;, &iquest;no?</p> 
<p>Lo cierto es que, en mi caso, no tengo tan claro que esto sea as&iacute;.</p> 
<p>Tener herramientas m&aacute;s avanzadas, como un compilador que chequea tipos o un IDE capaz de refactorizar y navegar autom&aacute;ticamente entre multitud de ficheros te ayuda a gestionar mejor la complejidad siempre creciente de un proyecto, pero tambi&eacute;n te oculta justo eso: que la complejidad est&aacute; creciendo, y quiz&aacute; demasiado.</p> 
<p>A fin de cuentas, no necesitas prestar tanta atenci&oacute;n al n&uacute;mero de ficheros que creas o <a href="http://blog.koalite.com/2014/10/formas-de-organizar-el-codigo/" title="Formas de organizar el c&oacute;digo">c&oacute;mo organizarlos</a>, navegar entre ellos es cuesti&oacute;n de pulsar una combinaci&oacute;n de teclas y saltar de uno a otro.</p> 
<p>O para qu&eacute; pensar detenidamente el nombre de un m&eacute;todo. Puedo poner el que quiera y, m&aacute;s adelante, renombrarlo en segundos. Siempre y cuando me acuerde de hacerlo y no quede con un nombre poco indicativo para siempre. Adem&aacute;s, aunque sea un nombre poco memorable, tengo un completo <em>intellisense</em> que me ayuda a encontrarlo cuando lo necesito.</p> 
<p>&iquest;Y la gesti&oacute;n de dependencias? &iquest;Qu&eacute; m&aacute;s me da si una clase se utiliza en 30 sitios distintos? Total, el <code>using</code> me lo a&ntilde;ade autom&aacute;ticamente el Resharper y la dependencia la puedo acabar inyectando a trav&eacute;s del <a href="http://blog.koalite.com/2012/11/contenedores-ioc-%c2%bfbuenos-o-malos/" title="Contenedores IoC, &iquest;buenos o malos?">contenedor de inversi&oacute;n de control</a>.</p> 
<p>Si quiero modificar c&oacute;digo existente tampoco tengo problema, aunque eso introduzca fallos en mucho otros sitios. Lo modifico y el an&aacute;lisis en tiempo real de Resharper me ir&aacute; guiando por todos los sitios en los que tengo que realizar correcciones. Correcciones que adem&aacute;s muchas veces puedo automatizar y realizar sin prestar mucha atenci&oacute;n.</p> 
<p>&iquest;Librer&iacute;as externas? Todas las que quiera. Si necesito usar cualquier funcionalidad, usando un <a href="http://blog.koalite.com/2014/07/el-lado-oscuro-de-los-gestores-de-paquetes/" title="El lado oscuro de los gestores de paquetes">gestor de paquetes</a> puedo a&ntilde;adir una librer&iacute;a que la implemente en un momento.</p> 
<p>No es que la herramienta me obligue a hacer las cosas mal, pero me permite no prestar atenci&oacute;n a esos peque&ntilde;os detalles y vivir con la &iquest;falsa? sensaci&oacute;n de que en realidad no son problemas, pero ciertamente los ejemplos que pon&iacute;a puede ocultar problemas reales en una aplicaci&oacute;n.</p> 
<p>Tener un proyecto con miles de ficheros puede indicar que su tama&ntilde;o es demasiado grande y que tal vez ser&iacute;a mejor partirlo en proyectos m&aacute;s peque&ntilde;os, que pueda evolucionar y versionar por separado.</p> 
<p>Escribir c&oacute;digo de manera descuidada confiando en que luego refactorizarlo es f&aacute;cil implica que si luego no me acuerdo de refactorizarlo, acabar&eacute; teniendo un mont&oacute;n de c&oacute;digo escrito de manera descuidada.</p> 
<p>Mantener una base de c&oacute;digo en la que existen muchas dependencias interconectadas y clases que se utilizan en cincuenta sitios s&oacute;lo porque es f&aacute;cil depender de ellas acaba siendo un problema porque el acoplamiento entre unas partes y otras del sistema crece y es m&aacute;s dif&iacute;cil realizar modificaciones, ya que los cambios se propagan de unos puntos a otros.</p> 
<p>Realizar cambios de forma masiva en el c&oacute;digo, aunque tengas una herramienta que te gu&iacute;e para solucionar los errores que est&aacute;s generando, no suele ser una buena idea porque implica que est&aacute;n modificando demasiados sitios a la vez y el riesgo de introducir errores en mayor.</p> 
<p>Introducir una librer&iacute;a con 5000 l&iacute;neas de c&oacute;digo s&oacute;lo para utilizar un par de funciones que se pueden escribir en 5 minutos con 15 l&iacute;neas de c&oacute;digo a&ntilde;ade una complejidad innecesaria a la hora de comprender las dependencias del proyecto e incrementa el API global con un mont&oacute;n de funciones que no necesitamos.</p> 
<p>Sin embargo, cuando programo en Javascript usando un editor de texto, pierdo muchas de estas ayudas. Por ejemplo, para referenciar un fichero desde otro, es necesario hacer un <code>require</code> (o algo equivalente) <em>a mano</em>, lo que me hace ser muy consciente de cuantas dependencias tiene cada fichero porque me supone un esfuerzo extra a&ntilde;adirlas y mantenerlas.</p> 
<p>Utilizar cientos de ficheros, aunque tengas ayudas para navegar entre ellos, se vuelve mucho m&aacute;s inc&oacute;modo porque las opciones para saltar a la definici&oacute;n de un objeto o un m&eacute;todo no son tan potentes como las del Visual Studio, y eso hace que te plantees si realmente necesitas tener un fichero para cada funci&oacute;n o es preferible mantener ficheros un poco m&aacute;s grandes pero m&aacute;s cohesionados.</p> 
<p>Puesto que renombrar es m&aacute;s complicado y recordar los nombres sin <em>intellisense</em> cuesta m&aacute;s, pongo m&aacute;s cuidado en intentar elegir un buen nombre desde el principio, y como cambiar la signatura de una funci&oacute;n no es una tarea trivial (no tengo compilador ni Resharper), me cuido mucho de tener un m&eacute;todo que se use en 1000 sitios diferentes por si tengo que modificarlo.</p> 
<p>Eso hace que intente acotar m&aacute;s el uso de cada funci&oacute;n para poder hacer cambios de forma m&aacute;s controladay y con menos riesgo de introducir errores.</p> 
<p>Todo esto, que no nos enga&ntilde;emos, son limitaciones impuestas por el entorno, acaba redundando en que el c&oacute;digo est&aacute; m&aacute;s cuidado, resulta m&aacute;s compacto, m&aacute;s cohesivo y menos acoplado. Porque si no lo haces as&iacute;, es imposible mantenerlo.</p> 
<p>Cuando trabajo con este tipo de herramientas mi forma de trabajar cambia. </p> 
<p>Mientras que con un IDE tiendo a escribir c&oacute;digo r&aacute;pidamente de la primera forma que se me ocurre porque s&eacute; que luego ser&aacute; f&aacute;cil modificarlo aprovechando la potencia de las herramientas, si pierdo esa posibilidad, escribo c&oacute;digo m&aacute;s despacio, pensando m&aacute;s lo que escribo pero dando menos vueltas para llegar al resultado final. <a href="http://www.youtube.com/watch?v=f84n5oFoZBc">Hammok driven development</a>, que dir&iacute;a Rich Hickey.</p> 
<p>En realidad, no creo que (al menos en mi caso) ninguna de las dos t&aacute;cticas d&eacute; lugar a un c&oacute;digo inherentemente mejor, y con ambas puedo llegar a conseguir escribir c&oacute;digo muy bueno o c&oacute;digo muy malo. Simplemente se trata de dos formas diferentes de trabajar impuestas por el tipo de herramientas que tengo disponibles y no deja de ser interesante plantearse esas diferencias y tratar de ver si se puede conjugar lo mejor de dos mundos.</p> 
<p>No se trata de una adoptar una postura neoludista y renunciar a todo avance tecnol&oacute;gico, sino de ser consciente de que a veces las herramientas avanzadas nos puede hacer demasiado vagos y prestarle poca atenci&oacute;n a la herramienta m&aacute;s poderosa que tenemos: nuestra capacidad de pensar y razonar.</p> 
<p>Lo ideal ser&iacute;a tener toda la potencia disponible para cuando sea necesaria, pero no por ello dejar de pensar cuidadosamente en lo que estamos haciendo. Para eso hacen falta dos cosas: por una parte, ser consciente de cuando dejamos de pensar y nos dejamos guiar por la herramienta, y por otra tener una disciplina que no siempre es sencilla de mantener.</p> 
<p>Y en eso estamos. Utilizar herramientas menos potentes me ha permitido ser consciente de algunos “vicios” que hab&iacute;a adquirido por disponer de funcionalidades avanzadas y ahora, incluso cuando vuelvo a Visual Studio y Resharper, trato de ser m&aacute;s consciente del c&oacute;digo que escribo y hacerlo mejor, independientemente de que las herramientas hagan tolerable trabajar con c&oacute;digo de peor calidad.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/_xgJGixAiFg" height="1" width="1" alt="" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas" st_title="Herramientas que solucionan y ocultan problemas | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2014
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1223,
      "url" : "http://www.blogstack.info/post/koalite/2014/12/herramientas-que-solucionan-y-ocultan-problemas"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>