<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>The Deep Web; ¿los suburbios de Internet? | Laborategia</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet"><span itemprop="headline">The Deep Web; ¿los suburbios de Internet?</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/seguridad"><img title="seguridad" alt="seguridad" src="/assets/images/labels/seguridad.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Dabid Martinez</span> en la bitácora <a href="http://laborategia.net/">Laborategia</a>, <a href="http://laborategia.net/2014/06/the-deep-web-los-suburbios-de-internet/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-06-21T12:36" itemprop="dateModified">Actualizado el sábado, 21 de junio de 2014 a las 12:36 UTC</span></div><div><span>
Etiquetado como
opinion, blog-stack, internet, en-castellano, cosas-que-hago, hackers, hackinbadakigu, privacidad, deep-web, tor, <a href="/label/seguridad"><span itemprop="articleSection">seguridad</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Cuando hablamos de la Internet profunda, hablamos a vez de un espacio mas libre, mas abierto pero no tan neutral como la Internet comercial que todas conocemos. Dicen las malas lenguas que en este espacio podremos encontrar sicarios a sueldo, venta directa de drogas, armas…, todo lo que la com&uacute;n mente podr&iacute;a tachar de deleznable. Pero mas all&aacute; de la nave del misterio y la p&aacute;ginas amarillistas que llenan nuestras televisiones,<a href="https://es.wikipedia.org/wiki/Edward_Snowden"> aunque la teor&iacute;a conspiradora suene a ciencia ficci&oacute;n</a>, hay veces en que las malas lenguas no est&aacute;n demasiado alejadas de la realidad.</p> 
<p>[blockquote source=&quot;Nietzsche&quot;]Cuando miras al abismo, el abismo tambi&eacute;n te mira a ti.[/blockquote]</p> 
<h2>Deep Web, &iquest;mito o realidad?</h2> 
<p>Lejos de las posibles conspiraciones cibern&eacute;ticas, centrarnos el art&iacute;culo en las posibilidades reales y positivas de la Deep Web.</p> 
<p>La Deep Web o Internet profunda son redes que escapan a los buscadores m&aacute;s conocidos de la superficie, de ah&iacute; su nombre. Sus p&aacute;ginas, manuales, documentos…, no est&aacute;n indexados y necesitamos usar programas espec&iacute;ficos para poder acceder a ellas. Son las bases de datos no indexadas, son redes que no quieren mantener comunicaci&oacute;n con la Internet com&uacute;n, son las entra&ntilde;as de la red, los suburbios. No se trata de un dogma de fe, algo supuesto e intangible;<strong> &iexcl;en el 2000 se hablaba de 7.500 TeraBytes de informaci&oacute;n!</strong> &iquest;Impresionados? Bien. Pues sabed que la Universidad de Berkeley, California, estima que <strong>actualmente la Internet Profunda debe tener unos 91.000 TeraBytes</strong>.</p> 
<p>Tal vez la forma m&aacute;s sencilla, aunque poco original de explicar este fen&oacute;meno, sea el iceberg. Es un excelente s&iacute;mil; claro y conciso.</p> 
<div style="width: 910px">
 <a href="http://laborategia.net/wp-content/uploads/2014/06/Deep-Web.jpg"><img src="http://laborategia.net/wp-content/uploads/2014/06/Deep-Web.jpg" alt="Explicaci&oacute;n del tama&ntilde;o de la Deep Web" width="900" height="773" /></a>
 <p>Explicaci&oacute;n del tama&ntilde;o de la Deep Web</p>
</div> 
<p>Se dice que la Deep Web no se navega, se bucea, y es com&uacute;n sentirse perdido las primeras veces; se trata de un ejercicio nuevo en un elemento conocido, y eso genera cierta confusi&oacute;n y tendencia a abandonar el intento. Los principales problemas con los que tropezamos son los siguientes: No sabemos cuales son los enlaces de inter&eacute;s ni sabemos como llegar a ellos. Tambi&eacute;n es com&uacute;n que al intentar acceder a un servicio de la Deep Web, este se encuentre ca&iacute;do, perdido o muerto. <strong>Hay que tener en cuenta que el mantenimiento de estas paginas, foros, chat, servicios…, no es tan habitual como el de una pagina web comercial</strong>, la de un peri&oacute;dico de &eacute;xito o la de un blog conocido en la Internet com&uacute;n, pero como todo en esta vida, no tenemos mas que seguir buscando, curioseando e incluso fisgando para poder encontrar cuales son esos buenos enlaces.</p> 
<h2>Ya sabemos navegar; comencemos a bucear</h2> 
<p>Cuando nos adentramos en los suburbios de nuestras ciudades, acostumbramos ha hacerlo con cautela, paseamos con alguien que conozca el terreno, por ejemplo, o al menos, buscamos informaci&oacute;n de primera mano sobre lo que pretendemos explorar. Lo mismo deber&iacute;amos hacer al entrar a la Deep Web.</p> 
<p>Son muchos los servicios y programas que nos permiten bucear por ella y aunque <a href="https://www.torproject.org/">TOR</a> es una de los mas conocidos y es sobre el que har&eacute; hincapi&eacute; en este art&iacute;culo, tambi&eacute;n es cierto que existen algunos otros y que funcionan igual de bien, o incluso mejor que TOR. Cabe mencionar tambi&eacute;n dos grandes redes que aunque menos conocidas son igual de importantes: <a href="https://freenetproject.org/?language=es">FreeNet</a> o <a href="https://geti2p.net/es/">i2p</a>. Tenemos que hacer la elecci&oacute;n correcta en base a nuestras necesidades ya que todas han sido desarrolladas con diferentes prop&oacute;sitos.</p> 
<p>Es com&uacute;n pensar, de hecho as&iacute; lo hago yo, que la idea rom&aacute;ntica y hacker del anonimato es una de las mas importantes convicciones a la hora de acceder a este tipo de redes.</p> 
<h2>TOR (The Onion Router and The onion web)</h2> 
<p>[blockquote source=&quot;Wikipedia&quot;]<strong>The Onion Router</strong>, en su forma abreviada <strong>TOR</strong>, es un proyecto cuyo objetivo principal es el desarrollo de una red de comunicaciones distribuida de baja latencia y superpuesta sobre internet en la que no se revele la identidad de los usuarios (anonimato a nivel de red) adem&aacute;s de mantener la integridad y el secreto de la informaci&oacute;n mientras esta viaja a trav&eacute;s de ella. Por este motivo se dice que esta tecnolog&iacute;a pertenece a la llamada deep web.[/blockquote]</p> 
<p>El uso de este tipo de herramientas esta bastante extendido en las activistas pol&iacute;ticas. El uso de los proxyes camufla tu rastro en Internet y adem&aacute;s te permite saltarte algunas de las restricciones que, como es bien conocido, algunos gobiernos imponen sobre la red y su uso. TOR permite preservar tu privacidad dentro de las web que visitas, permite ocultar los destinos en linea de nuestros ISPs y por &uacute;ltimo y no por ello menos importante <strong>nos permite saltarnos filtros de censura en Internet</strong>. Pero es importante saber que TOR fue dise&ntilde;ado para preservar tu privacidad en una capa de red pero no lo fue para preservarla en tus comunicaciones en linea. Por lo que no deber&iacute;a ser utilizado para enviar informaci&oacute;n a servicios web que usen una canal de comunicaci&oacute;n inseguro (http).</p> 
<p><a href="http://laborategia.net/wp-content/uploads/2014/06/TorNet.png"><img src="http://laborategia.net/wp-content/uploads/2014/06/TorNet.png" alt="TorNet" width="934" height="807" /></a></p> 
<p>TOR ofrece un software para conectarnos a los diferentes proxyes de su red. Para ello es necesario acceder a su web en la Internet comercial y descargarnos el software en forma de bundle o instalarlo en GNU/Linux usando el gestor de paquetes de nuestra distribuci&oacute;n favorita. En los dos casos se recomienda la instalaci&oacute;n del Vidalia, su panel de administraci&oacute;n, as&iacute; como Polipo, nuestro propio PROXY. Y en caso de que elijamos la segunda forma de instalaci&oacute;n tendremos que instalar el <a href="https://addons.mozilla.org/es/firefox/addon/foxyproxy-standard/">plugin ProxyFoxy para Firefox</a>, en el primer caso el navegador en formato de Bundle ya dispone de la gesti&oacute;n de proxy necesaria para red TOR usando la extensi&oacute;n de Firefox TOR Buttom.</p> 
<p>Hagamos el ejercicio de instalarlo desde nuestras fuentes ya que en el futuro nos permitir&aacute; configurar ciertos par&aacute;metros que el Bundle no (por ejemplo activar alg&uacute;n Hidden Service):</p> 
<pre>aptitude install tor tor-geoipdb vidalia polipo</pre> 
<p>Nos descargamos la configuraci&oacute;n de Polipo, para que no la tengamos que hacer nosotras mismas:</p> 
<pre>wget https://gitweb.torproject.org/torbrowser.git/blob_plain/ae4aa49ad9100a50eec049d0a419fac63a84d874:/build-scripts/config/polipo.conf
cp /etc/polipo/config{,.original}
mv polipo.conf /etc/polipo/config
service polipo restart
</pre> 
<p>Y por &uacute;ltimo reiniciamos TOR:</p> 
<pre>service tor restart</pre> 
<p>Los par&aacute;metros de configuraci&oacute;n de FoxyProxy son los siguientes:</p> 
<pre>localhost PUERTO Socket 5</pre> 
<p>Si todo ha ido bien podremos <a href="https://check.torproject.org/?lang=es_ES">ir a la web que nos permite mirar si nuestro TOR esta bien configurado</a>. En caso de que todo este correcto ya podremos hacer nuestra primera inmersi&oacute;n a UNO de los suburbios de Internet, The Onion Web.</p> 
<div style="width: 1012px">
 <a href="http://laborategia.net/wp-content/uploads/2014/06/Screenshot-Are-you-using-Tor-Mozilla-Firefox.png"><img src="http://laborategia.net/wp-content/uploads/2014/06/Screenshot-Are-you-using-Tor-Mozilla-Firefox.png" alt="Hacer click en la imagen para ver m&aacute;s grande" width="1002" height="719" /></a>
 <p>Hacer click en la imagen para ver m&aacute;s grande</p>
</div> 
<h2>The hidden services I: que podemos encontrar para garantizar nuestro anonimato</h2> 
<p>Los servicios que podremos encontrar en la Deep Web son com&uacute;nmente conocidos con Hidden Services o servicios ocultos y no van mucho mas all&aacute; de los servicios que podemos encontrar en la Internet com&uacute;n, pero tienen el a&ntilde;adido de la privacidad: foros, comercio electr&oacute;nico (donde aseguran el anonimato), bibliotecas de documentos en PDF o TXT, servidores de correo…, <strong>y sobre todo muchas cosas que tachar&iacute;amos de menos interesantes en la internet com&uacute;n</strong>, pero que aqu&iacute; adquieren el valor a&ntilde;adido de gestionar correctamente su privacidad.</p> 
<p>Una de las webs de referencia en TOR es <a href="https://es.wikipedia.org/wiki/The_Hidden_Wiki"><strong>The hiden Wiki</strong>, La wiki oculta</a>, all&iacute; con mucha frecuencia se cambian los enlaces a las webs mas comunes dentro de TOR, buscadores internos, repositorios de documentaci&oacute;n importante, enlaces a foros de inter&eacute;s…, <strong>incluso enlaces a cosas que no nos gustar&iacute;a tener que ver, lo dicho, los suburbios</strong>.</p> 
<p>Es muy conocido el mundo de los <a href="https://bitcoin.org/es/">BitCoin</a> en estos lares del ciber espacio, todo se paga con una moneda digital, global, an&oacute;nima y P2P. Esta moneda tiene buena fama dentro de todos los usuarios de este tipo de servicios y cada vez estamos viendo que llega mas arriba ya que hoy por hoy es bastante com&uacute;n encontrarnos con BitCoin en la Internet comercial. Sin entrar en mucho detalle, ya que no es el objeto del art&iacute;culo, dir&eacute; que BitCoin es una sistema de pago en la que todos los pares validan todas las transacciones que se efect&uacute;an en esa red (TODOS los pares TODAS las transacciones), incluso las que se hayan efectuado antes de que nuestra usuaria entrara en la red de BitCoin, por lo tanto tiene car&aacute;cter retroactivo. Por ello es habitual que al arrancar por primera vez el <a href="https://bitcoin.org/es/elige-tu-monedero">Wallet de BitCoin</a> tarde en dejarte hacer operaciones, ya que actualmente se descarga y valida unos 3 GB de datos.</p> 
<h2>The hidden services II: como poner en marcha nuestros propios servicios ocultos</h2> 
<p>[well]Me vais a permitir guardarme esta informaci&oacute;n para una pr&oacute;xima entrada (tengo que guardar algo en la recamara), pero prometo ense&ntilde;aros a desplegar vuestros propios Hidden Services ;-)[/well]</p> 
<h2>La guerra se activa en la deep web: #opDarknet</h2> 
<p><strong>Aunque los suburbios y el anonimato pueden ser un excelente caldo de cultivo de acciones deleznables, tambi&eacute;n se gestionan contracciones por parte de los usuarios de estos “bajos fondos”</strong>. As&iacute; pues, cuando <strong>Freedom Hosting</strong> permit&iacute;a que redes de pederastas montaran sus servicios dentro de sus servidores, <a href="https://es.wikipedia.org/wiki/Anonymous">Anonymous</a>, al igual que otros muchos, pens&oacute; que eso no se pod&iacute;a permitir y se lanz&oacute; uno de los mayores ataques colectivos que se han dado en la Internet oculta: <strong>#opDarknet</strong>.</p> 
<p>Dicha acci&oacute;n fue un &eacute;xito y cayeron servicios importantes de pederastia como lo fue <strong>TORpedo</strong>. Los integrantes de Anonymous lo comunicaron tanto en <strong>The house of anonymous</strong> como en la Internet comercial.</p> 
<p><strong>Con esto no quiero decir que todo lo que se hace en los suburbios sea bueno o sea malo, quiero decir que el anonimato y sus posibilidades son una herramienta m&aacute;s, no un modo moderno de ser impune. Nietzsche lo sab&iacute;a.</strong></p> 
<blockquote>
 <p>Solamente aquel que construye el futuro tiene derecho a juzgar el pasado.</p> 
 <p>Nietzsche</p>
</blockquote> 
<p>P.S: En un pr&oacute;ximo articulo os ense&ntilde;are a activar servicios dentro de la Deep Web <img src="http://laborategia.net/wp-includes/images/smilies/icon_wink.gif" alt=";-)" /> </p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet" st_title="The Deep Web; ¿los suburbios de Internet? | Laborategia"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/seguridad/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta seguridad</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 606,
      "url" : "http://www.blogstack.info/post/laborategia/2014/06/the-deep-web-los-suburbios-de-internet"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "laborategia",
      "name" : "Laborategia"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>