<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia"><span itemprop="headline">Ubuntu Mate 14.10: bendita nostalgia</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/ubuntu"><img title="ubuntu" alt="ubuntu" src="/assets/images/labels/ubuntu.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/12/ubuntu-mate-1410-bendita-nostalgia.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-19T11:16" itemprop="dateModified">Actualizado el viernes, 19 de diciembre de 2014 a las 11:16 UTC</span></div><div><span>
Etiquetado como
revision, mate, <a href="/label/ubuntu"><span itemprop="articleSection">ubuntu</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">La Navidad suele ser para muchas personas una &eacute;poca de a&ntilde;oranza, que aviva los recuerdos, no todos felices, por desgracia. Se echa de menos a muchos que ya emprendieron el viaje, o que se encuentran lejos por mor de las circunstancias econ&oacute;micas del tiempo que nos toc&oacute; vivir, siendo continuamente manejados por poderes econ&oacute;micos desconocidos, esos que no nos brindan ni tan siquiera la posibilidad de defendernos, aunque sea a h*****s (editado para cumplir con las leyes del pa&iacute;s de la piruleta, donde puedes acabar en la c&aacute;rcel por insultar a un futbolista millonario, mientras robar y estafar puede salir hasta gratis). S&iacute;, como suena. Pero mejor me centro, que como empiece a hablar de pol&iacute;tica (en min&uacute;sculas, por supuesto, no merecen otra cosa) me conozco y acabamos mal.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-UMZyevPZZ6k/VJLuBi37UpI/AAAAAAAAFbs/H0qCS1yKxEc/s1600/Logo%2BUbuntu%2BMate.png"><img src="http://3.bp.blogspot.com/-UMZyevPZZ6k/VJLuBi37UpI/AAAAAAAAFbs/H0qCS1yKxEc/s1600/Logo%2BUbuntu%2BMate.png" height="233" width="400" /></a>
</div>
<br />
<br />
<a></a>Retomo el hilo. Si nos ponemos nost&aacute;lgicos, en clave de GNU/Linux, algunos podemos rememorar nuestros comienzos con el sistema, si bien los m&iacute;os ya se empiezan a vislumbrar lejanos, all&aacute; por 2007 con Ubuntu Feisty Fawn. Pero si la nostalgia es de la buena, de la que se torna melancol&iacute;a, cuando echo la vista atr&aacute;s y pienso en la versi&oacute;n de Ubuntu que hizo consolidarse mi preferencia por GNU/Linux sobre Windows, entonces no veo otra cosa que Lucid Lynx. Un Gnome 2 en la c&uacute;spide de su funcionalidad y est&eacute;tica que dejaron, para tristeza de muchos, caer finalmente en la primera versi&oacute;n del a&ntilde;o 2011.
<br />
<br />Pero, como sabemos, Gnome 2 renaci&oacute; en Mate. Y &uacute;ltimamente, Ubuntu Lucid ha vuelto a cobrar vida tambi&eacute;n, con la aparici&oacute;n de una versi&oacute;n &quot;pseudo-oficial&quot; (todav&iacute;a no me ha quedado claro este punto, pues se refieren a ella en su 
<a href="https://ubuntu-mate.org/">web</a> como una versi&oacute;n comunitaria y en muchos sitios la dan como totalmente soportada por Canonical) que implementa el escritorio con nombre de yerba del Paraguay. Aprovechando esta &eacute;poca de recuerdos bonitos y esta vor&aacute;gine de instalaci&oacute;n de distros que seguramente no me conduce a nada bueno, he puesto el punto de mira en este nuevo sabor de Ubuntu. Veamos lo que me he encontrado.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />La cl&aacute;sica de Ubuntu, eso s&iacute;, en tonos verdes y azulados que combinan a la perfecci&oacute;n con las se&ntilde;as de identidad de Mate. L&aacute;stima que la presentaci&oacute;n aparezca por entero en ingl&eacute;s, si bien el resto de aspectos de la instalaci&oacute;n se encuentran en espa&ntilde;ol. El reinicio nos conduce a un precioso grub tematizado (bien har&iacute;an otras distros en copiar este punto) que reconoce a Chakra y a Windows 7. Tras las consabidas actualizaciones autom&aacute;ticas de rigor, vuelvo a reiniciar y ya est&aacute; todo hecho.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-Mft8V0DUcCE/VJLuPGl9IaI/AAAAAAAAFb0/LdiXtXAqpsw/s1600/Pantallazo.png"><img src="http://2.bp.blogspot.com/-Mft8V0DUcCE/VJLuPGl9IaI/AAAAAAAAFb0/LdiXtXAqpsw/s1600/Pantallazo.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />Esperaba algo m&aacute;s de rapidez al iniciar, pero 35 segundos sigue suponiendo un buen guarismo. El apagado se ejecuta en 5.
<br />
<br />
<b>Software</b>
<br />Voy a ser breve con esta revisi&oacute;n, en general, pues a Ubuntu ya de sobra la conocemos. Su sabor a yerba mate no cambia demasiado algunas cosas, de modo que disponemos del mismo centro de gesti&oacute;n de programas que la versi&oacute;n principal. Tambi&eacute;n se producen algunos errores... como el que me arroj&oacute; la primera ejecuci&oacute;n de Grub-customizer. Pero no creo que algo as&iacute; se tenga que apuntar en el debe de Ubuntu Mate, adem&aacute;s de que no recuerdo m&aacute;s problemas en toda la experiencia de uso.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-YDMSCACdg_U/VJLuak7vprI/AAAAAAAAFb8/6yZS4n0vji4/s1600/Pantallazo-5.png"><img src="http://1.bp.blogspot.com/-YDMSCACdg_U/VJLuak7vprI/AAAAAAAAFb8/6yZS4n0vji4/s1600/Pantallazo-5.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Hardware</b>
<br />Lo de siempre: una utilidad de impresoras que no me sirve para instalar los controladores de la HP Laserjet 1018. O, para ser m&aacute;s exactos, que los instala pero &eacute;sta no funciona ni a tiros. Menos mal que est&aacute; hp-setup para acudir al rescate. Esc&aacute;ner, webcam y tarjeta inal&aacute;mbrica, sin incidencias.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-1TwBQ7QeGsU/VJLunYiY9XI/AAAAAAAAFcE/fFFVUQS1OEw/s1600/Pantallazo-9.png"><img src="http://2.bp.blogspot.com/-1TwBQ7QeGsU/VJLunYiY9XI/AAAAAAAAFcE/fFFVUQS1OEw/s1600/Pantallazo-9.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Conectividad</b>
<br />&Eacute;rase una vez un usuario de GNU/Linux que no era capaz de emplear Samba para conectarse con su port&aacute;til de Windows. Distro tras distro, ten&iacute;a que soportar con desgana el sempiterno mensajito, siempre algo parecido a: &quot;Imposible obtener la lista de compartici&oacute;n del servidor&quot;. Empiezo a estar algo paranoico con este tema, a decir verdad. De hecho, estoy por culpar bien a Windows, que en alguna actualizaci&oacute;n se haya cambiado alg&uacute;n par&aacute;metro que impide ser visto por Samba, o bien a mi router, de una compa&ntilde;&iacute;a francesa que me est&aacute; dando un servicio infame y de la que estoy deseando poder librarme en cuanto esa cadena al cuello llamada &quot;compromiso de permanencia&quot; finalice. S&iacute;, hablo de Orange, maldita sea la hora en que se me ocurri&oacute; contratar sus servicios y su ADSL lleno de cortes sin soluci&oacute;n. Nunca hubo un eslogan publicitario m&aacute;s acertado en la historia de la televisi&oacute;n: &quot;tu vida cambia con Orange&quot;. Ya lo creo que cambia, amigos...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-PA9JZqXyYQg/VJLu3um6vlI/AAAAAAAAFcM/o0KCPZzoK4k/s1600/Pantallazo-10.png"><img src="http://3.bp.blogspot.com/-PA9JZqXyYQg/VJLu3um6vlI/AAAAAAAAFcM/o0KCPZzoK4k/s1600/Pantallazo-10.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />Vaya, he vuelto a mis desvar&iacute;os. El caso es que hay dos variables que han cambiado en las revisiones de este a&ntilde;o con respecto al anterior: el router y la versi&oacute;n de Samba. Dicho de otro modo, cuando la mayor&iacute;a de distribuciones que probaba lograban realizar con &eacute;xito la tarea de conectar al port&aacute;til con Windows, estaba empleando un router diferente y una versi&oacute;n de Samba diferente. Y, como os dec&iacute;a, empiezo a pensar que el problema no se encuentra en GNU/Linux. Investigar&eacute;, lo prometo.
<br />
<br />En cuanto a reconocimiento y tiempos de acceso a los dispositivos externos, todo bien. En Ubuntu sigo consiguiendo las copias de archivo m&aacute;s r&aacute;pidas, en general. No s&eacute; por qu&eacute;, pero as&iacute; es.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-jGKVznacrWs/VJLvE_CDg1I/AAAAAAAAFcY/_Y83PMlr3Ik/s1600/Pantallazo-11.png"><img src="http://3.bp.blogspot.com/-jGKVznacrWs/VJLvE_CDg1I/AAAAAAAAFcY/_Y83PMlr3Ik/s1600/Pantallazo-11.png" height="320" width="400" /></a>
</div>
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />A excepci&oacute;n de un fichero comprimido con extensi&oacute;n &quot;rar&quot;, todo aquello que intent&eacute; ver o reproducir desde el inicio con Ubuntu Mate lo logr&eacute; hacer sin mayores inconvenientes. Es decir, una experiencia de uso de primera categor&iacute;a.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-vHyGyBSYQJE/VJLvMgqUNdI/AAAAAAAAFcg/X_0zynAoRhY/s1600/Pantallazo-12.png"><img src="http://2.bp.blogspot.com/-vHyGyBSYQJE/VJLvMgqUNdI/AAAAAAAAFcg/X_0zynAoRhY/s1600/Pantallazo-12.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Estabilidad</b>
<br />Un peque&ntilde;o error, ya comentado, al cerrar Grub customizer es todo lo que puedo recalcar como negativo en esta distro. Ni cuelgues, ni reinicios, ni extra&ntilde;os comportamientos (&iexcl;ay, 
<a href="http://www.lasombradelhelicoptero.com/2014/12/linux-mint-171-rebecca-triste-regresion.html">Rebeca</a>!) que se&ntilde;alar.
<br />
<br />
<b>Fluidez</b>
<br />Como toda distro tiene su punto d&eacute;bil, voy a contaros cu&aacute;l me ha parecido el de &eacute;sta. Y, sorprendentemente, se nota un cierto retardo al cerrar algunas ventanas, as&iacute; como al cargar los iconos en el men&uacute; del sistema (en especial los de Libreoffice). Sin que ello lastre la experiencia en demas&iacute;a, s&iacute; tengo que reconocer que no me lo esperaba en un escritorio como Mate.
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Este tema representa otro de mis bucles actuales. AMD no me deja, con sus lamentables controladores propietarios, que suspenda o hiberne mi equipo. A m&iacute; me da igual, porque no hago ni lo uno ni lo otro, pero a quien le interesen estas opciones ya sabe qu&eacute; hardware no debe comprar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-kq-NSG1Rs6M/VJLvWysAvsI/AAAAAAAAFco/8It8wmBamcQ/s1600/Pantallazo-13.png"><img src="http://4.bp.blogspot.com/-kq-NSG1Rs6M/VJLvWysAvsI/AAAAAAAAFco/8It8wmBamcQ/s1600/Pantallazo-13.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Rendimiento</b>
<br />Se da la circunstancia de que la distribuci&oacute;n empleada para comparar en nuestro sistema de calificaciones no es otra que Ubuntu 14.04. Hab&iacute;a que elegir alguna, pues un &quot;benchmark&quot; no son m&aacute;s que un mont&oacute;n de n&uacute;meros sin sentido cuando se carece de alg&uacute;n otro sistema al que equipararlo. Es por ello que este apartado ten&iacute;a para m&iacute; un inter&eacute;s doble: comprobar las mejoras entre las versiones 14.04 y 14.10 de Ubuntu, al mismo tiempo que poder medir cu&aacute;n pesado es Unity con respecto a Mate. Pues resulta que la LTS gana en la mayor&iacute;a de puntos, con especial holgura en el tiempo de transferencia al &quot;pendrive&quot; y, lo que resulta m&aacute;s sorprendente a&uacute;n, en el &quot;benchmark&quot; de rendimiento de gr&aacute;ficos 3D.
<br />
<b> </b>
<br />Aunque, si lo pensamos, existe la remot&iacute;sima posibilidad (estoy siendo ir&oacute;nico, de nuevo) de que los controladores propietarios de AMD vayan cada vez a peor. No, no creo que sea eso...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-mNZ-yYIaV2g/VJLvdd9iDoI/AAAAAAAAFcw/64xf0xBuLi0/s1600/Pantallazo-14.png"><img src="http://3.bp.blogspot.com/-mNZ-yYIaV2g/VJLvdd9iDoI/AAAAAAAAFcw/64xf0xBuLi0/s1600/Pantallazo-14.png" height="320" width="400" /></a>
</div>
<br />Bueno, me pongo serio para concluir el art&iacute;culo, algo m&aacute;s &aacute;cido de lo habitual. Espero que sep&aacute;is disculparme, pero hacer revisiones una tras otra, todas en el mismo tono, aburre hasta a las ovejas. Y con esta Ubuntu Mate, la verdad es que he disfrutado bastante. Digamos que se trata de aquel Ubuntu que se fue y que jam&aacute;s volver&aacute;, al que muchos que no se sienten c&oacute;modos con los paradigmas de escritorio actuales no dudar&aacute;n en regresar, ahora que se les ofrece la oportunidad.
<br />
<br />&iquest;Qu&eacute; destacar de Ubuntu Mate? A m&iacute; me ha gustado mucho la est&eacute;tica, con unos tonos de colores acertados y un fondo de escritorio muy bonito para mi gusto. Se nota, adem&aacute;s, que Mate est&aacute; avanzando en el buen sentido, con la desaparici&oacute;n de algunos errores que sol&iacute;an dejarse ver por versiones pret&eacute;ritas. Sobre si merece la pena otra versi&oacute;n m&aacute;s de Ubuntu cuando ya tenemos Linux Mint, cuyo equipo se dedica a colaborar m&aacute;s que ninguno con los desarrolladores de Mate... no lo s&eacute;. Cansados estamos de decir que la libertad de elecci&oacute;n es inherente a GNU/Linux, y estamos ante una prueba m&aacute;s.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-7Yrbb_az5BI/VJLwE7HgM5I/AAAAAAAAFc8/xN9ctUePii8/s1600/Pantallazo-6.png"><img src="http://3.bp.blogspot.com/-7Yrbb_az5BI/VJLwE7HgM5I/AAAAAAAAFc8/xN9ctUePii8/s1600/Pantallazo-6.png" height="320" width="400" /></a>
</div>
<br />Me ha encantado volver a usar Mate y recordar viejos y buenos tiempos &quot;gnomeros&quot; (mi 
<a href="http://www.lasombradelhelicoptero.com/2012/06/mi-experiencia-con-solusos-11-eveline.html">SolusOS</a>, mi Debian Squeeze...) Faltar&iacute;a una comparativa con la &uacute;ltima versi&oacute;n de Mint que implementa el mismo escritorio. A ver si me pongo a ello. De momento, os dejo esta muy buena distribuci&oacute;n que punt&uacute;a 7'76 y nos devuelve a los d&iacute;as en que Gnome 2 era el rey y los escritorios ten&iacute;an un corte tradicional centrado en la productividad y sin tantas zarandajas. A algunos nos bastaba y nos sobraba.
<br />
<br />Salud 
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>Ubuntu Mate 14.10</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>8,13</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>9'17</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>8'75</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>2.972</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>17.057,52</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>13,15</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,39</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>438</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.956</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.896</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>4,31</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,03</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>4,55</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-0,61</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>0,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>7,76</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia" st_title="Ubuntu Mate 14.10: bendita nostalgia | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/ubuntu/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta ubuntu</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2014
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1245,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/ubuntu-mate-14-1-bendita-nostalgia"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>