<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Fedora 21: "déjà vu" | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu"><span itemprop="headline">Fedora 21: "déjà vu"</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/gnome"><img title="gnome" alt="gnome" src="/assets/images/labels/gnome.png"/></a><a class="label" href="/label/fedora"><img title="fedora" alt="fedora" src="/assets/images/labels/fedora.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/12/fedora-21-deja-vu.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-17T09:29" itemprop="dateModified">Actualizado el miércoles, 17 de diciembre de 2014 a las 09:29 UTC</span></div><div><span>
Etiquetado como
revision, <a href="/label/fedora"><span itemprop="articleSection">fedora</span></a>, <a href="/label/gnome"><span itemprop="articleSection">gnome</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Si por algo se caracteriza la estaci&oacute;n del a&ntilde;o en la que nos hallamos ahora mismo es por desatarse la fiebre de los lanzamientos en el mundo de Tux. Casualidad o no, que no lo tengo yo tan claro, el caso es que esta vor&aacute;gine de &quot;versionitis&quot; de periodicidad anual empieza despertando en m&iacute; el deseo de probar y degustar tanto sabor que se nos ofrece, para acabar, de manera invariable, en el hartazgo, la monoton&iacute;a y la sensaci&oacute;n de estar dando vueltas sobre sistemas que son, en suma, pr&aacute;cticamente lo mismo en cuanto a virtudes y defectos. Si acaso, lo que s&iacute; supone alguna diferencia es el rendimiento que da cada cual en mi sistema. Pero poco m&aacute;s all&aacute; de esta cuesti&oacute;n, el resto de aspectos resultan tan repetitivos que uno parece revivir una y otra vez lo mismo.
<br />
<br />
<div style="clear: both; text-align: center;"></div>
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-3fI_1uajpQQ/VJAhn8byD_I/AAAAAAAAFbc/LOlGSUXWVYU/s1600/Logo%2BFedora.png"><img src="http://3.bp.blogspot.com/-3fI_1uajpQQ/VJAhn8byD_I/AAAAAAAAFbc/LOlGSUXWVYU/s1600/Logo%2BFedora.png" height="214" width="320" /></a>
</div>
<br />
<br />
<a></a>Cuando el que realiza la revisi&oacute;n no disfruta, existen muchas probabilidades de que el art&iacute;culo resultante tampoco invite al goce. Os pido disculpas de antemano si os parece que el espacio dedicado a Fedora, insigne distribuci&oacute;n que sirve de conejillo de indias a Red Hat, es escaso o carente de excesivo entusiasmo. Pero ya os digo que cansa encontrar los mismos errores en todas las distribuciones, y tener que volver a repetir los consabidos argumentos en contra de AMD, mi sistema, Samba, mi impresora, etc&eacute;tera, etc&eacute;tera. Comprendo que a la gran mayor&iacute;a todo ello os importe un pimiento, en especial a aquellos que usan Fedora y les va de cine. Pero una revisi&oacute;n es una revisi&oacute;n, de modo que os contar&eacute; c&oacute;mo me fue con Fedora 21, a punto de cumplirse dos a&ntilde;os desde la &uacute;ltima 
<a href="http://www.lasombradelhelicoptero.com/2013/02/fedora-18-fue-bonito-mientras-duro.html">serie</a> 
<a href="http://www.lasombradelhelicoptero.com/2013/02/reintentando-con-fedora.html">de</a> 
<a href="http://www.lasombradelhelicoptero.com/2013/02/fedora-18-kde-notablemente-mejor.html">art&iacute;culos</a> que dediqu&eacute; a la misma. La versi&oacute;n explorada ha sido la recomendada para equipos de sobremesa y port&aacute;tiles, denominada Fedora Workstation. El escritorio, como no pod&iacute;a ser de otra forma trat&aacute;ndose de esta distribuci&oacute;n, es Gnome 3.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Si bien la sesi&oacute;n de escritorio en vivo ha de desarrollarse por entero en ingl&eacute;s, a la hora de instalar podemos escoger nuestro idioma. El instalador de Fedora posee una serie de caracter&iacute;sticas y un aspecto &uacute;nicos, sobre todo en la parte referente al particionado del disco. Se nota que la intenci&oacute;n de los creadores es facilitar la tarea, un poco en la l&iacute;nea de lo que ofrece Gnome 3. Pero, de modo parecido a lo que ocurre con el escritorio, aquellos no acostumbrados a esta forma de hacer las cosas van a encontrar esta parte de la instalaci&oacute;n m&aacute;s complicada, lo que viene siendo lograr lo contrario del objetivo que se persegu&iacute;a. En mi caso particular, el particionador me obliga a estar m&aacute;s pendiente de lo habitual, pues no parece claro en determinados momentos qu&eacute; se va a formatear y qu&eacute; no, qu&eacute; se monta y qu&eacute; no.
<br />
<b> </b>
<br />Cuesti&oacute;n de habituarse, supongo. Al menos, mirado desde el punto de vista de los usuarios poco avezados en la materia, existe la posibilidad de optar por el particionado autom&aacute;tico. La secuencia de im&aacute;genes que acompa&ntilde;a al proceso de instalaci&oacute;n es sencilla, pero refrescante, pues tambi&eacute;n se aleja de lo tradicional para ofrecernos l&iacute;neas modernas, con colores claros y distintivos, incluyendo el &iquest;perrito caliente? que aparece junto al enlace que invita a colaborar con la distribuci&oacute;n de Red Hat. Aun no entendiendo muy bien la relaci&oacute;n entre las salchichas y los sombreros tipo Fedora, queda result&oacute;n y divertido.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-vzlll3M5eck/VJAe2E4JLHI/AAAAAAAAFaE/zcXPf3R79eI/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A50%3A16.png"><img src="http://1.bp.blogspot.com/-vzlll3M5eck/VJAe2E4JLHI/AAAAAAAAFaE/zcXPf3R79eI/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A50%3A16.png" height="320" width="400" /></a>
</div>
<br />Tras reiniciar, un grub de texto plano que se podr&iacute;a adecentar un poco m&aacute;s nos da la bienvenida. Todos los sistemas reconocidos y funcionando, mi capit&aacute;n. El escritorio Gnome, en versi&oacute;n 3.14, comienza su sesi&oacute;n con una serie de pantallas de configuraci&oacute;n y ayuda para aquellos poco familiarizados con la forma de hacer las cosas un tanto especial que caracteriza a las versiones modernas del popular entorno. V&iacute;deos incluidos, todo hay que decirlo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-t7lE2zLp1NY/VJAe-wMUrOI/AAAAAAAAFaM/uyHhv4a61E8/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A53%3A59.png"><img src="http://4.bp.blogspot.com/-t7lE2zLp1NY/VJAe-wMUrOI/AAAAAAAAFaM/uyHhv4a61E8/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A53%3A59.png" height="320" width="400" /></a>
</div>
<br />El aspecto general es de un Gnome bastante &quot;vanilla&quot;, algo que se antoja hasta l&oacute;gico, siendo Red Hat uno de los principales valedores del escritorio. Si queremos modificar alg&uacute;n aspecto del grub en modo gr&aacute;fico, como es habitual, hay que tirar de programas externos como grub-customizer, el cual, en su versi&oacute;n para Fedora logr&eacute; localizar en el genial buscador 
<a href="http://www.rpmfind.net/">rpmfind</a>.
<br />
<br />
<b>Arranque y apagado</b>
<br />Un tiempo de encendido normal, de 40 segundos, y uno de apagado que supone un r&eacute;cord hasta ahora: 3 segundos. Menos, creo, es imposible salvo que se corte la corriente...
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de software</b>
<br />Me ha gustado la integraci&oacute;n del instalador de paqueter&iacute;a con el escritorio, a lo Ubuntu con Unity, esto es, que permite introducir cualquier programa en el campo de b&uacute;squeda, dando como resultado el enlace para iniciarlo cuando ya est&aacute; instalado, o la posibilidad de descargarlo y a&ntilde;adirlo a nuestro sistema cuando todav&iacute;a no lo est&aacute;. Es algo que puede parecer trivial, pero facilita y mucho la tarea de instalar programas que para los reci&eacute;n llegados a GNU/Linux no son conocidos. Me quito el sombrero (rojo) ante esta caracter&iacute;stica.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-h_oexZX9eR0/VJAfNIwOiBI/AAAAAAAAFaU/Z5HiaM-RG_U/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A50%3A28.png"><img src="http://4.bp.blogspot.com/-h_oexZX9eR0/VJAfNIwOiBI/AAAAAAAAFaU/Z5HiaM-RG_U/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A50%3A28.png" height="320" width="400" /></a>
</div>
<br />&iquest;Qu&eacute; programas nos entrega Fedora por defecto? Firefox, Libreoffice, Rhythmbox, V&iacute;deos, Shotwell... lo cl&aacute;sico, que si funciona, no tiene sentido cambiarlo. Y una peculiaridad referida a las actualizaciones que me resulta molesta: en cierta ocasi&oacute;n, cuando fui a reiniciar, el sistema me inform&oacute; de la existencia de las mismas, dispuestas para ser aplicadas, al m&aacute;s puro estilo de Windows. Reinici&eacute;, apareci&oacute; el &quot;Installing updates...&quot; y... &iexcl;volvi&oacute; a reiniciar! Lo dicho, estilo Redmond.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-YXVaGToAXdc/VJAfXK0ZslI/AAAAAAAAFac/nQbmcw6qylg/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B10%3A35%3A48.png"><img src="http://2.bp.blogspot.com/-YXVaGToAXdc/VJAfXK0ZslI/AAAAAAAAFac/nQbmcw6qylg/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B10%3A35%3A48.png" height="320" width="400" /></a>
</div>
<br />
<b>Reconocimiento de hardware</b>
<br />Podr&iacute;a hacer un &quot;copia y pega&quot; de todas mis &uacute;ltimas revisiones. Resumiendo la experiencia: uno intenta instalar la HP Laserjet 1018 con la utilidad entregada para tal efecto por el sistema, de nombre &quot;Impresoras&quot;. Se instala y no imprime. A continuaci&oacute;n, se busca la utilidad gr&aacute;fica de HP y se instala: la b&uacute;squeda del &quot;plugin&quot; no concluye nunca y tengo que matar el proceso. Finalmente, intento hacerlo desde consola con &quot;hp-setup&quot;. Se instala, pero sigue sin imprimir, aun mediando un reinicio. La utilidad de diagn&oacute;stico de HP me muestra que faltan gran cantidad de paquetes por instalar y recomienda deshabilitar &quot;SELinux&quot;. &iquest;Por qu&eacute;, entonces, da la impresora por bien instalada? Total, resultado final: cero, nada, &quot;niente&quot;.
<br />
<b> </b>
<br />Tambi&eacute;n es justo mencionar, por supuesto, que la webcam y el esc&aacute;ner, as&iacute; como mi tarjeta de red inal&aacute;mbrica van perfectas desde el inicio.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-RlnLqnDuILk/VJAfjtT4NoI/AAAAAAAAFak/OZGDEvwIPOQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A49%3A56.png"><img src="http://4.bp.blogspot.com/-RlnLqnDuILk/VJAfjtT4NoI/AAAAAAAAFak/OZGDEvwIPOQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A49%3A56.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Venga, &iquest;hacemos otro &quot;copia y pega&quot;? Samba sigue diciendo que no, que no se conecta al port&aacute;til con Windows y eso es lo que hay. En los tiempos de acceso a dispositivos externos se produce un incremento preocupante, destacando los m&aacute;s de siete minutos que tard&eacute; en copiar los 1'7 Gb de la iso de Chakra a la tarjeta de memoria. &iquest;Por qu&eacute; este rendimiento tan paup&eacute;rrimo?
<br />
<b> </b>
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />Sin ser de las peores, Fedora tampoco es la mejor en este aspecto. De inicio ya s&eacute;, aunque un usuario novel no tiene por qu&eacute; saberlo, que se va a necesitar al menos un repositorio adicional a los instalados de serie: el archiconocido &quot;RPMFusion&quot;. De no instalarse &eacute;ste, los intentos de las aplicaciones multimedia por encontrar &quot;codecs&quot; para reproducir archivos ser&aacute;n infructuosos. A pesar de todo, si no a&ntilde;adimos dicho repositorio todav&iacute;a seremos capaces de reproducir algunos de los formatos m&aacute;s populares, como &quot;.avi&quot; o &quot;.dv&quot;. Pero si queremos la funcionalidad completa, que es lo habitual, hay que optar por RPMFusion s&iacute; o s&iacute;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-ej8PDTkqsjY/VJAfv2_DE1I/AAAAAAAAFas/XNEk-8KgSj0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A36.png"><img src="http://1.bp.blogspot.com/-ej8PDTkqsjY/VJAfv2_DE1I/AAAAAAAAFas/XNEk-8KgSj0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A36.png" height="320" width="400" /></a>
</div>
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-oqzF3Z_3vLU/VJAf1ZD845I/AAAAAAAAFa0/PJ07NW2B2BE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A41.png"><img src="http://2.bp.blogspot.com/-oqzF3Z_3vLU/VJAf1ZD845I/AAAAAAAAFa0/PJ07NW2B2BE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A41.png" height="320" width="400" /></a>
</div>
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-9Et7M5LcYcI/VJAf5fa-wGI/AAAAAAAAFa8/T3h78CDiktY/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A44.png"><img src="http://4.bp.blogspot.com/-9Et7M5LcYcI/VJAf5fa-wGI/AAAAAAAAFa8/T3h78CDiktY/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A51%3A44.png" height="320" width="400" /></a>
</div>
<br />Lo extra&ntilde;o, como se aprecia en las capturas de arriba, es que el sistema informa de los paquetes que se necesitan, pero a la hora de instalarlos los reconoce como si ya estuvieran en el sistema. Todo ello, repito, sin haber a&ntilde;adido el repositorio de RPMFusion.
<br />
<br />Intent&eacute; tambi&eacute;n hacer uso de la utilidad que recomienda Tannhausser en su 
<a href="http://lamiradadelreplicante.com/2014/12/11/fedy-una-excelente-herramienta-para-tunear-fedora/">art&iacute;culo</a> dedicado a la misma: Fedy. Cuando lo le&iacute; me pareci&oacute; que es justamente lo que le falta a Fedora, o m&aacute;s bien, aquello que no puede incluir por razones de espacio o de licencias. Pero el &quot;script&quot; anteriormente conocido como Fedora Utils todav&iacute;a no se encuentra disponible para esta versi&oacute;n, y mis intentos de emplearlo terminaron con la cancelaci&oacute;n por mi parte del proceso, toda vez que pretend&iacute;a a&ntilde;adir repositorios de la versi&oacute;n 20, algo que no creo que sea recomendable para el sistema, la verdad.
<br />
<br />
<b>Estabilidad</b>
<br />Muchas de las cr&iacute;ticas que sus detractores hacen a Fedora se refieren a este aspecto, ya que se trata de una distribuci&oacute;n que suele estar a la &uacute;ltima y ello entra&ntilde;a sus riesgos. En el tiempo de uso, corto eso s&iacute;, no he tenido que lamentar fallos de estabilidad o cuelgues de aplicaciones, por lo que mi experiencia en este apartado es altamente positiva.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-VM-IehSh0mY/VJAgoVrLtRI/AAAAAAAAFbM/UmI1983Pv2g/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A49%3A09.png"><img src="http://3.bp.blogspot.com/-VM-IehSh0mY/VJAgoVrLtRI/AAAAAAAAFbM/UmI1983Pv2g/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A49%3A09.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Fluidez</b>
<br />Las nuevas versiones de Gnome 3 se mueven perfectamente en mi sistema, sin sensaci&oacute;n de pesadez ni &quot;lags&quot; que se&ntilde;alar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-mIxkce62_js/VJAgcy1I5qI/AAAAAAAAFbE/iBDEveBqeW0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A56%3A07.png"><img src="http://2.bp.blogspot.com/-mIxkce62_js/VJAgcy1I5qI/AAAAAAAAFbE/iBDEveBqeW0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A56%3A07.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Lamentablemente no encontr&eacute; la manera de habilitar las opciones de suspensi&oacute;n e hibernaci&oacute;n, pues me fue imposible instalar los controladores privativos. En ausencia de un repositorio con los Catalyst para Fedora 21, trat&eacute; de hacerlo a las bravas y compilarlos con la utilidad que AMD pone a nuestra disposici&oacute;n en su web. Ni que decir tiene que fue un fracaso rotundo que me oblig&oacute; a reinstalar Fedora, pues ni consegu&iacute; iniciar al entorno gr&aacute;fico ni arreglar el tremendo desaguisado que yo mismo hab&iacute;a creado. &iquest;Mensajes de error? Pues en concreto, tras la instalaci&oacute;n del controlador propietario, uno que rezaba &quot;DKMS part of installation failed&quot;. Inquietante, tanto que ya me imaginaba que el posterior reinicio acabar&iacute;a en tragedia. Y as&iacute; fue en todos mis intentos, con los dos kernels (el de serie y el actualizado) y el modo de recuperaci&oacute;n. Un &quot;a reinstalar se ha dicho&quot; de manual.
<br />
<b> </b>
<br />
<b>Rendimiento</b>
<br />Tengo poca experiencia con Fedora, de modo que no soy capaz de explicar el resultado tan pobre de las pruebas de rendimiento de Phoronix en mi sistema, al igual que tampoco tengo idea del porqu&eacute; de los tiempos tan alargados de copia al &quot;pendrive&quot; y la tarjeta de memoria. Como es costumbre (la excepci&oacute;n fue 
<a href="http://www.lasombradelhelicoptero.com/2014/12/kaos-fiel-sus-principios.html">KaOS</a>), los controladores libres no me permiten correr el &quot;benchmark&quot; de rendimiento gr&aacute;fico Unigine Valley, de modo que he tenido que obviar esa parte de las pruebas.
<br />
<br />Esta revisi&oacute;n puede que no guste demasiado a los felices usuarios de Fedora. Ya lo siento, pero as&iacute; son las cosas y esto es lo que la distro precursora de RHEL me ofrece a m&iacute;, con mi hardware y mis configuraciones particulares. Aspectos positivos, pues s&iacute; que los tiene: un Gnome de serie que har&aacute; las delicias de los muchos admiradores del escritorio de la huella y una gran base de usuarios a los que preguntar y a quienes acudir en busca de ayuda. As&iacute; mismo, gustar&aacute; a todos a los que les gusta estar a la &uacute;ltima, y como muestra un bot&oacute;n: ofrece la posibilidad de iniciar sesi&oacute;n utilizando Wayland. Ah&iacute; es nada.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-p4MC-YFyKvQ/VJAhCW9E9bI/AAAAAAAAFbU/1RPC4JSKjmQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A19%3A02.png"><img src="http://4.bp.blogspot.com/-p4MC-YFyKvQ/VJAhCW9E9bI/AAAAAAAAFbU/1RPC4JSKjmQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-15%2B12%3A19%3A02.png" height="320" width="400" /></a>
</div>
<br />&iquest;Puntos negativos? No estoy muy seguro de qu&eacute; parte de la problem&aacute;tica actual de mi equipo en GNU/Linux puede achacarse a Fedora, visto el resultado de las &uacute;ltimas revisiones. Pareciera que voy retrocediendo cual cangrejo, y que las nuevas versiones de paquetes causan regresiones en lugar de avances. Pero eso no explica el asunto del rendimiento, m&aacute;xime cuando la siguiente revisi&oacute;n (estoy &quot;on fire&quot;, literalmente), se ha comportado mucho mejor a todos los niveles. Ello me lleva a concluir, y sigo insistiendo en que lo lamento, que Fedora est&aacute; bastante por detr&aacute;s en desempe&ntilde;o de otros sistemas ya analizados aqu&iacute;. Si le unimos esa extra&ntilde;a sensaci&oacute;n de vivir siempre al filo de la navaja con las constantes actualizaciones de paquetes de importancia cr&iacute;tica, tenemos que reconocer que Fedora no es una distribuci&oacute;n que uno se aventure a recomendar a la ligera para usuarios noveles. Esa es mi opini&oacute;n y as&iacute; os la cuento.
<br />
<br />Y en resumidas cuentas, que siguen existiendo distribuciones que no casan demasiado bien con seg&uacute;n qu&eacute; equipos. Lo m&iacute;o con Fedora, lo tengo m&aacute;s que asumido, tiene poco arreglo.
<br />
<br />Salud
<br />
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>Fedora 21</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>5,83</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.775</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>11.747,67</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>13,40</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>18,70</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.761</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.807</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>5,46</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,07</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>7,25</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-1,17</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>0,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>7,17</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu" st_title="Fedora 21: &quot;déjà vu&quot; | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/fedora/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta fedora</a></li><li><a href="/label/gnome/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta gnome</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1235,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/fedora-21-deja-vu"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>