<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Speed in software development | Cuaderno de software</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/cuadernodesoftware/2014/08/speed-in-software-development"><span itemprop="headline">Speed in software development</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/desarrollo-de-software"><img title="desarrollo-de-software" alt="desarrollo-de-software" src="/assets/images/labels/desarrollo-de-software.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Luis Artola</span> en la bitácora <a href="http://www.programania.net/">Cuaderno de software</a>, <a href="http://www.programania.net/diseno-de-software/speed-in-software-development/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-08-01T06:27" itemprop="datePublished">Publicado el viernes, 01 de agosto de 2014 a las 06:27 UTC</span></div><div><span>
Etiquetado como
<a href="/label/desarrollo-de-software"><span itemprop="articleSection">desarrollo-de-software</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><strong>Disclaimer</strong>: he escrito un resumen a mi bola de un superart&iacute;culo que he le&iacute;do&nbsp;<a href="http://www.targetprocess.com/articles/speed-in-software-development.html">http://www.targetprocess.com/articles/speed-in-software-development.html</a></p> 
<h2>Sprint, Marathon and intervals</h2> 
<ul> 
 <li><strong>Extreme Sprint</strong>: no dormir, cafeina a tope. Puedes aguantar un mes empezando a hacer da&ntilde;o a tu salud. M&aacute;s, si la sacrificas completamente.</li> 
 <li><strong>Moderate Sprint</strong>: 8-10 horas diarias. Siempre se anda tarde. Trabajo aburrido. Se puede aguantar a&ntilde;os, la productividad va disminuyendo pero nadie se da cuenta.</li> 
 <li><strong>Marathon</strong>: 6-8 horas diarias. Tiempo para deporte, familia y amigos. Tiempo para pensar en profundidad en los problemas. Rara vez ocurre, normalmente los managers quieren m&aacute;s y lo intentan conseguir de maneras est&uacute;pidas como empujar tareas, “somos h&eacute;roes” &nbsp;y sobretrabajo.</li> 
 <li><strong>Intervalos</strong>: mezcla de&nbsp;marathon and “fast pace sprint”.</li> 
</ul> 
<p><strong>Fast pace sprint</strong>: nada de reuniones sobre el futuro, formaciones, actividades de recursos humanos, etc… s&oacute;lo entregar, probar&nbsp;y documentar c&oacute;digo.</p> 
<h2>Software Speed Model</h2> 
<p><img src="http://www.targetprocess.com/articles/img/speed/map2.jpg" alt="" width="803" height="517" /> <strong>Verde</strong>: aumenta la velocidad. <strong>Rojo</strong>, la disminuye. <strong>Amarillo: existen l&iacute;mites.</strong> <strong>Flecha verde</strong>: aumenta el efecto. <strong>Fecha roja</strong>: disminuye el efecto.</p> 
<h2>Skill and Experience</h2> 
<p>Aumentar las habilidades de los desarrolladores disminuye la complejidad del sistema. La posibilidad de contratar gente ya formada es limitada. La posibilidad de contratar gente y hacerla crecer no. Contrata a gente a la que le guste aprender nuevas cosas. Ayuda a la gente a aprender. Opciones:</p> 
<ul> 
 <li>compra libros</li> 
 <li>envia a conferencias</li> 
 <li>monta una conferencia</li> 
 <li>da tiempo para aprender nuevas cosas (80-20, learning fridays, etc….)</li> 
 <li>proyectos personales, coursera, leer art&iacute;culos</li> 
</ul> 
<p>Trabajar un 20% menos a la semana implica bajar la velocidad. &iquest;Importa? En modo marathon no. En modo sprint s&iacute;. Hay que ver cuando te lo puedes permitir.</p> 
<h3>Ayuda a la gente a entender mejor el dominio</h3> 
<p>Evitar que el desarrollador implemente cosas ciegamente sin entederlas. Ayuda a evitar re-work. Ayuda a detectar con mayor rapidez malas soluciones.</p> 
<h3>Experiencia</h3> 
<p>No es lo mismo gente con a&ntilde;os de experiencia que gente experta en algo (con la habilidad para algo).&nbsp;<strong>La clave de la velocidad es la habilidad (skill).</strong> Si tienes mucha experiencia en habilidades&nbsp;irrelevantes, no sirve. De todas formas, un developer con 20 a&ntilde;os de experiencia, normalmente resolver&aacute; las cosas m&aacute;s r&aacute;pidametne que uno de 5.</p> 
<h2>System complexity</h2> 
<p>La complejidad es inherente al software. Tenemos que intentar construir sistemas simples, pero no el m&aacute;s simple. La gente con habilidad&nbsp;hace las cosas menos complejas. La complejidad ralentiza mucho el software.</p> 
<h3>Deuda t&eacute;cnica</h3> 
<p>La deuda t&eacute;cnica es una decisi&oacute;n deliberada de no entregar la mejor soluci&oacute;n a cambio de entregarlo m&aacute;s r&aacute;pido. <strong>Mal c&oacute;digo y malas soluciones no es deuda t&eacute;cnica.</strong> La deuda t&eacute;cnica no es siempre mala. Est&aacute; bien si sabes que, por ir m&aacute;s r&aacute;pido, luego tienes que pagar y con intereses. Lo malo es cuando la gente obvia el pago, y la deuda aumenta hasta que la situaci&oacute;n es insostenible. Si los managers nos aprietan, es nuestra responsabilidad decirles que se est&aacute; sacrificando por llegar a la fecha l&iacute;mite. La deuda t&eacute;cnica se paga mediante refactoring o reescritura. Llegados a cierto punto, la organizaci&oacute;n puede estar pagando m&aacute;s por la deuda t&eacute;cnica que por el propio desarrollo.</p> 
<h3>Refactoring</h3> 
<p>Refactorizar es imposible sin una buena bater&iacute;a de pruebas automatizadas. &iquest;Por qu&eacute; no refactorizamos todo el tiempo? Porque refactorizar es una actividad que no a&ntilde;ade valor de negocio. El cliente no recibe nada a cambio. Lo hacemos para reducir la deuda t&eacute;cnica y la complejidad del sistema y porque sabemos a ciencia cierta que no podemos crear un sistema suficientemente bueno al primer intento.</p> 
<h3>Pruebas autom&aacute;ticas lentas o inestables</h3> 
<p>La complejidad del sistema hace que las pruebas puedan llegar a ser demasiado lentas. En parte se puede solucionar con&nbsp;la ejecuci&oacute;n paralela de las mismas. Es mucho peor cuando tienes pruebas que fallan de manera intermitente. A veces se puede llegar a perder una enorme cantidad de tiempo en intentar encontrar por qu&eacute; sucede…</p> 
<h3>Cowboy Coding</h3> 
<p>A muchos desarrolladores no les gustan los procesos. Les gusta programar libremente salt&aacute;ndoselos. Esto puede estar bien si trabajas solo o en un equipo peque&ntilde;o. En un desarrollo con m&aacute;s de 20 desarrolladores tiene que haber un proceso bien definido. Y disciplina. Extreme Programming es, por ejemplo, una metodolog&iacute;a que exige un mont&oacute;n de disciplina y energ&iacute;a, pero que entrega al final un trabajo de calidad.</p> 
<h3>Turboboost en el corto plazo</h3> 
<p>A veces uno puede meter el turbo para llegar a una cita importante sacrificando la calidad. Mientras luego se sepa que hay que pagar la deuda t&eacute;cnica generada.</p> 
<h3>Fechas l&iacute;mite (deadline)</h3> 
<p>Las fechas l&iacute;mite&nbsp;nunca tienen que ver con una arquitectura limpia o refactorizar. Tienen que ver con funcionalidad. Nos meten presi&oacute;n y nos hacen programar peor y aumentar la complejidad del sistema. As&iacute; de claro. Mezclar fechas l&iacute;mite con una actitud &eacute;pica es todav&iacute;a peor. Usar fechas l&iacute;mite a veces puede ser necesarias pero no pueden ser la manera normal de desarrollar.</p> 
<h3>Desarrollo iterativo y fechas l&iacute;mite</h3> 
<p>El desarrollo por sprints es desarrollar a base de fechas l&iacute;mite. Y, como consecuencia, puede tener los mismos efectos contraproducentes comentados anteriormente. Al ser sprints peque&ntilde;os, los efectos tambi&eacute;n ser&aacute;n peque&ntilde;os. El desarrollo por sprints puede estar bien, pero no hay que perder de vista el efecto de las fechas l&iacute;mite.</p> 
<h3>Sobretrabajar</h3> 
<p>La manera m&aacute;s simple de aumentar la cantidad de funcionalidad entregada es sobretrabajar. A veces no hay otro remedio. Pero intentar solucionar los problemas sobretrabajando hace que cuando el problema termina de explotar, las consecuencias sean peores todav&iacute;a. <a href="http://devopsangle.com/2012/04/18/what-research-says-about-working-long-hours/">Art&iacute;culo interesante sobre sobretrabajar.</a></p> 
<h3>Pasi&oacute;n</h3> 
<p>La pasi&oacute;n es buena. La gente apasionada se preocupa por su trabajo m&aacute;s. Pero no todo lo que reluce es oro.&nbsp;La gente apasionada tiene problemas para encontrar un equilibrio entre trabajo y vida personal. Puede quemarse antes y acabar deprimida.</p> 
<h3>Trabajo&nbsp;concentrado y enfocado</h3> 
<p>El trabajo enfocado y sin interrupciones&nbsp;es clave para que un programador entregue un buen c&oacute;digo. Es dif&iacute;cil sino mantener en el cerebro abstracciones de gran tama&ntilde;o. Repaso a las cosas que influyen en el trabajo concentrado.</p> 
<h3>Equipos inestables/ Rotaci&oacute;n de personal</h3> 
<p>Tuckman define cuatro estados de un equipo: forming, storming, norming, performing. La aut&eacute;ntica productividad del equipo se produce en la fase de performing. Si se rota a las personas, los equipos vuelven a pasar una y otra vez por las fases de forming, storming y norming. Es dif&iacute;cil desarrollar buenas relaciones si rotas a las personas todo el rato. Puede estar bien reformar equipos que no est&eacute;n siendo muy productivos. Pero se tarda meses en saberlo porque se puede pasar mucho tiempo en la fase de storming.</p> 
<h3>Open Space</h3> 
<p>Si tienes equipos estables es importante que cada equipo de, por ejemplo, seis personas est&eacute; en un espacio abierto. Pero si toda la empresa est&aacute; en un mismo espacio abierto hay demasiado ruido. Lo ideal es tener salas “tama&ntilde;o equipo”.</p> 
<h3>IM/Skype/Notifications</h3> 
<p>Las notificaciones destruyen tu concentraci&oacute;n. Y si no le pones atenci&oacute;n, se embeben en tu flujo diario. Aunque tengas pocas, pueden destruir la productividad de tu d&iacute;a. Si est&aacute;s programando, ci&eacute;rralo todo. Estos canales de comunicaci&oacute;n son muy &uacute;tiles, pero al mismo tiempo muy peligrosos. Y es muy dif&iacute;cil resolver el problema a nivel sist&eacute;mico.</p> 
<h3>Multi-tasking</h3> 
<p>Aunque sea muy f&aacute;cil decirlo y muy dif&iacute;cil hacerlo, hay que intentar hacer una tarea cada vez y poner toda la concentraci&oacute;n en ella, evitando las ineficiencias de los cambios de contexto. La t&eacute;cnica del pomodoro puede ayudar.</p> 
<h2>Rehacer</h2> 
<p>Obviamente reduce la velocidad en desarrollar software el tener que rehacer cosas. No podemos evitarlo completamente, pero s&iacute; reducirlo al m&aacute;ximo. Ocurre por tres motivos principalmente:</p> 
<h3>Errores (bugs)</h3> 
<p>Es imposible evitar tener alguno. Pero es importante encontrarlos r&aacute;pidamente. El ciclo de feedback tiene que ser r&aacute;pido y tiene que haber colaboraci&oacute;n entre el que desarrolla y el que prueba. Encontrar errores en producci&oacute;n es todav&iacute;a peor, sobre todo a nivel de comunicaci&oacute;n (desarrollador, probador, cliente, usuario….)</p> 
<h3>Requisitos vagos</h3> 
<p>Suponen intentar adivinar lo que se quiere hacer. Sin saberlo realmente. A veces porque el Due&ntilde;o de producto no est&aacute; disponible. A veces porque es muy dif&iacute;cil especificar por adelantado los detalles.</p> 
<ul> 
 <li><strong>Transici&oacute;n de UX a desarrollo</strong>: en el camino se pierde informaci&oacute;n. O se repiten discusiones ya aclaradas previamente. Formas de mejorar esto: 
  <ul> 
   <li>Los desarrolladores participan en la UX desde el principio</li> 
   <li>Antes de implementar una funcionalidad se hace una reuni&oacute;n previa con todo el mundo para tener una misma visi&oacute;n compartida.</li> 
   <li>escribir buenas especificaciones (imposible!)</li> 
  </ul> </li> 
</ul> 
<ul> 
 <li>&nbsp;<strong>Especificaciones</strong>: 
  <ul> 
   <li>las buenas son raras de ver. Las buenas, te ayudan a reducir&nbsp;los bugs, el rework y ahorran tiempo.</li> 
   <li><a href="http://www.targetprocess.com/articles/visual-specifications.html">Art&iacute;culo sobre c&oacute;mo mejorar las especificaciones</a>. Resumen: no hagas bdd ni pseudo-narrative. Haz flows, story-boards, prototyping, sketches, etc.</li> 
  </ul> </li> 
</ul> 
<h3>Fallo de demanda (Do the right things)</h3> 
<p>Los errores son malos pero… &iquest;qu&eacute; pasa con las funcionalidades que nadie usa? Todo el tiempo de pensarlas, desarrollarlas y probarlas no sirve para nada. &iquest;C&oacute;mo evitarlo?</p> 
<ul> 
 <li><strong>Canales de comunicaci&oacute;n</strong>: que los usuarios tengan una manera sencilla de dar feedback.</li> 
 <li><strong>Estad&iacute;sticas</strong>: &uacute;salas para saber si una funcionalidad es popular o no.</li> 
 <li><strong>Ranking de funcionalidades</strong>: crea un modelo lineal simple y &uacute;salo para crear un ranking de funcionalidades. Por ejemplo, bas&aacute;ndote en uso, votos de usuarios, tama&ntilde;o, dificultad, frecuencia de uso….</li> 
 <li><strong>UX feedback</strong>: prototipos, sketches, a/b testing….</li> 
</ul> 
<h4>M&aacute;s gente / M&aacute;s equipos de desarrollo</h4> 
<p>Las organizaciones peque&ntilde;as tienen mayor “velocidad por unidad” mientras las organizaciones grandes tienen mayor “velocidad global” (pero les cuesta econ&oacute;micamente lo suyo conseguirla). M&aacute;s gente significa m&aacute;s coordinaci&oacute;n, m&aacute;s reuniones, m&aacute;s desperdicio.</p> 
<h4>Contratar</h4> 
<p>Contratar a nueva gente puede aumentar la velocidad de la organizaci&oacute;n a largo plazo. A corto, se pierde tiempo en: entrevistar gente para contratarla, mentorizar a los nuevos para transmitirles conocimiento, etc. Y, adem&aacute;s, el propio contratado tardar&aacute; tiempo en ser totalmente productivo. Si quieres ir r&aacute;pido a corto plazo, contratando a m&aacute;s gente ir&aacute;s m&aacute;s lento.</p> 
<h4>Coordinaci&oacute;n</h4> 
<p>Cuanta m&aacute;s jerarqu&iacute;a m&aacute;s desperdicio en coordinaci&oacute;n y reuniones. Las organizaci&oacute;n en redes, de manera plana y con equipos aut&oacute;nomos y multifuncionales ayuda a reducir la coordinaci&oacute;n. Nota: la estructura de las organizaciones se transmite a la estructura del software. Una jerarqu&iacute;a flexible tiende a crear software flexible. Ser&iacute;a interesante estudiar c&oacute;mo son las estructuras de IBM o Atlassian y ver c&oacute;mo se transmite a su software.</p> 
<h2>Desperdicio y tareas que no a&ntilde;aden valor</h2> 
<h3>Reuniones</h3> 
<p>La mayor&iacute;a de las reuniones apestan. Hay que intentar reducirlas al m&iacute;nimo. Las organizaciones peque&ntilde;as pueden vivir sin reuniones. A partir de cierto tama&ntilde;o, hacen falta. Existen un mont&oacute;n de libros sobre c&oacute;mo mejorar las reuniones y… &iquest;sabes qu&eacute;? Funcionan. Todas las reuniones deber&iacute;an tener: facilitaci&oacute;n, agenda, gente preparada y resultados.</p> 
<h2>Para generar algo nuevo, tienes que pasar tiempo pensando.</h2> 
<h4>Deporte en el trabajo</h4> 
<p>El deporte en el trabajo est&aacute; estupendamente. Las soluciones creativas no vienen de estar sin levantarse del asiento ocho horas. Est&aacute; bien levantarse, charlar y hacer algo de ping-pong.</p> 
<h4>Aprender en el trabajo</h4> 
<p>Las organizaciones contratan a gente con capacidad para aprender y potencial, pero inexplicablemente no les dan tiempo para hacerlo. El efecto de dejar tiempo de aprendizaje en el trabajo (side-projects, hackatones, libros, conferencias….) no se puede ver a corto plazo. Adem&aacute;s, no existe un modelo para cuantificarlo a nivel econ&oacute;mico.</p> 
<h4>Equilibrio entre trabajo y vida personal</h4> 
<p>Si trabajas m&aacute;s y m&aacute;s duro, acabar&aacute;s haci&eacute;ndolo m&aacute;s y m&aacute;s tontamente. Cuando tienes un problema importante es dif&iacute;cil no pensar en &eacute;l en el trabajo, en casa, en la ducha,… pero eso no puede ser una constante. Un buen manager intentar&aacute; que los desarrolladores tengan hobbies y aficiones y dediquen tiempo a ello.</p> 
<h2>Resumiendo</h2> 
<p>Creo que el estr&eacute;s est&aacute; bien en momentos puntuales. La velocidad/productividad en el desarrollo de software es un problema a abordar desde m&uacute;ltiples puntos de vista. Es MUY dif&iacute;cil y no puede reducirse a decir “hay que trabajar m&aacute;s r&aacute;pido” y centrarse en dejar de hacer cosas y tomar atajos.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development" st_title="Speed in software development | Cuaderno de software"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/desarrollo-de-software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta desarrollo-de-software</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 809,
      "url" : "http://www.blogstack.info/post/cuadernodesoftware/2014/08/speed-in-software-development"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "cuadernodesoftware",
      "name" : "Cuaderno de software"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>