<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Mi experiencia y consejos para un blog | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog"><span itemprop="headline">Mi experiencia y consejos para un blog</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2014/01/mi-experiencia-y-consejos-para-un-blog/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-01-17T19:44" itemprop="datePublished">Publicado el viernes, 17 de enero de 2014 a las 19:44 UTC</span></div><div><span>
Etiquetado como
blog, planeta-arch-linux, planeta-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /> 
</div> 
<p>Al momento de escribir esta entrada el blog ya tiene m&aacute;s de 3 a&ntilde;os, ya m&aacute;s cerca de 4. En esta entrada en vez de algo relacionado con la tecnolog&iacute;a quiero comentar por que empec&eacute; un blog, que supone tener un blog, como ha evolucionado durante este tiempo, como lo hago y por que hago algunas cosas como las hago por si mi modesta experiencia le sirve de utilidad a alg&uacute;n otro blogger.</p> 
<h3>Por que empec&eacute; un blog</h3> 
<p>Empecemos por el por que inicie un blog. Trabajo como ingeniero de software y cree un blog principalmente porque tristemente en pocos momentos de mi vida profesional y con la que me gano mi sueldo a fin de mes puedo trabajar y usar las herramientas con las que realmente me gustar&iacute;a trabajar. Probablemente sea consecuencia de estar en un equipo de desarrolladores en el que son otras personas las que deciden que tecnolog&iacute;as usar y como hacer las cosas con su propia visi&oacute;n, el conocido <a href="http://es.wikipedia.org/wiki/Peopleware">&laquo;peopleware&raquo;</a>, o en otras ocasiones es el propio cliente el que marca las tecnolog&iacute;as a usar. En el blog no tengo ninguna limitaci&oacute;n, puedo aprender y usar aunque sea en peque&ntilde;os ejemplos las herramientas que quiera y como quiera, solo dependo de mi y no de otras personas. Tambi&eacute;n inici&eacute; el blog ya que de esta forma me obligaba a aprender aquello de lo que escrib&iacute;a aparte de compartir el conocimiento que he ido aprendiendo y sigo aprendiendo en los ya m&aacute;s de 10 a&ntilde;os de experiencia profesional, lo que explica el libro <a href="http://www.amazon.com/The-Pragmatic-Programmer-Journeyman-Master/dp/020161622X">&laquo;The Pragmatic Programmer&raquo;</a> como &laquo;Your Knowledge Portfolio&raquo;. Cuando surge la oportunidad de usar alguna de estas herramientas en el trabajo estoy preparado para usarla y con una mejor idea de saber cual es la opci&oacute;n m&aacute;s adecuada para cada caso. La tecnolog&iacute;a a usar no es lo m&aacute;s importante sino lo que se hace con ella pero usar la herramienta adecuada puede evitar muchos problemas en el desarrollo de un proyecto y facilitarlo enormemente.</p> 
<p>Aunque no inici&eacute; el blog por lo siguiente, pasado un tiempo y junto con <a href="https://twitter.com/picodotdev/">twitter</a> publicando los enlaces de las entradas en &eacute;l me di cuenta que es una buena combinaci&oacute;n para &laquo;spamear&raquo; a la gente de mi entorno (espero que con spam del bueno ;) y quiz&aacute; de esta manera tener m&aacute;s probabilidad de alg&uacute;n d&iacute;a usar profesionalmente algunas de las herramientas de las que hablo en el blog y con las que me gustar&iacute;a trabajar. No se si otro de los motivos de por que tengo un blog es porque aprendo o aprendo porque tengo un blog.</p> 
<p>Tambi&eacute;n el blog me parece una herramienta muy &uacute;til en el caso de la b&uacute;squeda de empleo ya que es una demostraci&oacute;n de conocimientos que en un curriculum vitae no se refleja, as&iacute; que desde que empec&eacute; el blog en mi CV incluyo un enlace al blog ya que mi blog y mi profesi&oacute;n est&aacute;n relacionados. Me parece un elemento muy interesante a incluir en el CV y en las pocas ocasiones que por el momento he tenido oportunidad de aprovecharlo en una oferta de trabajo me ha dado muy buenos resultados.</p> 
<h3>Que supone tener un blog</h3> 
<p>El blog es una de las cosas que m&aacute;s me divierte, pero quien quiera tener un blog ha de saber que requiere mucho esfuerzo, dedicaci&oacute;n y sobre todo constancia, aunque depender&aacute; del tipo del blog y de cada uno esto probablemente sea as&iacute;. A veces el blog se lleva un tiempo que podr&iacute;a dedicarlo a andar en bici, leer un libro, simplemente dar un paseo, ver una pel&iacute;cula o cualquier otra cosa. Elaborar cada entrada de este blog supone varias horas de dedicaci&oacute;n, no todas seguidas sino en diferentes d&iacute;as, trabajo que luego se ve recompensado con las visitas que recibe, alg&uacute;n retweet, alg&uacute;n comentario y la sensaci&oacute;n de haber aportado algo a otra gente y a mi mismo. Si alguien esta pensando en crear un blog le dir&iacute;a que si no va a ser constante en el compromiso de publicar contenido (medido en semanas, meses, semestres, …) y en la dedicaci&oacute;n al blog no lo empiece para dejarlo al cabo de unos pocos meses o unas pocas entradas (aunque por supuesto cada uno tiene todo el derecho de hacer con su blog lo que quiera).</p> 
<h3>Como ha evolucionado</h3> 
<p>A&uacute;n despu&eacute;s de estos casi 4 a&ntilde;os el blog tiene solamente unas 600 p&aacute;ginas vistas y unas 400 visitas diarias. Poco a poco van aumentando pero han sido necesarios 4 a&ntilde;os para llegar estos n&uacute;meros y no son muy grandes, quiz&aacute; podr&iacute;an ser mejores si usase alguno de los <a href="http://www.marketingguerrilla.es/">consejos que se dan por internet</a>. En la gr&aacute;fica de analytics desde que empec&eacute; el blog se ve que hay una leve tendencia ascendente. Comento esto para que si alguien empieza un blog no tenga falsas expectativas del n&uacute;mero de visitas y pierda inter&eacute;s al recibir pocas, si un blog quiere llegar a esos 4 a&ntilde;os de vida el inter&eacute;s de seguir manteni&eacute;ndolo con vida no debe depender del n&uacute;mero de visitas que recibe, la motivaci&oacute;n debe estar en otra parte, en mi caso es la satisfacci&oacute;n personal y los momentos de diversi&oacute;n que me d&aacute; aprendiendo y compartiendo.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/7/evolucion-analytics.png" title="Evoluci&oacute;n vistas seg&uacute;n Analytics"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/7/evolucion-analytics.png" /></a> 
</div> 
<h3>Publicidad</h3> 
<p>En el blog incluyo unos bloques de publicidad adsense, han sido necesarios casi 3 a&ntilde;os para superar los 70 € que exige Google para realizar la transferencia a mi cuenta, en el principio los ingresos mensuales eran de unos pocos c&eacute;ntimos y en estos momentos los ingresos suelen ser de entre 4 y 6 euros alg&uacute;n mes llegan a los 10 euros con unos 40 clics mensuales en los anuncios. Tambi&eacute;n van aumentando mes a mes pero no dan para mucho m&aacute;s que para pagar un dominio propio si lo tuviese y para unas cervezas pagadas a cr&eacute;dito.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/7/evolucion-adsense.png" title="Evoluci&oacute;n publicidad seg&uacute;n AdSense"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/7/evolucion-adsense.png" /></a> 
</div> 
<h3>Como lo hago</h3> 
<p>Para hacer el blog normalmente voy apuntando los temas sobre los que me interesa escribir. Las ideas pueden surgir en cualquier momento mientras voy en el metro, al irme a la cama, al leer un tweet, leer otros blogs, un libro, …. Por eso la forma de apuntarlos depende del momento, en el m&oacute;vil, en un correo en borrador, en un bloc de notas de papel que casi siempre llevo conmigo, en archivos del disco duro, lo importante es que cuando se me ocurra una idea sobre la que escribir no se me olvide para ello lo mejor es apuntarla a no mucho tardar, olvidar una idea que nos ha pasado por la mente deja una mala sensaci&oacute;n por ello ten siempre algo a mano en lo que apuntarlo. Sobre unas llego a escribir, otras pasan meses hasta que escribo sobre ellas y otras las descarto. Aunque a&uacute;n no me ha pasado, si en alg&uacute;n momento me quedo sin ideas sobre las que escribir y como en mi caso escribo sorbre temas relacionados con la programaci&oacute;n, software libre o linux una buena oportunidad est&aacute; revisando un libro del que una vez le&iacute;do explicar lo mismo que se explica en &eacute;l de forma resumida las partes importantes, con un ejemplo propio y con nuestras propias palabras. Un libro y un tema t&eacute;cnico puede darnos para escribir una serie de entradas relacionadas dependiendo del grado de profundidad al que queramos llegar o de nuestro inter&eacute;s.</p> 
<p>Los d&iacute;as que m&aacute;s visitas recibe el blog es el lunes, martes o mi&eacute;rcoles pero normalmente publico el viernes, esto aparte de ser el d&iacute;a en que tengo m&aacute;s tiempo para dar los &uacute;ltimos retoques a la entrada que voy a publicar, por el tipo de entradas que escribo me parece el momento m&aacute;s adecuado. Suelo escribir sobre cosas t&eacute;cnicas y con un ejemplo de c&oacute;digo fuente, publicando el viernes intento que el que quiera leerla la entrada tenga tambi&eacute;n tiempo y pueda leerla y tal vez probar el ejemplo m&aacute;s tranquilamente durante el fin de semana que un d&iacute;a entre semana.</p> 
<p>Si est&aacute;s a punto de iniciar un blog personal deber&aacute;s encontrar tu ritmo de publicaci&oacute;n. Mi ritmo de publicaci&oacute;n por ahora es una entrada por semana, es el ritmo que me he marcado para escribir, para darme tiempo de escribir algo que considero suficientemente bueno aportando algo, para no saturar de informaci&oacute;n al que est&eacute; suscrito a mi blog pueda asimilar la informaci&oacute;n y para tener suficiente tiempo para que se me vayan ocurriendo nuevas ideas sobre las que escribir. Tal vez podr&iacute;a escribir cada menos tiempo pero me exigir&iacute;a mucho m&aacute;s de mi tiempo de ocio y tal vez me quedar&iacute;a sin temas sobre los que escribir (ese miedo que todo blogger puede tener). Pero lo importante no es cada cuento publico sino la constancia, si en una semana no me diese tiempo a escribir una entrada optar&iacute;a por una cada dos semanas, si a&uacute;n as&iacute; no fuese suficiente optar&iacute;a una cada mes. El tener un ritmo de publicaci&oacute;n regular hace que los lectores sepan cuando se va a publicar algo y est&eacute;n esper&aacute;ndolo de forma que la entrada sea m&aacute;s visitada. Adem&aacute;s, da la sensaci&oacute;n de que el blog sigue vivo, yo por lo menos no tengo inter&eacute;s es a&ntilde;adir a mi lector de feeds un blog en el que creo que no se vaya a publicar nada nuevo aunque sea cada unos meses, me limito a ver si tiene algo interesante y lo leo pero no lo a&ntilde;ado a mi lector de feeds.</p> 
<p>A lo largo de varios a&ntilde;os hay &eacute;pocas en los que surgen m&aacute;s ideas sobre las que escribir y momentos sobre los que uno tiene m&aacute;s ganas de escribir y otros momentos en los que menos. Para evitar no publicar nada cuando no tengo ganas de dedicarle tiempo al blog o para cuando quiero tomarme una semana de descanso suelo tener varias entradas escritas y casi preparadas para publicar, es decir, cada semana no escribo y lo publico inmediatamente. La semana que no publico la compenso con otras semanas en las que escribo varias entradas. Lo que publico normalmente lo he tenido esperando a publicarse unas cuantas semanas, como no publico sobre temas de noticias de actualidad no tengo el problema de que la entrada se quede obsoleta.</p> 
<p>Y esto son algunos detalles de mi experiencia como blogger que tal vez le sirvan a alguien m&aacute;s. &iexcl;Feliz blogging!</p> 
<p>Referencia:<br /> <a href="http://picodotdev.github.io/blog-bitix/2013/12/hola-nuevo-mundo/">Hola nuevo mundo</a><br /> <a href="http://picodotdev.github.io/blog-bitix/2014/03/guia-para-la-creacion-de-un-blog-con-octopress/">Gu&iacute;a de creaci&oacute;n de blog con Octopress</a></p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" st_title="Mi experiencia y consejos para un blog | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "Mi experiencia y consejos para un blog";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2014/01/mi-experiencia-y-consejos-para-un-blog/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 40,
      "url" : "http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>