<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>El fin de Windows XP y el anclaje tecnológico | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico"><span itemprop="headline">El fin de Windows XP y el anclaje tecnológico</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/5jX1xZ9ZtgY/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-03-10T09:06" itemprop="datePublished">Publicado el lunes, 10 de marzo de 2014 a las 09:06 UTC</span></div><div><span>
Etiquetado como
opinion, windows-xp</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><img src="http://blog.koalite.com/wp-content/uploads/XP-Logo.jpg" alt="XP-Logo" width="300" height="219" /></p> 
<p>A estas alturas (marzo del 2014), quedan s&oacute;lo unas semanas para que se termine el soporte para Windows XP, el que probablemente haya sido el sistema operativo m&aacute;s exitoso de toda la historia. Esto no es una novedad, es algo que <a href="http://www.microsoft.com/en-us/windows/enterprise/endofsupport.aspx">Microsoft lleva anunciando bastante tiempo</a> pero no por ello ha dejado de generar bastante revuelo.</p> 
<p>Dentro de la comunidad t&eacute;cnica, o al menos la que tengo cerca (ya sea en el mundo f&iacute;sico o virtual), la sensaci&oacute;n generalizada es que “ya era hora”, que Windows XP “est&aacute; obsoleto” y cosas similares. </p> 
<p>Lo cierto es que <a href="http://www.xatakawindows.com/actualidad-en-redmond/windows-xp-llega-a-su-fin">no faltan argumentos para pensar as&iacute;</a>: Windows XP es un sistema operativo que apareci&oacute; en el 2001 y cuya &uacute;ltima gran actualizaci&oacute;n, el Service Pack 3, data del 2008, y muchas cosas han cambiado en el mundo de la inform&aacute;tica desde entonces. La consolidaci&oacute;n de los servicios en la nube, la necesidad de mejorar la seguridad en equipos que est&aacute;n m&aacute;s conectados que nunca, el acceso a la informaci&oacute;n del usuario desde m&uacute;ltiples dispositivos, etc., son cosas que hacen replantearse aspectos b&aacute;sicos de un sistema operativo.</p> 
<p>Entre la parte menos t&eacute;cnica, y especialmente en el mundo de la empresa, la sensaci&oacute;n es diferente. Hay muchos escenarios en los que todas las ventajas que pueden aportan sistemas operativos como Windows 7 y Windows 8, sencillamente, no compensan el coste de la actualizaci&oacute;n. Y no hablo s&oacute;lo aqu&iacute; del coste de la licencia, sino tambi&eacute;n de la posible necesidad de actualizar el hardware, de formar a la gente en un nuevo sistema operativo y de asegurar la compatibilidad de muchas aplicaciones corporativas, desarrolladas por vete t&uacute; a saber qui&eacute;n y qu&eacute; lenguajes.</p> 
<p>Existen muchos puestos de trabajo en los que el usuario s&oacute;lo utiliza el ordenador para realizar tareas muy concretas, como acceder a un ERP para introducir pedidos, realizar fichajes en un control de producci&oacute;n, o usar un punto de venta. Para esos casos, las ventajas del interfaz Metro (o como se llame ahora), de la integraci&oacute;n con OneDrive (o como se llame ahora) o el soporte para pantallas t&aacute;ctiles, no aporta lo suficiente como para dejar de usar Windows XP o algunas de sus variantes (<a href="http://en.wikipedia.org/wiki/Windows_XP_editions#Windows_XP_Embedded">XPe</a>, <a href="http://technet.microsoft.com/en-us/library/ee406170%28v=winembedded.0%29.aspx">POSReady 2009</a>, etc.).</p> 
<p>Estos factores est&aacute;n pesando mucho en la cuota de mercado que todav&iacute;a mantiene Windows XP y que <a href="http://www.theregister.co.uk/2014/03/05/windows_xp_market_share_grows_again/">seg&uacute;n algunos estudios</a>, incluso sigue subiendo. Los datos publicados por <a href="http://www.netmarketshare.com/">netmarkershare</a> sit&uacute;an la cuota de mercado de Windows XP cerca del 30% mientras que Windows 8/8.1 est&aacute; alrededor del 10%. </p> 
<div style="width: 546px">
 <img src="http://blog.koalite.com/wp-content/uploads/os-market-share.png" alt="Cuota de mercado de distintos sistemas operativos seg&uacute;n www.netmarketshare.com" width="536" height="295" />
 <p>Cuota de mercado de distintos sistemas operativos seg&uacute;n www.netmarketshare.com (Feb-2014)</p>
</div> 
<p>Pensad un momento en lo que eso significa. Para una empresa que desarrolle software de escritorio, a d&iacute;a de hoy desarrollar una aplicaci&oacute;n compatible con Windows XP puede suponer el triple de clientes potenciales que soportar Metro. Por supuesto no se puede ver s&oacute;lo de esa forma y hay que pensar en la evoluci&oacute;n futura de la cuota de mercado de ambos sistemas operativos, pero la realidad hoy es esa.</p> 
<p>Hay quien se queja de que Microsoft deje de dar soporte a Windows XP, pero creo que Microsoft no ha hecho nada malo en esta historia. Microsoft es una empresa que, como todas, busca obtener beneficios, y una parte importante de ellos proceden de la venta de sistemas operativos. Microsoft necesita que se renueve el parque de sistemas operativos instalados para conseguir nuevas ventas de licencias, por lo que es completamente razonable que deje de dar soporte a un producto que tiene m&aacute;s de diez a&ntilde;os, y adem&aacute;s lo ha hecho de forma programada, informando con antelaci&oacute;n y sin ocultar nada.</p> 
<p>Para promover la migraci&oacute;n a sus nuevos sistemas operativos, Microsoft aprovecha su ecosistema de aplicaciones, servicios y herramientas de desarrollo, como Office, OneDrive, Internet Explorer o .NET Framework, eliminando de ellas el soporte para Windows XP, consiguiendo as&iacute; ahorrar costes de desarrollo (una plataforma menos a soportar) e incentivar el cambio a plataformas m&aacute;s modernas (acceso a versiones mejoradas de las aplicaciones).</p> 
<p>Esto da lugar a una situaci&oacute;n curiosa que, estoy seguro, Microsoft ha medido y valorado mucho mejor que yo, pero el 30% de usuarios de Windows XP que hoy quieran un servicio de almacenamiento en la nube, se ir&aacute;n a DropBox o Google Drive (que s&iacute; soportan XP), o los que quieran un navegador moderno, se ir&aacute;n a Chrome o Firefox (que s&iacute; soportan Windows XP). </p> 
<p>Dicen que es m&aacute;s complicado ganar un cliente que mantenerlo, y en el caso de las aplicaciones de uso cotidiano, la inercia al cambio es grande (como se est&aacute; viendo con el propio caso de Windows XP, o con Google+ tratando de quitar desesperadamente usuarios a Facebook), por lo que Microsoft va a tener dif&iacute;cil convencer luego a estos usuarios de que migren sus datos de DropBox a OneDrive.</p> 
<p>Sin duda, es una situaci&oacute;n complicada para Microsoft. Por una parte, le interesa “motivar” a los usuarios para migrar a Windows 8, y una buena forma de hacerlo es diferenciarlo de Windows XP ofreciendo este tipo de servicios y aplicaciones. Por otra, le interesa aumentar el n&uacute;mero de usuarios de sus servicios, y para eso lo mejor ser&iacute;a hacer el acceso lo m&aacute;s universal posible.</p> 
<p>&iquest;C&oacute;mo nos afecta toda esta situaci&oacute;n como desarrolladores?</p> 
<p>Para mi lo interesante de toda esta historia no es tanto si se debe mantener el soporte para Windows XP, o si realmente Windows 8.1 es mejor que Windows XP. </p> 
<p>Lo interesante que es que una vez m&aacute;s se puede comprobar la divergencia que hay entre la velocidad a la que evoluciona la tecnolog&iacute;a y la velocidad a la que se adoptan esas evoluciones tecnol&oacute;gicas.</p> 
<p>Como desarrolladores, disfrutamos usando las t&eacute;cnicas m&aacute;s novedosas y las herramientas m&aacute;s avanzadas. Preferimos jugar con cosas nuevas porque nos hacen (o al menos eso creemos) m&aacute;s productivos y nos permiten resolver nuevos problemas, pero lo cierto es que hay muchas tecnolog&iacute;as “obsoletas” cuyo rendimiento y rentabilidad est&aacute; m&aacute;s que probada. </p> 
<p>No creo que haya muchos desarrolladores deseosos de usar Visual Basic 6 para hacer una aplicaci&oacute;n, pero el hecho es que hay muchas empresas que dependen de sistemas desarrollados con esa tecnolog&iacute;a y que obtienen unos buenos resultados con ella. Por supuesto, de COBOL ya ni hablamos.</p> 
<p>Para estas empresas existe un anclaje tecnol&oacute;gico a plataformas ya desfasadas, posiblemente sin soporte, y los desarrolladores tenemos que adaptarnos a &eacute;l. </p> 
<p>No pretendo decir con todo esto que no haya que mirar hacia el futuro, al contrario. Es fundamental que la tecnolog&iacute;a avance y seamos capaces de hacer cada vez cosas m&aacute;s incre&iacute;bles, pero tambi&eacute;n tenemos que tener los pies en el suelo y ser conscientes de la realidad en que vivimos y de que nuestro objetivo es solucionar problemas de una forma eficiente.</p> 
<p>Cuando elegimos una plataforma, igual que <a href="http://blog.koalite.com/2013/07/como-elegir-un-lenguaje-de-programacion/" title="C&oacute;mo elegir un lenguaje de programaci&oacute;n">cuando elegimos un lenguaje de programaci&oacute;n</a>, debemos tener en cuenta m&aacute;s factores que el tipo de APIs que soporta, lo productiva que nos resulta o las opciones tan novedosas que incorpora, y es necesario pensar tambi&eacute;n en la adopci&oacute;n que tiene entre nuestro p&uacute;blico objetivo, el ciclo de vida que va a tener y las expectativas de futuro que hay sobre la misma. </p> 
<p>Por ejemplo, si hoy en d&iacute;a quisieras desarrollar un ERP con clientes de escritorio usando .NET, seguramente lo m&aacute;s prudente ser&iacute;a limitarse a uilizar la versi&oacute;n 4.0 del framework para poder dar soporte a equipos con Windows XP, aunque ello implicase renunciar a caracter&iacute;sticas m&aacute;s avanzas de .NET o a determinadas librer&iacute;as.</p> 
<p>Este tipo de situaciones tambi&eacute;n sirven para recordar la importancia que tiene conocer los conceptos b&aacute;sicos que subyacen a las tecnolog&iacute;as. Hay mucho conocimiento que puedes aplicar de forma independiente a la tecnolog&iacute;a que est&aacute;s empleando en cada momento, y es importante hacer un esfuerzo por adquirir este tipo de conocimiento, puesto que est&aacute; por encima de plataformas concretas y ciclos de soporte y es lo que nos va a permirtir adaptarnos a convivir con viejas y nuevas tecnolog&iacute;as. </p> 
<p><strong>Posts relacionados:</strong></p>
<ol> 
 <li><a href="http://blog.koalite.com/2011/09/mensajes-del-mas-alla-windows-messages/" title="Mensajes del m&aacute;s all&aacute;: Windows Messages">Mensajes del m&aacute;s all&aacute;: Windows Messages</a></li> 
</ol>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/5jX1xZ9ZtgY" height="1" width="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico" st_title="El fin de Windows XP y el anclaje tecnológico | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 312,
      "url" : "http://www.blogstack.info/post/koalite/2014/03/el-fin-de-windows-xp-y-el-anclaje-tecnologico"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>