<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Datomic, una base de datos diferente | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/03/datomic-una-base-de-datos-diferente"><span itemprop="headline">Datomic, una base de datos diferente</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/ty86I-ag0ic/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-03-17T09:06" itemprop="datePublished">Publicado el lunes, 17 de marzo de 2014 a las 09:06 UTC</span></div><div><span>
Etiquetado como
datomic, nosql, clojure, development</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><img src="http://blog.koalite.com/wp-content/uploads/datomic-logo-medium.png" alt="datomic-logo-medium" width="250" height="240" /></p> 
<p>Hasta hace no mucho tiempo, siempre que uno pensaba en bases de datos lo hac&iacute;a en bases de datos relacionales. Pod&iacute;a ser Oracle, SQL Server, MySQL o cualquier otra pero, en definitiva, todas bases de datos relacionales y basadas en SQL. </p> 
<p>Sin embargo, de unos a&ntilde;os a esta parte se ha ido extendiendo el uso de bases de datos “alternativas” como <a href="https://www.mongodb.org/">MongoDB</a>, <a href="http://aws.amazon.com/es/dynamodb/">DynamoDB</a>, <a href="http://cassandra.apache.org/">Cassandra</a> o <a href="http://ravendb.net/">RavenDB</a>. Estas bases de datos est&aacute;n basadas en otros paradigmas (documentos, columnas, clave-valor) y tienen caracter&iacute;sticas que las hacen especialmente adecuadas para determinados escenarios.</p> 
<p>Una de las bases de datos NoSQL que m&aacute;s me ha llamado la atenci&oacute;n &uacute;ltimamente (junto con <a href="http://www.neo4j.org/">neo4j</a>, una base de datos orientada a grafos) ha sido <a href="http://www.datomic.com/">Datomic</a>.</p> 
<p><strong>OJO</strong>: No soy un experto en Datomic. En realidad, no le he dedicado m&aacute;s que unas horas para jugar con ella, por lo que es posible probable que parte de lo que diga no sea completamente cierto o, directamente, sea falso. Lo que pretendo con este post es poner en claro mi propias ideas y, si de paso, te sirve para aprender algo nuevo o despertar tu curiosidad, estupendo.</p> 
<h3>&iquest;Qu&eacute; es Datomic?</h3> 
<p>Datomic es una base de datos NoSQL con un clara inspiraci&oacute;n en la programaci&oacute;n funcional y las estructuras de datos persistentes (inmutables). Est&aacute; dise&ntilde;ada por Rich Hickey, el creador de clojure, y eso se nota bastante. Aunque el <a href="http://docs.datomic.com/tutorial.html">tutorial oficial</a> est&eacute; escrito en Java, el uso que hace Datomic del <a href="https://github.com/edn-format/edn">formato EDN</a> para representar estructuras de datos deja claro el origen <em>clojuriano</em> de la base de datos.</p> 
<p>Cumple con las propiedades <a href="http://en.wikipedia.org/wiki/ACID">ACID</a> (igual que, por ejemplo, SQL Server) y tiene una <a href="http://www.datomic.com/rationale.html">arquitectura bastante curiosa</a> basada en <em>peers</em> y <em>transactors</em> para poder separar lecturas de escrituras, tratando as&iacute; de favorecer la escalabilidad y todas estas cosas que est&aacute;n tan de moda ahora que todos desarrollamos aplicaciones para cientos de millones de usuarios (ejem).</p> 
<p>Cuenta con varios <a href="http://docs.datomic.com/storage.html">motores de almacenamiento</a>, incluyendo un almacenamiento en memoria ideal para pruebas r&aacute;pidas y desarrollo, y sistemas persistentes como Riak, DynamoDB, CouchDB o SQL.</p> 
<p>Tiene varios modos de licenciamiento, algunos de ellos gratuitos (tambi&eacute;n en aplicaciones comerciales) y otros de pago que incluyen soporte y caracter&iacute;sticas avanzadas.</p> 
<h3>Representaci&oacute;n de la informaci&oacute;n</h3> 
<p>Datomic es una base de datos con esquema, pero la forma en que se define un esquema en Datomic es completamente distinta de una base de datos relacional t&iacute;pica. En Datomic se definen atributos y, usando esos atributos, podemos almacenar la informaci&oacute;n de las entidades con las que queremos trabajar.</p> 
<p>Cada atributo tiene, entre otras cosas, un nombre, un tipo y una cardinalidad (es decir, si puede tomar s&oacute;lo un valor o admite varios valores). </p> 
<p>Por ejemplo, podr&iacute;amos definir los siguientes atributos para representar una entidad persona:</p> 
<table> 
 <tbody>
  <tr> 
   <th>Nombre</th> 
   <th>Tipo</th> 
   <th>Cardinalidad</th> 
  </tr> 
  <tr> 
   <td>:person/name</td> 
   <td>string</td> 
   <td>1</td> 
  </tr> 
  <tr> 
   <td>:person/age</td> 
   <td>integer</td> 
   <td>1</td> 
  </tr> 
  <tr> 
   <td>:person/friends</td> 
   <td>reference</td> 
   <td>varios</td> 
  </tr> 
 </tbody>
</table> 
<p>Por convenci&oacute;n, todos los atributos que van ligados a una misma entidad se marcan con el nombre de la entidad como prefijo (<code>person/</code> en este caso), pero en realidad no es necesario. </p> 
<p>Cada entidad de la base de datos tiene un id &uacute;nico y para representar la informaci&oacute;n que forma parte de una entidad, se establecen relaciones entre ese id y los valores de sus atributos.</p> 
<p>Por ejemplo, si tuvi&eacute;semos una persona con estos valores (representados en pseudo-json):</p> 
<pre>
{
  &quot;id&quot;: 900,
  &quot;name&quot;: &quot;Manolo&quot;,
  &quot;age&quot;: 29,
  &quot;friends&quot;: [101, 102, 103] /* ids de sus amigos */
}
</pre> 
<p>En la Datomic estar&iacute;a representada por algo parecido a esto:</p> 
<pre>
; id   atributo         valor
[[900  :person/name     &quot;Manolo&quot;]
 [900  :person/age      29]
 [900  :person/friends  [101 102 103]]]
</pre> 
<p>Representar la informaci&oacute;n de esta forma resulta un poco chocante al principio. En una base de datos relacional (SQL Server), la informaci&oacute;n de una persona estar&iacute;a almacenada en al fila de una (o varias) tablas. O en una base de datos documental (MongoDB, RavenDB), tendr&iacute;amos un documento dentro de una colecci&oacute;n para representar a la persona. </p> 
<p>Sin embargo, en Datamic lo que tenemos son asociaciones sueltas entre el id de la persona y sus atributos, y para conocer toda la informaci&oacute;n relacionada con una persona deberemos buscar todas los atributos asociados al id de la persona y ver qu&eacute; valores toman. En cierto modo, podr&iacute;amos verlo como una colecci&oacute;n de hechos (<em>facts</em>) como los usados en <a href="http://blog.koalite.com/2013/08/que-es-la-programacion-logica/">programaci&oacute;n l&oacute;gica</a>.</p> 
<p>Como dije antes, no hay nada que haga que obligue a que todas las personas tengan los mismos atributos, y los atributos ni siquiera est&aacute;n ligados a la entidad persona. De hecho, puede haber casos en los que interese definir atributos “gen&eacute;ricos” que podemos utilizar en varias entidades (por ejemplo el nombre) y podr&iacute;amos encontrar tanto personas como empresas con un atributo <code>:common/name</code>.</p> 
<p>Esto es importante porque supone una gran diferencia a la hora de modelar los datos. Mientras que en SQL o MongoDB se modela la entidad como un todo, en Datomic se modelan atributos que asignamos a entidades, y esa asociaci&oacute;n entre atributos y entidades es completamente impl&iacute;cita. En lugar de pensar en la entidad como tal, pensamos en los atributos que la definen.</p> 
<h3>Inmutabilidad</h3> 
<p>Datomic es una base de inmutable. Eso puede sonar raro (&iquest;qu&eacute; sentido tiene una base de datos que no puede cambiar?) pero en realidad la idea es sencilla: en Datomic <strong>nunca se modifica nada que ya est&eacute; en la base de datos</strong>, aunque podemos a&ntilde;adir cosas nuevas.</p> 
<p>Para conseguir esto, cada vez que asociamos un atributo a una entidad, internamente se registra el <em>instante</em> en que tuvo lugar esa asignaci&oacute;n, y en caso de que se actualice el atributo, se a&ntilde;ade una nueva relaci&oacute;n. </p> 
<p>Por ejemplo, si a la persona que defin&iacute;amos antes le cambi&aacute;semos el nombre, en la base de datos acabar&iacute;amos con dos registros asociando id a <code>:person/name</code>, cada uno de ellos en un instante diferente:</p> 
<pre>
[[900 :person/name &quot;Manolo&quot; :date '2014-03-15T10:15:10.121']
 [900 :person/name &quot;Manuel&quot; :date '2014-03-15T10:17:45.874']]
</pre> 
<p>Esto nos permite mantener un hist&oacute;rico del estado de la base de datos y poder consultar siempre c&oacute;mo se encontraba la informaci&oacute;n en un momento determinado. Al almacenar la informaci&oacute;n como tuplas asociando ids con atributos, es una operaci&oacute;n relativamente barata en t&eacute;rminos de almacenamiento, ya que cuando modificamos un atributo de una entidad no hace falta copiar todos los dem&aacute;s atributos, sino s&oacute;lo insertar el nuevo (podr&iacute;amos asimilarlo a lo que hace un sistema de control de versiones como git, que almacena s&oacute;lo los deltas entre revisiones en lugar de almacenar el fichero entero cada vez).</p> 
<p>Adem&aacute;s de la ventaja (obvia) de no perder nunca informaci&oacute;n de lo que ha ido pasando con nuestra informaci&oacute;n, esta manera de trabajar permite <a href="http://www.infoq.com/presentations/Datomic-Database-Value">ver la base de datos como un valor</a>. Es decir, podemos obtener una referencia a una base de datos en un momento determinado (generalmente el instante actual) y tratarla como un valor que nunca se modificar&aacute;, por lo que nos ahorraremos problemas derivados de la concurrencia tan t&iacute;picos en otras bases de datos y que acaban obligando a introducir bloqueos a nivel de tablas o niveles de aislamiento en transacciones muy restrictivos que limitan la concurrencia. Ser&iacute;a similar a ejecutar todas las transacciones en SQL Server con el <a href="http://msdn.microsoft.com/en-us/library/tcbchxcb(v=vs.110).aspx">nivel de aislamiento Snapshot</a>, pero sin la penalizaci&oacute;n en rendimiento que ello conlleva.</p> 
<h3>Resumen</h3> 
<p>Datomic es una base de datos con un enfoque bastante alejado no s&oacute;lo de las bases de datos relaciones, sino tambi&eacute;n de las (cada vez m&aacute;s) t&iacute;picas bases de datos documentales estilo MongoDB, CouchDB, RavenDB y dem&aacute;s amigos. </p> 
<p>Este post s&oacute;lo ha sido una introducci&oacute;n muy superficial a lo que es Datomic, pero al menos deber&iacute;a servir para hacernos una idea de cu&aacute;l es su filosof&iacute;a. En pr&oacute;ximos posts veremos como realizar operaciones b&aacute;sicas con Datomic, como definir un esquema, realizar transacciones o lanzar consultas.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/ty86I-ag0ic" height="1" width="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente" st_title="Datomic, una base de datos diferente | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 311,
      "url" : "http://www.blogstack.info/post/koalite/2014/03/datomic-una-base-de-datos-diferente"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>