<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero"><span itemprop="headline">Manjaro 0.8.10: el usuario es lo primero</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/xfce"><img title="xfce" alt="xfce" src="/assets/images/labels/xfce.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/10/manjaro-0810-el-usuario-es-lo-primero.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-10-28T12:05" itemprop="dateModified">Actualizado el martes, 28 de octubre de 2014 a las 12:05 UTC</span></div><div><span>
Etiquetado como
revision, manjaro, <a href="/label/xfce"><span itemprop="articleSection">xfce</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">A&ntilde;o y medio despu&eacute;s de revisar por primera vez una versi&oacute;n de 
<a href="http://www.lasombradelhelicoptero.com/2013/03/manjaro-084-otro-paso-hacia-la-cumbre.html">Manjaro</a>, me vuelve a picar el gusanillo de la curiosidad y me apetece asomarme un poco al momento que vive la otrora muy popular distribuci&oacute;n derivada de Arch Linux. El adverbio escogido no es casual, aunque no pretendo insinuar que Manjaro ya no goce de cierta reputaci&oacute;n, es innegable que el furor causado en sus inicios que la llevara a los primeros puestos en la clasificaci&oacute;n de distros m&aacute;s consultadas en 
<a href="http://distrowatch.com/">Distrowatch</a> no se mantiene hoy d&iacute;a. Me parece recordar, incluso, que lleg&oacute; a superar en consultas a su distro madre.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-XWlYcP-NnOg/VE9_tubb9uI/AAAAAAAAEwc/02H8wPb9pRI/s1600/Manjaro-logo.png"><img src="http://2.bp.blogspot.com/-XWlYcP-NnOg/VE9_tubb9uI/AAAAAAAAEwc/02H8wPb9pRI/s1600/Manjaro-logo.png" /></a>
</div>
<br />
<br />
<a></a>Todos sabemos ya que el mencionado ranking no ha de tomarse m&aacute;s que como un mero indicador de popularidad y nunca como medida de uso. Ni mucho menos nos sirve para diferenciar la calidad de una distribuci&oacute;n o su voluntad de tender puentes de ayuda al usuario final, que para eso ya estamos nosotros aqu&iacute;. En cierto modo me sorprende un poco el lento ritmo de desarrollo que ha tenido Manjaro, hasta el punto de que, transcurrido tanto tiempo desde sus inicios, a&uacute;n no nos han presentado una versi&oacute;n 1.0. Pero, como veremos en el art&iacute;culo de hoy, la distro no ha hecho m&aacute;s que avanzar en pos de un objetivo: facilitar la vida a aquellos que desean disfrutar de las ventajas de Arch Linux, sin verse obligados a lidiar con tareas excesivamente complejas. Aqu&iacute; es donde Manjaro marca, indudablemente, una importante diferencia. Veamos c&oacute;mo.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Manjaro comparte con Chakra sus primeras pantallas desde que iniciamos el entorno en vivo, con las &uacute;nicas y obligadas diferencias derivadas del conjunto est&eacute;tico que cada una de ellas propone. Hablando en plata: todo id&eacute;ntico, salvo los colores. Y una gran excepci&oacute;n: lo que en Chakra falla (en 
<a href="http://www.lasombradelhelicoptero.com/2014/10/chakra-euler-conocimos-tiempos-mejores.html">Euler</a>, al menos), en Manjaro funciona, esto es, el inicio e instalaci&oacute;n de los controladores gr&aacute;ficos propietarios de AMD. La resoluci&oacute;n es la adecuada desde el principio y, tras el reinicio, podemos comprobar que no es un controlador vesa gen&eacute;rico el instalado, sino los genuinos Catalyst de la empresa de Sunnyvale.
<br />
<br />El instalador no es Tribe, sino Thus, pero ambos comparten su estadio alfa. En el de Manjaro, sin embargo, todo se muestra en el idioma escogido salvo el &quot;slide show&quot; y la primera pantalla de ayuda o resumen. La instalaci&oacute;n se realiza en muy poco tiempo (unos cinco minutos desde pendrive), tras lo cual se nos da paso, sin ning&uacute;n tipo de complicaci&oacute;n, a nuestro escritorio XFCE. Como suelo hacer he escogido la versi&oacute;n principal, aquella a la que todas las distribuciones prestan especial atenci&oacute;n, que en el caso de Manjaro es la implementada con dicho escritorio. Est&aacute;n disponibles, empero, versiones oficiales con Openbox y KDE, adem&aacute;s de las comunitarias con pr&aacute;cticamente todos los escritorios y gestores de ventanas m&aacute;s utilizados.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-4G_e80DL2-4/VE9__NxlrCI/AAAAAAAAEwk/4acA38GDFkQ/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A39%3A02.png"><img src="http://3.bp.blogspot.com/-4G_e80DL2-4/VE9__NxlrCI/AAAAAAAAEwk/4acA38GDFkQ/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A39%3A02.png" height="320" width="400" /></a>
</div>
<br />Despu&eacute;s de un primer reinicio llega el momento de actualizar. Es aqu&iacute; donde Manjaro nos muestra un error que puede resultar crucial para el usuario poco experimentado: el gestor Pamac falla en su primer intento. A los ojos del tipo de usuario final al que Manjaro se dirige, esta temprana necesidad de usar la consola puede verse como un tremendo impedimento, raz&oacute;n por la cual califico el error como de importancia moderada en la clasificaci&oacute;n otorgada a la distro. La soluci&oacute;n pasa por abrir un terminal y actualizar a la usanza habitual, con un &quot;sudo pacman -Syu&quot;. Esto normaliza la situaci&oacute;n y nos brinda la oportunidad de instalar... &iexcl;487 nuevas actualizaciones!
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-c41lhXxmY2Q/VE-AJ15mT3I/AAAAAAAAEws/mEjh9nZ3EPI/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A40%3A18.png"><img src="http://4.bp.blogspot.com/-c41lhXxmY2Q/VE-AJ15mT3I/AAAAAAAAEws/mEjh9nZ3EPI/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A40%3A18.png" height="320" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-_evFS_wFOaU/VE-AWuMS4WI/AAAAAAAAEw0/eiqP6qhZsq8/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A45%3A52.png"><img src="http://1.bp.blogspot.com/-_evFS_wFOaU/VE-AWuMS4WI/AAAAAAAAEw0/eiqP6qhZsq8/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A45%3A52.png" height="320" width="400" /></a>
</div>
<br />M&aacute;s de 700 Mb descargados despu&eacute;s, adem&aacute;s de varios paquetes de idioma que Manjaro me indica convenientemente que es preciso instalar, tras un nuevo reinicio compruebo que todo ha ido sobre ruedas y ya tengo mi escritorio preparado para utilizar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-erUv_W-_bCM/VE-Adi-HeuI/AAAAAAAAEw8/ml6WYF-AMG8/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A39%3A22.png"><img src="http://2.bp.blogspot.com/-erUv_W-_bCM/VE-Adi-HeuI/AAAAAAAAEw8/ml6WYF-AMG8/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B16%3A39%3A22.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />El inicio de Manjaro XFCE lleva 40 segundos, mientras que su desconexi&oacute;n toma apenas 9. Buenos tiempos, aunque se podr&iacute;a esperar algo m&aacute;s de rapidez al iniciar de un escritorio liviano como XFCE. El gestor de arranque localiz&oacute; mi Ubuntu Trusty, permitiendo iniciar dicha partici&oacute;n sin inconvenientes. Para modificar el grub se puede emplear, entre otros, Grub Customizer, disponible en los repositorios.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-uTLebr_NMM0/VE-ArxoRmxI/AAAAAAAAExE/9IQvTpOkJwk/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A51%3A00.png"><img src="http://3.bp.blogspot.com/-uTLebr_NMM0/VE-ArxoRmxI/AAAAAAAAExE/9IQvTpOkJwk/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A51%3A00.png" height="320" width="400" /></a>
</div>
<br />
<b>Software</b>
<br />En el apartado de programas disponibles me voy a centrar en aquellos que hacen de Manjaro una distro tan amigable para el usuario. Para empezar, el gestor de paquetes Pamac nos permite instalar todo lo que queramos desde los &quot;repos&quot; de Manjaro, con la caracter&iacute;stica a&ntilde;adida de poder incluir AUR entre los mismos. Esto no es moco de pavo, pues pone a nuestra disposici&oacute;n una tremenda cantidad de paquetes con casi cualquier programa que podamos encontrar en GNU/Linux (si no est&aacute; en AUR, es que no existe...). Esto tiene sus inconvenientes tambi&eacute;n, siendo el m&aacute;s notable que no se muestran los mensajes de error o de otro tipo que podemos ver si hacemos una instalaci&oacute;n &quot;a pelo&quot;, con yaourt o cualquier otro gestor de AUR. As&iacute;, nos puede ocurrir que pensemos que una instalaci&oacute;n se ha colgado, por transcurrir un largo tiempo en que no sabemos qu&eacute; est&aacute; ocurriendo realmente, algo que me pas&oacute; mientras trataba de instalar el controlador foo2zjs para la impresora. Lo que yo tom&eacute; por un cuelgue de la aplicaci&oacute;n no era m&aacute;s que el tiempo empleado en descargar m&aacute;s de 100 Mb de paqueter&iacute;a, pero al no haber ning&uacute;n mensaje al respecto resulta sencillo pensar en lo peor.
<br />
<br />Por otra parte contamos con una estupenda utilidad llamada &quot;Gestor de configuraci&oacute;n de Manjaro&quot;. Con este programa podemos controlar aspectos tan importantes de nuestra distribuci&oacute;n como el kernel que estamos usando, los controladores gr&aacute;ficos o el idioma. Menci&oacute;n especial para los dos primeros, claro est&aacute;. Un programa que permite al usuario cambiar de kernel con suma facilidad, algo que cobra gran importancia si se tienen en cuenta las regresiones que, desgraciadamente, siguen acechando tras alguna que otra liberaci&oacute;n del n&uacute;cleo principal de Linux. &iquest;Que con el &uacute;ltimo kernel pierdes funcionalidad? Pues aqu&iacute; tienes este programa para volver a uno anterior, sin mayor problema.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-jYUmUjverdM/VE-A8MoZfBI/AAAAAAAAExM/iKNUvW4gjVM/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A47%3A05.png"><img src="http://2.bp.blogspot.com/-jYUmUjverdM/VE-A8MoZfBI/AAAAAAAAExM/iKNUvW4gjVM/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A47%3A05.png" height="320" width="400" /></a>
</div>
<br />Y lo mismo se puede decir de los controladores gr&aacute;ficos. En resumidas cuentas, una utilidad genial que no deber&iacute;a faltar en ninguna de las distribuciones que se suponen dirigidas a usuarios noveles o intermedios y por la que no queda m&aacute;s que aplaudir a los desarrolladores de Manjaro.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-84WQVJHKXo0/VE-BD5mNfuI/AAAAAAAAExU/WgiGS9OYi7U/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A48%3A11.png"><img src="http://4.bp.blogspot.com/-84WQVJHKXo0/VE-BD5mNfuI/AAAAAAAAExU/WgiGS9OYi7U/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A48%3A11.png" height="320" width="400" /></a>
</div>
<br />En lo que respecta al resto de programas, tan solo rese&ntilde;ar que contamos con las versiones m&aacute;s recientes de los mismos, un &quot;pel&iacute;n&quot; por detr&aacute;s de Arch, como suele ser habitual debido al tiempo de liberaci&oacute;n superior de los paquetes en los repositorios de Manjaro. El kernel incluido por defecto, de la serie 3.12, es f&aacute;cilmente reemplazable con la utilidad mencionada en el p&aacute;rrafo anterior, con lo que no supone un inconveniente, en realidad. Por lo dem&aacute;s, contamos con la colecci&oacute;n habitual que suele incorporar Manjaro: Firefox, Xnoise, Viewnior, Steam, etc&eacute;tera.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/--ie1NSVXqfo/VE-BM4LUxtI/AAAAAAAAExc/RJ4GkcVyTLo/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B18%3A08%3A38.png"><img src="http://1.bp.blogspot.com/--ie1NSVXqfo/VE-BM4LUxtI/AAAAAAAAExc/RJ4GkcVyTLo/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B18%3A08%3A38.png" height="320" width="400" /></a>
</div>
<br />
<b>Reconocimiento de hardware</b>
<br />En este aspecto, con Manjaro he vivido casi un calco de lo acontecido con Chakra Euler: esc&aacute;ner y webcam perfectos, impresora un infierno. Y al igual que con mi distro preferida, en Manjaro aparecen mensajes de &quot;configurando&quot; y &quot;lista para imprimir&quot;, que no se ajustan para nada a la realidad. En descargo de esta distro se puede decir que, tras el fallo en la impresi&oacute;n, se nos abre una ventana con t&iacute;tulo &quot;Troubleshooting Printing&quot; para tratar de arreglar el desaguisado, concluyendo, tras varias intentonas, que &quot;no hay soluci&oacute;n obvia&quot;.
<br />
<b> </b>
<br />Confieso que, trat&aacute;ndose de una revisi&oacute;n y no de una distro que voy a usar para mi d&iacute;a a d&iacute;a, no me he esmerado demasiado en poner remedio al problema. Baste rese&ntilde;ar que lo intent&eacute; en las dos &uacute;nicas formas que conozco, fallando con ambas: hp-setup no reconoce a Manjaro como una distribuci&oacute;n v&aacute;lida, mientras que el controlador foo2zjs, aunque al contrario que en CCR se puede compilar sin fallos, no hace funcionar la impresora tampoco. Fracaso absoluto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-4vklS3lJTgU/VE-BeOa1LdI/AAAAAAAAExk/_m1-cmLkG5Q/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B16%3A08%3A30.png"><img src="http://3.bp.blogspot.com/-4vklS3lJTgU/VE-BeOa1LdI/AAAAAAAAExk/_m1-cmLkG5Q/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B16%3A08%3A30.png" height="320" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-46RdJCTylNY/VE-Brz1YB2I/AAAAAAAAExs/IHInQXNtJ9s/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B17%3A11%3A35.png"><img src="http://4.bp.blogspot.com/-46RdJCTylNY/VE-Brz1YB2I/AAAAAAAAExs/IHInQXNtJ9s/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B17%3A11%3A35.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Otro &quot;deja v&uacute;&quot; de lo ocurrido con Chakra. No hay manera de conectar con mi port&aacute;til con Windows 7. Samba no viene instalado por defecto, pero aunque lo instalo y sigo un 
<a href="https://forum.manjaro.org/index.php?topic=16833.0">tutorial</a> disponible en el foro de Manjaro, no tengo &eacute;xito en la tarea. En cuanto a dispositivos extra&iacute;bles, nada que objetar, al reconocerse y montarse de modo autom&aacute;tico tanto el pendrive, como el disco duro externo y la micro tarjeta SD. El tiempo de copia al primero y la tercera es notablemente m&aacute;s largo que en Ubuntu, mientras que la copia al disco duro USB acontece un poco m&aacute;s r&aacute;pidamente.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-321K8pMOxGg/VE-ByEvXk5I/AAAAAAAAEx0/ITMokjYKJZg/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B17%3A12%3A24.png"><img src="http://2.bp.blogspot.com/-321K8pMOxGg/VE-ByEvXk5I/AAAAAAAAEx0/ITMokjYKJZg/s1600/Captura%2Bde%2Bpantalla%2B-%2B221014%2B-%2B17%3A12%3A24.png" height="320" width="400" /></a>
</div>
<br />
<b>Experiencia de uso</b>
<br />Otro de los aspectos en los que resulta obvio que el principal objetivo de Manjaro es facilitar la vida de quien lo usa. Desde la instalaci&oacute;n, con solo abrir Xnoise podemos reproducir todos los formatos de v&iacute;deo y audio que se nos ocurran, incluyendo el v&iacute;deo digital (.dv) que en otras distribuciones me ha dado problemas. Tambi&eacute;n podemos leer nuestros documentos, descomprimir nuestros archivos, reproducir v&iacute;deos en el navegador... insisto, sin instalar ning&uacute;n programa adicional. Muy buena implementaci&oacute;n de lo que se entiende por &quot;out-of-the-box&quot;, o en castellano, &quot;instalar y usar&quot;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-gJdBC_S_sh0/VE-B8qYWS1I/AAAAAAAAEx8/2v8EhpNMVRU/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A40%3A38.png"><img src="http://4.bp.blogspot.com/-gJdBC_S_sh0/VE-B8qYWS1I/AAAAAAAAEx8/2v8EhpNMVRU/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A40%3A38.png" height="320" width="400" /></a>
</div>
<br />
<b>Estabilidad</b>
<br />Ni cuelgues, ni ralentizaciones, ni nada parecido. Trat&aacute;ndose de una distro que roza el &quot;bleeding edge&quot;, no se puede pedir m&aacute;s. Destacar, como comentaba anteriormente, que en caso de problemas con el kernel por defecto podemos optar por otro m&aacute;s moderno o anterior, incluyendo aquellos que han sido catalogados como versiones de soporte extendido &quot;LTS&quot;, como el 3.10 o el 3.14.
<br />
<br />
<b>Fluidez</b>
<br />La inclusi&oacute;n de XFCE como escritorio por defecto en la edici&oacute;n principal de Manjaro asegura que la distro correr&aacute; bien en ordenadores con menos recursos disponibles. En mi caso, nada que objetar. Tan solo recordar que tambi&eacute;n se puede optar por algo m&aacute;s liviano como Openbox, o algo m&aacute;s pesado y completo como KDE. Para gustos, colores, y en Manjaro han pensando en todo tipo de equipos para ofrecer una experiencia lo m&aacute;s fluida posible.
<br />
<br />
<b>Gesti&oacute;n de la energ&iacute;a</b>
<br />Volvemos a repetir lo visto en Chakra Euler. Gracias a los nunca suficientemente vilipendiados controladores Catalyst, no puedo ni suspender a RAM ni hibernar. &quot;&iexcl;Viva AMD!&quot;, dicho con todo el sarcasmo posible, claro. La funci&oacute;n de reposo del monitor funciona como debe, destacando la inclusi&oacute;n de los salvapantallas, actualmente en desuso en la gran mayor&iacute;a de las distribuciones GNU/Linux.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-WBReQKzjmk0/VE-CJWSWlrI/AAAAAAAAEyE/Awj8o44Bj-8/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A48%3A45.png"><img src="http://3.bp.blogspot.com/-WBReQKzjmk0/VE-CJWSWlrI/AAAAAAAAEyE/Awj8o44Bj-8/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A48%3A45.png" height="320" width="400" /></a>
</div>
<br />
<b>Pruebas de rendimiento</b>
<br />De las diez pruebas a las que someto a las distribuciones que analizo, Manjaro supera a Ubuntu en 4 de ellas, mientras que lo contrario sucede en 5 ocasiones. El test &quot;Pybench&quot; de la suite Phoronix no pude llevarlo a cabo debido a un error desconocido, por lo que su valor se ha despreciado en la nota final. Destacar que Manjaro fue mucho m&aacute;s r&aacute;pido codificando un archivo de audio que Ubuntu, mientras que fue tremendamente lento a la hora de copiar a la tarjeta micro SD.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-ew-P8BvQbHk/VE-CSA8BIPI/AAAAAAAAEyM/oBiHMSs92j8/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A19%3A10.png"><img src="http://4.bp.blogspot.com/-ew-P8BvQbHk/VE-CSA8BIPI/AAAAAAAAEyM/oBiHMSs92j8/s1600/Captura%2Bde%2Bpantalla%2B-%2B231014%2B-%2B13%3A19%3A10.png" height="320" width="400" /></a>
</div>
<br />
<b> </b>Manjaro sigue haciendo muy bien su trabajo. Cogemos un Arch Linux y le a&ntilde;adimos algo m&aacute;s a su paradigma, con lo que tenemos un sistema muy f&aacute;cil de instalar y mantener para un usuario novel. Arch tambi&eacute;n lo es, pero para un determinado tipo de usuario m&aacute;s avanzado. Del mismo modo podr&iacute;a decirse que al aumentar el tiempo de liberaci&oacute;n de los paquetes de los repositorios de pruebas a los definitivos se est&aacute; disminuyendo la probabilidad de que se pasen por alto errores que son inherentes a distribuciones &quot;rolling release&quot;. Los que llevamos alg&uacute;n tiempo en esto sabemos, porque la vivimos en su d&iacute;a, de la pol&eacute;mica que esto suscit&oacute; entre los desarrolladores de Arch (McRae a la cabeza) y los de Manjaro, aludiendo a la problem&aacute;tica de seguridad que supon&iacute;a.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-zDi949EQUrA/VE-Ciq917EI/AAAAAAAAEyU/8Yp1Cf1Prn0/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A46%3A45.png"><img src="http://1.bp.blogspot.com/-zDi949EQUrA/VE-Ciq917EI/AAAAAAAAEyU/8Yp1Cf1Prn0/s1600/Captura%2Bde%2Bpantalla%2B-%2B211014%2B-%2B17%3A46%3A45.png" height="320" width="400" /></a>
</div>
<br />Las aguas se calmaron, o eso parece. En lo que a m&iacute; respecta solo puedo destacar a Manjaro como una distribuci&oacute;n que merece mucho la pena. Montones de felices usuarios que la siguen empleando en su d&iacute;a a d&iacute;a parecen darme la raz&oacute;n, pese a que el ambiente que he palpado en sus foros no es el de gran entusiasmo que sol&iacute;a. Da la impresi&oacute;n de que algunos desarrolladores est&aacute;n abandonando el barco (&iquest;de qu&eacute; me suena 
<a href="http://www.lasombradelhelicoptero.com/2013/08/algo-pasa-con-chakra-o-no.html">esto</a>?) Pero esta es una apreciaci&oacute;n muy personal y no tiene porqu&eacute; ser del todo cierta, ya que no soy un usuario habitual de la distribuci&oacute;n y muchas cosas se me escapan.
<br />
<br />Sea como fuere, centr&aacute;ndonos en la usabilidad y rendimiento, Manjaro sigue avanzando y consolid&aacute;ndose como una distribuci&oacute;n a tener muy en cuenta en un futuro. Un sistema que probablemente, si no se tiene un hardware como el m&iacute;o (AMD y HP, vaya par), os dar&aacute; muchas horas de gran rendimiento y escasos problemas. Enhorabuena a los desarrolladores por fijar el objetivo de su distribuci&oacute;n en facilitar las cosas al usuario partiendo de una base tan aclamada como Arch. Doble m&eacute;rito el suyo.
<br />
<br />Salud
<br />
<br />
<b>LO MEJOR</b>
<br />
<ul>
 <li>Programas propios que facilitan la vida al usuario</li>
</ul>
<br />
<b>LO PEOR</b>
<br />
<ul>
 <li>Error en la primera (y crucial) actualizaci&oacute;n con Pamac</li>
</ul>
<br />
<b>FICHA T&Eacute;CNICA</b>
<br />
<div style="text-align: center;"></div>
<div style="text-align: center;">
 <br />Distribuci&oacute;n: Manjaro 0.8.10
</div>
<div style="text-align: center;">
 Entorno de escritorio: XFCE 4.10
</div>
<div style="text-align: center;">
 Kernel: 3.12.29
</div>
<div style="text-align: center;">
 Xorg: 1.16.1
</div>
<div style="text-align: center;">
 Controlador gr&aacute;fico: fglrx 14.20.7
 <br />&nbsp;OpenGL: 4.4.12968
 <br />GCC: 4.9.1
</div>
<br />
<table>
 <tbody>
  <tr>
   <th>MANJARO 0.8.10</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>9,80</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5,00</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>20.567,54</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>7,65</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,35</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>469</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.966</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.976</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>4,55</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,13</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>6,05</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-0,23</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>-0,50</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>7,77</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero" st_title="Manjaro 0.8.10: el usuario es lo primero | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/xfce/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta xfce</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1065,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/manjaro-8-1-el-usuario-es-lo-primero"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>