<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-07-04T07:02:37Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-07-04T07:02:37Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Palabras (I)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/07/palabras-i" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2014-07-04T06:53:44Z</updated>
    <published>2014-07-04T06:53:44Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Aquel que me conozca sabr&amp;aacute; que tengo un punto bastante pedante-busca-palabras. Necesito verbalizarlo todo. Muchas veces discurro invent&amp;aacute;ndome di&amp;aacute;logos conmigo mismo o como si le explicara las cosas a otro… (s&amp;iacute;, estoy un poco pa&amp;acute;all&amp;aacute;… :-P). El caso es que me doy cuenta mientras hablo de que muchas veces confundo simple con f&amp;aacute;cil o complicado con complejo. Independientemente de lo tiquismiquis que uno se quiera poner con el idioma, creo que eso tiene consecuencias a la hora de entender a qu&amp;eacute; estamos cuando trabajamos. Pero primero, veamos la definici&amp;oacute;n de cada t&amp;eacute;rmino:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;&lt;strong&gt;f&amp;aacute;cil&lt;/strong&gt;: que cuesta poco trabajo. Que puede ocurrir con mucha probabilidad.&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;dif&amp;iacute;cil&lt;/strong&gt;: que no se logra sin mucho trabajo.&lt;/li&gt; 
 &lt;li&gt;&lt;strong&gt;simple&lt;/strong&gt;: sin complicaci&amp;oacute;n. Formado&amp;nbsp;por un solo elemento o por pocos. De f&amp;aacute;cil comprensi&amp;oacute;n.&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/07/palabras-i"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2014-07-04T06:53:44Z</dc:date>
  </entry>
  <entry>
    <title>Stress</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/07/stress" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2014-07-01T07:17:12Z</updated>
    <published>2014-07-01T07:17:12Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Entresacando lo que me da la gana de la &lt;a href="http://es.wikipedia.org/wiki/Estr%C3%A9s"&gt;wikipedia&lt;/a&gt;:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;El estr&amp;eacute;s es nerviosismo o inquietud.&lt;/li&gt; 
 &lt;li&gt;Una respuesta natural y necesaria para la superviviencia ante un agente externo.&lt;/li&gt; 
 &lt;li&gt;Es s&amp;oacute;lo patolog&amp;iacute;a&amp;nbsp;cuando se produce una sobrecarga de tensi&amp;oacute;n que produce enfermedades y anomal&amp;iacute;as como problemas de memoria, de concentraci&amp;oacute;n y de &amp;aacute;nimo.&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;No se puede decir que yo sea una persona que viva muy estresada. &amp;Eacute;ste a&amp;ntilde;o me est&amp;aacute; tocando meter horas porque hace falta y, como todo el mundo, cuando sobretrabajas, te agotas mentalmente y tu cuerpo se resiente. En mi caso, me suele llevar a so&amp;ntilde;ar con c&amp;oacute;digo, no poder desconectar, comer con ansiedad y engordar, etc. Pese a todo y en general, no tiene mayores consecuencias. Sin embargo, en mi c&amp;iacute;rculo personal de amigos y familiares he podido ver un par de casos concretos de lo que el estr&amp;eacute;s le puede hacer a la gente, que me han hecho estar m&amp;aacute;s alerta con &amp;eacute;ste tema.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/07/stress"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2014-07-01T07:17:12Z</dc:date>
  </entry>
  <entry>
    <title>Autonomía, maestría y propósito: hay que ganárselos</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/06/autonomia-maestria-y-proposito-hay-que-ganarselos" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2014-06-30T06:49:13Z</updated>
    <published>2014-06-30T06:49:13Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hace ya un tiempo que le&amp;iacute; &lt;a href="http://www.danpink.com/books/drive"&gt;Drive, de Daniel Pink&lt;/a&gt;. Un libro que ayuda a abrir la mente sobre las maneras de motivar a las personas y que pone en perspectiva la cl&amp;aacute;sica motivaci&amp;oacute;n a base de status o dinero. El libro habla en profundidad de varios aspectos de la motivaci&amp;oacute;n, pero a todos se nos ha quedado un meme&amp;nbsp;por encima de todo: &lt;strong&gt;autonom&amp;iacute;a, maestr&amp;iacute;a y prop&amp;oacute;sito&lt;/strong&gt;. Pese a que en alg&amp;uacute;n otro post me gustar&amp;iacute;a hacerme un resumen del libro (como ejercicio, y para fijar algunas de las ideas), en &amp;eacute;ste me gustar&amp;iacute;a centrarme en algo que llevo pensando desde hace mucho tiempo.&lt;/p&gt; 
&lt;p&gt;Cada vez que oigo el susodicho meme, viene de boca de alguien que est&amp;aacute; reivindicando algo a management o a la organizaci&amp;oacute;n a la que pertenece. “No nos escuchan”, “no hay tiempo suficiente para hacer un trabajo de calidad”, “esto no s&amp;eacute; para qu&amp;eacute; lo hacemos”…&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/06/autonomia-maestria-y-proposito-hay-que-ganarselos"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2014-06-30T06:49:13Z</dc:date>
  </entry>
  <entry>
    <title>Home Inventory – Productividad</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/05/home-inventory-productividad" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2014-05-23T08:03:22Z</updated>
    <published>2014-05-23T08:03:22Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&amp;Eacute;sta ma&amp;ntilde;ana he actualizado mi mac &amp;eacute;ste, como quien no quiere la cosa, aprovechado para mostrarme un anuncio de un programa que es award winning y todo:&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.programania.net/wp-content/uploads/homeinventory.png"&gt;&lt;img src="http://www.programania.net/wp-content/uploads/homeinventory-1024x744.png" alt="homeinventory" width="599" height="435" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;p&gt;Poco a poco voy cumpliendo a&amp;ntilde;os y me noto m&amp;aacute;s cascarrabias pero… &amp;iquest;Tener una base de datos especializada en hacer un inventario de tu casa te hace m&amp;aacute;s productivo? Pongamos que alguien tiene un problema con el inventario de su casa que le hace perder el tiempo:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Si ya pierde el tiempo y quiere ser m&amp;aacute;s productivo… &amp;iquest;perder m&amp;aacute;s tiempo rellenando una base de datos le va a hacer m&amp;aacute;s productivo?&lt;/li&gt; 
 &lt;li&gt;Si el problema es que tiene un l&amp;iacute;o con los n&amp;uacute;meros de serie y las garant&amp;iacute;as… &amp;iquest;lo mejor que puede hacer es meter software para gestionar su l&amp;iacute;o? &amp;iquest;no ser&amp;aacute; mejor ordenarse y solucionar ese l&amp;iacute;o?&lt;/li&gt; 
 &lt;li&gt;El low-tech de tener una cajita con las facturas de los productos y las garant&amp;iacute;as… no es m&amp;aacute;s que suficiente. &amp;iquest;qu&amp;eacute; tiene que aportar el software aqu&amp;iacute;? Y si tiene que aportar algo… &amp;iquest;hace falta un software vertical y especializado o bastar&amp;iacute;a con un Google Excel y punto pelota?&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/05/home-inventory-productividad"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2014-05-23T08:03:22Z</dc:date>
  </entry>
  <entry>
    <title>Identity vs GUID</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/05/identity-vs-guid" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Guille</name>
    </author>
    <updated>2014-05-21T12:10:51Z</updated>
    <published>2014-05-21T12:10:51Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Este es el resumen de un an&amp;aacute;lisis sobre la materia que realic&amp;eacute; hace alg&amp;uacute;n tiempo. Se agradecer&amp;aacute; cualquier aportaci&amp;oacute;n &lt;img src="http://www.programania.net/wp-includes/images/smilies/icon_smile.gif" alt=":)" /&gt; &lt;/p&gt; 
&lt;p&gt;&lt;b&gt;Recursos para entender este art&amp;iacute;culo&lt;/b&gt;&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Benchmark ID vs GUID y propuesta de un algoritmo de generaci&amp;oacute;n de GUIDs secuenciales para mitigar problemas de rendimiento en INSERT y derivadas: &lt;a href="http://www.informit.com/articles/printerfriendly/25862"&gt;http://www.informit.com/articles/printerfriendly/25862&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;Benchmark ID vs GUID en donde salen parejos (mysql) en un escenario de UPDATE: &lt;a href="http://krow.livejournal.com/497839.html"&gt;http://krow.livejournal.com/497839.html&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;a href="http://databases.aspfaq.com/database/what-should-i-choose-for-my-primary-key.html"&gt;http://databases.aspfaq.com/database/what-should-i-choose-for-my-primary-key.html&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;Estudio espec&amp;iacute;fico para MySQL + &amp;iacute;ndices &amp;uacute;nicos &lt;a href="http://kccoder.com/mysql/uuid-vs-int-insert-performance/"&gt;http://kccoder.com/mysql/uuid-vs-int-insert-performance/&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;a href="http://stackoverflow.com/questions/45399/advantages-and-disadvantages-of-guid-uuid-database-keys"&gt;http://stackoverflow.com/questions/45399/advantages-and-disadvantages-of-guid-uuid-database-keys&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/05/identity-vs-guid"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Guille</dc:creator>
    <dc:date>2014-05-21T12:10:51Z</dc:date>
  </entry>
  <entry>
    <title>The eye of the storm</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2014/04/the-eye-of-the-storm" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Guille</name>
    </author>
    <updated>2014-04-25T16:28:11Z</updated>
    <published>2014-04-25T16:28:11Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;I’m afraid that this is one of those posts in which the author has to briefly summarize its recent history to make a point at the end. Keep on reading if you are interested in personal awakenings, coding and the sexiness of hexagonal structures…&lt;/p&gt; 
&lt;p&gt;TL;DR Everything is about the secret of steel.&lt;/p&gt; 
&lt;p&gt;At first I was alone, misunderstood, working for a company that wasn’t about software at all. I didn’t have a clear view of the path ahead of me, but thanks to Luis and David and other people I started my journey of continuous improvement, learning as much as I could about coding, design patterns, agile principles, testing, katas, integration, etc.&lt;/p&gt; 
&lt;p&gt;Then I started working at a more technology-friendly organisation, BuntPlanet. My first task was to harness a legacy Struts 1.2, Ibatis 1 using, Java 6 project – eeeeewww, you’d probably scream. But I embraced the opportunity, applying what I had learned so far.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2014/04/the-eye-of-the-storm"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Guille</dc:creator>
    <dc:date>2014-04-25T16:28:11Z</dc:date>
  </entry>
  <entry>
    <title>Automatizar la gestión y aprovisionamiento de tu infraestructura</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2013/12/automatizar-la-gestion-y-aprovisionamiento-de-tu-infraestructura" />
    <category term="gestion-de-infraestructura" />
    <category term="desarrollo-de-software" />
    <category term="integracion-continua" />
    <author>
      <name>David González</name>
    </author>
    <updated>2013-12-23T09:00:42Z</updated>
    <published>2013-12-23T09:00:42Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;La automatizaci&amp;oacute;n de la gesti&amp;oacute;n de infraestructura y aprovisionamiento de los sitemas de manera automatizada es &amp;uacute;ltimamente todo un hype en el mundo del desarrollo de Software. Herramientas tipo &lt;a href="http://www.getchef.com/chef/"&gt;Chef&lt;/a&gt;, &lt;a href="http://puppetlabs.com/"&gt;Puppet&lt;/a&gt;, &lt;a href="http://www.saltstack.com/community.html"&gt;Salt&lt;/a&gt; et cetera se mencionan cont&amp;iacute;nuamente.&lt;br /&gt; Lo que se consigue con este tipo de soluciones es controlar la construcci&amp;oacute;n de las m&amp;aacute;quinas con las que trabajamos, mantener un control sobre los paquetes instalados, cuentas de usuario, configuraciones de todo tipo, nada que muchos sysadmins no hiciesen hasta ahora con nuestros queridos script shell.&lt;br /&gt; Entonces &amp;iquest;cual es el motivo por el cual es interesante realizar la inversi&amp;oacute;n de tiempo (y dinero por tanto) en ello?&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;-Conseguir que &lt;strong&gt;todas nuestros m&amp;aacute;quinas se construyan del mismo modo&lt;/strong&gt;&lt;/li&gt; 
 &lt;li&gt;-Mantener un &lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2013/12/automatizar-la-gestion-y-aprovisionamiento-de-tu-infraestructura"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>David González</dc:creator>
    <dc:date>2013-12-23T09:00:42Z</dc:date>
  </entry>
  <entry>
    <title>Valladolid, 1 de Junio: Programania from the trenches</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2013/05/valladolid-1-de-junio-programania-from-the-trenches" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2013-05-09T07:39:42Z</updated>
    <published>2013-05-09T07:39:42Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;div&gt;
   Creo que no nos puede apetecer m&amp;aacute;s. El s&amp;aacute;bado 1 de Junio estaremos en Valladolid dando unas charlitas David, Guillemo, y yo. Nuestra idea es reflexionar un poco sobre lo que hemos aprendido &amp;uacute;ltimamente con el d&amp;iacute;a a d&amp;iacute;a, “desde las trincheras”. 
 &lt;/div&gt; 
 &lt;div&gt;
   Muchas gracias a la gente de 
  &lt;a href="http://agilecyl.org/"&gt;AgileCyl&lt;/a&gt; en especial 
  &lt;a href="https://twitter.com/aloaisa"&gt;Alvaro&lt;/a&gt; e 
  &lt;a href="https://twitter.com/isidromerayo"&gt;Isidro&lt;/a&gt;! 
 &lt;/div&gt; 
 &lt;div&gt;&lt;/div&gt; 
 &lt;div&gt; 
  &lt;div&gt; 
   &lt;div&gt; 
    &lt;strong&gt;Charlas:&lt;/strong&gt; 
   &lt;/div&gt; 
   &lt;div&gt;&lt;/div&gt; 
   &lt;div&gt;
     &amp;nbsp;-&amp;nbsp; 
    &lt;strong&gt;David Gonz&amp;aacute;lez&lt;/strong&gt;&amp;nbsp;( 
    &lt;a href="https://twitter.com/penguinjournals"&gt;@penguinjournals&lt;/a&gt;) 
   &lt;/div&gt; 
   &lt;div&gt;
     &amp;nbsp; &amp;nbsp;&amp;nbsp; 
    &lt;strong&gt;La gran mentira detr&amp;aacute;s de las BBDD&lt;/strong&gt;:&amp;nbsp;Las BBDD son como las recetas de cocina, todas te dan de comer pero no es lo mismo hacer una tortilla francesa que una tembladera de huevo al espejo de azucar. Veremos como evitar que se te queme la comida. 
   &lt;/div&gt; 
   &lt;div&gt;&lt;/div&gt; 
   &lt;div&gt;
     &amp;nbsp;-&amp;nbsp; 
    &lt;strong&gt;Luis Artola&lt;/strong&gt;&amp;nbsp;( 
    &lt;a href="https://twitter.com/artolamola"&gt;@artolamola&lt;/a&gt;) 
   &lt;/div&gt; 
   &lt;div&gt;
     &amp;nbsp; &amp;nbsp;&amp;nbsp; 
    &lt;strong&gt;La letra peque&amp;ntilde;a del agilismo&lt;/strong&gt;: un ejemplo real de adopci&amp;oacute;n de pr&amp;aacute;cticas &amp;aacute;giles y sobre c&amp;oacute;mo muchas veces la “letra peque&amp;ntilde;a” es m&amp;aacute;s importante que el “titular” de una pr&amp;aacute;ctica &amp;aacute;gil. 
   &lt;/div&gt;
  &lt;/div&gt;
 &lt;/div&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2013/05/valladolid-1-de-junio-programania-from-the-trenches"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2013-05-09T07:39:42Z</dc:date>
  </entry>
  <entry>
    <title>Sobre Colegios de Ingeniería Informática</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2013/04/sobre-colegios-de-ingenieria-informatica" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2013-04-15T10:01:19Z</updated>
    <published>2013-04-15T10:01:19Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;: trabajo desde hace 8 a&amp;ntilde;os dando servicio al Colegio Oficial de Ingenieros Industriales de Gipuzkoa. Gente muy v&amp;aacute;lida que me ha hecho sentir como en casa y me han permitido aportarles todo lo que he podido. Trabajo para ellos y espero que, con su permiso, pueda seguir haci&amp;eacute;ndolo.&lt;/p&gt; 
&lt;p&gt;Desde mi visi&amp;oacute;n, intentar&amp;eacute; aportar algo:&lt;/p&gt; 
&lt;p&gt;Lo primero, bienvenida sea toda la gente que quiera hacer software. Ni&amp;ntilde;os, mayores, hombres, mujeres y, por supuesto, a la gente de CUALQUIER formaci&amp;oacute;n: inform&amp;aacute;tica, art&amp;iacute;stica, t&amp;eacute;cnica, social, dise&amp;ntilde;adores… &amp;iexcl;el software os necesita! Y tranquilos: no vais a bajar la calidad del software (que ya es bastante baja) sino a elevarla y enriquecerla de mil maneras.&lt;/p&gt; 
&lt;p&gt;Lo segundo, gracias a todo el que organiza un eventito, evento, eventazo, charla, hangout, art&amp;iacute;culo o cualquier otro tipo de evento/contenido inform&amp;aacute;tico donde podemos aprender, socializar, hacer netguorquin, o lo que sea, etc. Creo que aportan un mont&amp;oacute;n a la profesi&amp;oacute;n y yo mismo intento participar activamente en la comunidad. La comunidad es important&amp;iacute;sima, chicos. Gracias a vosotros, en software no echamos en falta algunas de las cosas que ofrece un Colegio Profesional.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2013/04/sobre-colegios-de-ingenieria-informatica"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2013-04-15T10:01:19Z</dc:date>
  </entry>
  <entry>
    <title>Algunos pensamientos sobre Story Points</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2013/02/algunos-pensamientos-sobre-story-points" />
    <category term="desarrollo-de-software" />
    <author>
      <name>Luis Artola</name>
    </author>
    <updated>2013-02-13T08:16:56Z</updated>
    <published>2013-02-13T08:16:56Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Iba a escribir un largo comentario en el art&amp;iacute;culo&amp;nbsp;&lt;a href="http://najaraba.blogspot.com.es/2013/02/la-estimacion-agil-de-proyectos-puntos.html"&gt;Mr. Joserra Diaz ha escrito un post sobre Story Poin&lt;/a&gt;ts. Dado que nos est&amp;aacute; ayudando en&lt;a href="http://buntplanet.com/es"&gt; Bunt Planet&lt;/a&gt; en todo lo relacionado con agilismo (&amp;iexcl;contratadlo!), me animo a compartir unas cuantas cosas que he aprendido sobre Puntos de Historia y algunas cosas que pienso.&lt;/p&gt; 
&lt;p&gt;En primer lugar, los Story points no son, para nada, una pr&amp;aacute;ctica del core de agile. No lo son ni de XP, ni de Kanban ni de Scrum. Se puede desarrollar de manera &amp;aacute;gil y no usarlos para nada.&lt;/p&gt; 
&lt;p&gt;No aparecen en la &lt;a href="http://www.scrum.org/Portals/0/Documents/Scrum%20Guides/Scrum_Guide.pdf#zoom=100"&gt;gu&amp;iacute;a Scrum&lt;/a&gt;&amp;nbsp;(aunque es verdad que &lt;a href="http://scrum.jeffsutherland.com/2010/04/story-points-why-are-they-better-than.html"&gt;uno de sus creadores habla positivamente de ellos&lt;/a&gt;)&lt;br /&gt; Existen interesantes art&amp;iacute;culos en su contra como &lt;a href="http://www.industriallogic.com/blog/stop-using-story-points/"&gt;&amp;eacute;ste&lt;/a&gt;. Con grandes comentarios de ilustres agilistas matiz&amp;aacute;ndolos como los que copipego:&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;J.B. Rainsberger:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2013/02/algunos-pensamientos-sobre-story-points"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Luis Artola</dc:creator>
    <dc:date>2013-02-13T08:16:56Z</dc:date>
  </entry>
  <entry>
    <title>Retrospectiva personal 2012</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2012/12/retrospectiva-personal-2-12" />
    <category term="desarrollo-de-software" />
    <author>
      <name>David González</name>
    </author>
    <updated>2012-12-15T12:34:56Z</updated>
    <published>2012-12-15T12:34:56Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Proyectos personales:&lt;br /&gt; Ya hace tiempo que una idea rondaba mi cabeza (&lt;a href="http://yokekomo.com"&gt;yokekomo&lt;/a&gt;).&lt;br /&gt; Para crear esta idea consegu&amp;iacute; algo que ha sido genial, “enga&amp;ntilde;e” a un equipo multidisciplinar formado por algunos de los mejores &lt;a href="http://twitter.com/artolamola"&gt;@artolamola&lt;/a&gt; y &lt;a href="http://twitter.com/ggalmazor"&gt;@ggalmazor&lt;/a&gt; que ten&amp;iacute;an que aportar valor t&amp;eacute;cnico, &lt;a href="http://twitter.com/jonparro"&gt;@jonparro&lt;/a&gt; para la UX y por &amp;uacute;ltimo a las chicas de &lt;a href="http://buzzko.com"&gt;Buzzko&lt;/a&gt;, &lt;a href="http://twitter.com/lacajadezapatos"&gt;@lacajadezapatos&lt;/a&gt; y &lt;a href="http://twitter.com/mallimi"&gt;@mallimi&lt;/a&gt;, periodista y dise&amp;ntilde;adora respectivamente.&lt;br /&gt; Las conclusiones han sido claras, intentamos lanzarlo en un “hackaton” de un fin de semana pero el nivel de exigencia t&amp;eacute;cnica que nos impusimos nos impidi&amp;oacute; llegar a entregar el producto.&lt;br /&gt; En un producto en el que el contenido es el rey, &lt;strong&gt;olvidamos un rol esencial en el equipo&lt;/strong&gt;, el nutricionista, que he conseguido enrolar a lo largo de diciembre (Richard Saenz) por lo que el equipo de &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2012/12/retrospectiva-personal-2-12"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>David González</dc:creator>
    <dc:date>2012-12-15T12:34:56Z</dc:date>
  </entry>
  <entry>
    <title>Creación de objetos eficiente en JavaScript</title>
    <link rel="alternate" href="http://www.blogstack.info/post/cuadernodesoftware/2012/11/creacion-de-objetos-eficiente-en-javascript" />
    <category term="prototipos" />
    <category term="desarrollo-de-software" />
    <category term="javascript" />
    <author>
      <name>Guille</name>
    </author>
    <updated>2012-11-02T12:17:02Z</updated>
    <published>2012-11-02T12:17:02Z</published>
    <content type="html">&lt;p&gt;&lt;blockquote&gt; 
 &lt;p&gt;There’s more than one way to skin a cat&lt;/p&gt; 
&lt;/blockquote&gt; 
&lt;p&gt; – Proverbio ingl&amp;eacute;s.&lt;/p&gt; 
&lt;p&gt;Hay muchas maneras de crear objetos en JavaScript y la que elijamos debe depender de las necesidades particulares de cada problema, pero siempre tenemos que tener en mente la eficiencia del c&amp;oacute;digo que escribamos.&lt;/p&gt; 
&lt;p&gt;En general, queremos que nuestro c&amp;oacute;digo fuente se ejecute &lt;strong&gt;una sola vez&lt;/strong&gt; y que prepare en memoria todo lo necesario para generar objetos, uno detr&amp;aacute;s de otro, como churros y con el m&amp;iacute;nimo esfuerzo posible. Por ello, la mejor opci&amp;oacute;n consiste en usar una funci&amp;oacute;n constructora y a&amp;ntilde;adir aquello que no sea el estado de una nueva instancia en el prototipo de la funci&amp;oacute;n constructora:&lt;/p&gt; 
&lt;div&gt; 
 &lt;table&gt; 
  &lt;tbody&gt; 
   &lt;tr&gt; 
    &lt;td&gt;&lt;pre&gt;var Counter = function(offset) {
  this.value = offset || 0;
};
&amp;nbsp;
Counter.prototype.increase = function() {
  return ++this.value;
};
&amp;nbsp;
Counter.prototype.decrease = function() {
  return --this.value;
};&lt;/pre&gt;&lt;/td&gt;
   &lt;/tr&gt;
  &lt;/tbody&gt;
 &lt;/table&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/cuadernodesoftware/2012/11/creacion-de-objetos-eficiente-en-javascript"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Guille</dc:creator>
    <dc:date>2012-11-02T12:17:02Z</dc:date>
  </entry>
</feed>

