<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Motivos para elegir el framework Apache Tapestry | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry"><span itemprop="headline">Motivos para elegir el framework Apache Tapestry</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/tapestry"><img title="tapestry" alt="tapestry" src="/assets/images/labels/tapestry.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2011/08/motivos-para-elegir-apache-tapestry.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-03-23T18:59" itemprop="dateModified">Actualizado el sábado, 23 de marzo de 2013 a las 18:59 UTC</span></div><div><span>
Etiquetado como
<a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, planeta-arch-linux, planeta-linux, <a href="/label/tapestry"><span itemprop="articleSection">tapestry</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Apache Tapestry" height="133" src="http://4.bp.blogspot.com/-OGvCbjBk0zU/TOq7Y6w6wfI/AAAAAAAAAiU/Pfuzt5kkDBQ/s320/tapestry.png" title="Apache Tapestry" width="320" />
</div>En el mundo del desarrollo web en el entorno Java hay muchos frameworks disponibles en los que elegir (JSP/Servlets, Struts, Grails, Wicket, Play, Seam, ... Tapestry y varios m&aacute;s), a veces la elecci&oacute;n del framework m&aacute;s adecuado para el desarrollo del proyecto que tenemos por delante no suele ser una decisi&oacute;n sencilla y no solo intervienen decisiones t&eacute;cnicas sino tambi&eacute;n los conocimientos y predisposici&oacute;n de aprender que tenga el equipo que vaya a desarrollarlo. Lo que est&aacute; claro es que si el proyecto es m&aacute;s o menos complejo o va a necesitar mantenimiento nadie se plantea desarrollarlo directamente con JSP y Servlets. 
<br />
<br />En la siguiente entrada voy a tratar de explicar algunas caracter&iacute;sticas y dar algunos motivos y razones por los que deber&iacute;as tener en cuenta el framework Apache Tapestry.
<br />
<br />
<b>Componentes</b>
<br />La caracter&iacute;stica estrella para mi de este framework es la alta productividad y la reutilizaci&oacute;n de c&oacute;digo que se puede conseguir con los componentes que se desarrollan en el framework ya que una vez desarrollados pueden ser usados tantas veces como se quiera a lo largo de todo el proyecto sin tener que conocer los detalles de como y que necesitan para funcionar salvo por los par&aacute;metros que recibe. Esta abstracci&oacute;n incluye los estilos y el javascript y Tapestry se encargar&aacute; de agregar e incluir &uacute;nicamente los necesarios en la p&aacute;gina seg&uacute;n la definici&oacute;n de los mismos.
<br />
<br />Pr&aacute;cticamente en todos los proyectos hay necesidad de desarrollar una serie de funcionalidades o componentes comunes que son usados repetidas veces en el mismo o en diferentes proyectos. &iquest;Cuantas veces en un mismo proyecto has tenido que implementar la misma funcionalidad en p&aacute;ginas diferentes? &iquest;y cuantas veces te has tenido que pelear con sus par&aacute;metros que hay que recoger de la request en forma cruda (String) necesitando convertir su tipo correcto o transformarlo a las entidades de dominio? &iquest;y si tienes que hacer la misma funcionalidad en varios sitios de la misma aplicaci&oacute;n, copias y pegas? &iquest;y si tienes que cambiar algo com&uacute;n lo tienes que hacer en todos los sitios? &iquest;cuanto c&oacute;digo duplicado tienes? Est&aacute; claro que tener c&oacute;digo duplicado desperdigado en nuestra aplicaci&oacute;n a la larga ser&aacute; un gran problema en el mantenimiento, pues bien, en con este framework el componente ser&aacute; solo uno y si tienes que hacer un cambio solo necesitar&aacute;s modificarlo en un sitio. Solo tienes que pensar en cual es la funcionalidad que quieres reutilizar (en la misma o diferentes p&aacute;ginas) y meterla en un componente. El desarrollo orientado a componentes predispone para reutilizar c&oacute;digo.
<br />
<br />En frameworks como Struts y Grails se trabaja en t&eacute;rminos de URL y par&aacute;metros en Tapestry en t&eacute;rminos de componentes y objetos. Tapestry se encarga de convertir los parm&aacute;metros de la URL al tipo adecuado y de dejarlo en una propiedad del componente de ese tipo. Tapestry puede transformar un String a un tipo de objeto en concreto (por ejemplo una clase de dominio) y viceversa, esto es necesario ya que todo lo que se env&iacute;a al navegador del usuario ha de ser un String &iquest;quien realiza esa transformaci&oacute;n del objeto a String? &iquest;y de String al objeto cuando se vuelvan a enviar los datos al servidor? Todo esto lo hace a trav&eacute;s de una clase que implementa la interfaz 
<a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/Translator.html">Translator</a>&nbsp;o&nbsp;
<a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/ValueEncoder.html">ValueEncoder</a>.
<br />
<br />Tambi&eacute;n, cuando pasamos un par&aacute;metro a un componente es capaz de hacer las conversiones necesarias para transformar el tipo del par&aacute;metro que pasamos al tipo de par&aacute;metro del componente. En el gr&aacute;fico de 
<a href="http://tapestry.apache.org/typecoercer-service.html">la documentaci&oacute;n de conversiones</a> se pueden ver las que hace se hacer por defecto aunque podr&iacute;amos implementar una nueva si tuviesemos necesidad.
<br />
<br />Adem&aacute;s los componentes pueden ser empaquetados en una librer&iacute;a (un archivo .jar) y ser reutilizados en varios proyectos cosa que har&aacute; que el tiempo de desarrollo de los siguientes proyectos se reduzca bastante si las necesidades son parecidas. Tambi&eacute;n a medida que vayamos tienendo una librer&iacute;a de componentes seremos m&aacute;s productivos en el mismo proyecto si es de larga duraci&oacute;n o tiene mucho mantenimiento.
<br />
<br />Pero tampoco hay que desarrollar los componentes desde cero, Tapestry ya proporciona una 
<a href="http://tapestry.apache.org/current/tapestry-core/ref/">amplia colecci&oacute;n</a> de ellos listos para usar directamente o agreg&aacute;ndolos en los nuevos que creemos y hay varias librer&iacute;as de ellos desarrolladas en otros proyectos. Hay componentes para tratar campos de formularios, que permiten evaluar una condici&oacute;n, para recorrer una colecci&oacute;n de elementos, para crear enlaces, para mostrar errores... tambi&eacute;n hay otros tan complejos como un grid para mostrar datos en una tabla paginada, para editar un bean o para cargar contenido en las p&aacute;ginas a trav&eacute;s de AJAX y algunos otros para otras tareas.
<br />
<br />En el componente grid que proporciona unicamente tendr&aacute;s que implementar el m&eacute;todo que ser&aacute; el que recupere los objetos de la base de datos ya que del resto se encargar&aacute; el componente llamando a nuestro m&eacute;todo de b&uacute;squeda con los par&aacute;metros necesarios para realizarla, como la p&aacute;gina a mostrar. Pero hacer un nuevo componente no es nada complejo, cada componente est&aacute; formado de un controlador (que es una simple clase Java POJO) y normalmente una platilla que es XHTML v&aacute;lido.
<br />
<br />Otra caracter&iacute;sticas importante es que los componentes pueden lanzar eventos que pueden ser procesados por aquellos que los contienen, pudiendo de esta forma realizar diferentes acciones y comportamientos dependiendo del componente en el que est&aacute; contenido. Esto a&ntilde;ade m&aacute;s posibilidades de reutilizaci&oacute;n de los componentes.
<br />
<br />Si desarrollamos muchos proyectos peque&ntilde;os y que no tienen mucho mantenimiento podemos reutilizar los componentes que desarrollamos en un proyecto en otro, si desarrollamos uno, dos o pocos proyectos pero que tienen un gran mantenimiento podemos reutilizarlos igualmente en las funcionalidades comunes. En ambos casos de tipos de proyectos nos beneficiaremos enormemente de los componentes.
<br />
<br />
<b>Modular y contenedor IOC integrado</b>
<br />Pr&aacute;ctiamente cada funcionalidad de Tapestry puede ser modificada o extendida a trav&eacute;s de su contenedor de inversi&oacute;n de control, solo hace falta hacer la contribuci&oacute;n adecuada en el contenedor. Adem&aacute;s, esas contribuciones no se hace en un XML sino que se hace a trav&eacute;s de c&oacute;digo Java con las ventajas que ello conlleva como la asistencia del compilador y la refactorizaci&oacute;n del IDE. El contenedor IOC implementa usa y pone a nuestra disposici&oacute;n varios de los patrones m&aacute;s usados como Chain of Command, Strategy Builder, Chain Builder, Shadow Builder, Pipelines, etc... Finalmente no impone un determinado framework de persistencia, de testing, de seguridad u otra cosa por lo que tendremos libertad de elegir la que m&aacute;s adecuado nos parezca en cada &aacute;mbito a resolver. En un mundo tan cambiante como la tecnolog&iacute;a cuando surja esa otra nueva y brillante forma de hacer las cosas no nos veremos encadenados a una en concreto porque Tapestry nos lo exija y eso tarde o temprano pasar&aacute;. &iquest;Quiz&aacute; dentro de poco pase con 
<a href="http://www.hibernate.org/">hibernate</a> y 
<a href="http://code.google.com/p/activejdbc/">activejdbc</a>? &iquest;Te gustar&iacute;a estar encadenado a un framework que te imponga un modelo o framework de persistencia en concreto?
<br />
<br />Hay plugins para las herramentas m&aacute;s habituales como Hibernate, String, Quartz, JFreeChart, Lucene, ... y si no existe siempre se puede hacer una integraci&oacute;n definiendo un nuevo servicio. Como he dicho pr&aacute;cticamente cualquier apartado puede ser extendido o adaptado a nuestras necesidades. &iquest;Necesitas un validador o un objeto que convieta de un tipo a otro? No hay problema, implementa en un objeto la interfaz adecuada, configuralo en la aplicaci&oacute;n y &eacute;l se encarga de usarlo cuando sea necesario.
<br />
<br />Tapestry no es un framework &laquo;full stack&raquo; pero eso... &iquest;es un defecto o una ventaja? Dependiendo del tipo de proyecto, nuestras preferencias o necesidades puede ser una cosa u otra.
<br />
<br />
<b>Exception reporting</b>
<br />Otra buena caracter&iacute;stica de Tapestry es que cuando algo va mal no solo nos da la traza de la excepci&oacute;n que se ha producido en la consola del servidor sino que nos muestra una p&aacute;gina con toda la informaci&oacute;n de la aplicaci&oacute;n y de la petici&oacute;n realizada y que ha fallado, con lo que descubrir la causa de la excepci&oacute;n nos ser&aacute; m&aacute;s sencillo. &iquest;Te has exasperado alguna vez porque la l&iacute;nea que se indica en un error no se corresponde con la realidad? En el informe ver&aacute;s la linea 
<strong>exacta</strong> que ha producido la excepci&oacute;n y un extracto del c&oacute;digo fuente de los componentes y los usos de unos a otros hasta llegar a la excepci&oacute;n, adem&aacute;s en la traza el informe te marcar&aacute; en otro color las clases que se han usado de tu aplicaci&oacute;n. Por supuesto est&aacute; pagina puede ser personalizada en un entorno de producci&oacute;n. En Tapestry 5.3 se ha incorporado un informe incluso para las peticiones AJAX y el autor del framework ha publicado un 
<a href="http://tapestryjava.blogspot.com/2011/08/tapestry-53-ajax-exception-reporting.html">screencast en el que se pueden ver los informes de errores</a>&nbsp;en acci&oacute;n.
<br />
<br />
<b>Productividad</b>
<br />En caso de hacer modificaciones en las clases de los componentes, p&aacute;ginas y servicios o a las plantillas de los mismos los cambios se hacen efectivos inmediatamente sin tener que realizar un redespliegue de la aplicaci&oacute;n aunque en algunos casos no nos quede m&aacute;s remedio que hacerlo. A&uacute;n en ese caso la aplicaci&oacute;n tarda poco en arrancar comparado con otros frameworks. Si desarrollamos en Java podemos aprovecharnos del soporte de refactor que ofrecen los IDE. La productividad se consigue reutilizando componentes ya desarrollados y probados.
<br />
<br />
<b>Rendimiento y escalabilidad</b>
<br />En las &uacute;ltimas versiones se han incorporado caracter&iacute;sticas para aumentar el rendimiento y su escalabilidad como la eliminaci&oacute;n del pool de p&aacute;ginas, ahora solo hay una instancia para todas las peticiones de la aplicaci&oacute;n, la eliminaci&oacute;n de espacios en blanco innecesarios lo que reduce el tama&ntilde;o del contenido a devolver, la compresi&oacute;n del contenido devuelto para reducirlo a&uacute;n m&aacute;s y la agregaci&oacute;n de javascripts y hojas de estilo para reducir el n&uacute;mero de peticiones a realizar al servidor. Con estas caracter&iacute;sticas se consigue que la p&aacute;gina carge m&aacute;s r&aacute;pido en el cliente y disminuya la carga de trabajo en el servidor al realizarse menos peticiones.
<br />
<br />
<b>Soporte localizaci&oacute;n</b>
<br />En otros frameworks es habitual que solo exista un bundle con las traducciones de toda la aplicaci&oacute;n. Tapestry permite una granularidad mayor, los componentes pueden tener su propio bundle de propeties con las traducciones espec&iacute;ficas de ese componente, adem&aacute;s los componentes y p&aacute;ginas pueden tener una plantilla diferente seg&uacute;n el locale (y a partir de la versi&oacute;n 5.3 podriamos tener una 
<a href="http://blog.tapestry5.de/index.php/2011/06/24/template-skinning/">plantilla diferente si el cliente es un dispositivo movil</a> u otras caracter&iacute;sticas que decidamos) e incluso las im&aacute;genes con textos son recursos que podr&iacute;an localizarse eligiendo la adecuada seg&uacute;n el lenguaje de la aplicaci&oacute;n.
<br />
<br />
<b>Validaciones</b>
<br />La validaci&oacute;n de los datos de entrada de un usuario de la aplicaci&oacute;n es una de las cosas importantes que como desarrolladores tenemos que tratar. La validaciones son muy simples de aplicar ya que se hace de forma declarativa dejando a Tapestry todo el trabajo de comprobarlas en el servidor. Adem&aacute;s es capaz de presentar los errores al usuario en caso de que alguna haya producido alg&uacute;n error. Soporta la especificaci&oacute;n JSR-303.
<br />
<br />
<b>Pol&iacute;glota</b>
<br />&iquest;Te gustan otros lenguajes que han aparecido recientemente y que se pueden ejecutar sobre la Java VM como Groovy o Scala? Pues con &eacute;l puedes desarrollar tus componentes, p&aacute;ginas y servicios con el lenguaje que prefieras ya sea Java, Groovy, Scala o cualquier otro que se pueda ejecutar sobre la m&aacute;quina virtual. Puedes ver un ejemplo en otra entrada que he escrito 
<a href="http://elblogdepicodev.blogspot.com/2011/07/usar-apache-tapestry-5-con-groovy-u.html">Usar Apache Tapestry 5 con Groovy (u otros lenguajes de la JVM)</a>.
<br />
<br />
<b>Otras caracter&iacute;sticas</b>
<br />Tapestry implementa el patr&oacute;n &laquo;
<b>redirect after post</b>&raquo; que resuelve algunos problemas inherentes a las aplicaciones web o los botones atr&aacute;s y adelante de los navegadores. En un art&iacute;culo de theserverside, 
<a href="http://www.theserverside.com/news/1365146/Redirect-After-Post">Redirect After Post</a>, tienes una explicaci&oacute;n m&aacute;s detallada de este patr&oacute;n.
<br />
<br />Adem&aacute;s de las anteriores, y en mi opini&oacute;n personal, otra es que con &eacute;l realmente disfruto programando y quedo satisfecho de como queda el trabajo que realizo. &iquest;Se podr&iacute;a decir algo mejor de un framework de forma resumida?
<br />
<br />Por supuesto no es perfecto y estas&nbsp;&nbsp;son&nbsp;solo unas pocas de sus caracter&iacute;sticas pero creo que en los aspectos importantes como la reutilizaci&oacute;n de c&oacute;digo en base a los componentes, su modularidad, adaptabilidad y gran rendimiento, productividad y su desarrollo sencillo una vez aprendidos sus conceptos b&aacute;sicos considero que gana por mucha diferencia respecto a otros frameworks. Una de sus deficiencias respecto a otros frameworks (o no) como Grails y otros parecidos en otros lenguajes (PHP, Ruby) es que no proporciona un entorno tan integrado (&laquo;full stack&raquo;) como la posibilidad de ejecutar los teses con grails test-app o de ejecutar la aplicaci&oacute;n grails run-app, pero esto tambi&eacute;n tiene la ventaja de que no se nos impone uno y podemos usar el que queramos y tenemos mayor control sobre lo que hacemos.
<br />
<br />La versi&oacute;n actual de Tapestry es la 5.2.6 estando al versi&oacute;n 5.3 en estos momentos en proceso de entrar en estado beta. Los cambios que incorporar&aacute; 5.3 pueden consultarse en las&nbsp;
<a href="http://tapestry.apache.org/release-notes-53.html">notas de publicaci&oacute;n de la versi&oacute;n</a>.
<br />
<br />Si tienes curiosidad de ver algo de c&oacute;digo de una aplicaci&oacute;n puedes ver estas entradas: 
<a href="http://elblogdepicodev.blogspot.com/2010/05/hola-mundo-con-apache-tapestry-5.html">Hola Mundo con Tapestry 5</a>, 
<a href="http://elblogdepicodev.blogspot.com/2011/01/componente-lista-para-tapestry-5.html">Componentes lista paginada con Tapestry</a> y si quieres ver una aplicaci&oacute;n funcionando puedes acceder a este 
<a href="http://hello-world-tapestry5-gae.appspot.com/">Hola Mundo con Tapestry 5</a> que se est&aacute; ejecutando en el Google App Engine. Tambi&eacute;n en la aplicaci&oacute;n&nbsp;
<a href="http://jumpstart.doublenegative.com.au/jumpstart/">JumpStart</a> tienes un mont&oacute;n de ejemplos&nbsp;&nbsp;interesantes&nbsp;con el c&oacute;digo fuente sobre diversas caracter&iacute;sticas de &eacute;l, seguro te sorprende lo simple y &laquo;limpio&raquo; que es el c&oacute;digo para las cosas que se hacen en esos ejemplos.
<br />
<br />En la entrada 
<a href="http://elblogdepicodev.blogspot.com/2010/05/documentacion-sobre-apache-tapestry.html">Documentaci&oacute;n sobre Tapestry</a> puedes ver la documentaci&oacute;n disponible que he ido recopilando por la red.
<br />
<br />Espero que estos motivos os animen a echarle un vistazo, con que s&oacute;lo uno lo hiciera ya me sentir&iacute;a recompensado por haber escrito la entrada. Si es as&iacute; pueden estar atentos a las entradas que escriba en mi blog ya que pretendo seguir escribiendo sobre Tapestry en &eacute;l :).
<br />
<br />Referencia:
<br />
<a href="http://mail-archives.apache.org/mod_mbox/tapestry-users/201201.mbox/%3C4F210FCA.3020801@ictjob.be%3E">http://mail-archives.apache.org/mod_mbox/tapestry-users/201201.mbox/%3C4F210FCA.3020801@ictjob.be%3E</a></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry" st_title="Motivos para elegir el framework Apache Tapestry | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Motivos para elegir el framework Apache Tapestry";
var disqus_url = "http://elblogdepicodev.blogspot.com/2011/08/motivos-para-elegir-apache-tapestry.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/tapestry/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tapestry</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 138,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2011/08/motivos-para-elegir-el-framework-apache-tapestry"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>