<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-12-11T10:03:35Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-12-11T10:03:35Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Probando Plasma 5 en mi portátil</title>
    <link rel="alternate" href="http://www.blogstack.info/post/kdeblog/2014/12/probando-plasma-5-en-mi-portatil" />
    <category term="plasma-5" />
    <category term="kde" />
    <author>
      <name>baltolkien</name>
    </author>
    <updated>2014-12-11T09:10:20Z</updated>
    <published>2014-12-11T09:10:20Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Desde que apareci&amp;oacute; &lt;a href="http://www.kubuntu.org/news/kubuntu-14.10"&gt;Kubuntu 14.10&lt;/a&gt; en mi port&amp;aacute;til de uso diario estoy probando Plasma 5. Han pasado casi dos meses y es el momemto de hacer una peque&amp;ntilde;a reflexi&amp;oacute;n.&lt;/strong&gt;&lt;/p&gt; 
&lt;h2&gt;Probando Plasma 5&lt;/h2&gt; 
&lt;p&gt;Cambiar de entorno de escritorio es un ordenador que es la herramienta habitual de trabajo es una decisi&amp;oacute;n nada trivial.&lt;/p&gt; 
&lt;p&gt;Mi peque&amp;ntilde;o port&amp;aacute;til de 13 pulgadas es el dipositivo que se pasea por todas las aulas donde imparto clase de ESO y en la Universidad. Adem&amp;aacute;s se pasea se pasa el d&amp;iacute;a manejando todo tipo de documentos ofim&amp;aacute;ticos, conect&amp;aacute;ndose a un buen n&amp;uacute;mero de conexiones de inal&amp;aacute;mbricas y a otro buen n&amp;uacute;mero de proyectores.&lt;/p&gt; 
&lt;p&gt;Y cuando mi jornada habitual finaliza, se convierte en mi mi peque&amp;ntilde;a oficina para realizar las publicaciones del blog y centro de ocio en el escaso tiempo que me queda.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/kdeblog/2014/12/probando-plasma-5-en-mi-portatil"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>baltolkien</dc:creator>
    <dc:date>2014-12-11T09:10:20Z</dc:date>
  </entry>
  <entry>
    <title>KaOS: fiel a sus principios</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios" />
    <category term="revision" />
    <category term="kaos" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-12-08T11:26:56Z</updated>
    <published>2014-12-04T15:22:00Z</published>
    <content type="html">&lt;p&gt;Revisi&amp;oacute;n delicada la que acometemos hoy. No deber&amp;iacute;a serlo, pues en el mundo del software libre se supone que ha de imperar la libertad, valga la redundancia, para opinar sobre lo que a cada cual le parezca sin temer a las hordas de &amp;quot;fanboys&amp;quot; que se echan encima a la m&amp;iacute;nima oportunidad. Pero una cosa es lo que me gustar&amp;iacute;a y otra muy distinta la realidad, y me temo por lo ya le&amp;iacute;do en diferentes foros y blogs, que existe una cierta pol&amp;eacute;mica en torno a esta distribuci&amp;oacute;n que hace saltar chispas entre detractores y fieles. Como lo primero es lo primero, yo no me declaro perteneciente a ninguno de los dos grupos, y vaya por delante mi respeto y admiraci&amp;oacute;n por el trabajo de Anke Boersma, desarrolladora en solitario de toda una distribuci&amp;oacute;n GNU/Linux, que no es poco. Anke decidi&amp;oacute; en su d&amp;iacute;a salir de Chakra, algo que en mi humilde opini&amp;oacute;n supuso una grave p&amp;eacute;rdida para la distribuci&amp;oacute;n, por tratarse de una persona que colaboraba activamente en el desarrollo y en los foros, como creo que se puede intuir por su incansable trabajo al frente de KaOS. Pero as&amp;iacute; es el software libre: la gente viene, la gente va. Y a &amp;quot;demm&amp;quot;, antes &amp;quot;abveritas&amp;quot;, se le echa de menos.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/kaos-fiel-a-sus-principios"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-12-04T15:22:00Z</dc:date>
  </entry>
  <entry>
    <title>Free software, beyond software de Agustín Benito</title>
    <link rel="alternate" href="http://www.blogstack.info/post/kdeblog/2014/12/free-software-beyond-software-de-agustin-benito" />
    <category term="ted" />
    <category term="video" />
    <category term="tedx" />
    <category term="kde" />
    <author>
      <name>baltolkien</name>
    </author>
    <updated>2014-12-07T09:10:11Z</updated>
    <published>2014-12-07T09:10:11Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Hoy me siento especialmente feliz ya que os voy a presentar una peque&amp;ntilde;a charla de la famosa serie TEDx, una ponencia titulada Free software, beyond software de Agust&amp;iacute;n Benito, un destacado miembro de la Comunidad KDE y una persona que, aunque apenas nos hemos visto diez veces a lo largo de nuestra vida, creo que compartimos un v&amp;iacute;nculo que podr&amp;iacute;amos definir como de amistad.&lt;/strong&gt;&lt;/p&gt; 
&lt;h2&gt;&amp;iquest;Qu&amp;eacute; son las charlas TED? &amp;iquest;Y lasTEDx? &lt;/h2&gt; 
&lt;p&gt;Para los que no lo sepan las charlas TED (&lt;b&gt;Tecnolog&amp;iacute;a, Entretenimiento, Dise&amp;ntilde;o&lt;/b&gt;) son unas ponencias organizadas por el organismo del mismo nombre cuya finalidad es difundir ideas dignas de ser difundidas, en las que han participados desde presidentes del gobierno de EE.UU como &lt;a href="http://es.wikipedia.org/wiki/Bill_Clinton"&gt;Bill Clinton&lt;/a&gt;. o premios N&amp;oacute;bel (&lt;a href="http://es.wikipedia.org/wiki/James_D._Watson"&gt;James D. Watson&lt;/a&gt;, &lt;a href="http://es.wikipedia.org/wiki/Murray_Gell-Mann"&gt;Murray Gell-Mann&lt;/a&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/kdeblog/2014/12/free-software-beyond-software-de-agustin-benito"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>baltolkien</dc:creator>
    <dc:date>2014-12-07T09:10:11Z</dc:date>
  </entry>
  <entry>
    <title>Disponible la versión candidata de KDE Aplicaciones 14.12</title>
    <link rel="alternate" href="http://www.blogstack.info/post/kdeblog/2014/11/disponible-la-version-candidata-de-kde-aplicaciones-14-12" />
    <category term="kde" />
    <category term="kde-aplicaciones-14-12" />
    <author>
      <name>baltolkien</name>
    </author>
    <updated>2014-11-29T07:14:25Z</updated>
    <published>2014-11-29T07:14:25Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Ya est&amp;aacute; disponible la&amp;nbsp;versi&amp;oacute;n candidata de KDE Aplicaciones 14.12, es decir, el siguiente gran actualizaci&amp;oacute;n de las aplicaciones de la Comunidad KDE para su escritorio Plasma para gnu/linux y sus versiones en otros sistemas operativos.&lt;br /&gt; &lt;/strong&gt;&lt;/p&gt; 
&lt;h2&gt;Disponible la versi&amp;oacute;n candidata de KDE Aplicaciones 14.12&lt;/h2&gt; 
&lt;div&gt;
  El 
 &lt;strong&gt;pasado 27 de noviembre&lt;/strong&gt;, puntuales como un reloj suizo, el equipo de desarrolladores de KDE anunciaron qu 
 &lt;strong&gt;e ya est&amp;aacute; disponible la&amp;nbsp;versi&amp;oacute;n candidata de KDE Aplicaciones 14.12.&lt;br /&gt; &lt;/strong&gt; 
&lt;/div&gt; 
&lt;div&gt;
  Para los que no lo sepan, una versi&amp;oacute;n candidata es la antesala de la versi&amp;oacute;n definitiva, es decir, la versi&amp;oacute;n final a menos que encuentren un error grave en el tiempo previsto del lanzamiento oficial. 
&lt;/div&gt; 
&lt;div&gt;
  Desde el anuncio 
 &lt;strong&gt; de la primera beta, se termin&amp;oacute; el tiempo de a&amp;ntilde;adir nueva&amp;nbsp; funcionalidades y se&amp;nbsp;&lt;/strong&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/kdeblog/2014/11/disponible-la-version-candidata-de-kde-aplicaciones-14-12"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>baltolkien</dc:creator>
    <dc:date>2014-11-29T07:14:25Z</dc:date>
  </entry>
  <entry>
    <title>openSUSE 13.2: cosas que mejorar</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar" />
    <category term="revision" />
    <category term="opensuse" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-11-18T17:19:54Z</updated>
    <published>2014-11-18T17:19:00Z</published>
    <content type="html">&lt;p&gt;No sab&amp;eacute;is el trabajo que me ha costado decidirme a escribir este art&amp;iacute;culo. Para alguien enamorado del mundo del FOSS no hay nada m&amp;aacute;s apetecible que airear a los cuatro vientos las virtudes de un sistema operativo libre, gratuito y de c&amp;oacute;digo abierto, como lo es openSUSE. As&amp;iacute; lo hice y estuve encantado de hacerlo con la 
&lt;a href="http://www.lasombradelhelicoptero.com/2013/03/opensuse-123-si-la-perfeccion-existiera.html"&gt;&amp;uacute;ltima versi&amp;oacute;n&lt;/a&gt; revisada, la que en su momento coron&amp;eacute; como mejor sistema jam&amp;aacute;s probado en este blog. No obstante, tambi&amp;eacute;n las hubo algo peores, e incluso alguna 
&lt;a href="http://www.lasombradelhelicoptero.com/2011/11/opensuse-121-un-pasito-atras.html"&gt;bastante deficiente&lt;/a&gt;. As&amp;iacute; es este mundillo, tan variable y tan dependiente de la m&amp;aacute;quina en la que se utiliza cada sistema. Y la versi&amp;oacute;n que hoy nos ocupa, de nombre c&amp;oacute;digo Harlequin, no se ha comportado como yo esperaba. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/-KfH3HPpr3ic/VGtmd2hL_wI/AAAAAAAAFTY/Zj6gVbdG5lQ/s1600/Opensuse-logo%2Btype-wog.sh-600x600.png"&gt;&lt;img src="http://4.bp.blogspot.com/-KfH3HPpr3ic/VGtmd2hL_wI/AAAAAAAAFTY/Zj6gVbdG5lQ/s1600/Opensuse-logo%2Btype-wog.sh-600x600.png" height="320" width="320" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Puesto que silenciar los errores no ayuda en absoluto a corregirlos, os propongo hacer un repaso por este nuevo lanzamiento de la distro de Geeko, viendo tanto los problemas como las muchas virtudes, que por supuesto tambi&amp;eacute;n las tiene, y recordando, una vez m&amp;aacute;s y van mil, que se trata de una revisi&amp;oacute;n realizada en un hardware espec&amp;iacute;fico. Para otros ordenadores, la experiencia puede variar. Y mucho.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/opensuse-13-2-cosas-que-mejorar"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-11-18T17:19:00Z</dc:date>
  </entry>
  <entry>
    <title>KDE Telepathy 0.9.0 con encriptación OTR</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/10/kde-telepathy-9-con-encriptacion-otr" />
    <category term="noticias" />
    <category term="kde" />
    <category term="software-libre" />
    <author>
      <name>victorhck</name>
    </author>
    <updated>2014-10-20T10:21:41Z</updated>
    <published>2014-10-20T10:21:41Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Telepathy, el cliente de mensajer&amp;iacute;a instant&amp;aacute;nea de KDE lanza una nueva versi&amp;oacute;n, con m&amp;uacute;ltiples mejoras y nuevas funcionalidades.&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;img src="http://static.davidedmundson.co.uk/blog/ktp_09/ktp_otr.png" alt="" width="661" height="488" /&gt;&lt;/p&gt; 
&lt;p&gt;De las cenizas de &lt;strong&gt;Kopete&lt;/strong&gt; resurgi&amp;oacute; hace tiempo &lt;strong&gt;Telepathy,&lt;/strong&gt; el cliente de mensajer&amp;iacute;a instant&amp;aacute;nea (y mucho m&amp;aacute;s) para escritorios KDE.&lt;/p&gt; 
&lt;p&gt;Hoy leo la noticia de que los desarrolladores de &lt;strong&gt;Telepathy&lt;/strong&gt; han lanzado una nueva versi&amp;oacute;n de este paquete, la 0.9.0. Y como es habitual, corrigen errores reportados, y a&amp;ntilde;aden nuevas funcionalidades.&lt;/p&gt; 
&lt;h2&gt;Off The Record (OTR)&lt;/h2&gt; 
&lt;p&gt;Entre ellas una de las m&amp;aacute;s esperadas es el cifrado &lt;a href="https://es.wikipedia.org/wiki/Off_the_record_messaging"&gt;&lt;strong&gt;OTR&lt;/strong&gt;&lt;/a&gt; que a&amp;ntilde;ade un nivel extra de cifrado al protocolo ya existente que se env&amp;iacute;a en cads mensaje. Este cifrado previene cualquier tipo de intento potencial de “husmear” en las conversaciones.&lt;/p&gt; 
&lt;p&gt;Esta nueva funcionalidad hay que agradec&amp;eacute;rsela a &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/10/kde-telepathy-9-con-encriptacion-otr"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>victorhck</dc:creator>
    <dc:date>2014-10-20T10:21:41Z</dc:date>
  </entry>
  <entry>
    <title>Chakra Euler: conocimos tiempos mejores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores" />
    <category term="revision" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-10-20T09:40:12Z</updated>
    <published>2014-10-20T09:40:00Z</published>
    <content type="html">&lt;p&gt;Bienvenidos a una nueva etapa de revisiones en el blog. Motivado por un renovado esp&amp;iacute;ritu curioso y unas tremendas ganas de retomar la principal y m&amp;aacute;s demandada actividad de LSDH, me dispongo a relatar mis experiencias con un nuevo lanzamiento de la que siempre consider&amp;eacute; mi distribuci&amp;oacute;n favorita: Chakra Euler. Como muchos ya sab&amp;eacute;is, 
&lt;a href="http://www.lasombradelhelicoptero.com/p/chakra.html"&gt;Chakra&lt;/a&gt; es una distro tipo &amp;quot;semi-rolling&amp;quot;, que publica una imagen con el estado de los repositorios cuatro veces al a&amp;ntilde;o, aprovechando habitualmente para actualizar los paquetes centrales y cr&amp;iacute;ticos. Pero el continuo lanzamiento de nuevas versiones no es &amp;oacute;bice para que, de cuando en cuando echemos un vistazo escrutador, siempre con cari&amp;ntilde;o, eso s&amp;iacute;, al momento en que se encuentra la distro. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-4Ga3QOa_nUM/Uht2iSk_bqI/AAAAAAAAD68/CyVtrBza2FI/s1600/chakra-logo1.png"&gt;&lt;img src="http://3.bp.blogspot.com/-4Ga3QOa_nUM/Uht2iSk_bqI/AAAAAAAAD68/CyVtrBza2FI/s1600/chakra-logo1.png" height="320" width="320" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Antes de comenzar considero importante hacer un par de puntualizaciones sobre las clasificaciones. He introducido alg&amp;uacute;n cambio en los par&amp;aacute;metros, confiriendo mayor importancia al rendimiento ofrecido, de modo que a la tradicional bater&amp;iacute;a de pruebas de la Phoronix Test Suite se viene a a&amp;ntilde;adir un &amp;quot;benchmark&amp;quot; de navegadores (Browsermark 2.1) que ejecuto sobre los dos m&amp;aacute;s utilizados (Firefox y Chrome), a la par que incluyo el tiempo de transferencia de archivos a dispositivos externos como indicador de calidad.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/chakra-euler-conocimos-tiempos-mejores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-10-20T09:40:00Z</dc:date>
  </entry>
  <entry>
    <title>Instalando Telegram en Kubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalando-telegram-en-kubuntu" />
    <category term="play" />
    <category term="unity" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="mensajeria" />
    <category term="ubuntu" />
    <category term="kubuntu" />
    <category term="telegram" />
    <category term="kde" />
    <category term="chromium" />
    <category term="linux" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-10-04T19:27:12Z</updated>
    <published>2014-10-04T19:24:25Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-gallery.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-gallery.jpg" alt="telegram-gallery" width="640" height="360" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Hace un tiempo ya expliqu&amp;eacute; las bondades de &lt;a title="&amp;iquest;Qui&amp;eacute;n hay detr&amp;aacute;s de Telegram?" href="http://www.ochobitshacenunbyte.com/2014/02/24/quien-hay-detras-de-telegram/"&gt;&lt;strong&gt;Telegram&lt;/strong&gt;&lt;/a&gt;, su gran privacidad, incluido el uso de un potente cifrado y la posibilidad de realizar conversaciones privadas, donde cada interlocutor usar&amp;aacute; claves de cifrado distintas, y el historial se guardar&amp;aacute; en nuestro equipo local y no en la nube. Aunque esto hace que dichas conversaciones no nos aparezcan en el resto de dispositivos.&lt;/p&gt; 
&lt;p&gt;Hoy explicar&amp;eacute; c&amp;oacute;mo instalarlo en &lt;strong&gt;Ubuntu&lt;/strong&gt; y sus derivadas, que en mi caso es &lt;strong&gt;Kubuntu&lt;/strong&gt;. La verdad es que es muy sencillo, s&amp;oacute;lo tenemos que ir a la p&amp;aacute;gina oficial del proyecto y all&amp;iacute; dirigirnos a la p&amp;aacute;gina de descargas.&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-kubuntu-2.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/10/telegram-kubuntu-2.jpg" alt="telegram-kubuntu-2" width="435" height="585" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Cuando descargamos el archivo comprimido lo que tenemos una vez descargado son los binarios, por lo tanto para ejecutarlo tenemos que clickar sobre el archivo ejecutable llamado “Telegram”&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/10/instalando-telegram-en-kubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-10-04T19:24:25Z</dc:date>
  </entry>
  <entry>
    <title>Me cambio a KDE en Ubuntu</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/10/me-cambio-a-kde-en-ubuntu" />
    <category term="opinion" />
    <category term="ubuntu" />
    <category term="kde" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-10-02T20:45:16Z</updated>
    <published>2014-10-02T20:45:16Z</published>
    <content type="html">&lt;p&gt;&lt;div&gt; 
 &lt;p&gt;Llevaba ya un tiempo que quer&amp;iacute;a cambiar de entorno gr&amp;aacute;fico y creo que ha llegado el momento. Tengo que decir que tambi&amp;eacute;n hab&amp;iacute;a pensado en cambiar de distribuci&amp;oacute;n principal pero eso lo voy a dejar por ahora, voy a seguir con &lt;strong&gt;Ubuntu&lt;/strong&gt; pero con &lt;strong&gt;KDE&lt;/strong&gt;, concretamente voy a instalar Kubuntu en los pr&amp;oacute;ximos d&amp;iacute;as.&lt;/p&gt; 
 &lt;p&gt;Despu&amp;eacute;s de estar probandolo unos d&amp;iacute;as y de cacharrearlo he decidido hacer el cambio. Se que no es un cambio demasiado grande, ya que seguir&amp;eacute; usando Ubuntu pero nunca me he metido a fondo con &lt;strong&gt;KDE&lt;/strong&gt; porque no me terminaba de convencer, pero hace alrededor de un a&amp;ntilde;o que me viene picando el gusanillo y por fin me he decidido, &amp;iquest;que le vamos a hacer? soy un poco indeciso &lt;img src="http://elblogdeliher.com/wp-includes/images/smilies/icon_biggrin.gif" alt=":D" /&gt;&lt;/p&gt; 
 &lt;p&gt;El cambio es por varias razones y entre ellas no esta el que Unity no me guste, al principio era una patata, para mi gusto, pero fue evolucionando bien y tengo que decir que al final si me gustaba, lo usaba a partes iguales con Cairo Dock, aunque me gustaba mas este ultimo.&lt;/p&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/10/me-cambio-a-kde-en-ubuntu"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-10-02T20:45:16Z</dc:date>
  </entry>
  <entry>
    <title>Guardar nuestra colección de cd’s con K3b</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/guardar-nuestra-coleccion-de-cd-s-con-k3b" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="musica" />
    <category term="kubuntu" />
    <category term="banshee" />
    <category term="k3b" />
    <category term="kde" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-09-26T11:15:23Z</updated>
    <published>2014-09-23T22:24:15Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/k3b-logo-150.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/09/k3b-logo-150.jpg" alt="k3b-logo-150" width="150" height="150" /&gt;&lt;/a&gt;Lo reconozco, durante muchos a&amp;ntilde;os he ido acumulando decenas de cd’s de m&amp;uacute;sica. No lo pod&amp;iacute;a evitar, cuando se pusieron de moda y destronaron (temporalmente) a los vinilos era un adolescente sin un chavo, y m&amp;aacute;s tarde cuando comenz&amp;eacute; a trabajar y gan&amp;eacute; mi primer sueldo, me fu&amp;iacute; directo a la tienda de discos. Ahora han pasado los a&amp;ntilde;os, y tras tres mudanzas de piso, ya no tengo espacio para tanto cd’s, dvd y dem&amp;aacute;s elementos de ocio. La soluci&amp;oacute;n la he encontrado con el programa &lt;strong&gt;K3b,&lt;/strong&gt; que viene nativo en Kubuntu, y que me permite grabar toda mi m&amp;uacute;sica en ficheros de audio.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h2&gt;Sobre K3b&lt;/h2&gt; 
&lt;p&gt;&lt;strong&gt;K3b (&lt;/strong&gt;KDE, burn, baby, burn) es una completa interfaz para la grabaci&amp;oacute;n de cd’s y DVD, funcionando sobre sistemas &lt;strong&gt;GNU/Linux&lt;/strong&gt; y &lt;strong&gt;FreeBSD&lt;/strong&gt;.&amp;nbsp; Podemos hacer gran cantidad de cosas:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/09/guardar-nuestra-coleccion-de-cd-s-con-k3b"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-09-23T22:24:15Z</dc:date>
  </entry>
  <entry>
    <title>openSUSE presente en Akademy 2014</title>
    <link rel="alternate" href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/09/opensuse-presente-en-akademy-2-14" />
    <category term="eventos" />
    <category term="opensuse" />
    <category term="kde" />
    <author>
      <name>Victor Hck</name>
    </author>
    <updated>2014-09-15T14:30:57Z</updated>
    <published>2014-09-15T14:30:57Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;strong&gt;Akademy es el gran encuentro multinacional de la comunidad KDE, en el que openSUSE no pod&amp;iacute;a faltar!&lt;br /&gt; &lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;a href="https://lh3.googleusercontent.com/o5w_ul-Z5e9enj5RKBqqYGKzN4L7sqT26sw2eRNtmoE=w884-h590-no"&gt;&lt;img src="https://lh5.googleusercontent.com/o5w_ul-Z5e9enj5RKBqqYGKzN4L7sqT26sw2eRNtmoE=w301-h200-p-no" alt="" width="301" height="200" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;p&gt;Del &lt;strong&gt;6 al 12 de Septiembre de 2014&lt;/strong&gt; se celebr&amp;oacute; en la ciudad de Brno, en la Rep&amp;uacute;blica Checa, &lt;strong&gt;Akademy el gran encuentro de entusiastas de KDE&lt;/strong&gt; y de muchas otras comunidades del software libre, entre ellas no pod&amp;iacute;a faltar la presencia de openSUSE.&lt;/p&gt; 
&lt;p&gt;El proyecto de &lt;strong&gt;openSUSE&lt;/strong&gt; tuvo un stand en el que voluntarios de la comunidad informaban, daban a conocer, y difund&amp;iacute;an las ventajas de este sistema operativo de GNU/Linux. En &amp;eacute;l se reparti&amp;oacute; informaci&amp;oacute;n &lt;strong&gt;y elementos de promoci&amp;oacute;n Geek!&lt;/strong&gt; Adem&amp;aacute;s tambi&amp;eacute;n mostraron la nueva versi&amp;oacute;n de openSUSE Factory Rolling Release a los que por all&amp;iacute; se acercaron&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;La presencia de la comunidad de openSUSE en los eventos m&amp;aacute;s importantes&lt;/strong&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/victorhckinthefreeworld/2014/09/opensuse-presente-en-akademy-2-14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Victor Hck</dc:creator>
    <dc:date>2014-09-15T14:30:57Z</dc:date>
  </entry>
  <entry>
    <title>Krita, el editor de pintura digital</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/krita-el-editor-de-pintura-digital" />
    <category term="comics" />
    <category term="diseno" />
    <category term="mate" />
    <category term="gimp" />
    <category term="blog-stack" />
    <category term="programas" />
    <category term="krita" />
    <category term="kde" />
    <category term="ilustracion" />
    <category term="gnome" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-09-01T07:54:02Z</updated>
    <published>2014-08-31T05:45:36Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/icon-kritaDesktop-150.png"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/icon-kritaDesktop-150.png" alt="icon-kritaDesktop-150" width="150" height="150" /&gt;&lt;/a&gt;Tengo que admitir que como administrador de sistemas, el tema del dise&amp;ntilde;o digital se me escapa bastante de las manos. Eso s&amp;iacute;, &lt;strong&gt;GIMP&lt;/strong&gt; me ha ayudado mucho para los pocos retoques que de vez en cuando debo realizar en las im&amp;aacute;genes. He tenido una grata sorpresa en encontrarme con &lt;strong&gt;Krita&lt;/strong&gt;, un programa de pintura digital, pensado para entornos &lt;strong&gt;KDE&lt;/strong&gt;, que funciona perfecto en otros entornos como &lt;strong&gt;Gnome&lt;/strong&gt; o &lt;strong&gt;Mate&lt;/strong&gt;, y que tambi&amp;eacute;n es compatible con &lt;strong&gt;Mac OSX&lt;/strong&gt; e incluso con &lt;strong&gt;Microsoft Windows&lt;/strong&gt;. S&amp;oacute;lo puedo decir una palabra, incre&amp;iacute;ble.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h2&gt;Sobre Krita&lt;/h2&gt; 
&lt;p&gt;A diferencia de &lt;strong&gt;GIMP&lt;/strong&gt; que est&amp;aacute; pensando para el retoque fotogr&amp;aacute;fico, se ha dise&amp;ntilde;ado pensando en la pintura digital y en la ilustraci&amp;oacute;n. Se encuentra integrado dentro de la suite &lt;strong&gt;Calligra Suite&lt;/strong&gt; y liberado bajo la licencia de software libre &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/krita-el-editor-de-pintura-digital"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-08-31T05:45:36Z</dc:date>
  </entry>
  <entry>
    <title>KDEdu, el proyecto de educación de KDE</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/kdedu-el-proyecto-de-educacion-de-kde" />
    <category term="kdedu" />
    <category term="kturtle" />
    <category term="klettres" />
    <category term="kubuntu" />
    <category term="educacion" />
    <category term="cantor" />
    <category term="edu-kde" />
    <category term="kbruch" />
    <category term="blog-stack" />
    <category term="blinken" />
    <category term="kgeography" />
    <category term="kstars" />
    <category term="kde" />
    <category term="kalzium" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-08-14T11:24:53Z</updated>
    <published>2014-08-14T11:17:31Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/kdedu-logo-1.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/kdedu-logo-1.jpg" alt="kdedu-logo-1" width="150" height="66" /&gt;&lt;/a&gt;Hoy descubrimos &lt;strong&gt;KDEdu&lt;/strong&gt;, un proyecto colaborativo para el desarrollo de software educativo libre (bajo licencia &lt;strong&gt;GPL&lt;/strong&gt;) para el escritorio &lt;strong&gt;KDE&lt;/strong&gt;. El desarrollo est&amp;aacute; enfocado en crear productos para colegios, estudiantes y para los padres en casa, y para todas las personas que quieran ampliar sus conocimientos.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;h2&gt;&lt;strong&gt;Un poco de historia&lt;/strong&gt;&lt;/h2&gt; 
&lt;p&gt;Seg&amp;uacute;n leemos en su &lt;a title="KDE Edu" href="http://edu.kde.org/"&gt;web oficial&lt;/a&gt;, el proyecto &lt;strong&gt;KDE-Edu&lt;/strong&gt; naci&amp;oacute; en julio de 2001, buscando el desarrollo de software educativo libre. Se cre&amp;oacute; un nuevo m&amp;oacute;dulo en &lt;strong&gt;KDE&lt;/strong&gt;, llamado &lt;strong&gt;&lt;em&gt;kdeedu&lt;/em&gt;&lt;/strong&gt;, que se uni&amp;oacute; al lanzamiento oficial de &lt;strong&gt;KDE 3.0&amp;nbsp;&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/kdedu-captura-1.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/08/kdedu-captura-1.jpg" alt="kdedu-captura-1" width="600" height="544" /&gt;&lt;/a&gt;&lt;/p&gt; 
&lt;h2&gt;&lt;strong&gt;Las aplicaciones&lt;/strong&gt;&lt;/h2&gt; 
&lt;p&gt;El proyecto desarrolla aplicaciones para diferentes franjas de edad y materias. Las franjas est&amp;aacute;n divididas en tres categor&amp;iacute;as:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Preescolar&lt;/li&gt; 
 &lt;li&gt;Escuela&lt;/li&gt; 
 &lt;li&gt;Universidad&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Y en temas:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Idioma&lt;/li&gt; 
 &lt;li&gt;Matem&amp;aacute;ticas&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/08/kdedu-el-proyecto-de-educacion-de-kde"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-08-14T11:17:31Z</dc:date>
  </entry>
  <entry>
    <title>KDE Connect: o porqué cada día siento mas amor hacia KDE y sus (locos) desarrolladores</title>
    <link rel="alternate" href="http://www.blogstack.info/post/laborategia/2014/04/kde-connect-o-porque-cada-dia-siento-mas-amor-hacia-kde-y-sus-locos-desarrolladores" />
    <category term="opinion" />
    <category term="blog-stack" />
    <category term="linux" />
    <category term="aplicaciones" />
    <category term="en-castellano" />
    <category term="cosas-que-hago" />
    <category term="howto" />
    <category term="cosas-que-veo" />
    <category term="kde" />
    <author>
      <name>Dabid Martinez</name>
    </author>
    <updated>2014-06-21T12:37:50Z</updated>
    <published>2014-04-29T14:03:53Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hace unos pocos a&amp;ntilde;os, cambie mi escritorio de &lt;a href="http://es.wikipedia.org/wiki/GNOME"&gt;GNOME&lt;/a&gt; a &lt;a href="http://es.wikipedia.org/wiki/KDE"&gt;KDE&lt;/a&gt;, b&amp;aacute;sicamente por una raz&amp;oacute;n, GNOME3 ademas de no gustarme me l&amp;iacute;a y no me sirve para trabajar, no termino de pillarlo, de sentirme c&amp;oacute;modo. Tambi&amp;eacute;n es cierto que al principio no me sent&amp;iacute;a c&amp;oacute;modo con el escritorio de KDE, pero cada d&amp;iacute;a que pasa me siento mas a gusto en el. De hecho creo que hoy por hoy no lo cambiar&amp;iacute;a de nuevo por GNOME, cuando te acostumbras a las configuraciones de KDE y sobre todo comienzas a saber donde encontrar cada una de ellas en caso de tener que modificarlas es un entorno la mar de c&amp;oacute;modo. Otro tema tambi&amp;eacute;n es conocer sus mejores softwares, pero eso es muy f&amp;aacute;cil si te das un paseo por &lt;a href="http://www.kdeblog.com/explora-aplicaciones-con-muon-discover.html"&gt;Muon Discover&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;La integraci&amp;oacute;n de &lt;a href="http://es.wikipedia.org/wiki/Android"&gt;Android&lt;/a&gt; con el port&amp;aacute;til puede ser un quebradero de cabeza, lo podamos hacer por bluetooth, &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/laborategia/2014/04/kde-connect-o-porque-cada-dia-siento-mas-amor-hacia-kde-y-sus-locos-desarrolladores"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Dabid Martinez</dc:creator>
    <dc:date>2014-04-29T14:03:53Z</dc:date>
  </entry>
  <entry>
    <title>Chakra y yo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/05/chakra-y-yo" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-05-22T16:29:09Z</updated>
    <published>2014-05-22T11:25:00Z</published>
    <content type="html">&lt;p&gt;No me pregunt&amp;eacute;is por qu&amp;eacute;, no sabr&amp;iacute;a deciros, pero hoy siento la imperiosa necesidad de hablar de mi distribuci&amp;oacute;n GNU/Linux favorita. Podr&amp;iacute;a hacer un nuevo tutorial de instalaci&amp;oacute;n, 
&lt;a href="http://www.lasombradelhelicoptero.com/2012/05/tutorial-instalacion-de-chakra.html"&gt;el antiguo&lt;/a&gt; ya se qued&amp;oacute; m&amp;aacute;s que obsoleto, pero obviando el tema de los extintos &amp;quot;bundles&amp;quot;, poca cosa ha cambiado. Tambi&amp;eacute;n podr&amp;iacute;a optar por un art&amp;iacute;culo del estilo &amp;quot;cosas que hacer despu&amp;eacute;s de...&amp;quot;, pero resulta que 
&lt;a href="http://www.lasombradelhelicoptero.com/2013/02/cosas-que-hacer-despues-de-instalar.html"&gt;ya existe&lt;/a&gt;, y sigue vigente. &amp;iquest;Entonces? &amp;iquest;Qu&amp;eacute; se puede escribir sobre Chakra en un d&amp;iacute;a como hoy, reci&amp;eacute;n salida del horno la 
&lt;a href="http://www.lasombradelhelicoptero.com/2014/05/pienso-luego-existo-e-instalo-chakra.html"&gt;&amp;uacute;ltima versi&amp;oacute;n&lt;/a&gt;? 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-rwQkgT4pKoE/U33ZLQ06V4I/AAAAAAAAEg4/UYVmuiUOvS8/s1600/Chakra15.png"&gt;&lt;img src="http://3.bp.blogspot.com/-rwQkgT4pKoE/U33ZLQ06V4I/AAAAAAAAEg4/UYVmuiUOvS8/s1600/Chakra15.png" height="301" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Pues me voy a decidir por un art&amp;iacute;culo m&amp;aacute;s personal, con opiniones que, como tales, son altamente subjetivas e intransferibles. Algo parecido al &amp;quot; 
&lt;a href="http://www.lasombradelhelicoptero.com/2012/04/razones-para-apostar-por-chakra.html"&gt;Razones para apostar por Chakra&lt;/a&gt;&amp;quot; que escrib&amp;iacute; en su d&amp;iacute;a, m&amp;aacute;s de dos a&amp;ntilde;os atr&amp;aacute;s. Sab&amp;eacute;is, los que hab&amp;eacute;is le&amp;iacute;do este blog con cierta asiduidad, que he padecido, padezco y padecer&amp;eacute; de un enfermizo distro hopping asociado a la curiosidad y mi gusto por los sistemas operativos. Por fortuna, con el tiempo he ido domando a la fiera interior y ya me lo tomo como un hobby, un pasatiempo, siempre respaldado por la comodidad de mantener una distribuci&amp;oacute;n principal inamovible para el uso cotidiano. Y &amp;eacute;sa es, no es ning&amp;uacute;n secreto, Chakra GNU/Linux. A veces me pregunto por el motivo, dada la cantidad de distribuciones existentes, de quedarme con una que est&amp;aacute; muy lejos de ser de las m&amp;aacute;s usadas, populares o como quer&amp;aacute;is llamarlas. En Distrowatch, de hecho, ocupa actualmente el puesto 50 entre las distros m&amp;aacute;s visitadas en los &amp;uacute;ltimos 6 meses.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/05/chakra-y-yo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-05-22T11:25:00Z</dc:date>
  </entry>
  <entry>
    <title>Pienso, luego existo... e instalo Chakra Descartes</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/05/pienso-luego-existo-e-instalo-chakra-descartes" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2014-05-22T16:28:01Z</updated>
    <published>2014-05-21T16:13:00Z</published>
    <content type="html">&lt;p&gt;No ando muy activo en el blog &amp;uacute;ltimamente, lo reconozco. En parte se debe a que est&amp;aacute; siendo un mes muy cargado de trabajo en la &amp;quot;vida real&amp;quot;, si bien me encuentro bien asentado en mi distro de siempre y no veo la necesidad de cambiar o probar otras cosas. Bueno, de probar, digamos que s&amp;iacute;, pues por la partici&amp;oacute;n que tengo para tal efecto han rodado ya Debian, Arch, Linux Mint Debian y, en los &amp;uacute;ltimos d&amp;iacute;as, hasta Ubuntu Trusty. Pero no son m&amp;aacute;s que jugueteos y escarceos sin inter&amp;eacute;s suficiente para merecer una entrada, sinceramente. No es el caso de la nueva edici&amp;oacute;n de Chakra, llamada 
&lt;a href="https://en.wikipedia.org/wiki/Ren%C3%A9_Descartes"&gt;Descartes&lt;/a&gt;, que paso a presentaros en palabras de Neophytos Kolokotronis, m&amp;aacute;s conocido como tetris4. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-ujQLYrP_3-4/U3zLgvHkDcI/AAAAAAAAEfs/gvcDZbM1GaA/s1600/chakra-2014-descartes-announce.png"&gt;&lt;img src="http://3.bp.blogspot.com/-ujQLYrP_3-4/U3zLgvHkDcI/AAAAAAAAEfs/gvcDZbM1GaA/s1600/chakra-2014-descartes-announce.png" height="260" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;El equipo de Chakra se enorgullece en presentar la primera edici&amp;oacute;n de la serie Descartes, emparejada con los lanzamientos de KDE 4.13. Estamos entusiasmados con la inclusi&amp;oacute;n del nuevo set art&amp;iacute;stico, obra de&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2014/05/pienso-luego-existo-e-instalo-chakra-descartes"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2014-05-21T16:13:00Z</dc:date>
  </entry>
  <entry>
    <title>OpenBSD lanza la version 5.5</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/05/openbsd-lanza-la-version-5-5" />
    <category term="gnome" />
    <category term="postfix" />
    <category term="postgresql" />
    <category term="sistemas-operativos" />
    <category term="unix" />
    <category term="noticias" />
    <category term="openbsd" />
    <category term="netbsd" />
    <category term="mysql" />
    <category term="kde" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-05-02T12:28:33Z</updated>
    <published>2014-05-02T12:04:11Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/05/openBSDgrande.jpg"&gt;&lt;img src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/05/openBSDgrande.jpg" alt="openBSDgrande" width="171" height="115" /&gt;&lt;/a&gt;El sistema operativo libre similar a &lt;a title="UNIX" href="http://www.unix.org/"&gt;UNIX&lt;/a&gt;, &lt;a title="OpenBSD Web" href="http://www.openbsd.org/"&gt;OpenBSD&lt;/a&gt;, acaba de lanzar la nueva versi&amp;oacute;n 5.5&lt;/p&gt; 
&lt;p&gt;&lt;strong&gt;Sobre OpenBSD&lt;/strong&gt;&lt;/p&gt; 
&lt;p&gt;OpenBSD es un sistema operativo libre liberado bajo la licencia &lt;a title="Licencia BSD" href="http://es.wikipedia.org/wiki/Licencia_BSD"&gt;BSD&lt;/a&gt;, desciende del sistema &amp;nbsp;&lt;a title="NetBSD" href="http://es.wikipedia.org/wiki/NetBSD"&gt;NetBSD.&lt;/a&gt; Prioriza la seguridad y la criptograf&amp;iacute;a. Su kernel es de tipo monol&amp;iacute;tico.&lt;/p&gt; 
&lt;p&gt;&lt;br /&gt; &lt;strong&gt;Novedades&lt;/strong&gt;&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Escritorios: &lt;a title="GNOME" href="http://www.gnome.org/"&gt;GNOME&lt;/a&gt; 3.10.2 ,&lt;a title="KDE" href="http://www.kde.org/"&gt;KDE &lt;/a&gt;3.5.10 y 4.11.5 y &lt;a title="XFCE" href="http://www.xfce.org/"&gt;Xfce&lt;/a&gt; 4.10&lt;br /&gt; &lt;/li&gt; 
 &lt;li&gt;Soporte 64 bits para &lt;a title="time_t" href="http://es.wikipedia.org/wiki/Time_t"&gt;time_t &lt;/a&gt;en todas las plataformas&lt;/li&gt; 
 &lt;li&gt;Bases de datos: &lt;a title="MYSQL" href="http://www.mysql.com/"&gt;MySQL&lt;/a&gt; 1.5.73 y &lt;a title="PostgreSQL" href="http://www.postgresql.org.es/"&gt;PostgreSQL&lt;/a&gt; 9.3.2&lt;/li&gt; 
 &lt;li&gt;Sistema de correo: &lt;a title="Como configurar un relay de correo para nuestra empresa con Postfix" href="http://www.ochobitshacenunbyte.com/2012/07/10/como-configurar-un-relay-de-correo-para-nuestra-empresa-con-postfix/"&gt;Postfix&lt;/a&gt; 2.11.0 &lt;/li&gt; 
 &lt;li&gt;Versi&amp;oacute;n de &lt;a title="LDAP" href="http://es.wikipedia.org/wiki/LDAP"&gt;LDAP&lt;/a&gt; 2.3.43 y 2.4.38&lt;/li&gt; 
 &lt;li&gt;Internet: &lt;a title="Mozilla Firefox" href="http://www.mozilla.org/es-ES/firefox/new/"&gt;Mozilla Firefox &lt;/a&gt;24.3 y 26.0&lt;/li&gt; 
 &lt;li&gt;Paquete ofim&amp;aacute;tico: &lt;a title="LibreOffice" href="http://es.libreoffice.org/"&gt;LibreOffice &lt;/a&gt;4.1.4.2&lt;/li&gt; 
 &lt;li&gt;Desarrollo: &lt;a title="PHP" href="http://www.php.net/"&gt;PHP &lt;/a&gt;5.3.28 y 5.4.24&lt;/li&gt; 
 &lt;li&gt;&lt;a title="Python" href="https://www.python.org/"&gt;Python&lt;/a&gt; 2.7.6 y 3.3.2&lt;/li&gt; 
 &lt;li&gt;&lt;a title="GCC" href="http://gcc.gnu.org/"&gt;GCC &lt;/a&gt;4.6.4 y 4.8.2&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Para ver las notas del lanzamiento oficial &lt;a title="Notas Lanzamiento OpenBSD" href="http://www.openbsd.org/55.html?hn"&gt;aqu&amp;iacute;&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;p&gt;&amp;nbsp;&lt;/p&gt; 
&lt;div&gt; 
 &lt;a href="http://twitter.com/share?url=http://www.ochobitshacenunbyte.com/2014/05/02/openbsd-lanza-la-version-5-5/&amp;amp;text=OpenBSD lanza la version 5.5" title="Click here if you like this article."&gt; &lt;img src="http://www.ochobitshacenunbyte.com/wp-content/plugins/twitter-plugin/images/twitt.gif" alt="Twitt" /&gt; &lt;/a&gt; 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/05/openbsd-lanza-la-version-5-5"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-05-02T12:04:11Z</dc:date>
  </entry>
  <entry>
    <title>Ampliando la busqueda</title>
    <link rel="alternate" href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/04/ampliando-la-busqueda" />
    <category term="shell" />
    <category term="linux" />
    <category term="sistemas-operativos" />
    <category term="konqueror" />
    <category term="locate" />
    <category term="comandos" />
    <category term="find" />
    <category term="dolphin" />
    <category term="gnu" />
    <category term="kde" />
    <author>
      <name>ochobitshacenunbyte</name>
    </author>
    <updated>2014-04-03T00:38:27Z</updated>
    <published>2014-04-03T00:27:26Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/04/binocular150.jpg"&gt;&lt;img alt="binocular150" src="http://www.ochobitshacenunbyte.com/wp-content/uploads/2014/04/binocular150.jpg" width="150" height="113" /&gt;&lt;/a&gt;Hay muchos comandos de GNU/Linux que usamos en el d&amp;iacute;a a d&amp;iacute;a sin darnos cuenta de todas las posibilidades que nos pueden dar. En &amp;eacute;ste art&amp;iacute;culo hablaremos de los comandos de busqueda.&lt;/p&gt; 
&lt;p&gt;Muchas veces, en las series de la televisi&amp;oacute;n se crean partidas de b&amp;uacute;squeda para encontrar una persona desaparecida o los restos de un accidente de avi&amp;oacute;n. En nuestro caso buscaremos archivos de usuarios que ya no trabajan en nuestra empresa, o que hace m&amp;aacute;s de dos a&amp;ntilde;os que se crearon o realizaremos b&amp;uacute;squedas con par&amp;aacute;metros combinados.&lt;/p&gt; 
&lt;p&gt;&lt;/p&gt; 
&lt;p&gt;El comando m&amp;aacute;s usado es &lt;strong&gt;&lt;em&gt;find&lt;/em&gt;.&lt;/strong&gt; Aqu&amp;iacute; veremos varias de opciones que nos puede dar:&lt;/p&gt; 
&lt;p&gt;Partiremos de la base de una b&amp;uacute;squeda sencilla, por ejemplo, queremos encontrar todos los archivos que contengan la palabra java&lt;em&gt;.&lt;/em&gt; &amp;iquest;C&amp;oacute;mo lo hacemos?&lt;/p&gt; 
&lt;pre&gt;#Buscamos todos los archivos que contengan la palabra &amp;quot;java&amp;quot;
find -name &amp;quot;*java*&amp;quot;&lt;/pre&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/ochobitshacenunbyte/2014/04/ampliando-la-busqueda"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>ochobitshacenunbyte</dc:creator>
    <dc:date>2014-04-03T00:27:26Z</dc:date>
  </entry>
  <entry>
    <title>Chakra Fritz ya está aquí</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/chakra-fritz-ya-esta-aqui" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2013-09-23T14:00:11Z</updated>
    <published>2013-09-23T14:00:00Z</published>
    <content type="html">&lt;p&gt;Despu&amp;eacute;s de una larga noche de guardia en el hospital no puedo recibir el d&amp;iacute;a con mejor noticia que la salida, tras cuatro meses, de una nueva iso de Chakra, bautizada con el nombre de Fritz en recuerdo de 
&lt;a href="http://chakra-project.org/news/index.php?/archives/99-RIP-Fritz_Van_Tom.html"&gt;Johannes Tr&amp;ouml;scher&lt;/a&gt;, m&amp;aacute;s conocido como Fritz_Van_Tom, desarrollador de Chakra fallecido hace un a&amp;ntilde;o en un tr&amp;aacute;gico accidente. Esta nueva serie de la distro es la que corresponde a las versiones 4.11 del escritorio que la representa y define, el cada vez m&amp;aacute;s pr&amp;oacute;ximo a la excelencia KDE SC. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/-XY5jl2j8EWQ/UkAQ3By_24I/AAAAAAAAD_4/HAT_WVjB5FA/s1600/BannerChakra3.png"&gt;&lt;img height="200" src="http://4.bp.blogspot.com/-XY5jl2j8EWQ/UkAQ3By_24I/AAAAAAAAD_4/HAT_WVjB5FA/s200/BannerChakra3.png" width="133" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Como es costumbre, paso a traduciros el 
&lt;a href="http://chakra-project.org/news/"&gt;anuncio&lt;/a&gt; de Neophytos Kolokotronis (alg&amp;uacute;n d&amp;iacute;a aprender&amp;eacute; a escribir su nombre de corrido) en la web oficial del proyecto Chakra: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;blockquote&gt;
  El equipo del proyecto Chakra se enorgullece en presentar la primera versi&amp;oacute;n de Chakra Fritz, nombre de una serie de lanzamientos que presentan KDE 4.11, dedicadas a la memoria de Fritz_Van_Tom. 
&lt;/blockquote&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/chakra-fritz-ya-esta-aqui"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2013-09-23T14:00:00Z</dc:date>
  </entry>
  <entry>
    <title>Intervención manual al actualizar Chakra</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/intervencion-manual-al-actualizar-chakra" />
    <category term="chakra" />
    <category term="tutorial" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2013-09-17T20:26:14Z</updated>
    <published>2013-09-17T18:27:00Z</published>
    <content type="html">&lt;p&gt;La rama estable de Chakra recibi&amp;oacute; ayer una nueva actualizaci&amp;oacute;n, con la particularidad de que precisa cierta intervenci&amp;oacute;n del usuario para que no aparezcan problemas. De hecho, una mala interpretaci&amp;oacute;n de los pasos a seguir pueden dejarte sin sistema (s&amp;iacute;, a m&amp;iacute; me ha pasado), por lo que creo conveniente orientar un poco sobre qu&amp;eacute; hacer para que no ocurra semejante desgracia y como deshacer el entuerto. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://1.bp.blogspot.com/-_XiczcfPQ4c/UjhlK_OupaI/AAAAAAAAD_U/PdSsavEErR8/s1600/Chakra+actualizada1.png"&gt;&lt;img height="250" src="http://1.bp.blogspot.com/-_XiczcfPQ4c/UjhlK_OupaI/AAAAAAAAD_U/PdSsavEErR8/s400/Chakra+actualizada1.png" width="400" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt;Lo primero, como es natural, el anuncio oficial de rigor, por parte de Neophytos Kolokotronis: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;blockquote&gt;
  KDE SC 4.11.1 ya est&amp;aacute; disponible oficialmente para todos los usuarios de Chakra: 
&lt;/blockquote&gt; 
&lt;blockquote&gt;
  M&amp;aacute;s de 70 correcciones de errores registradas, incluyendo mejoras en el gestor de ventanas Kwin, el gestor de archivos Dolphin, y otras. Los usuarios podr&amp;aacute;n notar que el escritorio Plasma inicia m&amp;aacute;s r&amp;aacute;pido, el desplazamiento es m&amp;aacute;s suave en Dolphin, y varias aplicaciones y herramientas usan menos memoria. Las mejoras incluyen el regreso del &amp;quot;arrastrar y soltar&amp;quot; desde la barra de tareas al paginador, arreglos en el subrayado y los colores para Kate, y la eliminaci&amp;oacute;n de muchos peque&amp;ntilde;os errores en el juego Kmahjongg. Hay muchas correcciones en la estabilidad y el habitual a&amp;ntilde;adido de traducciones. Los cambios completos se encuentran listados 
&lt;/blockquote&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/intervencion-manual-al-actualizar-chakra"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2013-09-17T18:27:00Z</dc:date>
  </entry>
  <entry>
    <title>KDE Connect: integra tu Android con KDE</title>
    <link rel="alternate" href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/kde-connect-integra-tu-android-con-kde" />
    <category term="android" />
    <category term="aplicaciones" />
    <category term="kde-connect" />
    <category term="chakra" />
    <category term="kde" />
    <author>
      <name>Enrique Bravo</name>
    </author>
    <updated>2013-09-13T13:58:42Z</updated>
    <published>2013-09-13T13:58:00Z</published>
    <content type="html">&lt;p&gt;Los seguidores de nuestro mundillo linuxero estoy seguro de que llev&amp;aacute;is alg&amp;uacute;n tiempo leyendo aqu&amp;iacute; y all&amp;aacute; sobre las bondades de una nueva aplicaci&amp;oacute;n desarrollada por 
&lt;a href="http://albertvaka.wordpress.com/"&gt;Albert Vaca&lt;/a&gt; para el 
&lt;a href="https://es.wikipedia.org/wiki/Google_Summer_of_Code"&gt;GSoC 2013&lt;/a&gt;. Se trata de KDE Connect, una maravillosa utilidad que brilla m&amp;aacute;s por lo que promete que por lo que actualmente ofrece, que tampoco es moco de pavo, por otra parte. Descubr&amp;iacute; la aplicaci&amp;oacute;n de la mano del blog 
&lt;a href="http://victorhckinthefreeworld.wordpress.com/2013/08/31/tutorial-de-kde-connect-en-opensuse/"&gt;victorhckinthefreeworld&lt;/a&gt; hace unos d&amp;iacute;as y desde entonces la vengo usando. Transcurrido el tiempo suficiente creo que es un buen momento para hacerle justicia a su creador d&amp;aacute;ndola a conocer por el blog, a la par que orientar a los usuarios de Chakra en su instalaci&amp;oacute;n y uso. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://2.bp.blogspot.com/-LcGHqh4zUBg/UjLcJ2f9HVI/AAAAAAAAD9U/ZZBAgEVvQTE/s1600/kdelogo.png"&gt;&lt;img src="http://2.bp.blogspot.com/-LcGHqh4zUBg/UjLcJ2f9HVI/AAAAAAAAD9U/ZZBAgEVvQTE/s1600/kdelogo.png" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;b&gt;&lt;/b&gt; 
&lt;br /&gt; 
&lt;a&gt;&lt;/a&gt; 
&lt;b&gt;Qu&amp;eacute; es y para qu&amp;eacute; sirve&lt;/b&gt; 
&lt;br /&gt;KDE Connect es un programa que permite la integraci&amp;oacute;n entre un dispositivo Android y el escritorio KDE. Cuenta con varias funcionalidades, que veremos m&amp;aacute;s adelante, y en principio se espera que se incorporen varias m&amp;aacute;s a medida que el desarrollo vaya avanzando. Podemos disfrutar de todo su poder si tenemos un dispositivo cuya versi&amp;oacute;n de Android sea 4.3, de casi todo si es una versi&amp;oacute;n superior a la 4.0 (mi caso), o de muy poco en el resto de los casos, si bien Albert Vaca indica en su blog que se pretende extender el soporte a versiones m&amp;aacute;s antiguas dentro de un tiempo.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/kde-connect-integra-tu-android-con-kde"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Enrique Bravo</dc:creator>
    <dc:date>2013-09-13T13:58:00Z</dc:date>
  </entry>
</feed>

