<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Windows vs Linux: allá vamos otra vez | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez"><span itemprop="headline">Windows vs Linux: allá vamos otra vez</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/windows"><img title="windows" alt="windows" src="/assets/images/labels/windows.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/11/windows-vs-linux-alla-vamos-otra-vez.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-11-12T19:43" itemprop="dateModified">Actualizado el miércoles, 12 de noviembre de 2014 a las 19:43 UTC</span></div><div><span>
Etiquetado como
experiencias, <a href="/label/windows"><span itemprop="articleSection">windows</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Aunque Halloween ya pas&oacute;, hoy me voy a disfrazar de Artem S. Tashkinov, aquel que se les aparece a los linuxeros talibanes como los que ya me est&aacute;n maldiciendo por no escribir GNU en el t&iacute;tulo del presente art&iacute;culo. Si no sab&eacute;is qui&eacute;n es os recomiendo echar un vistazo a 
<a href="http://www.lasombradelhelicoptero.com/2014/01/principales-problemas-de-linux-en-el.html">este enlace</a>. Uno, que ya es perro viejo y lleva usando GNU/Linux en sus distintas formas, colores y sabores, de modo casi exclusivo desde el a&ntilde;o 2.007, por mucho que se empe&ntilde;e en ocasiones en salir de su 
<a href="http://www.lasombradelhelicoptero.com/2014/10/jaulas-de-oro.html">jaula dorada</a>, termina por tener que volver a entrar con el rabo entre las piernas y muy a su pesar. De manera que, desde mi m&aacute;quina que de nuevo arranca en dual, os cuento por qu&eacute; he tenido que abandonar el uso exclusivo de GNU/Linux en mi ordenador y de Cyanogenmod en mi tel&eacute;fono m&oacute;vil. Si eres de los que opinan que dichos sistemas son perfectos y el 
<a href="http://es.wikipedia.org/wiki/Bill_Gates">tito Bill</a> es el demonio, ya puedes dejar de leer.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="https://4.bp.blogspot.com/-A3-3umbMz-A/VGNP1pNX5SI/AAAAAAAAFS4/XnceSQGqSMg/s1600/Windows.png"><img height="320" src="https://4.bp.blogspot.com/-A3-3umbMz-A/VGNP1pNX5SI/AAAAAAAAFS4/XnceSQGqSMg/s400/Windows.png" width="400" /></a>
</div>
<br />
<b></b>
<br />
<a></a>
<b>La necesidad de actualizar la BIOS</b>
<br />Un buen d&iacute;a se me ocurri&oacute; que mis continuos problemas con los puertos USB del equipo tal vez hab&iacute;an encontrado remedio en alguna actualizaci&oacute;n de la BIOS de la placa base. Ocurre que Gigabyte dispone de una sencilla utilidad para hacer esta delicad&iacute;sima operaci&oacute;n, pero, oh sorpresa, dicho programa est&aacute; escrito para Windows. Hay que tenerlos del tama&ntilde;o del 
<a href="http://blogs.20minutos.es/yaestaellistoquetodolosabe/tag/tener-los-cojones-como-el-caballo-de-espartero/">caballo de Espartero</a> para atreverse a usar eso con Wine, una aplicaci&oacute;n que tiene sus virtudes, innegablemente, pero de la que nunca puedes fiarte del todo, seg&uacute;n mi experiencia personal.
<br />
<br />Cuando comprob&eacute; que hab&iacute;a nada menos que 7 actualizaciones para mi placa base en la web del fabricante, supe que no hab&iacute;a remedio: necesitaba otra vez una partici&oacute;n con Windows. Escarmentado ya del modo en que obtuve mi &uacute;ltimo Windows 8, decid&iacute; instalar el que tra&iacute;a mi equipo, un Windows 7 Home Premium y &quot;disfrutar&quot; de sus prestaciones con todas las de la ley. Horas y horas despu&eacute;s de instalar controladores, actualizaciones de seguridad, opcionales, importantes y esas cosas de Windows, tuve finalmente un sistema plenamente utilizable. Afortunadamente, la actualizaci&oacute;n de la BIOS con el programa de Gigabyte result&oacute; un &eacute;xito por su sencillez y rapidez. Sobre si ello sirvi&oacute; o no para arreglar las extra&ntilde;as &quot;desconexiones&quot; de los puertos USB, me temo no estar todav&iacute;a en posici&oacute;n de afirmarlo o negarlo, aunque por mis trasteos en Ubuntu y Chakra parece que s&iacute;.
<br />
<br />
<b>Los juegos: vamos mejorando, pero...</b>
<br />Durante el &uacute;ltimo a&ntilde;o he recuperado mi vieja afici&oacute;n, que data de los tiempos en que 
<a href="http://es.wikipedia.org/wiki/Clive_Sinclair">Sir Clive Sinclair</a> dio vida a su primer ordenador: los videojuegos. Gracias a Valve y su Steam, GNU/Linux est&aacute; recuperando terreno en esta materia, lo que me permite jugar, por ejemplo, a Football Manager en mi sistema preferido de forma nativa. Otra cosa distinta es la calidad a la que puedo hacerlo, pues los controladores AMD, sin ser nada del otro mundo en Windows s&iacute; que mejoran a sus hom&oacute;logos de GNU/Linux.
<br />
<br />Claro est&aacute;, que siempre hay un pero. Y el que yo pongo tiene su origen en una oferta de la tienda 
<a href="http://www.greenmangaming.com/">Green Man Gaming</a>, gracias a la cual pude conseguir el juego &quot;State of Decay&quot; por apenas 4 euros. Muy iluso habr&iacute;a que ser para pensar que un t&iacute;tulo en el que interviene Microsoft Studios va a funcionar bajo GNU/Linux. Ya os digo yo que no, y no ser&aacute; porque no intent&eacute; todo lo habido y por haber: Wine en diferentes versiones, Playonlinux, art&iacute;culos en ruso de uno que logr&oacute;, her&oacute;icamente, hacerlo correr en Ubuntu (l&aacute;stima, ten&iacute;a una Nvidia), etc&eacute;tera, etc&eacute;tera.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="https://4.bp.blogspot.com/-zv7xQPs87HY/VGNQVaRkzaI/AAAAAAAAFTA/8Iobo88Nzf0/s1600/State%2Bof%2BDecay.jpg"><img height="266" src="https://4.bp.blogspot.com/-zv7xQPs87HY/VGNQVaRkzaI/AAAAAAAAFTA/8Iobo88Nzf0/s400/State%2Bof%2BDecay.jpg" width="400" /></a>
</div>
<br />La historia en Windows, bueno, ya la conoc&eacute;is: instalar y listo. Lo habitual, por otra parte. Por no hablar del sonido, de mucha m&aacute;s calidad y con todas esas chorradas de &quot;Dolby Surround&quot; y &quot;Bass boost&quot; que hacen que retumbe la habitaci&oacute;n.
<br />
<br />
<b>Cyanogenmod y sus inconvenientes</b>
<br />Turno ahora para mi triste regreso a la ROM original en mi Galaxy S3 Mini. Si bien el problema de sobrecalentamiento de la bater&iacute;a qued&oacute; resuelto por entero, como contaba en su 
<a href="http://www.lasombradelhelicoptero.com/2014/10/solucionar-problema-de-bateria-en.html">art&iacute;culo correspondiente</a>, persist&iacute;an dos molestos inconvenientes: el reloj que se congelaba de modo aleatorio y la imposibilidad de usar algunas aplicaciones que eran &uacute;tiles para m&iacute;, concretamente Google Play Music y Appgree.
<br />
<br />Reconozco que la culpa la tengo yo. Un d&iacute;a me levanto rebelde y reivindicativo, dispuesto a pelear contra los monopolios y las imposiciones. Ese d&iacute;a nada me parece una molestia. Pero pasa el tiempo, el viento sopla desde otro sitio, y ese mismo yo se pregunta por qu&eacute; renunciar a c&oacute;modos servicios, a qui&eacute;n beneficia mi perjuicio y para qu&eacute; sufrirlo. As&iacute; soy yo, y quien me entienda que me compre...
<br />
<br />
<b>Revisando Windows 7 Home Premium</b>
<br />Aprovechando este nuevo golpe de tim&oacute;n que ha hecho que Windows y GNU/Linux vuelvan a coexistir en mi equipo de sobremesa, se me ha ocurrido aplicar mi baremo habitual para clasificar las distribuciones al sistema de Microsoft. La verdad es que no ha sido una prueba tan exhaustiva como hubiera deseado, pues a pesar de que lo intent&eacute; durante un largo rato, no fui capaz de hacer funcionar la Phoronix Test Suite bajo Windows. Resumiendo un poco la experiencia, pues tampoco es plan de extenderse con la cuesti&oacute;n, digamos que, a d&iacute;a de hoy, una instalaci&oacute;n limpia de Windows proporciona una mejor experiencia de usuario de la que sol&iacute;a en el pasado.
<br />
<br />De hecho, me esperaba unos resultados mucho peores, sobre todo en cuanto a reproducci&oacute;n de archivos &quot;out-of-the-box&quot;. Windows &uacute;nicamente tuvo problemas con los archivos Matroska, los de v&iacute;deo digital (.dv) y los .3gp. En cuanto a otro tipo de formatos no multimedia, no se pueden abrir de serie los .pdf, ni tampoco descomprimir los .rar. En todo lo dem&aacute;s, da la talla.
<br />
<br />En lo referente a resultados me sorprendi&oacute; gratamente que la transferencia de archivos al pendrive fuese m&aacute;s lenta que en GNU/Linux... &iexcl;por casi un minuto de diferencia! Claro est&aacute; que, en el resto de parcelas gana Windows por goleada, sobre todo en cuanto al rendimiento gr&aacute;fico medido por Unigine Valley, que arroj&oacute; un resultado de 511, casi 40 puntos m&aacute;s que en Ubuntu. Y en los navegadores, m&aacute;s de lo mismo, siendo muy superior el rendimiento de Chrome y solo algo mejor el de Firefox, sin tener en cuenta la insufrible velocidad de &quot;scrolling&quot; del rat&oacute;n del primero en GNU/Linux, que no he encontrado forma humana de solventar.
<br />
<br />Haciendo un somero repaso por las secciones que conforman la tabla de puntuaci&oacute;n:
<br />
<br />
<ul>
 <li>Instalaci&oacute;n. Todo perfecto y en castellano.</li>
 <li>Arranque y apagado. Bastante m&aacute;s lento que en GNU/Linux.</li>
 <li>Software. Todo el que quieras y m&aacute;s, pero sin centro de aplicaciones.</li>
 <li>Hardware. El esc&aacute;ner no lo reconoce por haber retirado el fabricante (Epson) los controladores para Windows. Ello hace completamente imposible su utilizaci&oacute;n bajo este sistema, salvo pagando a una tercera compa&ntilde;&iacute;a llamada <a href="http://www.hamrick.com/">Hamrick Software</a>.</li>
 <li>Conectividad. Perfecto, incluyendo el &quot;Grupo en el hogar&quot; para comunicarse con el port&aacute;til.</li>
 <li>&quot;Out of the box&quot;. No est&aacute; mal para ser Windows, reproduce mp3 y otros formatos propietarios que en antiguas versiones necesitaban de c&oacute;decs.</li>
 <li>Estabilidad. Ni rastro de pantallazos azules que, la verdad, hace mucho tiempo que no veo.</li>
 <li>Fluidez. Bastante bien, con el l&oacute;gico retardo inicial cuando se entra al escritorio, pero nada grave.</li>
 <li>Gesti&oacute;n de energ&iacute;a. La hibernaci&oacute;n no viene habilitada por defecto, algo que ocurre tambi&eacute;n en muchos sistemas GNU/Linux.</li>
</ul>
<br />Para finalizar, penalizo a Windows con un error grave: imposible reiniciar en algunas ocasiones, oblig&aacute;ndome a usar el bot&oacute;n de apagado del equipo. Esto no repercute en la estabilidad, pues solamente sucede al reiniciar y no de un modo continuado, pero el fallo est&aacute; ah&iacute; y no es la primera vez que me ocurre (si bien, en el tiempo que tuve Windows 8.1 instalado no sucedi&oacute; nunca). El resultado final tras todas estas tribulaciones es de notable alto (8'06), puntuaci&oacute;n que no esperaba, sinceramente, y que supera con creces a la que obtuvo su predecesor, hace ahora 3 a&ntilde;os, en el 
<a href="http://www.lasombradelhelicoptero.com/2011/11/actualizacion-del-sistema-de.html">art&iacute;culo</a> que le dedicaba al que era, por aquel entonces, el sistema de clasificaci&oacute;n del blog (6'36 para el entra&ntilde;able XP).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="https://2.bp.blogspot.com/-8CC2fuau5xI/VGNQoK1779I/AAAAAAAAFTI/Rh1L8j2Ry-k/s1600/Windows%2B2.png"><img height="320" src="https://2.bp.blogspot.com/-8CC2fuau5xI/VGNQoK1779I/AAAAAAAAFTI/Rh1L8j2Ry-k/s400/Windows%2B2.png" width="400" /></a>
</div>
<br />Y hasta aqu&iacute; mi peque&ntilde;a excursi&oacute;n de hoy por el mundo &quot;windowsero&quot;. Si has llegado hasta este punto en tu lectura es porque no eres extremista, y te lo agradezco. Mas no temas, que enseguida retomo las revisiones &quot;normales&quot; con openSUSE y sigo usando Ubuntu para casi todo. Sin embargo, a mi parecer, aun hoy, en noviembre de 2.014, parece imposible huir de una partici&oacute;n del sistema de Microsoft si te gustan los juegos de ordenador, quieres actualizar tu navegador TomTom o hacer lo propio con tu BIOS Gigabyte. Esta es, como siempre, mi experiencia personal y mi conclusi&oacute;n, que no tiene porqu&eacute; ser la tuya. T&uacute;, tal vez, tienes otros motivos para seguir en arranque dual o para haber desterrado a Windows de tu disco duro para siempre. A tu disposici&oacute;n tienes los comentarios por si te apetece compartirlos.
<br />
<br />Salud
<br />
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>WINDOWS 7 HOME PREMIUM</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>1,25</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>6,25</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>8,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>N/D</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>511</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.808</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>4.523</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>4,46</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>0,53</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>3,56</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>+0,17</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>-1,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>8,06</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez" st_title="Windows vs Linux: allá vamos otra vez | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/windows/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta windows</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1110,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/11/windows-vs-linux-alla-vamos-otra-vez"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>