<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-01T22:12:31Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-01T22:12:31Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Desempaquetado y análisis Samsung SSD 840 EVO 250 GB</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/03/desempaquetado-y-analisis-samsung-ssd-840-evo-250-gb" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-29T15:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;p&gt;En estos momentos sin lugar a dudas la actualizaci&amp;oacute;n m&amp;aacute;s provechosa para mejorar el rendimiento de un equipo es una unidad de estado s&amp;oacute;lido o SSD (&lt;a href="http://es.wikipedia.org/wiki/Unidad_de_estado_s%C3%B3lido"&gt;Solid State Drive&lt;/a&gt;) una vez tengamos memoria RAM suficiente, unos 2 GiB suelen ser suficientes para tareas ofim&amp;aacute;ticas y acceder a internet y los equipos que se est&amp;aacute;n vendiendo ahora ya suelen venir con 4 GiB e incluso 8 GiB. El tiempo de acceso a un disco duro mec&amp;aacute;nico es grande y la velocidad de transferencia es peque&amp;ntilde;a, en los momentos que se require un uso intensivo del disco se nota que los disco mec&amp;aacute;nicos son el cuello de botella del sistema. A veces una mejora en el software puede producir una notable aumento de rendimiento con el mismo hardware pero cuando ya no hay margen de mejora en el software con una mejora en el hardware podemos conseguir el aumento de rendimiento buscado, este es el caso de los SSD.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/03/desempaquetado-y-analisis-samsung-ssd-840-evo-250-gb"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Novedades y nuevas características de Java 8</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/03/novedades-y-nuevas-caracteristicas-de-java-8" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-28T20:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/java.png" alt="Java" title="Java" /&gt; 
&lt;/div&gt; 
&lt;p&gt;El 18 de marzo de 2014 se public&amp;oacute; la nueva versi&amp;oacute;n de la plataforma &lt;a href="http://www.oracle.com/technetwork/java/javase/overview/java8-2100321.html"&gt;Java 8&lt;/a&gt;, Java 7 fue liberada el en julio de 2011. Java 8 incorporar&amp;aacute; varias novedades siguiendo la tendencia de otros lenguajes como la incorporaci&amp;oacute;n de lambdas o closures o una demandada nueva API para el manejo de fechas entre otras muchas caracter&amp;iacute;sticas m&amp;aacute;s. La &lt;a href="http://openjdk.java.net/projects/jdk8/features"&gt;lista completa de novedades&lt;/a&gt; es bastante amplia, a continuaci&amp;oacute;n pondr&amp;eacute; lo que me ha parecido m&amp;aacute;s destacable:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;Se a&amp;ntilde;aden las expresiones lambda o closures y se adapta la API para usarlas en los sitios que se pueda.&lt;/li&gt; 
 &lt;li&gt;Se definen nuevos perfiles compactos para dispositivos que no necesitan toda la API Java, esto es una alternativa a la modularizaci&amp;oacute;n. Inicialmente la modularizaci&amp;oacute;n era una caracter&amp;iacute;stica que estaba planificada para Java 8 pero finalmente se ha aplazado a posteriores versiones.&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/03/novedades-y-nuevas-caracteristicas-de-java-8"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Guía para la creación de un blog con Octopress</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/03/guia-para-la-creacion-de-un-blog-con-octopress" />
    <category term="planeta-codigo" />
    <category term="blog" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-14T18:19:24Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /&gt; 
&lt;/div&gt; 
&lt;p&gt;En la &lt;a href="http://picodotdev.github.io/blog-bitix/2013/12/hola-nuevo-mundo/"&gt;primera entrada de este blog usando Octopress&lt;/a&gt; ya comentaba las razones por las que he pasado de usar &lt;a href="http://www.blogger.com"&gt;Blogger&lt;/a&gt; a usar &lt;a href="http://octopress.org/"&gt;Octopress&lt;/a&gt;. Entre las razones del cambio estaban la posibilidad en Octopress de escribir en markdown, edici&amp;oacute;n desconectado (para textos e im&amp;aacute;genes), dise&amp;ntilde;o adaptable y m&amp;aacute;s personalizable, git y control de versiones, alojamiento en cualquier servidor web. A&amp;uacute;n sin ser Octpress tambi&amp;eacute;n tiene cosas mejorables pero desde luego me est&amp;aacute; resultando mucho mejor que blogger.&lt;/p&gt; 
&lt;p&gt;En esta entrada quiero escribir una gu&amp;iacute;a con los pasos necesarios para crear un blog en Octopress de forma r&amp;aacute;pida y algunas funcionalidades a tener en cuenta o que deberemos realizar.&lt;/p&gt; 
&lt;p&gt;Antes de empezar supondr&amp;eacute; que ya tenemos en nuestro sistema &lt;a href="https://www.archlinux.org/packages/extra/x86_64/ruby/"&gt;ruby&lt;/a&gt; y &lt;a href="https://www.archlinux.org/packages/extra/x86_64/git/"&gt;git&lt;/a&gt; instalados. En Linux basta con buscar el paquete correspondiente para nuestra distribuci&amp;oacute;n e instalarlo con el gestor de paquetes. Con &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/03/guia-para-la-creacion-de-un-blog-con-octopress"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Integración continua con Jenkins</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/09/integracion-continua-con-jenkins" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-07T23:31:52Z</updated>
    <published>2011-09-02T18:16:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: left;"&gt; 
 &lt;img alt="Jenkins" src="http://1.bp.blogspot.com/-VDA-zXScjY8/TmEXmNUTE4I/AAAAAAAAA-M/9Ox1D_VDmvQ/s200/jenkins.png" height="63" title="Jenkins" width="200" /&gt; 
&lt;/div&gt;Jenkins es una herramienta de 
&lt;a href="http://en.wikipedia.org/wiki/Continuous_integration"&gt;integraci&amp;oacute;n continua&lt;/a&gt; (CI) que permite realizar tareas peri&amp;oacute;dicas y autom&amp;aacute;ticamente como generar el archivo del proyecto o ejecutar los casos de prueba. Usar una herramienta de integraci&amp;oacute;n continua tiene varios beneficios como detectar problemas de forma temprana haciendo que sean m&amp;aacute;s f&amp;aacute;ciles de resolver y automatizar procesos repetitivos que nos liberan de tiempo. Todo ello en un entorno independiente de los de desarrollo. 
&lt;br /&gt; 
&lt;br /&gt;Su instalaci&amp;oacute;n y uso es muy sencillo basta con descargar u archivo .war y arrancarlo con: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;pre&gt;java -jar jenkins.war&lt;/pre&gt; 
&lt;/div&gt; 
&lt;br /&gt;O desplegarlo en un contenedor de aplicaciones como Tomcat ya que es una aplicaci&amp;oacute;n web java. Su configuraci&amp;oacute;n se puede hacer completamente desde la interfaz de usuario que proporciona. Algunas otras caracter&amp;iacute;sticas de Jenkins son:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/09/integracion-continua-con-jenkins"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-09-02T18:16:00Z</dc:date>
  </entry>
  <entry>
    <title>Componente AjaxSpinner para Tapestry 5</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/09/componente-ajaxspinner-para-tapestry-5" />
    <category term="programacion" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tapestry" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-06T08:46:40Z</updated>
    <published>2011-09-09T19:09:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Apache Tapestry" src="http://4.bp.blogspot.com/-OGvCbjBk0zU/TOq7Y6w6wfI/AAAAAAAAAiU/Pfuzt5kkDBQ/s320/tapestry.png" height="133" title="Apache Tapestry" width="320" /&gt; 
&lt;/div&gt;Hoy en d&amp;iacute;a las aplicaciones web que hace peticiones de forma as&amp;iacute;ncrona con AJAX son la mayor&amp;iacute;a ya que es una t&amp;eacute;cnica que permite obtener &amp;uacute;nicamente los datos que se necesitan sin tener que hacer una cargar entera de la p&amp;aacute;gina web en el navegador. Esta t&amp;eacute;cnica hace que las peticiones al devolver &amp;uacute;nicamente los datos necesarios (y no toda la p&amp;aacute;gina) y los recursos para procesar la petici&amp;oacute;n sean menos, tambi&amp;eacute;n hace que el resultado de las peticiones sean m&amp;aacute;s peque&amp;ntilde;os con lo que el tiempo de carga tambi&amp;eacute;n se reduce al generar menos tŕafico de red, asi mismo el usuario nota un aumento de tiempo de respuesta. Tambi&amp;eacute;n hace que en ciertos casos las aplicaciones sean m&amp;aacute;s f&amp;aacute;ciles de desarrollar por no tener que tratar en el servidor en cada petici&amp;oacute;n el estado concreto de cada cliente.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/09/componente-ajaxspinner-para-tapestry-5"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-09-09T19:09:00Z</dc:date>
  </entry>
  <entry>
    <title>Configurar SSL en un servidor Tomcat, JBoss, WildFly, Lighttpd, nginx o Apache</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/02/configurar-ssl-en-un-servidor-tomcat-jboss-wildfly-lighttpd-nginx-o-apache" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-28T15:58:17Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/openssl.png" alt="OpenSSL" title="OpenSSL" /&gt; 
&lt;/div&gt; 
&lt;p&gt;En entradas anteriores he explicado &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;en que consiste la criptograf&amp;iacute;a y GPG&lt;/a&gt; y como podemos usarlo a nivel personal para firmar y cifrar archivos y &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/como-usar-gpg-con-evolution.html"&gt;firmar correos electr&amp;oacute;nicos con el cliente de correo Evolution&lt;/a&gt;. Tambi&amp;eacute;n he comentado &lt;a href="http://picodotdev.github.io/blog-bitix/2014/02/generar-y-convertir-claves-y-certificados-con-openssl/"&gt;como crer un certificado con OpenSSL y como convertirlo a diferentes formatos&lt;/a&gt;. En esta entrada explicar&amp;eacute; como usar un certificdo creado con OpenSSL para proporcionar acceso SSL al sevidor web o servidor de aplicaciones, explicar&amp;eacute; cual es la configuraci&amp;oacute;n necesaria para los servidores &lt;a href="http://tomcat.apache.org/"&gt;Tomcat&lt;/a&gt;, &lt;a href="http://www.lighttpd.net/"&gt;Lighttpd&lt;/a&gt;, &lt;a href="http://www.jboss.org/jbossas"&gt;JBoss&lt;/a&gt;/&lt;a href="http://wildfly.org/"&gt;WildFly&lt;/a&gt;, &lt;a href="http://nginx.org/"&gt;nginx&lt;/a&gt; y &lt;a href="http://www.apache.org/"&gt;Apache&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;Usar una conexi&amp;oacute;n SSL y un certificado de servidor evita que los datos entre el navegador del usuario y el servidor sean legibles para una tercera parte siendo mayor la seguridad en nuestras aplicaciones o dando mayor confianza al usuario y usando algunos certificados al aparecer en la barra de navegaci&amp;oacute;n del navegador en verde el nombre de la entidad detr&amp;aacute;s de la p&amp;aacute;gina evitando problemas de suplantaci&amp;oacute;n de identidad.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/02/configurar-ssl-en-un-servidor-tomcat-jboss-wildfly-lighttpd-nginx-o-apache"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Introducción a la criptografía e inicio con GPG</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/introduccion-a-la-criptografia-e-inicio-con-gpg" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-23T01:13:34Z</updated>
    <published>2013-11-15T20:18:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: both; text-align: center;"&gt; 
  &lt;img alt="GnuPG" src="http://4.bp.blogspot.com/-wnNsw8HqDxE/UoZZ15a-ZOI/AAAAAAAACrc/c4ZId2hHNqs/s320/gnupg.png" height="105" title="GnuPG" width="320" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Internet est&amp;aacute; formado por una red de m&amp;aacute;quinas interconectadas que en conjunto permiten que un par de m&amp;aacute;quinas de esa red puedan comunicarse entre si aunque no est&amp;eacute;n directamente conectadas, el 
&lt;a href="http://es.wikipedia.org/wiki/Transmission_Control_Protocol"&gt;protocolo TCP/IP&lt;/a&gt; es el que posibilita esa comunicaci&amp;oacute;n. En la comunicaci&amp;oacute;n entre las m&amp;aacute;quinas que no est&amp;aacute;n directamente conectadas la informaci&amp;oacute;n de la m&amp;aacute;quina origen ha de ser transportada por un camino de varias m&amp;aacute;quinas hasta llegar a a la m&amp;aacute;quina destino y posteriormente de vuelta por el mismo camino u otro. En muchos casos la informaci&amp;oacute;n que viaja a lo largo de ese camino de terceras m&amp;aacute;quinas no es relevante ni sensible pero en otros casos podemos necesitar o queremos evitar que esas terceras m&amp;aacute;quinas puedan acceder a la informaci&amp;oacute;n que se est&amp;aacute; transmitiendo. En este &amp;uacute;ltimo caso es donde entra en acci&amp;oacute;n la criptograf&amp;iacute;a.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/introduccion-a-la-criptografia-e-inicio-con-gpg"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-15T20:18:00Z</dc:date>
  </entry>
  <entry>
    <title>Generar y convertir claves y certificados con OpenSSL</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/02/generar-y-convertir-claves-y-certificados-con-openssl" />
    <category term="programacion" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-21T16:36:21Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/openssl.png" alt="OpenSSL" title="OpenSSL" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Para un uso personal como enviar correos o archivos cifrados o firmados digitalmente usar &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;GnuPG&lt;/a&gt; es una buena opci&amp;oacute;n. En Internet los servidores tambi&amp;eacute;n se aprovechan del uso de criptograf&amp;iacute;a para realizar comunicaciones seguras entre el usuario y el servidor.&lt;/p&gt; 
&lt;p&gt;Para hacer uso en un servidor de una comunicaci&amp;oacute;n https donde los datos viajan cifrados y sin que otras partes salvo el usuario y el servidor puedan acceder a los datos necesitamos un certificado digital. Un certificado es un archivo que contiene la clave p&amp;uacute;blica sirvi&amp;eacute;ndonos para verificar su autenticidad. Un certificado autofirmado es un certificado firmado con la misma clave privada asociada a la clave p&amp;uacute;blica que contiene el certificado. Un certificado autofirmado es suficiente para un entorno de pruebas pero en un servidor para proporcionar confianza a los usuarios deberemos solicitar que una autoridad de certificados que nos firme con su clave nuestro certificado, si el usuario conf&amp;iacute;a en esa autoridad de certificado puede de esta manera confiar en nuestro certificado y clave p&amp;uacute;blica.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/02/generar-y-convertir-claves-y-certificados-con-openssl"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Libro sobre desarrollo de aplicaciones con Apache Tapestry</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/07/libro-sobre-desarrollo-de-aplicaciones-con-apache-tapestry" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="software" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="tapestry" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-14T20:12:44Z</updated>
    <published>2013-07-24T17:06:00Z</published>
    <content type="html">&lt;p&gt;Recientemente he publicado 
&lt;a href="http://goo.gl/Vx8icI"&gt;PlugIn Tapestry&lt;/a&gt;, un libro acerca del desarrollo de aplicaciones web en el lenguaje Java y con el framework 
&lt;a href="http://tapestry.apache.org/"&gt;Apache Tapestry&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;div style="clear: both; text-align: center;"&gt; 
  &lt;a href="http://goo.gl/WFQgY"&gt;&lt;img alt="PlugIn Tapestry" src="http://1.bp.blogspot.com/-CUcQ3fWr9Yw/Ue7FYGDd_SI/AAAAAAAACls/eLuRuVvRz7w/s320/PlugInTapestry.png" height="320" style="border-color: red; border-style: solid; border-width: 1px;" title="PlugIn Tapestry" width="226" /&gt;&lt;/a&gt; 
 &lt;/div&gt;Apache Tapestry es un framework orientado a componentes para crear aplicaciones web r&amp;aacute;pidas, din&amp;aacute;micas, robustas y altamente escalables en la plataforma Java. Al basarse en componentes es distinto de los muchos basados en acciones similares en esencia a Struts que podemos encontrar en la plataforma Java como SpringMVC, Grails y Play! y tambi&amp;eacute;n de los muchos otros en los que la principal diferencia es el lenguaje como Django (Python), Symfony (PHP), .NET MVC (C#) o Ruby On Rails (Ruby). 
 &lt;br /&gt; 
 &lt;br /&gt;Incluyendo la descripci&amp;oacute;n de las caracter&amp;iacute;sticas del framework el libro trata la mayor&amp;iacute;a de aspectos que puede necesitar una aplicaci&amp;oacute;n o p&amp;aacute;gina web, entre ellos: 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/07/libro-sobre-desarrollo-de-aplicaciones-con-apache-tapestry"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-07-24T17:06:00Z</dc:date>
  </entry>
  <entry>
    <title>Mi experiencia y consejos para un blog</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog" />
    <category term="blog" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-01-17T14:44:23Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Al momento de escribir esta entrada el blog ya tiene m&amp;aacute;s de 3 a&amp;ntilde;os, ya m&amp;aacute;s cerca de 4. En esta entrada en vez de algo relacionado con la tecnolog&amp;iacute;a quiero comentar por que empec&amp;eacute; un blog, que supone tener un blog, como ha evolucionado durante este tiempo, como lo hago y por que hago algunas cosas como las hago por si mi modesta experiencia le sirve de utilidad a alg&amp;uacute;n otro blogger.&lt;/p&gt; 
&lt;h3&gt;Por que empec&amp;eacute; un blog&lt;/h3&gt; 
&lt;p&gt;Empecemos por el por que inicie un blog. Trabajo como ingeniero de software y cree un blog principalmente porque tristemente en pocos momentos de mi vida profesional y con la que me gano mi sueldo a fin de mes puedo trabajar y usar las herramientas con las que realmente me gustar&amp;iacute;a trabajar. Probablemente sea consecuencia de estar en un equipo de desarrolladores en el que son otras personas las que deciden que tecnolog&amp;iacute;as usar y como hacer las cosas con su propia visi&amp;oacute;n, el conocido &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/01/mi-experiencia-y-consejos-para-un-blog"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Iniciar la Raspberry Pi desde un disco o memoria USB</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/01/iniciar-la-raspberry-pi-desde-un-disco-o-memoria-usb" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-01-10T11:41:33Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/raspberrypi.jpg" alt="Raspberry Pi" title="Raspberry Pi" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Por defecto la Raspberry Pi se instala en una tarjeta SD y se inicia desde ella, sin embargo, la tarjeta SD es muy lenta tanto en la lectura como en la escritura de datos y cuando tiene que hacerlo de forma intensiva el sistema queda sin responder y aparentemente atascado. Para aumentar muy notablemente el rendimiento de la Raspberry Pi podemos instalar la partici&amp;oacute;n del sistema en una memoria USB o disco duro externo.&lt;/p&gt; 
&lt;p&gt;En la gu&amp;iacute;a de &lt;a href="http://elblogdepicodev.blogspot.com.es/2012/06/guia-instalacion-raspberry-pi-con-arch.html"&gt;Instalaci&amp;oacute;n de la Raspberry Pi&lt;/a&gt; expliqu&amp;eacute; como instalar la distribuci&amp;oacute;n &lt;a href="http://archlinuxarm.org/"&gt;Arch Linux ARM&lt;/a&gt; en una tarjeta SD, esa gu&amp;iacute;a ser&amp;aacute; el punto de partida para esta entrada. La Raspberry Pi inicia el sistema desde la tarjeta SD por lo que aunque instalemos el sistema en un dispositivo USB seguiremos necesitando la tarjeta SD para que contenga al menos la partici&amp;oacute;n de arranque (boot).&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/01/iniciar-la-raspberry-pi-desde-un-disco-o-memoria-usb"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Raspberry Pi como Media Center con GeeXboX</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2014/01/raspberry-pi-como-media-center-con-geexbox" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-01-03T19:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/geexbox.png" alt="GeeXboX" title="GeeXboX" /&gt; 
 &lt;br /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/raspberrypi.jpg" alt="Raspberry Pi" title="Raspberry Pi" /&gt; 
&lt;/div&gt; 
&lt;p&gt;La Raspberry Pi es un computador del tama&amp;ntilde;o de una tarjeta de cr&amp;eacute;dito que se puede usar para diferentes prop&amp;oacute;sitos. Hasta hace no mucho a mi me serv&amp;iacute;a para descargar pel&amp;iacute;culas mediante torrent, sin embargo, puede usarse perfectamente para otros prop&amp;oacute;sitos muy interesantes como usarla como Media Center en una televisi&amp;oacute;n que no es una Smart TV o como Media Center con m&amp;aacute;s opciones.&lt;/p&gt; 
&lt;p&gt;Dada la popularidad que tiene la Raspberry Pi disponemos de varias distribuciones con soporte para usar la Raspberry Pi como centro multimedia de nuestro sal&amp;oacute;n. Las principales son:&lt;/p&gt; 
&lt;ul&gt; 
 &lt;li&gt;&lt;a href="http://www.geexbox.org/"&gt;GeeXboX&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;a href="http://www.raspbmc.com/"&gt;RaspBMC&lt;/a&gt;&lt;/li&gt; 
 &lt;li&gt;&lt;a href="http://openelec.tv/"&gt;OpenELEC&lt;/a&gt;&lt;/li&gt; 
&lt;/ul&gt; 
&lt;p&gt;Las tres opciones tienen la similitud que son muy f&amp;aacute;cilmente instalables (tambi&amp;eacute;n para alguien sin muchos conocimientos t&amp;eacute;cnicos) y que se basan en el programa &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2014/01/raspberry-pi-como-media-center-con-geexbox"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Hemeroteca #4</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2013/12/hemeroteca-4" />
    <category term="hemeroteca" />
    <category term="planeta-codigo" />
    <category term="blog" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-24T17:28:48Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /&gt; 
&lt;/div&gt; 
&lt;p&gt;El 2013 toca a su fin, el 2014 est&amp;aacute; llamando a la puerta y como cada medio a&amp;ntilde;o en el blog toca hacer una recapitulaci&amp;oacute;n con las entradas que he escrito durante estos meses. Durante este a&amp;ntilde;o he cumplido con el objetivo de escribir y publicar una entrada por semana, en total han sido 52, casi todas publicadas en &lt;a href="http://elblogdepicodev.blogspot.com.es/"&gt;elblogdepicodev&lt;/a&gt; y las del &amp;uacute;ltimo m&amp;eacute;s del a&amp;ntilde;o publicadas en &lt;a href="http://picodotdev.github.io/blog-bitix/"&gt;Blog Bitix&lt;/a&gt;. Esta entrada es un buen momento para leer alguna que te perdiste o releer alguna que te gust&amp;oacute;.&lt;/p&gt; 
&lt;p&gt;Durante estos 6 meses y este a&amp;ntilde;o a destacar ha sido el &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/07/libro-sobre-desarrollo-de-aplicaciones.html"&gt;libro que publiqu&amp;eacute; sobre Apache Tapestry&lt;/a&gt;, un framework para el desarrollo de aplicaciones en Java, del que dentro de no mucho tiempo se publicar&amp;aacute; la versi&amp;oacute;n 5.4 final. El libro tiene m&amp;aacute;s de 250 p&amp;aacute;ginas escritas en espa&amp;ntilde;ol, un precio de 0.00 € y puedes &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2013/12/hemeroteca-4"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Enviar correos electrónicos firmados con el DNIe y Evolution</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2013/12/enviar-correos-electronicos-firmados-con-el-dnie-y-evolution" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-21T11:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/archlinux.png" alt="Arch Linux" title="Arch Linux" /&gt; 
 &lt;br /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/dnie.jpg" alt="DNIe" title="DNIe" /&gt; 
 &lt;br /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/evolution.png" alt="Evolution" title="Evolution" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Otra forma de la que podemos sacar partido al DNI electr&amp;oacute;nico adem&amp;aacute;s de para &lt;a href="http://picodotdev.github.io/blog-bitix/2013/12/usar-el-dni-electronico-con-firefox-en-linux/"&gt;identificarnos en sitios web&lt;/a&gt; que lo soporten como medio de autenticaci&amp;oacute;n es usarlo para firmar digitalmente los correos electr&amp;oacute;nicos que enviamos. Ya he comentado &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/como-usar-gpg-con-evolution.html"&gt;como firmar correos electr&amp;oacute;nicos con GPG&lt;/a&gt; pero hacerlo con el DNI electr&amp;oacute;nico tiene la ventaja de que no necesitaremos &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;crear una par de claves GPG&lt;/a&gt; sino que con tener el DNI e &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/instalar-un-lector-de-tarjetas-inteligentes-en-arch-linux.html"&gt;instalar un lector de tarjetas inteligentes&lt;/a&gt; ser&amp;aacute; suficiente.&lt;/p&gt; 
&lt;p&gt;En esta entrada explicar&amp;eacute; como usar el DNI electr&amp;oacute;nico para firmar digitalmente correos usando el cliente de correo &lt;a href="https://projects.gnome.org/evolution/"&gt;Evolution&lt;/a&gt;. Primeramente necesitaremos hacer una configuraci&amp;oacute;n adicional a la que hemos necesitado para poder usar el lector de tarjetas inteligentes y el DNIe en Linux. Y es usar el siguiente comando tal y como est&amp;aacute; comentado en &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2013/12/enviar-correos-electronicos-firmados-con-el-dnie-y-evolution"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Usar el DNI electrónico con Firefox en Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2013/12/usar-el-dni-electronico-con-firefox-en-linux" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-21T11:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/archlinux.png" alt="Arch Linux" title="Arch Linux" /&gt; 
 &lt;br /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/dnie.jpg" alt="DNIe" title="DNIe" /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/firefox.png" alt="Firefox" title="Firefox" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Una vez hemos conseguido &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/instalar-un-lector-de-tarjetas-inteligentes-en-arch-linux.html"&gt;instalar el DNIe en Linux&lt;/a&gt; correctamente podemos empezar a darle alguna utilidad m&amp;aacute;s all&amp;aacute; de cuando se nos require para acreditar nuestra identidad. Como veremos en esta entrada podemos usar el DNI electr&amp;oacute;nico para hacer varios tr&amp;aacute;mites administrativos y consultas con la administraci&amp;oacute;n p&amp;uacute;blica, empresas o entidades que en su web soporten el DNIe como medio de autenticaci&amp;oacute;n.&lt;/p&gt; 
&lt;p&gt;En esta entrada explicar&amp;eacute; como usar el DNIe electr&amp;oacute;nico con la combinaci&amp;oacute;n del navegador &lt;a href="http://www.mozilla.org/es-ES/"&gt;Firefox&lt;/a&gt; y &lt;a href="http://www.linux.com/"&gt;Linux&lt;/a&gt;. Para ello primeramente debemos hacer que Firefox detecte el lector de tarjetas inteligentes, desde el men&amp;uacute; de Firefox vamos a &amp;laquo;Preferencias &amp;gt; Avanzado &amp;gt; Certificados &amp;gt; Dispositivos de seguridad&amp;raquo;.&lt;/p&gt; 
&lt;div style="text-align: center;"&gt; 
 &lt;a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/preferencias-firefox.png" title="Preferencias de Firefox"&gt;&lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/preferencias-firefox-thumb.png" alt="Preferencias de Firefox" title="Preferencias de Firefox" /&gt; &lt;/a&gt; 
 &lt;a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/administrador-dispositivos-1.png" title="Administrador de dispositivos (1)"&gt;&lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/administrador-dispositivos-1-thumb.png" alt="Administrador de dispositivos (1)" title="Administrador de dispositivos (1)" /&gt;&lt;/a&gt; 
 &lt;a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/administrador-dispositivos-2.png" title="Administrador de dispositivos (2)"&gt;&lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/1/administrador-dispositivos-2-thumb.png" alt="Administrador de dispositivos (2)" title="Administrador de dispositivos (2)" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;p&gt;En esta pantalla pulsamos el bot&amp;oacute;n &amp;laquo;Cargar&amp;raquo; e introducimos los siguientes datos:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2013/12/usar-el-dni-electronico-con-firefox-en-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Firmar digitalmente documentos con el DNIe y Sinadura</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2013/12/firmar-digitalmente-documentos-con-el-dnie-y-sinadura" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-21T10:34:55Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right; text-align: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/dnie.jpg" alt="DNIe" title="DNIe" /&gt; 
 &lt;br /&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/sinadura.png" alt="Sinadura" title="Sinadura" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Ya he comentado &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/instalar-un-lector-de-tarjetas-inteligentes-en-arch-linux.html"&gt;como instalar un lector de tarjetas inteligentes en linux para usar el DNI electr&amp;oacute;nico&lt;/a&gt; y que una vez instalado como podemos darle alg&amp;uacute;n uso &amp;uacute;til como por ejemplo &lt;a href="http://picodotdev.github.io/blog-bitix/2013/12/usar-el-dni-electronico-con-firefox-en-linux/"&gt;autenticarnos con en DNI&lt;/a&gt; en las p&amp;aacute;ginas que lo soporten como medio de autenticaci&amp;oacute;n y el navegador Firefox. Tambi&amp;eacute;n he comentado &lt;a href="http://picodotdev.github.io/blog-bitix/2013/12/enviar-correos-electronicos-firmados-con-el-dnie-y-evolution/"&gt;como usar el DNI con el cliente de correo Evolution para enviar correos firmados digitalmente&lt;/a&gt;.&lt;/p&gt; 
&lt;p&gt;En esta entrada voy a comentar como firmar digitalmente documentos en cualquier formato electr&amp;oacute;nico con la aplicaci&amp;oacute;n de software libre &lt;a href="http://www.sinadura.net/es/"&gt;Sinadura&lt;/a&gt;. La firma que hagamos con el DNIe sobre estos documentos puede tener la misma validez legal que la firma manuscrita.&lt;/p&gt; 
&lt;p&gt;Primeramente deberemos descargar la &amp;uacute;ltima versi&amp;oacute;n de &lt;a href="http://www.sinadura.net/es/"&gt;Sinadura&lt;/a&gt; seg&amp;uacute;n la arquitectura de nuestro procesador, de 32 bits o de 64 bits y la plataforma linux o windows. El archivo descargado es un instalador que deberemos ejecutarlo, como es un programa Java deberemos tener instalado previamente un entorno de ejecuci&amp;oacute;n de Java como el &lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2013/12/firmar-digitalmente-documentos-con-el-dnie-y-sinadura"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>Instalar un lector de tarjetas inteligentes y usar el DNIe en Arch Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/instalar-un-lector-de-tarjetas-inteligentes-y-usar-el-dnie-en-arch-linux" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-14T09:59:03Z</updated>
    <published>2013-11-29T17:34:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Arch Linux" src="http://3.bp.blogspot.com/-XVsmee9V9Vo/S_LjDl4iWZI/AAAAAAAAAQI/LcBAWOoav-s/s1600/archlinux-official-dark.png" height="106" title="Arch Linux" width="320" /&gt; 
&lt;/div&gt;Ya desde hace un tiempo los documentos nacionales de indentidad que emite la administraci&amp;oacute;n p&amp;uacute;blica espa&amp;ntilde;ola son en el formato de tarjeta inteligente (SmartCard), conocido como DNI electr&amp;oacute;nico o DNIe. Estas tarjetas inteligentes tienen la ventaja de que incluyen un certificado digital que nos permiten identificarnos en sitios que lo soporten y realizar diversos tr&amp;aacute;mites y acciones. 
&lt;br /&gt; 
&lt;br /&gt;El DNI electr&amp;oacute;nico nos puede servir para identificarnos en varias p&amp;aacute;ginas de la administraci&amp;oacute;n p&amp;uacute;blica, en las p&amp;aacute;ginas de varios bancos y realizar diferentes tr&amp;aacute;mites electr&amp;oacute;nicos. El DNIe como medio de identificaci&amp;oacute;n en una p&amp;aacute;gina tiene la ventaja de que no necesitamos tener un usuario y una contrase&amp;ntilde;a espec&amp;iacute;fica para ese sitio sino que con el DNI f&amp;iacute;sico y el PIN nos ser&amp;aacute; suficiente. Para identificarnos necesitamos algo que poseemos (el DNI) y algo que conocemos (PIN) con lo que las posibilidades que de alguien que quiera realizar alguna acci&amp;oacute;n en nuestro nombre suplantando nuestra identidad ser&amp;aacute; m&amp;aacute;s complicado, la seguridad es mayor ya que no basta con conocer &amp;uacute;nicamente el usuario y clave sino que se necesita algo f&amp;iacute;sico. Conseguir ambas cosas es m&amp;aacute;s dif&amp;iacute;cil que solo la clave. Realizar tramites administrativos de forma electr&amp;oacute;nica tiene la ventaja que no necesitamos desplazarnos hasta la correspondiente ventanilla para realizar el tr&amp;aacute;mite. Algunos bancos que permiten identificarnos con el DNIe son el&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/instalar-un-lector-de-tarjetas-inteligentes-y-usar-el-dnie-en-arch-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-29T17:34:00Z</dc:date>
  </entry>
  <entry>
    <title>¡Hola nuevo mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/blogbitix/2013/12/$003fhola-nuevo-mundo" />
    <category term="planeta-codigo" />
    <category term="blog" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-09T18:00:00Z</updated>
    <content type="html">&lt;p&gt;&lt;div style="float: right;"&gt; 
 &lt;img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/octopress.png" alt="Octopress" title="Octopress" /&gt; 
&lt;/div&gt; 
&lt;p&gt;Esta es la &amp;uacute;ltima entrada que publicar&amp;eacute; en el &lt;a href="http://elblogdepicodev.blogspot.com.es"&gt;elblogdepicodev.blogspot.com.es&lt;/a&gt; o la primera de &lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt; dependiendo del blog al que hayas accedido, es decir, seguir&amp;eacute; teniendo un blog y escribiendo sobre la tem&amp;aacute;tica alrededor de la tecnolog&amp;iacute;a como hasta ahora pero a partir de este momento todo el nuevo contenido que publique lo har&amp;eacute; en el nuevo blog &lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt;, por lo que si est&amp;aacute;s suscrito al feed de elblogdepicodev te recomiendo que te suscribas al &lt;a href="http://feeds.feedburner.com/blog-bitix/"&gt;feed de bitix&lt;/a&gt; para no perderte ninguna de las nuevas entradas que publique.&lt;/p&gt; 
&lt;h2&gt;Que est&amp;aacute; por venir en Bitix&lt;/h2&gt; 
&lt;p&gt;Tengo bastante cotenido por publicar en el futuro m&amp;aacute;s o menos inmediato empezando por continuar con la &lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;serie de art&amp;iacute;culos sobre criptograf&amp;iacute;a, GPG y DNI electr&amp;oacute;nico&lt;/a&gt;&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/blogbitix/2013/12/$003fhola-nuevo-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
  </entry>
  <entry>
    <title>¡Adios viejo mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/12/$003fadios-viejo-mundo" />
    <category term="planeta-codigo" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-12-05T12:59:16Z</updated>
    <published>2013-12-05T12:59:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Blogger" src="http://2.bp.blogspot.com/-P5IpdthiWSc/UPmd-a_-UwI/AAAAAAAACOI/2287mjoueEU/s1600/blogger.png" title="Blogger" /&gt; 
&lt;/div&gt;Esta es la &amp;uacute;ltima entrada que publicar&amp;eacute; en el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/"&gt;elblogdepicodev.blogspot.com.es&lt;/a&gt; o la primera de 
&lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt; dependiendo del blog al que hayas accedido, es decir, seguir&amp;eacute; teniendo un blog y escribiendo sobre la tem&amp;aacute;tica alrededor de la tecnolog&amp;iacute;a como hasta ahora pero a partir de este momento todo el nuevo contenido que publique lo har&amp;eacute; en el nuevo blog 
&lt;a href="http://picodotdev.github.io/blog-bitix"&gt;picodotdev.github.io/blog-bitix&lt;/a&gt;, por lo que si est&amp;aacute;s suscrito al feed de elblogdepicodev te recomiendo que te suscribas al 
&lt;a href="http://feeds.feedburner.com/blog-bitix/"&gt;feed de bitix&lt;/a&gt; para no perderte ninguna de las nuevas entradas que publique. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;h3&gt;Que est&amp;aacute; por venir en Bitix&lt;/h3&gt;Tengo bastante cotenido por publicar en el futuro m&amp;aacute;s o menos inmediato empezando por continuar con la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;serie de art&amp;iacute;culos sobre criptograf&amp;iacute;a, GPG y DNI electr&amp;oacute;nico&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/12/$003fadios-viejo-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-12-05T12:59:00Z</dc:date>
  </entry>
  <entry>
    <title>Como usar GPG con Evolution</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/como-usar-gpg-con-evolution" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-11-29T18:05:13Z</updated>
    <published>2013-11-22T20:42:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="GnuPG" src="http://2.bp.blogspot.com/-wnNsw8HqDxE/UoZZ15a-ZOI/AAAAAAAACrg/PTAsi1g0Imw/s1600/gnupg.png" height="107" title="GnuPG" width="320" /&gt; 
&lt;/div&gt; 
&lt;div style="background-color: #dddddd; clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Evolution" src="http://3.bp.blogspot.com/-6ffS27mB8Lc/Uo-5N40RfbI/AAAAAAAACuc/5MO4GXbgPbM/s1600/evolution.png" title="Evolution" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;introducci&amp;oacute;n a la criptograf&amp;iacute;a y crear una clave GPG&lt;/a&gt; ya sea a trav&amp;eacute;s de la linea de comandos en la terminal o con la herramienta Contrase&amp;ntilde;as y claves de GNOME adem&amp;aacute;s de usarla para cifrar y firmar documentos desde la terminal podemos usarla para firmar y cifrar los correos electr&amp;oacute;nicos que enviemos usando nuestro cliente de correo. La firma de los correos electr&amp;oacute;nicos permitir&amp;aacute; conocer al receptor si el correo ha sido modificado por una tercera parte, comprobar la autenticidad del mensaje y si tenemos la clave p&amp;uacute;blica del destinatario podremos enviarle el correo cifrado evitando que pueda ser le&amp;iacute;do salvo por el destinatario. 
&lt;br /&gt; 
&lt;br /&gt;En esta entrada explicar&amp;eacute; como firmar y cifrar el correo electr&amp;oacute;nico que enviemos usando nuestra clave GPG y el cliente de correo por defecto de GNOME,&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/como-usar-gpg-con-evolution"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-22T20:42:00Z</dc:date>
  </entry>
  <entry>
    <title>Karmacracy y como integrarlo en Blogger</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger" />
    <category term="planeta-codigo" />
    <category term="blogger" />
    <category term="planeta-linux" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-11-22T21:25:02Z</updated>
    <published>2012-03-29T19:18:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Karmacracy" height="106" src="http://3.bp.blogspot.com/-ZRqkujvZc0g/T3Sw_BV4nuI/AAAAAAAABFc/ZM9R9VsOpLw/s320/karmacracy.png" title="Karmacracy" width="320" /&gt; 
&lt;/div&gt;Hoy en d&amp;iacute;a los que tienen un medio en el cual publican contenido ya se un blog, un peri&amp;oacute;dico, agregador de noticias, foro u otra forma saben que a&amp;ntilde;adir una barra de botones para que los usuarios puedan compartirlo es una buena idea ya que son los propios usuarios, a los que les parece interesante el contenido tanto como para compartirlo en alguna de sus redes sociales, los que ayudan a difundirlo. Esto es bueno para los medios ya que ayuda a atraer m&amp;aacute;s visitas hacia ese contenido pero hasta el momento para los usuarios el hecho de compartirlo no tiene ning&amp;uacute;n aliciente adicional, lo m&amp;aacute;s, formar parte de un n&amp;uacute;mero de usuarios que han compartido anteriormente. 
&lt;br /&gt; 
&lt;br /&gt;Si hab&amp;eacute;is visitado este blog alguna otra vez tal vez os hay&amp;aacute;is dado cuenta que debajo de cada entrada y de los tradicionales botones que ofrece blogger para compartir ha aparecido un bloque a trav&amp;eacute;s del cual tambi&amp;eacute;n se puede compartir las entradas de una forma muy sencilla y en un par de clics en tus redes sociales como twitter, facebook o linkedin. Este bloque es proporcionado por&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-03-29T19:18:00Z</dc:date>
  </entry>
  <entry>
    <title>Archivo de log de sentencias SQL en MySQL o MariaDB</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/10/archivo-de-log-de-sentencias-sql-en-mysql-o-mariadb" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="software" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-10-04T16:59:54Z</updated>
    <published>2013-10-04T16:59:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="MySQL" src="http://1.bp.blogspot.com/-ydHo_TjkCWE/Uk7y3xDZ87I/AAAAAAAACog/7BiVkqaD4-I/s1600/mysql.png" title="MySQL" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="MariaDB" height="150" src="http://1.bp.blogspot.com/-nRVJt74-IbE/Uk7y3zWE5OI/AAAAAAAACok/4ntaGFLkh0s/s200/mariadb.png" title="MariaDB" width="200" /&gt; 
&lt;/div&gt;Muchas aplicaciones utilizan para su 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/08/acceso-base-de-datos-con-hibernate-y-jpa.html"&gt;capa de persistencia un framework ORM&lt;/a&gt; que abstraen al programador de la base de datos, de las peculiaridades de cada una ellas y de las sentencias SQL que se env&amp;iacute;an a la base de datos para realizar las operaciones de recuperaci&amp;oacute;n, actualizaci&amp;oacute;n, borrado y b&amp;uacute;squeda. En Java el ORM suele ser 
&lt;a href="http://www.hibernate.org/"&gt;Hibernate&lt;/a&gt;, en Symphony es 
&lt;a href="http://symfony.com/doc/current/book/doctrine.html"&gt;Doctrine&lt;/a&gt;, en Ruby on Rails es 
&lt;a href="http://guides.rubyonrails.org/active_record_basics.html"&gt;ActiveRecord&lt;/a&gt;, en Django es 
&lt;a href="https://docs.djangoproject.com/en/dev/topics/db/models/"&gt;Models&lt;/a&gt; pero en definitiva todas sirven para el mismo prop&amp;oacute;sito que es darnos un marco de trabajo m&amp;aacute;s similar a un lenguaje orientado a objetos y hacernos olvidar el lenguaje SQL que hay que utilizar para comunicarse con cualquier base de datos relacional. 
&lt;br /&gt; 
&lt;br /&gt;Sin embargo, esa facilidad que dan los ORM puede hacer que las SQL que realmente se env&amp;iacute;an a la base de datos no sean eficientes o no sepamos el n&amp;uacute;mero exacto de las que se est&amp;aacute;n enviando (problema N+1) lo que puede hacer que ciertas funcionalidades de una aplicaci&amp;oacute;n sean lentas y poco eficientes con un volumen de datos grande.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/10/archivo-de-log-de-sentencias-sql-en-mysql-o-mariadb"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-10-04T16:59:00Z</dc:date>
  </entry>
  <entry>
    <title>Libros de ciencia ficción y fantasía</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/06/libros-de-ciencia-ficcion-y-fantasia" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-10-03T17:51:49Z</updated>
    <published>2011-06-03T18:19:00Z</published>
    <content type="html">&lt;p&gt;Si te gustan los libros seguramente te hayas encontrado en alg&amp;uacute;n momento que no encuentras uno determinado que te gustar&amp;iacute;a leer porque en las librer&amp;iacute;as comerciales ya est&amp;aacute;n decatalogados o si los encuentras en alguna a trav&amp;eacute;s de internet est&amp;aacute;n en ingl&amp;eacute;s. En esta situaci&amp;oacute;n tienes varias posibilidades, una de ellas es hacerte con un lector de libros electr&amp;oacute;nico y buscarlo en formato digital en internet y si el libro es un poco conocido y no es la &amp;uacute;ltima novedad seguramente lo encuentres o si te gusta m&amp;aacute;s leer en papel te puedes acercar a una biblioteca p&amp;uacute;blica de tu ciudad. 
&lt;br /&gt; 
&lt;br /&gt;Hace ya unos a&amp;ntilde;os descubr&amp;iacute; el amplio 
&lt;a href="http://katalogoa.bilbao.net/default.ashx"&gt;cat&amp;aacute;logo de libros de las bibliotecas municipales de mi ciudad&lt;/a&gt;, he leido muchos libros que de otra forma no hubiese podido tener acceso a ellos, no est&amp;aacute;n todos pero si muchos que he buscado, y estoy muy contento con esta opci&amp;oacute;n ya que aparte de poder leerlos en papel no tengo que comprarlos con lo que eso me ahorro y luego adem&amp;aacute;s almacenarlos en casa adem&amp;aacute;s evito consumir papel con lo que ademas ayudo al medio ambiente, lo &amp;uacute;nico que me cuesta es el tiempo de desplazarme y el transporte cada vez que quiera pedir o devolver uno, una vez prestados en el plazo de 45 d&amp;iacute;as que los puedo poseer me leo las entre 250 y 350 p&amp;aacute;ginas que suelen tener. He leido grandes libros de Isaac Asimov, Philip K. Dick, Arthur C. Clarke, Robert A. Heinlein, David Eddings y alg&amp;uacute;n otro con los que he pasado muy buenos momentos. Todos estos autores tienen libros muy recomendables si te gusta el g&amp;eacute;nero de ciencia ficci&amp;oacute;n y la fantas&amp;iacute;a y que entre sus libros han recibido varios&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/06/libros-de-ciencia-ficcion-y-fantasia"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-06-03T18:19:00Z</dc:date>
  </entry>
  <entry>
    <title>Archivos properties con codificación UTF-8</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/09/archivos-properties-con-codificacion-utf-8" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="software" />
    <category term="planeta-linux" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-09-21T21:00:08Z</updated>
    <published>2013-09-20T18:15:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Java" height="200" src="http://2.bp.blogspot.com/-hC2-QuC33AU/TBeztET3lAI/AAAAAAAAAZ8/EzZnNZw5do0/s200/java.png" title="Java" width="107" /&gt; 
&lt;/div&gt;En Java los archivos 
&lt;a href="http://docs.oracle.com/javase/7/docs/api/java/util/Properties.html"&gt;Properties&lt;/a&gt; que se cargan con la clase 
&lt;a href="http://docs.oracle.com/javase/7/docs/api/java/util/ResourceBundle.html"&gt;ResourceBundle&lt;/a&gt;&amp;nbsp;utilizados com&amp;uacute;nmente para realizar la internacionalizaci&amp;oacute;n y la localizaci&amp;oacute;n a varios idiomas en una aplicaci&amp;oacute;n Java por defecto usan la codificaci&amp;oacute;n de caracteres ISO-8859-1 (salvo que usemos un framework o una librer&amp;iacute;a lo haga de otra forma). Los caracteres que no pertenezcan al ISO-8859-1 deben ser escapados, por ejemplo \u20AC para el s&amp;iacute;mbolo del euro (€). Esto hace que si tenemos una aplicaci&amp;oacute;n que trabaja con caracteres en varios idiomas tengamos unos ficheros properties con un mont&amp;oacute;n de caracteres de escape que impide su legibilidad al momento de escribirlos o nos obliga a usar el comando 
&lt;a href="http://docs.oracle.com/javase/7/docs/technotes/tools/windows/native2ascii.html"&gt;native2ascii&lt;/a&gt; lo que nos produce tambi&amp;eacute;n archivos poco legibles. 
&lt;br /&gt; 
&lt;br /&gt;La clase ResourceBundle permite cargar archivos properties seg&amp;uacute;n un Locale pero como digo los carga con la codificaci&amp;oacute;n ISO-8859-1 y esto es un problema para los locales como el chino donde casi todos los caracteres deben ser escapados. Si queremos tener archivos m&amp;aacute;s legibles y sin necesidad de escapar los caracteres debemos extender la clase ResourceBundle.Control y redefinirla un poco para que cargue los properties en UTF-8. La implementaci&amp;oacute;n ser&amp;iacute;a la siguiente:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/09/archivos-properties-con-codificacion-utf-8"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-09-20T18:15:00Z</dc:date>
  </entry>
  <entry>
    <title>Autenticación SSH con clave privada y pública</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/01/autenticacion-ssh-con-clave-privada-y-publica" />
    <category term="raspberrypi" />
    <category term="planeta-codigo" />
    <category term="bash" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-09-19T13:21:52Z</updated>
    <published>2013-01-11T12:44:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="OpenSSH" height="104" src="http://2.bp.blogspot.com/-xA1fbdip4ik/UOcpr317aSI/AAAAAAAACI8/ERcKs9Fm7IA/s320/openssh.gif" title="OpenSSH" width="320" /&gt; 
&lt;/div&gt;Siguiendo el art&amp;iacute;culo de la semana pasada sobre 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/01/dejar-procesos-vivos-de-conexion-ssh.html"&gt;como hacer que los programas no se terminasen al finalizar o perderse la conexi&amp;oacute;n SSH&lt;/a&gt;&amp;nbsp;en esta entrada explicar&amp;eacute; como conectarnos a un una m&amp;aacute;quina de forma remota mediante SSH con una clave p&amp;uacute;blica y privada en vez de con la contrase&amp;ntilde;a del usuario. 
&lt;br /&gt; 
&lt;br /&gt;Normalmente mediante contrase&amp;ntilde;a nos conectamos a la m&amp;aacute;quina remota mediante el siguiente comando: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;script src="https://gist.github.com/4510310.js?file=ssh-1.sh"&gt;&lt;/script&gt; Esto nos pedir&amp;aacute; la contrase&amp;ntilde;a del usuario con el que trabajaremos en la m&amp;aacute;quina remota, en este caso la contrase&amp;ntilde;a del usuario raspberrypi, y la deberemos introducir cada vez que realicemos la conexi&amp;oacute;n. Si nos conectamos varias veces, realizamos conexiones a diferentes m&amp;aacute;quinas o nos conectamos con diferentes usuarios m&amp;aacute;s pronto que tarde nos cansaremos de introducir la contrase&amp;ntilde;a constantemente adem&amp;aacute;s de tener que estar recordando cada una de ellas si trabajamos con diferentes usuarios y asignamos a cada uno de ellos una diferente.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/01/autenticacion-ssh-con-clave-privada-y-publica"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-01-11T12:44:00Z</dc:date>
  </entry>
  <entry>
    <title>Guía básica del reproductor de música cmus</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/09/guia-basica-del-reproductor-de-musica-cmus" />
    <category term="raspberrypi" />
    <category term="software" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-09-13T15:46:45Z</updated>
    <published>2013-09-13T15:39:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="cmus" src="http://3.bp.blogspot.com/--mbV1Ag1sV0/UjMupL-Aw8I/AAAAAAAACng/tF15es6zi68/s1600/cmus.png" title="cmus" /&gt; 
&lt;/div&gt;A medida que paso m&amp;aacute;s tiempo usando Linux cada vez m&amp;aacute;s estoy usando y aprendiendo herramientas que funcionan desde la terminal. Por ejemplo, usando 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/09/guia-para-aprender-usar-vim.html"&gt;vim como editor de textos&lt;/a&gt;, 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/11/convertir-imagenes-entre-formatos-y.html"&gt;algunas utilidades de ImageMagick para tratar im&amp;aacute;genes de forma masiva&lt;/a&gt; y 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/01/autenticacion-ssh-con-clave-privada-y.html"&gt;algunas otras utilidades como ssh&lt;/a&gt;, tail, grep, 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/01/dejar-procesos-vivos-de-conexion-ssh.html"&gt;screen&lt;/a&gt;, cal, .... A veces usar estas herramientas es m&amp;aacute;s c&amp;oacute;modo, r&amp;aacute;pido y directo que usar un programa con interfaz gr&amp;aacute;fica como en el caso de ImageMagick pero otras es una necesidad como el uso que le doy a la Raspberry Pi. 
&lt;br /&gt; 
&lt;br /&gt;Como la RPi la uso por SSH y sin interfaz gr&amp;aacute;fica necesitaba buscar un reproductor de m&amp;uacute;sica basado en una interfaz de texto, 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/01/dejar-procesos-vivos-de-conexion-ssh.html"&gt;que permaneciese ejecutandose a pesar de terminar la sesi&amp;oacute;n ssh&lt;/a&gt; y usable desde la terminal para reproducir m&amp;uacute;sica adem&amp;aacute;s de que consuma pocos recursos (rid&amp;iacute;culos comparados con cualquier programa gr&amp;aacute;fico). Despu&amp;eacute;s de una b&amp;uacute;squeda en google y en la wiki de Arch Linux encontr&amp;eacute;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/09/guia-basica-del-reproductor-de-musica-cmus"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-09-13T15:39:00Z</dc:date>
  </entry>
  <entry>
    <title>4 formas de escuchar música a través de internet</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/01/4-formas-de-escuchar-musica-a-traves-de-internet" />
    <category term="raspberrypi" />
    <category term="vlc" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-09-13T15:44:33Z</updated>
    <published>2013-01-25T17:19:00Z</published>
    <content type="html">&lt;p&gt;Si nos gusta la m&amp;uacute;sica probablemente tendremos una colecci&amp;oacute;n amplia de canciones de diferentes artistas y g&amp;eacute;neros, sin embargo, por muy amplia que sea tal vez en alg&amp;uacute;n momento nos apetezca escuchar algo diferente a la m&amp;uacute;sica que tenemos o nos apetezca escuchar la m&amp;uacute;sica del momento a trav&amp;eacute;s de alguna radio que emita por internet via streaming. 
&lt;br /&gt; 
&lt;br /&gt;Muchas radios ya emiten a trav&amp;eacute;s de internet y por tanto las podemos escuchar desde el ordenador siempre y cuando tengamos una conexi&amp;oacute;n a internet. Si no queremos usar el applet flash que normalmente proporciona cada radio en su propia p&amp;aacute;gina web podemos usar VLC, Banshee o incluso desde la terminal o consola. Para esto &amp;uacute;ltimo ello basta con que tengamos instalado el programa 
&lt;a href="https://www.archlinux.org/packages/extra/x86_64/mpg123/"&gt;mpg123&lt;/a&gt; y conozcamos la URL en la que emite la radio lo cual a veces no es sencillo ni viendo el c&amp;oacute;digo fuente de la p&amp;aacute;gina del reproductor del applet flash pero escuchar m&amp;uacute;sica o radios por internet disponemos de varias opciones m&amp;aacute;s, estas son algunas de ellas:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/01/4-formas-de-escuchar-musica-a-traves-de-internet"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-01-25T17:19:00Z</dc:date>
  </entry>
  <entry>
    <title>5 opciones de hosting para aplicaciones Java</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-08-26T23:05:49Z</updated>
    <published>2012-02-25T13:05:00Z</published>
    <content type="html">&lt;p&gt;La tecnolog&amp;iacute;a avanza y hoy en d&amp;iacute;a tenemos nuevas opciones para hospedar las aplicaciones de tal forma que est&amp;eacute;n las 24 horas de los 365 d&amp;iacute;as del a&amp;ntilde;o (o 366) disponibles para ofrecer sus servicios. Veamos algunas de las que hemos tenido hasta el momento con algunas de sus caracter&amp;iacute;sticas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;strong&gt;Servidor propio&lt;/strong&gt; 
&lt;br /&gt;Disponer de un servidor propio tiene varias ventajas como que tenemos total control sobre la m&amp;aacute;quina y en la que podremos instalar todo lo que necesitemos sin ninguna limitaci&amp;oacute;n, sin embargo, esta ventaja tambi&amp;eacute;n puede ser una desventaja ya que tendremos que tener los conocimientos y tiempo para administrar la m&amp;aacute;quina. Otra desventaja es que deberemos solventar los fallos de hardware que se produzcan como una rotura de un disco duro, un sobrecalentamiento de la placa base, memoria, procesador o router lo que puede afectar a la disponibilidad de la aplicaci&amp;oacute;n. Adem&amp;aacute;s, tendremos que disponer de un sitio adecuado para alojar la m&amp;aacute;quina y de los costes que conlleva tenerla encendida en todo el momento que no hay que despreciar. Tambi&amp;eacute;n tenemos que tener en cuenta que si necesitamos escalar la aplicaci&amp;oacute;n tendremos m&amp;aacute;s dificultades que otras opciones ya que tal vez tengamos que adquirir nuevo hardware y haya que adaptar la aplicaci&amp;oacute;n.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-02-25T13:05:00Z</dc:date>
  </entry>
  <entry>
    <title>Internacionalización (i18n) de campos con Hibernate</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/11/internacionalizacion-i18n-de-campos-con-hibernate" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-08-09T17:25:58Z</updated>
    <published>2011-11-11T19:52:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="Java" height="200" src="http://2.bp.blogspot.com/-hC2-QuC33AU/TBeztET3lAI/AAAAAAAAAZ8/EzZnNZw5do0/s200/java.png" title="Java" width="107" /&gt; 
&lt;/div&gt;Si estamos desarrollando un sitio web que soporta varios idiomas necesitaremos internacionalizar (i18n) los literales que aparecen en &amp;eacute;l. Esto incluye tambi&amp;eacute;n tenerlo en cuenta y solucionarlo en los nombres, descripciones y textos que guardamos en la base de datos de las entidades de dominio y que puedan aparecer en en el html generado. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="Hibernate" src="http://4.bp.blogspot.com/-NW8tZ9bOLc0/Tr1-LwGV1KI/AAAAAAAAA_E/Ix83vOC01Nk/s1600/hibernate.png" title="Hibernate" /&gt; 
&lt;/div&gt;La primera soluci&amp;oacute;n que se nos ocurre para las entidades de dominio es crear un campo por cada idioma y concepto a internacionalizar. Sin embargo, esto tiene el problema de que en la base de datos el n&amp;uacute;mero de campos crecer&amp;aacute; r&amp;aacute;pidamente y si tenemos muchos elementos a internacionalizar y muchos idiomas el n&amp;uacute;mero de campos puede ser un problema por el tama&amp;ntilde;o de fila, y aunque los 
&lt;a href="http://www.postgresql.org/about/"&gt;limites en postgresql&lt;/a&gt;&amp;nbsp;y los&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/11/internacionalizacion-i18n-de-campos-con-hibernate"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-11-11T19:52:00Z</dc:date>
  </entry>
  <entry>
    <title>Hemeroteca #1</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1" />
    <category term="hemeroteca" />
    <category term="raspberrypi" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="otros" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <category term="tapestry" />
    <category term="java" />
    <category term="minix" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-07-07T01:16:10Z</updated>
    <published>2012-06-29T16:43:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img src="http://1.bp.blogspot.com/-cK1PH5pzXNc/TdKfToeduKI/AAAAAAAAApw/axtoypLaDfU/s1600/El+blog+de+picodev+%2528watermark%2529.png" /&gt; 
&lt;/div&gt;Ya han pasado seis meses de este 2012 y seguro que muchos estamos ya pensando en coger vacaciones dentro de poco. En esta entrada recopilar&amp;eacute; para que han dado estos seis meses en El blog de pico.dev. Si te interesan entradas como estas y a&amp;uacute;n no lo has hecho suscr&amp;iacute;bete al feed de mi blog, tengo una buena cantidad de entradas esperando a ser escritas y que ir&amp;eacute; publicando a raz&amp;oacute;n de una por semana si dispongo del tiempo y el &amp;aacute;nimo para escribirlas. 
&lt;br /&gt; 
&lt;br /&gt;En estos seis meses he escrito estas 23 entradas agrupadas por tem&amp;aacute;tica: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Varios&lt;/b&gt; 
&lt;br /&gt;Como menci&amp;oacute;n especial integr&amp;eacute; el widget de karmacracy que puede verse al final de cada entrada mediante el cual cualquier usuario puede compartir la entradas de este blog en sus redes sociales como facebook, twitter o linkedin de una forma r&amp;aacute;pida y sencilla obteniendo a cambio un lugar en el widget para los usuarios que m&amp;aacute;s clics atraigan.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-06-29T16:43:00Z</dc:date>
  </entry>
</feed>

