<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-10T23:33:05Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-10T23:33:05Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>4 formas de escuchar música a través de internet</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/01/4-formas-de-escuchar-musica-a-traves-de-internet" />
    <category term="raspberrypi" />
    <category term="vlc" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-09-13T15:44:33Z</updated>
    <published>2013-01-25T17:19:00Z</published>
    <content type="html">&lt;p&gt;Si nos gusta la m&amp;uacute;sica probablemente tendremos una colecci&amp;oacute;n amplia de canciones de diferentes artistas y g&amp;eacute;neros, sin embargo, por muy amplia que sea tal vez en alg&amp;uacute;n momento nos apetezca escuchar algo diferente a la m&amp;uacute;sica que tenemos o nos apetezca escuchar la m&amp;uacute;sica del momento a trav&amp;eacute;s de alguna radio que emita por internet via streaming. 
&lt;br /&gt; 
&lt;br /&gt;Muchas radios ya emiten a trav&amp;eacute;s de internet y por tanto las podemos escuchar desde el ordenador siempre y cuando tengamos una conexi&amp;oacute;n a internet. Si no queremos usar el applet flash que normalmente proporciona cada radio en su propia p&amp;aacute;gina web podemos usar VLC, Banshee o incluso desde la terminal o consola. Para esto &amp;uacute;ltimo ello basta con que tengamos instalado el programa 
&lt;a href="https://www.archlinux.org/packages/extra/x86_64/mpg123/"&gt;mpg123&lt;/a&gt; y conozcamos la URL en la que emite la radio lo cual a veces no es sencillo ni viendo el c&amp;oacute;digo fuente de la p&amp;aacute;gina del reproductor del applet flash pero escuchar m&amp;uacute;sica o radios por internet disponemos de varias opciones m&amp;aacute;s, estas son algunas de ellas:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/01/4-formas-de-escuchar-musica-a-traves-de-internet"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-01-25T17:19:00Z</dc:date>
  </entry>
  <entry>
    <title>Escuchar radios a través de internet con VLC</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/escuchar-radios-a-traves-de-internet-con-vlc" />
    <category term="vlc" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-01-25T18:37:24Z</updated>
    <published>2010-02-15T20:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;img alt="VideoLAN" src="http://3.bp.blogspot.com/_9zOwWD_PYL8/S3moV9Jsf2I/AAAAAAAAAGI/7xDLYDZZyFg/s320/VLC.png" style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;" title="VideoLAN" /&gt; 
&lt;/div&gt; 
&lt;div style="text-align: left;"&gt;&lt;/div&gt;Esta es s&amp;oacute;lo una de las posibilidades del magn&amp;iacute;fico reproductor 
&lt;a href="http://www.videolan.org/"&gt;VLC&lt;/a&gt;. Comentando brevemente sus caracter&amp;iacute;sticas para aquellos que a&amp;uacute;n no lo conozcan, VLC es capaz de reproducir la mayor&amp;iacute;a de los formatos tanto de video como de audio (H.264, Ogg, DivX, MKV, TS, MPEG-2, mp3, MPEG-4, aac, ...) tanto de medios como CD, DVD, tarjetas capturadoras de TV y varios protocolos de emisi&amp;oacute;n a trav&amp;eacute;s de internet mediante 
&lt;a href="http://es.wikipedia.org/wiki/Streaming"&gt;streaming&lt;/a&gt;, como bien queda reflejado en la propia p&amp;aacute;gina de VCL. Posee una interfaz simple y minimalista pero proporciona un mont&amp;oacute;n de posibilidades, y est&amp;aacute; 
&lt;a href="http://www.videolan.org/vlc/"&gt;disponible para los sistemas operativos m&amp;aacute;s conocidos&lt;/a&gt; (por supuesto entre ellos est&amp;aacute;n Windows, GNU/Linux y Mac pero tambi&amp;eacute;n para *BSD y varios Unix). 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://1.bp.blogspot.com/_9zOwWD_PYL8/S3ao1KlwvYI/AAAAAAAAAFM/TnKioDhdNFE/s1600-h/VLC.png"&gt;&lt;img alt="Reproductor de medios VLC" src="http://1.bp.blogspot.com/_9zOwWD_PYL8/S3ao1KlwvYI/AAAAAAAAAFM/TnKioDhdNFE/s320/VLC.png" title="Reproductor de medios VLC" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;Una de estas posibilidades es escuchar radios a trav&amp;eacute;s de internet mediante streaming. Para ello hay que activar la opci&amp;oacute;n &amp;laquo;Medio &amp;gt; Descubrimiento de servicios &amp;gt; Escuchas de radio SHOUTcast&amp;raquo;. Ahora haciendo doble clic en la opci&amp;oacute;n &amp;laquo;Ver &amp;gt; Listas de reproducci&amp;oacute;n &amp;gt; Escuchas de radio SHOUTcast&amp;raquo; (s&amp;oacute;lo aparece habiendo activado la opci&amp;oacute;n previamente en el men&amp;uacute; &amp;laquo;Medio &amp;gt; Descubrimiento de servicios&amp;raquo;) obtendremos una lista de todas la radios que tenemos disponibles, esta lista est&amp;aacute; organizada por g&amp;eacute;nero de la m&amp;uacute;sica. Hay radios que emiten principalmente canciones de los a&amp;ntilde;os 60, 70, ... , electr&amp;oacute;nica, chillout, cl&amp;aacute;sica, pop, rock por mencionar s&amp;oacute;lo unos pocos, s&amp;oacute;lo tienes que buscar el g&amp;eacute;nero que m&amp;aacute;s te guste o m&amp;aacute;s te apetezca escuchar en ese momento y hacer doble clic en &amp;eacute;l, se te mostrar&amp;aacute; una lista de radios de ese g&amp;eacute;nero y podr&amp;aacute;s iniciar la reproducci&amp;oacute;n de esa radio o cambiar a otra haciendo nuevamente doble clic en ella.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/escuchar-radios-a-traves-de-internet-con-vlc"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-15T20:10:00Z</dc:date>
  </entry>
</feed>

