<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15"><span itemprop="headline">Las 11 mejores distribuciones de GNU/Linux del 2015</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/linux"><img title="linux" alt="linux" src="/assets/images/labels/linux.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">victorhck</span> en la bitácora <a href="https://victorhckinthefreeworld.wordpress.com/">Victorhck in the free world</a>, <a href="https://victorhckinthefreeworld.wordpress.com/2015/02/18/las-11-mejores-distribuciones-de-gnulinux-del-2015/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-02-18T18:09" itemprop="datePublished">Publicado el miércoles, 18 de febrero de 2015 a las 18:09 UTC</span></div><div><span>
Etiquetado como
comparativa, <a href="/label/linux"><span itemprop="articleSection">linux</span></a>, gnu-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p><strong>Veamos un repaso a las 11 mejores distribuciones de GNU/Linux para este 2015</strong></p> 
<p><img src="https://i0.wp.com/suse-art.org/CONTENT/content-files/139017-wearelegion.jpg" alt="" width="690" height="517" /></p> 
<p>Quiz&aacute;s eres ne&oacute;fito en esto de GNU/Linux, y te parece demasiado dif&iacute;cil elegir entre tanta distribuci&oacute;n que existe.</p> 
<p>En este art&iacute;culo veremos <strong>las 11 mejores distribuciones de GNU/Linux englobadas en 11 categor&iacute;as.</strong> Puede que te sirva para decidirte por una, y empezar as&iacute; en el mundo de GNU/Linux</p> 
<p></p> 
<p>Un a&ntilde;o m&aacute;s (y ya van unos cuantos) tienes aqui la traducci&oacute;n de este art&iacute;culo, en el que se hace un repaso a las mejores distribuciones de GNU/Linux enfocadas en distintas categor&iacute;as.</p> 
<p>Puedes consultar los art&iacute;culos de <a href="https://victorhckinthefreeworld.wordpress.com/2012/05/08/las-7-mejores-distribuciones-de-gnulinux-del-2012/"><strong>2012,</strong></a> <a href="https://victorhckinthefreeworld.wordpress.com/2013/03/25/las-7-mejores-distribuciones-de-gnulinux-del-2013/"><strong>2013</strong></a> y <a href="https://victorhckinthefreeworld.wordpress.com/2014/01/18/las-7-mejores-distros-de-linux-para-el-2014/"><strong>2014</strong></a> para comparar y ver la evoluci&oacute;n.</p> 
<p>Este art&iacute;culo es una traducci&oacute;n de un art&iacute;culo publicado en <a href="http://www.linux.com"><strong>Linux.com</strong> </a>escrito por <strong>Swapnil Bhartiya,</strong> por tanto son sus opiniones en las que puedes estar m&aacute;s o menos de acuerdo. Puedes expresar la tuya siempre que sea con argumentos y con respeto. El art&iacute;culo original puedes leerlo en este enlace:</p> 
<ul> 
 <li><a href="http://www.linux.com/news/software/applications/810295-the-top-11-best-linux-distros-for-2015"><strong>http://www.linux.com/news/software/applications/810295-the-top-11-best-linux-distros-for-2015</strong></a></li> 
</ul> 
<p><strong>Gracias a Linux.com</strong> por permitir la traducci&oacute;n y la publicaci&oacute;n del art&iacute;culo en mi blog. Empezamos…</p> 
<p><img src="https://victorhckinthefreeworld.files.wordpress.com/2013/07/c3b1u_pinguino.png?w=142&amp;h=208" alt="c3b1u_pinguino.png" width="142" height="208" /></p> 
<h2>La distribuci&oacute;n m&aacute;s bonita: elementary OS</h2> 
<p><a href="https://es.wikipedia.org/wiki/Elementary_OS"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Screenshot_from_2013-08-11_15_57_35.png/800px-Screenshot_from_2013-08-11_15_57_35.png" alt="" width="461" height="288" /></a></p> 
<p>No hay duda de que <a href="http://elementary.io/"><strong>elementary OS</strong></a> es la distribuci&oacute;n basada en Linux m&aacute;s atractiva. La raz&oacute;n es simple: Ser desarrollada por algunos de los mejores dise&ntilde;adores en activo en el mundo del software abierto, as&iacute; que <strong>han llevado el dise&ntilde;o a cada rinc&oacute;n de la distro.</strong></p> 
<p>Con el fin de ofrecer una experiencia consistente a trav&eacute;s de aplicaciones b&aacute;sicas (como el navegador o editor de texto), han creado ya sea sus propias aplicaciones o recogido las que encajan perfectamente en su propia filosof&iacute;a de dise&ntilde;o - por ejemplo, est&aacute;n utilizando el navegador Midori en lugar de Firefox o Chrome.</p> 
<p>Esto hace que se presenten ciertos retos, como que este navegador no ofrece tantas caracter&iacute;sticas como las que ofrecen Chrome o Firefox gracias a sus extensiones y plugins.</p> 
<p>Elementary OS est&aacute; claramente inspirado en <strong>Mac OSX,</strong> e igualmente ofrece un “dock” un panel superior y las aplicaciones tienen los botones a la izquierda, incluso el tema gris de escritorio tambi&eacute;n recuerda a Macbook.</p> 
<div>
 Es un sistema operativo limpio para probar que se ve est&eacute;ticamente y que funciona muy bien “out of the box”.
</div> 
<h2>Mejor distribuci&oacute;n para PC: openSUSE</h2> 
<div>
 <a href="https://es.wikipedia.org/wiki/OpenSUSE"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/OpenSUSE13_2.png/800px-OpenSUSE13_2.png" alt="" width="505" height="378" /></a>
</div> 
<div></div> 
<div>
 Paso la mayor parte de mi tiempo de trabajo en mi PC de sobremesa, es una m&aacute;quina potente capaz de hacer cosas como renderizado de v&iacute;deo, edici&oacute;n de im&aacute;genes, y escribir.
</div> 
<p>Encuentro que <a href="https://www.opensuse.org/es/"><strong>openSUSE</strong></a> es la distro m&aacute;s pulida, madura y professional de las que existen. Tienen especial cuidado en integrar el entorno de escritorio con el resto del sistema operativo, as&iacute; que tendr&aacute;s una experiencia nativa, al utilizarlo.</p> 
<p>openSUSE ha hecho extremadamente sencillo instalar software de terceros mediante su <strong>“One Click Install”</strong> desde la web de <a href="https://victorhckinthefreeworld.wordpress.com/software.opensuse.org"><strong>software.opensuse.org</strong></a> (Lo encuentro m&aacute;s sencillo que a&ntilde;adir manualmente los PPAs de Ubuntu). Tienen un enorme repositorio de software y es probable encontrar tu software para openSUSE.</p> 
<p>openSUSE tiene una herramienta protagonista llamada<strong> YaST,</strong> es el “comando central” del PC entero y podr&aacute;s controlar casi cada aspecto de &eacute;l.</p> 
<p>openSUSE tambi&eacute;n hace muy sencillo instalar varios entornos d escritorio distintos, incluyendo <strong>Lxde, Enlightenment, Gnome, Mate, KDE, y Xfce,</strong> en el mismo sistema uno junto a otro mediante YaST.</p> 
<h2>Mejor distribuci&oacute;n para servidor personal: Debian</h2> 
<p><a href="https://es.wikipedia.org/wiki/Debian"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Openlogo-debianV2.svg/484px-Openlogo-debianV2.svg.png" alt="" width="276" height="342" /></a></p> 
<div>
 &nbsp;Si vas a montar tu propio servidor para tu uso personal, 
 <a href="https://www.debian.org/"><strong>Debian</strong></a> es la distribuci&oacute;n que debes elegir. Debian es conocida por su 
 <strong>fundaci&oacute;n s&oacute;lida como una roca,</strong> nada puede ir mal en un servidor Debian.
</div> 
<div>
 Adem&aacute;s es muy sencillo de manejar un sistema Debian, y hay una gran cantidad de informaci&oacute;n en los foros que te servir&aacute;n de ayuda en caso de duda.
</div> 
<div></div> 
<h2>Mejor distribuci&oacute;n para port&aacute;til: Ubuntu MATE</h2> 
<p><a href="https://es.wikipedia.org/wiki/MATE"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/MATE_Desktop_Environment_1.8_-_About.png/800px-MATE_Desktop_Environment_1.8_-_About.png" alt="" width="486" height="304" /></a></p> 
<p>Port&aacute;tiles, a diferencia de los PC’s de escritorio no suelen ser tan potentes como los PC’s de escritorio en cuanto a hardware, adem&aacute;s pueden existir problemas con cierto software privativo, ah&iacute; es donde <a href="https://ubuntu-mate.org/"><strong>Ubuntu MATE</strong></a> saca lo mejor de s&iacute;. Basada en Ubuntu, MATE hace extremadamente sencillo manejar cualquier dispositivo con <strong>hardware privativo.</strong></p> 
<p>Adem&aacute;s, <strong>MATE</strong> ofrece un buen balance entre rendimiento y uso eficiente de los recursos. La interfaz MATE es amigable, sin curva de aprendizaje para los reci&eacute;n llegados, y se ve muy pulida en port&aacute;tiles.</p> 
<p>MATE cree en el uso de pocos recursos, dej&aacute;ndolos para tus aplicaciones, lo que tambi&eacute;n se traduce en una mayor duraci&oacute;n de la bater&iacute;a.</p> 
<h2>La distribuci&oacute;n m&aacute;s <em>customizable:</em> Arch Linux</h2> 
<div>
 <a href="https://es.wikipedia.org/wiki/Arch_Linux"><img src="https://upload.wikimedia.org/wikipedia/commons/8/85/ArchlinuxLogo.png" alt="" width="350" height="103" /></a>
</div> 
<p><a href="https://www.archlinux.org/"><strong>Arch Linux</strong> </a>es la mejor distribuci&oacute;n cuando se trata de elegir alguna en la que el control total est&aacute; bajo el usuario.</p> 
<p>Cuando un usuario instala <strong>Arch,</strong> est&aacute; montando su propio edificio ladrillo por ladrillo y elige unicamente los componente que necesita, manteni&eacute;ndola limpia y optimizada para el trabajo, por supuesto necesita de un usuario que sea totalmente capaz de utilizar y manejar distribuciones de GNU/Linux.</p> 
<p>Adem&aacute;s es una distribuci&oacute;n “<strong>rolling release</strong>“, yo la llamo “dispara y olvida”. Una vez que instalas Arch Linux no tienes que volver a actualizar todo el sistema operativo completo cada seis meses. Al igual que Chrome OS, tu sistema siempre estar&aacute; al d&iacute;a, simplemente mant&eacute;n la llama de “<strong>pacman -Syu</strong>” ardiendo.</p> 
<h2>La mejor distribuci&oacute;n para Raspberry Pi: Snappy Ubuntu core</h2> 
<p><a href="http://developer.ubuntu.com/en/snappy/"><img src="https://i0.wp.com/assets.ubuntu.com/sites/ubuntu/1253/u/img/cloud/tools/snappy/snappy.png" alt="" width="355" height="251" /></a></p> 
<p><a href="http://www.raspbian.org/"><strong>Raspbian</strong></a> es el l&iacute;der indiscutible en las Paspberry Pi, sin embargo recientemente se ha anunciado <a href="http://developer.ubuntu.com/en/snappy/"><strong>Snappy Core Ubuntu,</strong> </a>que corre en las recientes <strong>Raspberry Pi 2,</strong> ha cambiado las reglas del juego. Con sus actualizaciones similares a las de “Chrome OS”, no tendr&aacute;s que volver a preocuparte de mantener tu sistema operativo actualizado.Mejor distribuci&oacute;n para ni&ntilde;os: Sugar<a href="https://es.wikipedia.org/wiki/Sugar_%28software%29"><img src="https://upload.wikimedia.org/wikipedia/commons/c/ca/Sugar-home-view-0.82.jpg" alt="" width="445" height="334" /></a><a href="https://www.sugarlabs.org/"><strong>Sugar,</strong> </a>es una distribuci&oacute;n basada en Fedora orientada a educadores. Aunque existen otras distribuciones de GNU/Linux para ni&ntilde;os, he escogido Sugar porque no es s&oacute;lo una colecci&oacute;n de software para ni&ntilde;os, est&aacute; actualmente respaldada por un equipo cuyo &uacute;nico objetivo es crear una plataforma pra la educaci&oacute;n. El proyecto naci&oacute; de una colaboraci&oacute;n entre <strong>The One Laptop Per Child, Pentagram, y Red Hat.</strong>Mejor distribuci&oacute;n para jugar: Steam OS<a href="https://es.wikipedia.org/wiki/SteamOS"><img src="https://upload.wikimedia.org/wikipedia/commons/3/36/SteamOS_sin_derechos.png" alt="" width="350" height="92" /></a><a href="http://store.steampowered.com/livingroom/SteamOS/"><strong>Steam OS</strong></a> fue dise&ntilde;ada como la respuesta de Valve Software a Windows para jugar con los PC’s. Han creado este sistema operativo desde la base, con el juego en mente. El sistema operativo est&aacute; basado en Debian y ofrece soporte para optimizar tu GPU para un desarrollo optimo del juego.Valve es conocido por tomarse su tiempo antes de lanzar su software publicamente, as&iacute; el sistema operativo todav&iacute;a est&aacute; en fase beta, debido a que las cosas se pueden romper.La &uacute;nica pega al utilizar Stem OS comparado con alguna otra distribuci&oacute;n de Linux, como por ejemplo Arch Linux, es que <strong>Steam OS formatear&aacute; el disco duo entero,</strong> no hay ninguna opci&oacute;n a elegir durante la partici&oacute;n cuando quieras instalar Steam OS.La mejor distribuci&oacute;n para privacidad: Tails<a href="https://es.wikipedia.org/wiki/The_Amnesic_Incognito_Live_System"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Tails-logo-flat-inverted.svg/446px-Tails-logo-flat-inverted.svg.png" alt="" width="446" height="223" /></a>Nos dirigimos a una era donde nuestros gobiernos elegidos democr&aacute;ticamente (en los USA y en algunos paises Europeos) se est&aacute;n convirtiendo cada vez m&aacute;s y m&aacute;s reservados, y los ciudadanos est&aacute;n perdiendo sus derechos a la <strong>privacidad.</strong> En la era en la que compa&ntilde;&iacute;as recolectan nuestros datos y registran nuestra actividad en la red, mantener la privacidad se est&aacute; convirtiendo en una partida de ajedrez, debes mantenerte un paso por delante. <a href="https://tails.boum.org/"><strong>Tails (The Amnesic Incognito Live System)</strong> </a>es la mejor distribuci&oacute;n que puedes conseguir para mantener tu privacidad y anonimato. El sistema operativo fuerza todas las conexiones a trav&eacute;s de la red Tor y todas conexiones directas son bloqueadas. Adem&aacute;s como el sistema est&aacute; dise&ntilde;ado para funcionar en un Live-CD no quedar&aacute;n rastros en tu disco duro.Tails no necesita ninguna recomendaci&oacute;n m&aacute;s, de acuerdo a un art&iacute;culo del peri&oacute;dico Der Spiegel<strong> la propia NSA lo declar&oacute; “una gran amenaza” para su misi&oacute;n.</strong> Ese es el mejor aval para Tails que puedes tener en el siglo 21.Las mejores tistribuciones para la producci&oacute;n de audio y v&iacute;deo: KXStudio y AVLinux</p> 
<p><img src="https://i0.wp.com/kxstudio.sourceforge.net/screenshots/carla.png" alt="" width="529" height="515" /></p> 
<p>Linux no tiene ning&uacute;n software de edici&oacute;n y v&iacute;deo del gusto de los consumidores, incluso aunque la mayor&iacute;a de Hollywood funcione con Linux. Discho esto, existen muchas distribuciones orientadas a la producci&oacute;n de audio y v&iacute;deo. Lo que diferencia estas distribuciones de otras, es que utilizan diferentes componentes que aquellas orientadas a los escritorios tradicionales.Estas distribuciones utilizan un kernel Linux de baja latencia optimizado para el duro proceso de trabajar con audio y v&iacute;deo. Estas tampoco utilizan PulseAudio, que est&aacute; bien para distros normales, pero no es aconsejable para la producci&oacute;n de audio y v&iacute;deo. <strong>En vez de PulseAudio usan JACK.</strong>Dos de las distribuciones m&aacute;s reputadas para estas tareas son <a href="http://kxstudio.sourceforge.net/"><strong>KXStudio</strong></a> y <a href="http://www.bandshed.net/AVLinux.html"><strong>AVLinux.</strong></a> Estas distribuciones son bien conocidas por ser extremadamente ligeras, por razones obvias, no quiere consumir tus rcursos, mantienen esos recursos libres para la producci&oacute;n de tu trabajo.Para mantener esos recursos libres, estas distros son cuidadosas al escoger sus entornos de escritorio. Mientras de <strong>AVLinux utiliza LXDE</strong>, la distro <strong>KXStudio usa una versi&oacute;n muy reducida de KDE</strong>.Las mejores distribuciones empresariales: SUSE Linux y Red Hat<img src="https://i0.wp.com/www.linux.com/images/stories/41373/fig-3-suseredhat.png" alt="" width="240" height="264" /><a href="http://www.redhat.com/en"><strong>Red Hat</strong></a> y <a href="https://www.suse.com/"><strong>SUSE</strong></a> son dos gigantes en el mundo de Linux que han contribuido fuertemente sobre todo en proyectos de c&oacute;digo abierto, incluyendo el propio kernel Linux. Red Hat ha mostrado prudencia y se est&aacute; transformando ella misma desde una compa&ntilde;&iacute;a de cliente-servidor a una compa&ntilde;&iacute;a m&oacute;vil-nube. Mientras que SUSE quiz&aacute;s un poco ahogada en su cambio de compa&ntilde;&iacute;a propietaria (de Novel a Attachmate y ahora Micro Focus), Red Hat est&aacute; aumentando su posici&oacute;n a trav&eacute;s de adquisiciones (como Feed Henry) y trabajando de cerca con otras plataformas emergentes como OpenStack.Mientras que <strong>Red Hat</strong> fue la primera compa&ntilde;&iacute;a en registrar m&aacute;s de un bill&oacute;n de d&oacute;lares con el comercio &uacute;nicamente de productos de c&oacute;digo abierto, SUSE parece estar sobreviviendo despu&eacute;s de Novell. El fabricante NetWare se dividi&oacute; (como Sun Microsystems) entre sus soluciones privativas compet&iacute;an con soluciones de c&oacute;digo abierto como SUSE. Mientras que el mercado de SUSE Linux crec&iacute;a NetWare deca&iacute;a. Cuando Attachmate compr&oacute; Novell, <strong>se separ&oacute; SUSE Linux de Novell</strong>, haciendo una divisi&oacute;n independiente para centrarse mejor en el mercado de Linux.Ahora SUSE est&aacute; en nuevas manos, y esperamos que esto signifique que se centren m&aacute;s en el lado de Linux que es un mercado creciente.Tanto <strong>SUSE y Red Hat </strong>son conocidas por el mejor de los talentos y el sistema de apoyo muy profesional con los clientes. Incluso si sus equipos de ventas compiten entre s&iacute; para captar clientes, sus desarrolladores trabajan juntos para crear y fortalecer la columna vertebral del imperio Linux.La mejor distribuci&oacute;n para hardware antiguo: Lubuntu<a href="https://es.wikipedia.org/wiki/Lubuntu"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Lubuntu_13.10_English.png/800px-Lubuntu_13.10_English.png" alt="" width="486" height="304" /></a>Todos nosotros tenemos hardware viejo, no lo tires. <strong>Linux puede darle un nuevo aliento de vida a ese hardware,</strong> puedes utilizarlo como PC familiar, o donarlo a quien lo pueda necesitar. La cuesti&oacute;n del mill&oacute;n de d&oacute;lares para este viejo hardware es: <strong>&iquest;Qu&eacute; sistema operativo funcionar&aacute; mejor en &eacute;l?</strong> La respuesta es simple, una distribuci&oacute;n con escritorio LXDE.Personalmente, yo uso Arch Linux en este tipo de hardware con LXDE para manejarlo, pero Arch puede ser muy complicado para el usuario medio, as&iacute; que la mejor distro que puedes conseguir es<a href="http://lubuntu.net/"><strong> Lubuntu.</strong></a>Lubuntu, gracias a tener a Ubuntu de base, funcionar&aacute; bien con tu viejo hardware. Como es una versi&oacute;n de largo soporte oficial por parte de la comunidad de Ubuntu, puedes instalar la versi&oacute;n 14.04 en un equipo <strong>y tendr&aacute;s 3 a&ntilde;o de soporte,</strong> sin necesidad de actualizarlo cada seis meses. Si tu hardware est&aacute; en servicio despu&eacute;s de tres a&ntilde;os puedes facilmente actualizarlo a la siguiente versi&oacute;n sin necesidad de reformatear el sistema.<img src="https://victorhckinthefreeworld.files.wordpress.com/2014/08/keep-calm-and-learn-linux.jpg?w=257&amp;h=300" alt="keep-calm-and-learn-linux" width="257" height="300" />Hasta aqui el vistazo que hemos echado a las distribuciones de GNU/Linux que pueden adecuarse a casi todas las necesidades que tengamos. Hay algo id&oacute;neo para cada uno y no ser&aacute; necesario que uses una &uacute;nica soluci&oacute;n para todo. Estas distribuciones est&aacute;n optimizadas para diferentes tareas en particular.<br /> <strong>De todas ellas &iquest;cual ser&iacute;a tu elecci&oacute;n? &iquest;cual ser&iacute;a tu recomendaci&oacute;n? Sea la que sea… GNU/Linux por favor! ;)</strong>———————————————–</p>
<br /> 
<a href="http://feeds.wordpress.com/1.0/gocomments/victorhckinthefreeworld.wordpress.com/4405/"><img alt="" src="http://feeds.wordpress.com/1.0/comments/victorhckinthefreeworld.wordpress.com/4405/" /></a> 
<img alt="" src="https://pixel.wp.com/b.gif?host=victorhckinthefreeworld.wordpress.com&amp;blog=22503493&amp;post=4405&amp;subd=victorhckinthefreeworld&amp;ref=&amp;feed=1" width="1" height="1" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15" st_title="Las 11 mejores distribuciones de GNU/Linux del 2015 | Victorhck in the free world"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/linux/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta linux</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1484,
      "url" : "http://www.blogstack.info/post/victorhckinthefreeworld/2015/02/las-11-mejores-distribuciones-de-gnu-linux-del-2-15"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "victorhckinthefreeworld",
      "name" : "Victorhck in the free world"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>