<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca"><span itemprop="headline">Chakra y GTK: otra vuelta de tuerca</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-11-20T13:07" itemprop="dateModified">Actualizado el miércoles, 20 de noviembre de 2013 a las 13:07 UTC</span></div><div><span>
Etiquetado como
chakra</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Chakra hace tiempo que no est&aacute; &quot;de moda&quot;, soy consciente y lo asumo. Igualmente tengo interiorizada la imposibilidad de abandonar esta distribuci&oacute;n, con la que tanto he disfrutado y disfruto, por mucho que no termine de estar de acuerdo con algunas de las decisiones que toman los desarrolladores, si bien no es el caso de la que hoy me propongo dar a conocer. Por eso, porque la considero mi distribuci&oacute;n de cabecera y porque apenas hay p&aacute;ginas en la blogosfera que traten sobre ella, aqu&iacute; estamos de nuevo con un art&iacute;culo sobre Chakra. Quienes conocen Chakra y su filosof&iacute;a recordar&aacute;n c&oacute;mo fueron los primeros pasos de esta distribuci&oacute;n, la base Arch Linux con KDEmod, su posterior escisi&oacute;n de la distro canadiense y su consolidaci&oacute;n como sistema independiente absolutamente centrado, de un modo exclusivo y excluyente, en el escritorio KDE y las tecnolog&iacute;as Qt. La dedicaci&oacute;n absoluta a una 
<a href="http://www.lasombradelhelicoptero.com/2012/08/fin-del-soporte-32-bits-en-chakra.html">&uacute;nica arquitectura</a> (64 bits), escritorio y librer&iacute;as de desarrollo hac&iacute;an de la distro algo especial, tan admirada como repudiada en algunos casos por esa especie de discriminaci&oacute;n hacia GTK y las arquitecturas de 32 bits.
<br />
<br />
<table>
 <tbody>
  <tr>
   <td><a href="http://3.bp.blogspot.com/-nNXR5MXwPtU/UoyuTTgR37I/AAAAAAAAEGA/ssN88cRtNEw/s1600/extra-repo-promotional.png"><img height="246" src="http://3.bp.blogspot.com/-nNXR5MXwPtU/UoyuTTgR37I/AAAAAAAAEGA/ssN88cRtNEw/s400/extra-repo-promotional.png" width="400" /></a></td>
  </tr>
  <tr>
   <td>Imagen obra de Malcer</td>
  </tr>
 </tbody>
</table>
<br />
<br />
<a></a>Yo siempre viv&iacute; esta diferencia como algo l&oacute;gico, teniendo en cuenta la escasez de recursos humanos end&eacute;mica en Chakra y su condici&oacute;n de distribuci&oacute;n comunitaria que se desarrolla en el tiempo libre que pueden sacar de aqu&iacute; y de all&aacute; las personas al frente de ella. En un mundo plagado de distribuciones gen&eacute;ricas jam&aacute;s vi con malos ojos la existencia de una un poco distinta en sus esquemas, en su forma de hacer las cosas y, es justo reconocerlo, en su exquisito gusto para decorar KDE.
<br />
<br />Pero las cosas est&aacute;n cambiando. Tras la marcha de algunos desarrolladores principales, a las que se ha unido recientemente la del responsable de la parcela art&iacute;stica que a muchos nos cautiv&oacute; en su d&iacute;a (me refiero a 
<a href="http://ext4.wordpress.com/2013/10/31/un-hasta-luego-o-un-adios/">Malcer</a>, por supuesto, quien ha emprendido nuevo rumbo lejos de Chakra), la distro est&aacute; inmersa en una profunda renovaci&oacute;n. En tiempos pasados era muy sencillo se&ntilde;alar cabezas visibles al frente del proyecto (Jan Mette (DEP), Anke Boersma, Phil M&uuml;ller, Manuel Tortosa...). Aunque ninguno de ellos llevase la vitola de l&iacute;der, su actividad p&uacute;blica en pos de la distro era notoria y reconocible. A d&iacute;a de hoy Chakra es una distribuci&oacute;n basada en el &quot;no liderazgo&quot;, si es que ello es posible, donde todas las decisiones se toman de com&uacute;n acuerdo empleando una 
<a href="https://www.loomio.org/groups/945">plataforma de apoyo</a>.
<br />
<br />Pues bien, es en este marco actual donde se ha decidido prescindir, como en su d&iacute;a se hizo con los 
<a href="http://www.lasombradelhelicoptero.com/2013/04/adios-los-bundles-en-chakra.html">bundles</a>, de la estructura de directorios espec&iacute;fica para alojar las aplicaciones GTK, en concreto el &quot;/extra&quot;. Ojo, no se debe confundir con el repositorio del mismo nombre, el cual contin&uacute;a activo y recogiendo dichas aplicaciones. Las motivaciones y repercusiones, mejor las transcribo del 
<a href="http://chakra-project.org/news/index.php?/archives/111-Moving-the-installation-of-extra-packages-from-extra-to-usr.html">art&iacute;culo</a> publicado por Neophytos Kolokotronis en la web del proyecto:
<br />
<br />
<blockquote>
 <i>Tras una larga discusi&oacute;n entre los miembros del proyecto se ha tomado la decisi&oacute;n de mover el lugar de instalaci&oacute;n de todos los paquetes del repositorio [extra] desde /extra hasta /usr.</i>
</blockquote>
<blockquote>
 <i>Se ha tomado esta decisi&oacute;n para facilitar el mantenimiento de los paquetes por parte de los desarrolladores, los colaboradores en CCR y los usuarios. Con este cambio no se necesitar&aacute;n m&aacute;s arreglos especiales adem&aacute;s de que el sistema cumple mejor con los est&aacute;ndares de jerarqu&iacute;a de sistemas de archivos. Para el usuario final no ha de suponer ning&uacute;n problema, sino una mejora.</i>
</blockquote>
<blockquote>
 <i>Os estar&eacute;is preguntando por qu&eacute; hacemos un nuevo cambio m&aacute;s en nuestra forma de tratar los paquetes con dependencias GTK+. Como probablemente ya sabr&eacute;is, en principio desarrollamos un sistema de bundles. Fue una idea que innovaba, pero no fue posible lograr que se integrase como debiera con el resto del sistema, debido a las modificaciones que hab&iacute;a que realizar en binarios y librer&iacute;as. A principios de a&ntilde;o abandonamos el sistema de bundles y a&ntilde;adimos el repositorio [extra], el cual instalaba todos sus paquetes en el directorio /extra. Ya no hab&iacute;a retrasos en el lanzamiento de aplicaciones con dependencias GTK+, al no tener que duplicar paquetes se redujo el tama&ntilde;o de las mismas y resultaba mucho m&aacute;s sencillo a&ntilde;adir complementos a esos programas. Hab&iacute;amos invertido un tiempo considerable en el desarrollo de los bundles; el cambio a [extra] fue una decisi&oacute;n muy dif&iacute;cil de tomar, pero lo hicimos convencidos de que era un mejora en la experiencia general de usuario. Sin embargo, el cambio trajo consigo otros problemas al no detectarse correctamente ciertas librer&iacute;as GTK+ por parte de algunos programas debido a su ubicaci&oacute;n especial, con lo que resultaba m&aacute;s complicado compilar e instalar paquetes. Con el cambio de ubicaci&oacute;n que ahora acometemos estamos seguros de que la detecci&oacute;n de librer&iacute;as GTK+ no supondr&aacute; un problema a partir de ahora.</i>
</blockquote>
<blockquote>
 <i>Para el usuario final, el cambio va a ser imperceptible, ya que pacman informar&aacute; del cambio de los antiguos paquetes por los nuevos. Tan solo se deber&aacute;n ajustar las rutas en caso de utilizar alg&uacute;n enlace o lanzador para que apunten al ejecutable en /usr/bin en lugar de en /extra/bin. En caso de encontrar alguna dificultad, por favor, comunicadlo. Si no ten&eacute;is instalado ning&uacute;n paquete de CCR que dependa del paquete filesystem-extra pod&eacute;is eliminarlo sin problemas.</i>
</blockquote>
<blockquote>
 <i>Hay disponible una lista de los paquetes CCR afectados en <a href="http://paste.chakra-project.org/5754/">este enlace</a>.</i> 
 <i>Los mantenedores de paquetes en CCR tendr&aacute;n que eliminar la parte referente a /extra de las secciones build y package(). Lamentamos daros trabajo extra, pero esperamos que este cambio sea para mejor.</i>
</blockquote>
<blockquote>
 &nbsp;
 <i>Por &uacute;ltimo, aseguramos que todos los paquetes a excepci&oacute;n de los contenidos en el repositorio [extra] continuar&aacute;n siendo compilados sin ninguna dependencia GTK+, as&iacute; como nuestras ISOs seguir&aacute;n sin incluir ning&uacute;n paquete de este tipo. Siempre se podr&aacute; instalar lo que se quiera desde el repositorio [extra] o CCR. Nosotros, como proyecto, creemos necesario puntualizar que <u><b>no tenemos nada en contra de GTK+</b></u>, es solamente que nuestro deseo es concentrarnos en KDE/Qt y entregar nuestros paquetes acorde a ello.</i>
</blockquote>
<br />As&iacute; que, informados quedan todos los seguidores y usuarios de Chakra de este nuevo movimiento, que esperan sea definitivo y que parece acercar un poco a la distro hacia la normalidad. Estoy seguro, es m&aacute;s, ya lo he podido constatar en ciertos foros, de que habr&aacute; usuarios que no est&eacute;n de acuerdo con este cambio, lamentando que Chakra se vaya a convertir en una distro m&aacute;s. Personalmente no comparto esa visi&oacute;n del asunto, y no lo hago porque he sido uno de los que ha sufrido las incomodidades de tener que empaquetar para CCR y que un paquete no compile por no encontrar las librer&iacute;as adecuadas. Por no hablar de cuando se logra compilar y el funcionamiento es penoso y lamentable, uno se pregunta d&oacute;nde est&aacute; el problema, y &eacute;ste se halla precisamente en la particular forma de tratar las dependencias GTK en Chakra.
<br />
<br />Por mi parte aplaudo este movimiento en pos de la regularizaci&oacute;n de GTK en la distribuci&oacute;n. No est&aacute;n cambiando gran cosa en realidad, aquellos que se declaran anti-GTK podr&aacute;n seguir teniendo su sistema Qt puro sin mayor dificultad, lo &uacute;nico que han de hacer es no habilitar el repositorio [extra], como hasta ahora, repositorio que adem&aacute;s viene desactivado por defecto al instalar. Y los que abogamos por la coexistencia entre Qt y alguna aplicaci&oacute;n GTK, porque las hay muy buenas e irreemplazables, podremos instalar y compilar sin tener que quebrarnos la cabeza en busca de soluciones a extra&ntilde;os errores en la localizaci&oacute;n de librer&iacute;as. &iquest;D&oacute;nde est&aacute; el problema?
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-RoBdnaUSzW4/UoyvBa8G_KI/AAAAAAAAEGI/PYL7AySjBHQ/s1600/Chakra1.png"><img height="320" src="http://1.bp.blogspot.com/-RoBdnaUSzW4/UoyvBa8G_KI/AAAAAAAAEGI/PYL7AySjBHQ/s400/Chakra1.png" width="400" /></a>
</div>
<br />Termino agradeciendo a los desarrolladores su duro trabajo para lograr que Chakra no caiga en el olvido. A&uacute;n lamentando las &uacute;ltimas bajas en el equipo y a sabiendas de que dejan un hueco imposible de llenar, quisiera acabar resaltando algunas de las novedades que se plantean en la pr&oacute;xima ISO de la distro, como el suavizado de fuentes de Ubuntu instalado &quot;de serie&quot;, o la inclusi&oacute;n casi segura del soporte para Wayland en mesa. Sobre los aspectos art&iacute;sticos no s&eacute; nada, tras la marcha de Malcer ignoro si se va a trabajar en un nuevo &quot;artwork&quot; o se apostar&aacute; por la continuidad en este apartado. Estaremos (al menos yo, seguro) atentos a las novedades.</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca" st_title="Chakra y GTK: otra vuelta de tuerca | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 325,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/chakra-y-gtk-otra-vuelta-de-tuerca"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>