<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2015-01-12T00:13:35Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2015-01-12T00:13:35Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Instalar un lector de tarjetas inteligentes y usar el DNIe en Arch Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/instalar-un-lector-de-tarjetas-inteligentes-y-usar-el-dnie-en-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="software-libre" />
    <category term="hardware" />
    <category term="planeta-arch-linux" />
    <category term="gnu-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-10-07T13:16:19Z</updated>
    <published>2013-11-29T17:34:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Arch Linux" src="http://3.bp.blogspot.com/-XVsmee9V9Vo/S_LjDl4iWZI/AAAAAAAAAQI/LcBAWOoav-s/s1600/archlinux-official-dark.png" height="106" title="Arch Linux" width="320" /&gt; 
&lt;/div&gt;Ya desde hace un tiempo los documentos nacionales de indentidad que emite la administraci&amp;oacute;n p&amp;uacute;blica espa&amp;ntilde;ola son en el formato de tarjeta inteligente (SmartCard), conocido como DNI electr&amp;oacute;nico o DNIe. Estas tarjetas inteligentes tienen la ventaja de que incluyen un certificado digital que nos permiten identificarnos en sitios que lo soporten y realizar diversos tr&amp;aacute;mites y acciones. 
&lt;br /&gt; 
&lt;br /&gt;El DNI electr&amp;oacute;nico nos puede servir para identificarnos en varias p&amp;aacute;ginas de la administraci&amp;oacute;n p&amp;uacute;blica, en las p&amp;aacute;ginas de varios bancos y realizar diferentes tr&amp;aacute;mites electr&amp;oacute;nicos. El DNIe como medio de identificaci&amp;oacute;n en una p&amp;aacute;gina tiene la ventaja de que no necesitamos tener un usuario y una contrase&amp;ntilde;a espec&amp;iacute;fica para ese sitio sino que con el DNI f&amp;iacute;sico y el PIN nos ser&amp;aacute; suficiente. Para identificarnos necesitamos algo que poseemos (el DNI) y algo que conocemos (PIN) con lo que las posibilidades que de alguien que quiera realizar alguna acci&amp;oacute;n en nuestro nombre suplantando nuestra identidad ser&amp;aacute; m&amp;aacute;s complicado, la seguridad es mayor ya que no basta con conocer &amp;uacute;nicamente el usuario y clave sino que se necesita algo f&amp;iacute;sico. Conseguir ambas cosas es m&amp;aacute;s dif&amp;iacute;cil que solo la clave. Realizar tramites administrativos de forma electr&amp;oacute;nica tiene la ventaja que no necesitamos desplazarnos hasta la correspondiente ventanilla para realizar el tr&amp;aacute;mite. Algunos bancos que permiten identificarnos con el DNIe son el&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/instalar-un-lector-de-tarjetas-inteligentes-y-usar-el-dnie-en-arch-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-29T17:34:00Z</dc:date>
  </entry>
  <entry>
    <title>Nuevo centralizador de Feeds sobre Linux y tecnologia</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdeliher/2014/09/nuevo-centralizador-de-feeds-sobre-linux-y-tecnologia" />
    <category term="feed" />
    <category term="noticias" />
    <category term="tecnologia" />
    <category term="ubuntu" />
    <category term="centralizador" />
    <category term="linux" />
    <author>
      <name>Liher</name>
    </author>
    <updated>2014-09-16T09:51:41Z</updated>
    <published>2014-09-16T09:51:41Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;Hoy he conocido un nuevo &lt;strong&gt;centralizador&lt;/strong&gt; de &lt;strong&gt;Feeds&lt;/strong&gt; gracias a Google Analitycs. Cuando he accedido a su web he tenido un “deja vu”, ya que es id&amp;eacute;ntico a UbuntuFeed, un centralizador de Feeds que cerro el a&amp;ntilde;o pasado, cambia la paleta de colores y ha ampliado la tem&amp;aacute;tica. En este caso, en este centralizador de Feeds podemos encontrar paginas de &lt;strong&gt;Linux&lt;/strong&gt;, m&amp;oacute;viles y &lt;strong&gt;tecnolog&amp;iacute;a&lt;/strong&gt; en general.&lt;/p&gt; 
&lt;p&gt;El creador de esta nueva pagina es&amp;nbsp;&lt;a href="https://twitter.com/juan77_sonic"&gt;JuanK&lt;/a&gt;. Ha cogido el c&amp;oacute;digo de UbuntuFeed que esta disponible en Github, y lo ha aplicado a su web, en la cual hay muchos blogs sobre los temas anteriormente mencionados. Tengo que decir que ya lo tengo agregado a mi lista de &lt;strong&gt;Feeds&lt;/strong&gt; en el Thunderbird y como tiene tantas webs centralizadas podremos estar al d&amp;iacute;a con el.&lt;/p&gt; 
&lt;p&gt;La pagina es tal que as&amp;iacute;:&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdeliher/2014/09/nuevo-centralizador-de-feeds-sobre-linux-y-tecnologia"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Liher</dc:creator>
    <dc:date>2014-09-16T09:51:41Z</dc:date>
  </entry>
  <entry>
    <title>Cómo saber qué tecnologías usa un sitio web</title>
    <link rel="alternate" href="http://www.blogstack.info/post/placerdigital/2013/05/como-saber-que-tecnologias-usa-un-sitio-web" />
    <category term="extensiones" />
    <category term="blog-stack" />
    <category term="tecnologia" />
    <category term="wappalyzer" />
    <category term="software" />
    <category term="analisis" />
    <author>
      <name>Ricardo Barra</name>
    </author>
    <updated>2014-05-07T21:47:08Z</updated>
    <published>2013-05-22T14:23:45Z</published>
    <content type="html">&lt;p&gt;&lt;p&gt;&lt;a href="http://placerdigital.net/pdblog/wp-content/uploads/2013/05/operating-systems.png"&gt;&lt;img alt="Gr&amp;aacute;fico de sistemas operativos" src="http://placerdigital.net/pdblog/wp-content/uploads/2013/05/operating-systems.png" width="720" height="407" /&gt;&lt;/a&gt;Una de las cosas que m&amp;aacute;s me gustan en la vida es averiguar con qu&amp;eacute; tecnolog&amp;iacute;as est&amp;aacute; hecho un sitio web. Para m&amp;iacute; es interesante conocer el servidor que est&amp;aacute; usando, lenguaje de programaci&amp;oacute;n, sistema de estad&amp;iacute;sticas, framework de Javascript, administrador de contenidos (CMS), qu&amp;eacute; sistema operativo usa el servidor, si el sitio tiene wiki, editores de texto enriquecido, galer&amp;iacute;as de fotos, redes sociales, foros, y un sinf&amp;iacute;n de otras cosas.&lt;/p&gt; 
&lt;p&gt;Hasta hace no mucho, hab&amp;iacute;a pocos servicios para enterarse de esto. Uno de ellos era &lt;a title="BuiltWith" href="http://builtwith.com/"&gt;BuiltWith&lt;/a&gt;, que us&amp;eacute; hace a&amp;ntilde;os pero no siempre confi&amp;eacute; en los resultados y adem&amp;aacute;s cobraban por un servicio “premium”. Por eso &lt;strong&gt;Wappalyizer&lt;/strong&gt; fue la panacea para m&amp;iacute;. Con esta esta extensi&amp;oacute;n para Firefox, puedo saber todo lo anterior y mucho m&amp;aacute;s sin hacer que el navegador se ponga m&amp;aacute;s lento, si hacer ni un solo clic, sin alterar mis h&amp;aacute;bitos de navegaci&amp;oacute;n o tener que ir a otro sitio a hacer una consulta.&lt;/p&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/placerdigital/2013/05/como-saber-que-tecnologias-usa-un-sitio-web"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>Ricardo Barra</dc:creator>
    <dc:date>2013-05-22T14:23:45Z</dc:date>
  </entry>
  <entry>
    <title>Introducción a la criptografía e inicio con GPG</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/introduccion-a-la-criptografia-e-inicio-con-gpg" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="software-libre" />
    <category term="planeta-arch-linux" />
    <category term="gnu-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-23T01:13:34Z</updated>
    <published>2013-11-15T20:18:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: both; text-align: center;"&gt; 
  &lt;img alt="GnuPG" src="http://4.bp.blogspot.com/-wnNsw8HqDxE/UoZZ15a-ZOI/AAAAAAAACrc/c4ZId2hHNqs/s320/gnupg.png" height="105" title="GnuPG" width="320" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Internet est&amp;aacute; formado por una red de m&amp;aacute;quinas interconectadas que en conjunto permiten que un par de m&amp;aacute;quinas de esa red puedan comunicarse entre si aunque no est&amp;eacute;n directamente conectadas, el 
&lt;a href="http://es.wikipedia.org/wiki/Transmission_Control_Protocol"&gt;protocolo TCP/IP&lt;/a&gt; es el que posibilita esa comunicaci&amp;oacute;n. En la comunicaci&amp;oacute;n entre las m&amp;aacute;quinas que no est&amp;aacute;n directamente conectadas la informaci&amp;oacute;n de la m&amp;aacute;quina origen ha de ser transportada por un camino de varias m&amp;aacute;quinas hasta llegar a a la m&amp;aacute;quina destino y posteriormente de vuelta por el mismo camino u otro. En muchos casos la informaci&amp;oacute;n que viaja a lo largo de ese camino de terceras m&amp;aacute;quinas no es relevante ni sensible pero en otros casos podemos necesitar o queremos evitar que esas terceras m&amp;aacute;quinas puedan acceder a la informaci&amp;oacute;n que se est&amp;aacute; transmitiendo. En este &amp;uacute;ltimo caso es donde entra en acci&amp;oacute;n la criptograf&amp;iacute;a.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/introduccion-a-la-criptografia-e-inicio-con-gpg"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-15T20:18:00Z</dc:date>
  </entry>
  <entry>
    <title>Libro sobre desarrollo de aplicaciones con Apache Tapestry</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/07/libro-sobre-desarrollo-de-aplicaciones-con-apache-tapestry" />
    <category term="programacion" />
    <category term="planeta-linux" />
    <category term="java" />
    <category term="tecnologia" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="software-libre" />
    <category term="tapestry" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-02-14T20:12:44Z</updated>
    <published>2013-07-24T17:06:00Z</published>
    <content type="html">&lt;p&gt;Recientemente he publicado 
&lt;a href="http://goo.gl/Vx8icI"&gt;PlugIn Tapestry&lt;/a&gt;, un libro acerca del desarrollo de aplicaciones web en el lenguaje Java y con el framework 
&lt;a href="http://tapestry.apache.org/"&gt;Apache Tapestry&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;div style="clear: both; text-align: center;"&gt; 
  &lt;a href="http://goo.gl/WFQgY"&gt;&lt;img alt="PlugIn Tapestry" src="http://1.bp.blogspot.com/-CUcQ3fWr9Yw/Ue7FYGDd_SI/AAAAAAAACls/eLuRuVvRz7w/s320/PlugInTapestry.png" height="320" style="border-color: red; border-style: solid; border-width: 1px;" title="PlugIn Tapestry" width="226" /&gt;&lt;/a&gt; 
 &lt;/div&gt;Apache Tapestry es un framework orientado a componentes para crear aplicaciones web r&amp;aacute;pidas, din&amp;aacute;micas, robustas y altamente escalables en la plataforma Java. Al basarse en componentes es distinto de los muchos basados en acciones similares en esencia a Struts que podemos encontrar en la plataforma Java como SpringMVC, Grails y Play! y tambi&amp;eacute;n de los muchos otros en los que la principal diferencia es el lenguaje como Django (Python), Symfony (PHP), .NET MVC (C#) o Ruby On Rails (Ruby). 
 &lt;br /&gt; 
 &lt;br /&gt;Incluyendo la descripci&amp;oacute;n de las caracter&amp;iacute;sticas del framework el libro trata la mayor&amp;iacute;a de aspectos que puede necesitar una aplicaci&amp;oacute;n o p&amp;aacute;gina web, entre ellos: 
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/07/libro-sobre-desarrollo-de-aplicaciones-con-apache-tapestry"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-07-24T17:06:00Z</dc:date>
  </entry>
  <entry>
    <title>Como usar GPG con Evolution</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2013/11/como-usar-gpg-con-evolution" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="planeta-codigo" />
    <category term="software" />
    <category term="software-libre" />
    <category term="planeta-arch-linux" />
    <category term="gnu-linux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-11-29T18:05:13Z</updated>
    <published>2013-11-22T20:42:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="GnuPG" src="http://2.bp.blogspot.com/-wnNsw8HqDxE/UoZZ15a-ZOI/AAAAAAAACrg/PTAsi1g0Imw/s1600/gnupg.png" height="107" title="GnuPG" width="320" /&gt; 
&lt;/div&gt; 
&lt;div style="background-color: #dddddd; clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Evolution" src="http://3.bp.blogspot.com/-6ffS27mB8Lc/Uo-5N40RfbI/AAAAAAAACuc/5MO4GXbgPbM/s1600/evolution.png" title="Evolution" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2013/11/introduccion-la-criptografia-e-inicio-con-gpg.html"&gt;introducci&amp;oacute;n a la criptograf&amp;iacute;a y crear una clave GPG&lt;/a&gt; ya sea a trav&amp;eacute;s de la linea de comandos en la terminal o con la herramienta Contrase&amp;ntilde;as y claves de GNOME adem&amp;aacute;s de usarla para cifrar y firmar documentos desde la terminal podemos usarla para firmar y cifrar los correos electr&amp;oacute;nicos que enviemos usando nuestro cliente de correo. La firma de los correos electr&amp;oacute;nicos permitir&amp;aacute; conocer al receptor si el correo ha sido modificado por una tercera parte, comprobar la autenticidad del mensaje y si tenemos la clave p&amp;uacute;blica del destinatario podremos enviarle el correo cifrado evitando que pueda ser le&amp;iacute;do salvo por el destinatario. 
&lt;br /&gt; 
&lt;br /&gt;En esta entrada explicar&amp;eacute; como firmar y cifrar el correo electr&amp;oacute;nico que enviemos usando nuestra clave GPG y el cliente de correo por defecto de GNOME,&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2013/11/como-usar-gpg-con-evolution"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2013-11-22T20:42:00Z</dc:date>
  </entry>
  <entry>
    <title>5 opciones de hosting para aplicaciones Java</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-08-27T03:05:49Z</updated>
    <published>2012-02-25T18:05:00Z</published>
    <content type="html">&lt;p&gt;La tecnolog&amp;iacute;a avanza y hoy en d&amp;iacute;a tenemos nuevas opciones para hospedar las aplicaciones de tal forma que est&amp;eacute;n las 24 horas de los 365 d&amp;iacute;as del a&amp;ntilde;o (o 366) disponibles para ofrecer sus servicios. Veamos algunas de las que hemos tenido hasta el momento con algunas de sus caracter&amp;iacute;sticas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;strong&gt;Servidor propio&lt;/strong&gt; 
&lt;br /&gt;Disponer de un servidor propio tiene varias ventajas como que tenemos total control sobre la m&amp;aacute;quina y en la que podremos instalar todo lo que necesitemos sin ninguna limitaci&amp;oacute;n, sin embargo, esta ventaja tambi&amp;eacute;n puede ser una desventaja ya que tendremos que tener los conocimientos y tiempo para administrar la m&amp;aacute;quina. Otra desventaja es que deberemos solventar los fallos de hardware que se produzcan como una rotura de un disco duro, un sobrecalentamiento de la placa base, memoria, procesador o router lo que puede afectar a la disponibilidad de la aplicaci&amp;oacute;n. Adem&amp;aacute;s, tendremos que disponer de un sitio adecuado para alojar la m&amp;aacute;quina y de los costes que conlleva tenerla encendida en todo el momento que no hay que despreciar. Tambi&amp;eacute;n tenemos que tener en cuenta que si necesitamos escalar la aplicaci&amp;oacute;n tendremos m&amp;aacute;s dificultades que otras opciones ya que tal vez tengamos que adquirir nuevo hardware y haya que adaptar la aplicaci&amp;oacute;n.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-02-25T18:05:00Z</dc:date>
  </entry>
  <entry>
    <title>Guía instalación Raspberry Pi con Arch Linux ARM (Parte I, instalación base)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-i-instalacion-base" />
    <category term="raspberrypi" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-03-23T22:08:32Z</updated>
    <published>2012-06-08T23:03:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Raspberry Pi" src="http://2.bp.blogspot.com/-xGGLQL8UfII/T7azF5bgY2I/AAAAAAAABHg/CEVqX-iC4-g/s1600/raspberrypi.jpg" title="Raspberry Pi" /&gt; 
&lt;/div&gt;Nota: la &amp;uacute;ltima actualizaci&amp;oacute;n de esta gu&amp;iacute;a fue el 19-01-2013. Al ser Arch Linux una distribuci&amp;oacute;n rolling release puede que cuando la leas algunas cosas hayan cambiado aunque la mayor&amp;iacute;a seguir&amp;aacute;n siendo como esta escrito a continuaci&amp;oacute;n. 
&lt;br /&gt; 
&lt;br /&gt;Si ya tenemos en nuestras manos una 
&lt;a href="http://www.raspberrypi.org/"&gt;Raspberry Pi&lt;/a&gt;&amp;nbsp;convencidos de que nos puede ser de utilidad para algunas tareas&amp;nbsp;y la hemos 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/05/raspberry-pi-desempaquetado-unboxing.html"&gt;desempaquetado&lt;/a&gt; el primer paso que deberemos de dar es instalar alguna de las 
&lt;a href="http://elinux.org/RPi_Distributions"&gt;distribuciones GNU/Linux disponibles&lt;/a&gt;, en este momento Debian y 
&lt;a href="http://archlinuxarm.org/"&gt;Arch Linux ARM&lt;/a&gt;, Fedora finalmente ha tenido alg&amp;uacute;n problema y desapareci&amp;oacute; de la lista de descargas aunque es probable que en alg&amp;uacute;n momento vuelva a ofrecer soporte. 
&lt;br /&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Arch Linux ARM" height="88" src="http://2.bp.blogspot.com/-Or91_hYDlQk/T9K1chcDVMI/AAAAAAAABOk/d1ORSB16KRY/s400/archlinuxarm.png" title="Arch Linux ARM" width="400" /&gt; 
&lt;/div&gt; 
&lt;br /&gt;Los materiales que deberemos tener para realizar el proceso adem&amp;aacute;s de la propia Raspberry son:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-i-instalacion-base"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-06-08T23:03:00Z</dc:date>
  </entry>
  <entry>
    <title>Análisis software y BIOS de Sony Vaio E 14P</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/analisis-software-y-bios-de-sony-vaio-e-14p" />
    <category term="software" />
    <category term="software-privativo" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="arch-linux" />
    <category term="hardware" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-01-27T03:07:17Z</updated>
    <published>2012-12-15T00:05:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Windows 8" src="http://2.bp.blogspot.com/-oJ_bynnlfOI/UMt2wkfcJkI/AAAAAAAAB-U/g8vWHPyACMk/s1600/Windows8.png" title="Windows 8" /&gt; 
&lt;/div&gt;Esta ser&amp;aacute; la &amp;uacute;ltima entrada que escribir&amp;eacute; sobre el port&amp;aacute;til Sony Vaio E 14P. En la primera entrada coment&amp;eacute; 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/mi-guia-para-eleccion-de-portatil-nuevo.html"&gt;que es lo que buscaba y porque finalmente eleg&amp;iacute; este modelo&lt;/a&gt;. En la segunda hice un 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html"&gt;reportaje gr&amp;aacute;fico amplio&lt;/a&gt; con muchos detalles desde el aspecto externo, teclado y hasta de los m&amp;oacute;dulos de memoria y disco duro por si alguien tuviese inter&amp;eacute;s de ampliar la memoria o ponerle un disco duro SSD. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Linux" height="200" src="http://4.bp.blogspot.com/-gf0CBdHQ0EI/TQJrCzG9OZI/AAAAAAAAAiY/NcJAFNmleAw/s200/tux.png" title="Linux" width="169" /&gt; 
&lt;/div&gt;En esta entrada me centrar&amp;eacute; en los aspectos una vez encendido el port&amp;aacute;til como es el caso de la BIOS UEFI, el software preinstalado que incorpora y analizar el equipo con programas como CPU-Z, GPU-Z y HWINFO que proporcionan muchos detalles del hardware. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;h3&gt;Primer arranque del sistema&lt;/h3&gt;Antes de poder usar el equipo que viene con Windows 8 preinstalado sin posibilidad de otra opci&amp;oacute;n por gracia del&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/analisis-software-y-bios-de-sony-vaio-e-14p"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-15T00:05:00Z</dc:date>
  </entry>
  <entry>
    <title>Desempaquetado Sony Vaio E 14P (SVE14)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/desempaquetado-sony-vaio-e-14p-sve14" />
    <category term="software" />
    <category term="software-privativo" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="arch-linux" />
    <category term="hardware" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-01-27T03:00:05Z</updated>
    <published>2012-12-06T15:02:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de comentar la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/mi-guia-para-eleccion-de-portatil-nuevo.html"&gt;gu&amp;iacute;a que segu&amp;iacute; para elegir un port&amp;aacute;til nuevo&lt;/a&gt;, cuales eran las caracter&amp;iacute;sticas que buscaba, cual fue el modelo que eleg&amp;iacute; finalmente (que es el comentado en esta entrada) y cuales algunas&amp;nbsp;caracter&amp;iacute;sticas&amp;nbsp;que ni siquiera el fabricante comenta ahora voy poner la galer&amp;iacute;a de fotos y reportaje con el desempaquetado o &amp;laquo;unboxing&amp;raquo; del modelo Sony Vaio E 14P&amp;nbsp;(SVE14A2C5E) en acabado color gris plomo con algunos detalles que en pocas reviews y a an&amp;aacute;lisis se ven en detalle o ni siquiera se comentan. 
&lt;br /&gt; 
&lt;br /&gt;Dejar&amp;eacute; para la siguiente entrada otra de las cosas que tampoco es habitual ver en los an&amp;aacute;lisis: la parte del software con el que viene instalado como es la BIOS (que es UEFI), los programas 
&lt;strike&gt;
  crapware 
&lt;/strike&gt; preinstalados con Windows, la informaci&amp;oacute;n del sistema con&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/desempaquetado-sony-vaio-e-14p-sve14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-06T15:02:00Z</dc:date>
  </entry>
  <entry>
    <title>Mi guía para elección de portátil nuevo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" />
    <category term="software" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="hardware" />
    <category term="otros" />
    <category term="apple" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-12-15T00:10:23Z</updated>
    <published>2012-12-01T16:49:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Intel" height="131" src="http://3.bp.blogspot.com/-YsNoDxaK4SY/ULH_Z2yBd5I/AAAAAAAABpI/d6WIftJMvvc/s200/intel.png" title="Intel" width="200" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de muchos meses buscando y comparando (no se cuantos meses exactamente pero m&amp;aacute;s de 18 seguro) finalmente me decid&amp;iacute; por un ordenador que pas&amp;oacute; mi exigente criterio (o puede que me cansase de esperar), ya llevando unos d&amp;iacute;as con &amp;eacute;l ha sido una buena elecci&amp;oacute;n aunque algunos detalles no me gustan del todo pero es lo mejor que he encontrado y no quer&amp;iacute;a esperar mucho m&amp;aacute;s ya. En esta entrada comentar&amp;eacute; mi experiencia y consejos que quiz&amp;aacute; le ayuden a otra gente en su elecci&amp;oacute;n de port&amp;aacute;til si est&amp;aacute; buscando uno. En las siguientes entradas har&amp;eacute; el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html"&gt;desempaquetado&lt;/a&gt; y el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/analisis-software-y-bios-sony-vaio-e-14p.html"&gt;an&amp;aacute;lisis del equipo funcionando&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Primeros pasos&lt;/b&gt; 
&lt;br /&gt;Antes de empezar ni siquiera a buscar un port&amp;aacute;til es tener una idea del presupuesto, que marca/o que no marca se quiere, tama&amp;ntilde;o, caracter&amp;iacute;sticas que consideramos indispensables que tenga, uso que le vamos a dar y necesidades o modelos de lo que buscamos, con esto empieza la selecci&amp;oacute;n y discriminaci&amp;oacute;n de entre todas las posibilidades que tenemos. En el mundo del PC tantas que pueden llegar a abrumar y dificultar la elecci&amp;oacute;n por eso recomendable tener unos par&amp;aacute;metros prefijados, luego podremos flexibilizarlos. En Apple y los Mac es m&amp;aacute;s sencillo, hay menos modelos, la mayor&amp;iacute;a de gama alta para lo que considerar&amp;iacute;amos en los PC y tambi&amp;eacute;n a precios que a parecidas caracter&amp;iacute;sticas son notablemente mucho m&amp;aacute;s caros y est&amp;aacute;n inflados, todo sea dicho. Un Mac no quer&amp;iacute;a ya que son caros y adem&amp;aacute;s pretend&amp;iacute;a instalar Arch Linux en &amp;eacute;l, as&amp;iacute; que para esto consideraba que mejor un PC.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-01T16:49:00Z</dc:date>
  </entry>
  <entry>
    <title>Reglas de negocio con Drools y Activiti</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/10/reglas-de-negocio-con-drools-y-activiti" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-21T15:40:04Z</updated>
    <published>2012-10-20T13:24:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img height="63" src="http://2.bp.blogspot.com/-ynlQBBlw8ts/UIJyvOlW4zI/AAAAAAAABjE/PKdDXyq8y8s/s200/drools.png" width="200" alt="Drools" title="Drools" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Activiti" height="51" src="http://3.bp.blogspot.com/-DXJP21kWGMM/UGawTPCKXmI/AAAAAAAABdQ/pb7HAoJHumc/s200/activiti.png" title="Activiti" width="200" /&gt; 
&lt;/div&gt;Los procesos de negocio pueden tener varios caminos de ejecuci&amp;oacute;n distintos. En algunos casos la decisi&amp;oacute;n que determina el camino de ejecuci&amp;oacute;n del proceso de negocio puede estar determinado por una decisi&amp;oacute;n de negocio. Por ejemplo, si se determina que un cliente es VIP se puede querer dirigir el flujo del proceso de negocio por un camino alternativo para tratarle de forma especial por su condici&amp;oacute;n de cliente VIP, esta decisi&amp;oacute;n se puede realizar mediante una regla de negocio (&amp;laquo;business rule&amp;raquo;). Tambi&amp;eacute;n, el propio hecho de determinar si el cliente es VIP puede ser realizado por otra regla de negocio. Con lo que podemos aplicar las reglas de negocio al menos a dos escenarios: 
&lt;br /&gt; 
&lt;ul&gt; 
 &lt;li&gt;Para dirigir el flujo de un proceso de negocio. A este tipo de reglas de negocio se les denomina reglas con l&amp;oacute;gica de decisi&amp;oacute;n (&amp;laquo;Decision logic rules&amp;raquo;).&lt;/li&gt;
&lt;/ul&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/10/reglas-de-negocio-con-drools-y-activiti"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-10-20T13:24:00Z</dc:date>
  </entry>
  <entry>
    <title>Conceptos sobre procesos de negocio (BP, BPM, BPMS, ...)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/09/conceptos-sobre-procesos-de-negocio-bp-bpm-bpms" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-20T13:26:07Z</updated>
    <published>2012-09-22T01:53:00Z</published>
    <content type="html">&lt;p&gt;Toda empresa realiza una serie de actividades para lleva a cabo el trabajo o servicio que efect&amp;uacute;a. A este conjunto actividades relacionadas se les conoce como bussines process (BP). Dado que los procesos de negocio forman parte de lo m&amp;aacute;s basico de la empresa se entiende que son importantes ya que sin ellos no habr&amp;iacute;a actividad y en la medida en que se lleven a cabo esos procesos de negocio de forma r&amp;aacute;pida, eficaz y eficientemente depender&amp;aacute; la el buen o mal desarrollo de la misma. La definici&amp;oacute;n formal de BP es: 
&lt;br /&gt; 
&lt;br /&gt;&amp;laquo;Sequencia de tareas que se realizan en cierto orden por sistemas o humanos para conseguir un objetivo de negocio.&amp;raquo; 
&lt;br /&gt; 
&lt;br /&gt;Las partes de esta frase son: 
&lt;br /&gt; 
&lt;br /&gt;1) &amp;laquo;Sequencia de tareas que se realizan en cierto orden&amp;raquo;: Las tareas son las actividades que desarrolla la empresa para la consecuci&amp;oacute;n de los objetivos de negocio. La palabra secuencia impone cierto orden en las tareas de forma que cuando termina una se pasa a la siguiente hasta llegar a una &amp;uacute;ltima en la que se da por terminada el proceso y completado el objetivo de negocio. Algunas definiciones de tareas ser&amp;iacute;an:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/09/conceptos-sobre-procesos-de-negocio-bp-bpm-bpms"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-09-22T01:53:00Z</dc:date>
  </entry>
  <entry>
    <title>Procesos de negocio con Activiti</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/09/procesos-de-negocio-con-activiti" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-20T13:25:58Z</updated>
    <published>2012-09-29T12:55:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Activiti" height="51" src="http://3.bp.blogspot.com/-DXJP21kWGMM/UGawTPCKXmI/AAAAAAAABdQ/pb7HAoJHumc/s200/activiti.png" title="Activiti" width="200" /&gt; 
&lt;/div&gt;Como suele suceder con muchas tecnolog&amp;iacute;as en la plataforma Java tenemos varios frameworks entre los cuales podemos elegir. En el &amp;aacute;mbito de los BPMS los principales son 
&lt;a href="http://es.bonitasoft.com/"&gt;Bonita&lt;/a&gt;, 
&lt;a href="http://www.jboss.org/jbpm"&gt;jBPM&lt;/a&gt; y 
&lt;a href="http://activiti.org/"&gt;Activiti&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;Despu&amp;eacute;s de leer el libro 
&lt;a href="http://www.packtpub.com/jbpm-developer-guide/book"&gt;jBPM Developer Guide&lt;/a&gt; intente hacer un hola mundo con jbpm 5, sin embargo, la API explicada en el libro (jBPM 4) y la de la versi&amp;oacute;n actual (jBPM 5) ha cambiado bastante con lo que los ejemplos del libro son muy did&amp;aacute;cticos a nivel te&amp;oacute;rico pero son poco pr&amp;aacute;cticos a&amp;uacute;n as&amp;iacute; la teor&amp;iacute;a de fondo es perfectamente v&amp;aacute;lida para cualquier BPMS por lo que el libro sigue siendo bastante interesante. Con lo que la documentaci&amp;oacute;n sobre jBPM seg&amp;uacute;n mi opini&amp;oacute;n deja que desea para el que empieza desde cero. Hay un 
&lt;a href="http://www.packtpub.com/jboss-business-process-management-5-jave-developer-guide/book"&gt;libro sobre jBPM 5&lt;/a&gt; en proyecto que a&amp;uacute;n no ha sido publicado, probablemente las cosas mejoran en ese momento para jBPM 5. Por otra parte, seg&amp;uacute;n lo que he le&amp;iacute;do Bonita est&amp;aacute; m&amp;aacute;s centrado en las personas de negocio y el desarrollador no tiene tanto control sobre los procesos de negocio.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/09/procesos-de-negocio-con-activiti"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-09-29T12:55:00Z</dc:date>
  </entry>
  <entry>
    <title>Usar variables en un proceso de negocio con Activiti</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/10/usar-variables-en-un-proceso-de-negocio-con-activiti" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-20T13:25:46Z</updated>
    <published>2012-10-06T15:38:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Activiti" height="51" src="http://3.bp.blogspot.com/-DXJP21kWGMM/UGawTPCKXmI/AAAAAAAABdQ/pb7HAoJHumc/s200/activiti.png" title="Activiti" width="200" /&gt; 
&lt;/div&gt;Un proceso de negocio en Activiti o en cualquier otro BPMS para ejecutarse es muy probable que necesite informaci&amp;oacute;n de entrada que usar&amp;aacute;n las tareas y que tambi&amp;eacute;n podr&amp;aacute;n modificar, adem&amp;aacute;s es posible que el proceso genere datos de salida como resultado de la ejecuci&amp;oacute;n de las tareas. 
&lt;br /&gt; 
&lt;br /&gt;Vamos a ver un ejemplo de como es esto en Activiti. Para obtener el valor de una variable mientras el proceso a&amp;uacute;n est&amp;aacute; en ejecuci&amp;oacute;n se puede conseguir con: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;script src="https://gist.github.com/3882398.js?file=gistfile1.java"&gt;&lt;/script&gt; Sin embargo, hay que tener en cuenta que una vez finalizado el proceso las variables son descartadas no pudi&amp;eacute;ndose recuperar de la forma anterior ya que la instancia del proceso ya no existir&amp;aacute; con lo que si id no nos servir&amp;aacute;. Una vez finalizado el proceso &amp;uacute;nicamente permanecen en los datos hist&amp;oacute;ricos del proceso siempre y cuando el nivel de&amp;nbsp;hist&amp;oacute;rico&amp;nbsp;de datos est&amp;aacute; indicado como &amp;laquo;full&amp;raquo; en la configuraci&amp;oacute;n de Activiti. La siguiente sentencia nos dar&amp;aacute; las modificaciones de la variables ordenadas por tiempo de modificaci&amp;oacute;n en una lista de elementos&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/10/usar-variables-en-un-proceso-de-negocio-con-activiti"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-10-06T15:38:00Z</dc:date>
  </entry>
  <entry>
    <title>Tratamiento de errores en procesos de negocio con Activiti</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/10/tratamiento-de-errores-en-procesos-de-negocio-con-activiti" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-20T13:25:37Z</updated>
    <published>2012-10-12T23:54:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Activiti" src="http://3.bp.blogspot.com/-DXJP21kWGMM/UGawTPCKXmI/AAAAAAAABdQ/pb7HAoJHumc/s1600/activiti.png" title="Activiti" /&gt; 
&lt;/div&gt;Al igual que en todo programa durante la ejecuci&amp;oacute;n de los procesos de negocio se pueden producir condiciones de error que deberemos tratar. Por ejemplo, supongamos un proceso de negocio que trata con la venta de diferentes art&amp;iacute;culos, probablemente una comprobaci&amp;oacute;n y condici&amp;oacute;n de error ser&amp;aacute; comprobar las existencias del art&amp;iacute;culo que se va a vender en el proceso. Este es un error l&amp;oacute;gico que se podr&amp;iacute;a dar pero tambi&amp;eacute;n se pueden dar errores t&amp;eacute;cnicos como por ejemplo un error al actualizar las existencias en la base de datos o al acceder a un sistema externo como podr&amp;iacute;a ser un web service o servicio REST. 
&lt;br /&gt; 
&lt;br /&gt;Los errores l&amp;oacute;gicos se pueden tratar mediante ciertas construcciones de la notaci&amp;oacute;n BPMN, los errores t&amp;eacute;cnicos podemos tratarlos dirigiendo el flujo del proceso. Estas dos formas de tratamiento de errores no son exclusivas sino que se pueden aplicar ambas en un mismo proceso. Veamos un ejemplo de ambos tipos de tratamientos en un proceso de negocio que comprueba las existencias de un producto.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/10/tratamiento-de-errores-en-procesos-de-negocio-con-activiti"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-10-12T23:54:00Z</dc:date>
  </entry>
  <entry>
    <title>GitHub, repositorio Git para proyectos</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/github-repositorio-git-para-proyectos" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-09-22T00:28:14Z</updated>
    <published>2012-05-11T22:14:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="GitHub" src="http://2.bp.blogspot.com/-2dTNKEa5Fmo/T61RikcdlGI/AAAAAAAABG0/eJHR-RAwLhw/s1600/github.png" title="GitHub" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Git" src="http://1.bp.blogspot.com/-yLvqsRu7ELU/T61Uz2bYZCI/AAAAAAAABHU/Wv2IN_QKxMI/s1600/git.png" title="Git" /&gt; 
&lt;/div&gt; 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2010/06/sistema-de-control-de-versiones.html"&gt;El sistema de control de versiones Git&lt;/a&gt; tiene varias ventajas sobre los tradicionales herrramientas de control de versiones como puede ser Subversion y en est&amp;aacute; &amp;eacute;poca muchos servicios est&amp;aacute;n ya ofreci&amp;eacute;ndose a trav&amp;eacute;s de internet, las herramientas de control de versiones tambi&amp;eacute;n.&amp;nbsp; 
&lt;a href="https://github.com/"&gt;GitHub&lt;/a&gt; es un repositorio para hospedar proyectos de software que se basa en 
&lt;a href="http://git-scm.com/"&gt;Git&lt;/a&gt; como herramienta de control de versiones todo ello a trav&amp;eacute;s de internet. A parte del repositorio Git para el c&amp;oacute;digo fuente 
&lt;a href="https://github.com/features/projects"&gt;otras caracter&amp;iacute;sticas que ofrece&lt;/a&gt; son un gestor de peticiones, wikis y revisi&amp;oacute;n de c&amp;oacute;digo. Adem&amp;aacute;s de poder trabajar de forma colaborativa 
&lt;a href="http://help.github.com/fork-a-repo/"&gt;haciendo forks&lt;/a&gt; de los proyectos de otras personas y envi&amp;aacute;ndoles peticiones pull para los cambios que hagamos en sus proyectos. 
&lt;br /&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/github-repositorio-git-para-proyectos"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-11T22:14:00Z</dc:date>
  </entry>
  <entry>
    <title>Guía instalación CyanogenMod</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod" />
    <category term="android" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="gnulinux" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-05-26T23:33:04Z</updated>
    <published>2012-05-25T21:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
  &lt;img alt="Android" src="http://3.bp.blogspot.com/-SWH4vcj_XSA/T7-4U4INTbI/AAAAAAAABKg/zi-b2AOtzPw/s1600/android.png" title="Android" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Uno de los defectos que tienen los m&amp;oacute;viles android es que los fabricantes y las operadores si ofrecen actualizaciones a nuevas versiones de android lo hacen tarde y en algunos casos ni eso con lo que al cabo de una a&amp;ntilde;o ya no tienes la &amp;uacute;ltima versi&amp;oacute;n de andoid en un m&amp;oacute;vil que por hardware ser&amp;iacute;a perfectamente capaz. Esto causa uno de los problemas en android, fragmentaci&amp;oacute;n en el ecosistema, dificultando el desarrollo de las aplicaciones y obligando a soportar un mayor n&amp;uacute;mero de versiones andoid en vez de unas pocas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="CyanogenMod" height="68" src="http://1.bp.blogspot.com/-7_FkslK58nc/T7-zjoLu-GI/AAAAAAAABKQ/ls-xqbPKu7A/s320/cyanogenmod.png" title="CyanogenMod" width="320" /&gt; 
&lt;/div&gt;A raiz de este problema han ido surgiendo varias roms como 
&lt;a href="http://www.cyanogenmod.com/"&gt;CyanogenMod&lt;/a&gt; o 
&lt;a href="http://en.miui.com/"&gt;MIUI&lt;/a&gt;&amp;nbsp;que proporcionan versiones de android m&amp;aacute;s actualizadas y modificadas partiendo del c&amp;oacute;digo original proporcionado por google. CyanogenMod es una de las roms m&amp;aacute;s longevas, que soporta mayor n&amp;uacute;mero de dispositivos y de las m&amp;aacute;s estables. Adem&amp;aacute;s del motivo anterior de tener una versi&amp;oacute;n m&amp;aacute;s actualizada de android, CyanogenMod puede solucionar algunos defectos que tiene el android original del tel&amp;eacute;fono. En mi caso el tel&amp;eacute;fono ven&amp;iacute;a con froyo (2.2) y CyanogenMod me ha permitido disponer de gingerbread (2.3) adem&amp;aacute;s de corregir algunos problemas como poder desactivar la respuesta h&amp;aacute;ptica (vibraci&amp;oacute;n) de los botones y de los bloqueos que se produc&amp;iacute;an en algunas ocasiones al activar y desactivar la radio. Adem&amp;aacute;s CyanogenMod tiene muchas m&amp;aacute;s opciones de personalizaci&amp;oacute;n que las originales de android.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-25T21:10:00Z</dc:date>
  </entry>
  <entry>
    <title>Obtener la clave de una red WIFI WEP</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/obtener-la-clave-de-una-red-wifi-wep" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-05-07T11:04:49Z</updated>
    <published>2012-05-04T23:28:00Z</published>
    <content type="html">&lt;p&gt;Obtener la clave con la que est&amp;aacute; protegida una red WIFI con seguridad WEP no es excesivamente complicado para una persona que tiene unos pocos conocimientos sobre inform&amp;aacute;tica, sabe buscar, leer y no le da miedo el terminal. A&amp;uacute;n as&amp;iacute; hay que tener en cuenta que acceder a una red WIFI que no conocemos y que no sabemos de quien es no es recomendable ya que podemos ser victimas de que accedan a los datos que transmitimos. 
&lt;br /&gt; 
&lt;br /&gt;Si a&amp;uacute;n sabiendo esto queremos acceder a una, para obtener la clave de las redes WIFI con seguridad WEP necesitamos una serie de programas que en la mayor&amp;iacute;a de distribuciones Linux son muy f&amp;aacute;ciles de instalar a trav&amp;eacute;s de sus gestoresde paquetes, necesitaremos aircrack-ng y macchanger. En el momento que prob&amp;eacute; a hacerlo con Arch Linux, parece que el el aircrack-ng ten&amp;iacute;a un problema con los canales de las WIFI asi que tuve que optar por usar BackTrack. La&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/obtener-la-clave-de-una-red-wifi-wep"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-04T23:28:00Z</dc:date>
  </entry>
  <entry>
    <title>Un día en la Euskal Encounter 19</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19" />
    <category term="ubuntu" />
    <category term="planeta-arch-linux" />
    <category term="software-privativo" />
    <category term="planeta-linux" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T21:16:22Z</updated>
    <published>2011-07-24T13:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Euskal encounter 19" src="http://1.bp.blogspot.com/-XcMwHk7AABo/TiqxFNgHm7I/AAAAAAAAA50/Ot6_eSvAkEA/s1600/euskal-encounter.png" title="Euskal encounter 19" /&gt; 
&lt;/div&gt;En estos d&amp;iacute;as se est&amp;aacute; celebrando, del 22 al 25 de julio, la&amp;nbsp; 
&lt;a href="http://www.euskal.org/"&gt;Euskal Encounter&lt;/a&gt;, uno de los enventos inform&amp;aacute;ticos m&amp;aacute;s importantes de Euskadi, del estado de Espa&amp;ntilde;a y seg&amp;uacute;n algunos uno de los mejores de parte de Europa. As&amp;iacute; desde hace ya 19 ediciones, con en estos d&amp;iacute;as exactamente 4096 puestos para los asistentes que disponen de una conexi&amp;oacute;n de 20 Gb por segundo ofrecida por la mano de Euskaltel y HP. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s1600/DSCN0130.JPG"&gt;&lt;img height="150" src="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s200/DSCN0130.JPG" width="200" /&gt;&lt;/a&gt; 
 &lt;a href="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s1600/DSCN0100.JPG"&gt;&lt;img height="150" src="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s200/DSCN0100.JPG" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;br /&gt; 
&lt;/div&gt;A pesar de que se organiza en Barakaldo, al alcance de metro de ciudad en la que vivo y escasos minutos, hasta este a&amp;ntilde;o no hab&amp;iacute;a asistido a ninguna. Ten&amp;iacute;a muchas ganas de ir y vivir en primera persona lo que ah&amp;iacute; acontec&amp;iacute;a al menos por un d&amp;iacute;a, este a&amp;ntilde;o no lo quer&amp;iacute;a dejar pasar y as&amp;iacute; ha sido. Como repaso de lo que ha dado el d&amp;iacute;a (y parte de la noche) os escribo esta entrada.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-07-24T13:46:00Z</dc:date>
  </entry>
  <entry>
    <title>El impuesto Windows</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/05/el-impuesto-windows" />
    <category term="planeta-arch-linux" />
    <category term="software-privativo" />
    <category term="planeta-linux" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-12-10T00:57:45Z</updated>
    <published>2011-05-06T21:40:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img height="198" src="http://3.bp.blogspot.com/-jH1CDgwhky0/TcQlzRMGfUI/AAAAAAAAApM/GqnFKxYCUQg/s200/no-windows.jpg" width="200" /&gt; 
&lt;/div&gt;Desde hace ya un tiempo estoy en buscando comprar un port&amp;aacute;til (PC, no Mac). &amp;iquest;Pero os hab&amp;eacute;is fijado? Todos vienen con Windows, incluso los menos potentes y baratos netbooks, donde probablemente el coste de la licencia Windows a pesar de ser m&amp;aacute;s barata que la retail supondr&amp;aacute; un importante porcentaje del coste total del equipo. Por desgrac&amp;iacute;a en las marcas m&amp;aacute;s conocidas (Sony, HP, Dell, Acer, ...) no he encontrado ning&amp;uacute;n modelo con alguna distribuci&amp;oacute;n GNU/Linux o al menos sin sistema operativo. Hay alguna marca de port&amp;aacute;tiles menos conocida como 
&lt;a href="http://www.ahtec.es/"&gt;Ahtec&lt;/a&gt; que si ofrece esta posibilidad pero he leido algunas opiniones no muy buenas de su soporte. 
&lt;br /&gt; 
&lt;br /&gt;Si hace ya un tiempo la comisi&amp;oacute;n Europea oblig&amp;oacute; a Microsoft a no incluir su Internet Explorer en su sistema operativo para no abusar de posici&amp;oacute;n dominante y a incluir la ballot screen para que los usuarios pudiesen elegir su navegador. &amp;iquest;Por qu&amp;eacute; no hace algo parecido pero con el sistema operativo de los port&amp;aacute;tiles? &amp;iquest;Por qu&amp;eacute; el consumidor pr&amp;aacute;cticamente no puede comprar un equipo sin sistema operativo? &amp;iquest;Por qu&amp;eacute; si no es justo imponer un canon indiscriminado a todos los medios de almacenamiento y dispositivos electr&amp;oacute;nicos se nos impone un &amp;quot;Impuesto Windows&amp;quot; en los port&amp;aacute;tiles a todos los usuarios aunque no seamos usuarios de ese sistema operativo y lo primero que hacemos es eliminarlo del disco duro? &amp;iquest;Por qu&amp;eacute; ese impuesto se ha de pagar por cada equipo que se compra? &amp;iquest;Si ya tengo una licencia porque tengo que comprar otra nueva OEM?&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/05/el-impuesto-windows"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-05-06T21:40:00Z</dc:date>
  </entry>
  <entry>
    <title>Unir Apache HTTPD y Tomcat mediante un reverse proxy</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/02/unir-apache-httpd-y-tomcat-mediante-un-reverse-proxy" />
    <category term="programacion" />
    <category term="tecnologia" />
    <category term="java" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-18T23:51:25Z</updated>
    <published>2011-02-12T00:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="margin-left: 1em; margin-right: 1em; text-align: center;"&gt; 
 &lt;img alt="Apache HTTPD" height="28" src="http://2.bp.blogspot.com/-Yc4QODRbbTc/TVWF-a2fh7I/AAAAAAAAAlE/z58fDJXSeAo/s320/httpd_logo_wide.gif" title="Apache HTTPD" width="320" /&gt; 
 &lt;img alt="Apache Tomcat" src="http://1.bp.blogspot.com/-TUqUInA8Y9A/S7cRPuP2gKI/AAAAAAAAANs/Fac3C7tNKJE/s1600/tomcat-logo.gif" title="Apache Tomcat" /&gt; 
&lt;/div&gt; 
&lt;br /&gt;Al dise&amp;ntilde;ar el despliegue de una aplicaci&amp;oacute;n es habitual hacer que un servidor web devuelva el contenido est&amp;aacute;tico de la p&amp;aacute;gina web o de la aplicaci&amp;oacute;n. Esto nos puede interesar por varias razones, una de ellas es que quita la carga de trabajo correspondiente al servir el contenido est&amp;aacute;tico al servidor de aplicaciones que dependiendo de la aplicaci&amp;oacute;n o p&amp;aacute;gina web puede ayudar a aliviar su carga. Pero tambi&amp;eacute;n puede ser usado para realizar balanceo de carga entre varios servidores de de aplicaciones, cacheo o para acceder a un servidor de nuestra intranet que est&amp;aacute; detr&amp;aacute;s de un firewall y no es accesible directamente por los usuarios de internet. El esquema es el siguiente: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/-1Nyp24DjgcI/TVWGZfh7mvI/AAAAAAAAAlI/8hmiJSarJ58/s1600/proxy_phase1.png"&gt;&lt;img height="106" src="http://4.bp.blogspot.com/-1Nyp24DjgcI/TVWGZfh7mvI/AAAAAAAAAlI/8hmiJSarJ58/s200/proxy_phase1.png" width="200" /&gt;&lt;/a&gt; 
 &lt;a href="http://1.bp.blogspot.com/-IluhR7FnlTY/TVWGaCrDIfI/AAAAAAAAAlM/ZbiWgdzXwaM/s1600/proxy_phase2.png"&gt;&lt;img height="107" src="http://1.bp.blogspot.com/-IluhR7FnlTY/TVWGaCrDIfI/AAAAAAAAAlM/ZbiWgdzXwaM/s200/proxy_phase2.png" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;Viendo un gr&amp;aacute;fico se entiende mejor &amp;iquest;verdad?. En &amp;eacute;l tenemos el cliente que realiza la petici&amp;oacute;n, el servidor web que se encargar&amp;aacute; de devolver los recursos est&amp;aacute;ticos (en la figura denominado reverse proxy) y finalmente el servidor de aplicaciones que se encargar&amp;aacute; de generar el contenido din&amp;aacute;mico de la aplicaci&amp;oacute;n (posiblemente accediendo a un servidor de base de datos que en el gr&amp;aacute;fico no se muestra, en la figura denominado Web1 y Web2). En un primer paso el cliente realiza una petici&amp;oacute;n que llega al servidor web, este determina si el recurso solicitado lo puede servir &amp;eacute;l o lo tiene que delegar en el servidor de aplicaciones. En el caso de que el servidor web tenga que delegar la petici&amp;oacute;n en el servidor de aplicaciones el servidor web realiza un petici&amp;oacute;n al servidor de aplicaciones solicitando el recurso que no puede servir &amp;eacute;l. Una vez que el servidor de aplicaciones genera el recurso se lo devuelve al servidor web que a su vez este se lo devuelve al cliente. Para el cliente todo este proceso es transparente, es como si todos los recursos los pudiese servir el servidor web. En este esquema el servidor web act&amp;uacute;a de proxy para el servidor de aplicaciones (tambien se llama reverse proxy).&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/02/unir-apache-httpd-y-tomcat-mediante-un-reverse-proxy"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-02-12T00:10:00Z</dc:date>
  </entry>
  <entry>
    <title>Chrome Web Store</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/02/chrome-web-store" />
    <category term="juegos" />
    <category term="tecnologia" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-02-05T01:33:32Z</updated>
    <published>2011-02-05T01:26:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img src="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxdrb6DKkI/AAAAAAAAAko/OaUBUItkpns/s1600/chrome-web-store.gif" /&gt; 
&lt;/div&gt;Ayer Google liber&amp;oacute; otra versi&amp;oacute;n estable de su navegador web, y ya van por la 9, en Arch Linux ya est&amp;aacute; en testing asi que no tardaremos mucho en tenerla disponible para actualizar. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/_9zOwWD_PYL8/TUxdlwwup5I/AAAAAAAAAkk/HBJH-2R7_Kw/s1600/google-chrome-9.png"&gt;&lt;img height="174" src="http://4.bp.blogspot.com/_9zOwWD_PYL8/TUxdlwwup5I/AAAAAAAAAkk/HBJH-2R7_Kw/s320/google-chrome-9.png" width="320" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;Entre las principales novedades que incorpora esta versi&amp;oacute;n es el soporte para WebGL que permitir&amp;aacute; dotar a las aplicaciones de nuevas posibilidades. Si quieres probar que es esto de WebGL dale un vistazo a 
&lt;a href="http://www.chromeexperiments.com/webgl"&gt;Chrome experiments&lt;/a&gt;. La otra novedad presentada junto con el navegador es la tienda de aplicaciones 
&lt;a href="https://chrome.google.com/webstore"&gt;Chrome Web Store&lt;/a&gt; desde la cual prodremos instalar aplicaciones en el navegador Chrome. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxehoFFsGI/AAAAAAAAAkw/QzY0zFTsLOw/s1600/chrome-web-store.jpg"&gt;&lt;img height="163" src="http://3.bp.blogspot.com/_9zOwWD_PYL8/TUxehoFFsGI/AAAAAAAAAkw/QzY0zFTsLOw/s200/chrome-web-store.jpg" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt;En esta tienda podremos encontrar aplicaciones (Web Apps), extensiones y temas para el navegador Chrome. En cuanto a las aplicaciones est&amp;aacute;n divididas en diversas categorias, educaci&amp;oacute;n, entretenimineto, juegos, noticias, etc... algunas son de pago, otras prueden probase y otras son gratuitas. Para adquirir las de pago deberemos hacer uso del sistema de pagos Google Checkout.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/02/chrome-web-store"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-02-05T01:26:00Z</dc:date>
  </entry>
  <entry>
    <title>¡Hola mundo!</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/hola-mundo" />
    <category term="hola" />
    <category term="ubuntu" />
    <category term="blogger" />
    <category term="tecnologia" />
    <category term="arch-linux" />
    <category term="software-libre" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2010-02-07T23:07:04Z</updated>
    <published>2010-02-06T20:55:00Z</published>
    <content type="html">&lt;p&gt;Bueno, &amp;iexcl;pues ya est&amp;aacute;!, ya tengo mi propio blog, todav&amp;iacute;a est&amp;aacute; en fase de construcci&amp;oacute;n as&amp;iacute; que seg&amp;uacute;n vaya teniendo tiempo ir&amp;eacute; haciendo peque&amp;ntilde;os cambios en los gadgets y en su disposici&amp;oacute;n. Por ahora me conformo con tenerlo visible e ir conociendo como funciona 
&lt;a href="http://www.blogger.com/"&gt;Blogger&lt;/a&gt; y otras herramientas como 
&lt;a href="https://www.google.com/adsense"&gt;Google Adsense&lt;/a&gt;, 
&lt;a href="http://www.google.com/analytics/"&gt;Google Analytics&lt;/a&gt; y 
&lt;a href="https://www.google.com/accounts/ServiceLogin?service=feedburner"&gt;Google FeedBurner&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;Pero lo principal, escribir entradas en el blog, es algo que ya puedo realizar. Tratar&amp;aacute;n sobre temas relacionados con el software libre, incluyendo las dos distribuciones GNU/Linux que en este momento uso m&amp;aacute;s habitualmente que son 
&lt;a href="http://www.ubuntu.com/"&gt;Ubuntu&lt;/a&gt; y 
&lt;a href="http://www.archlinux.org/"&gt;Arch Linux&lt;/a&gt;, temas de tecnolog&amp;iacute;a, quiz&amp;aacute; temas de programaci&amp;oacute;n, experiencias personales sobre los mismos y otras cosas que se me vayan ocurriendo. 
&lt;br /&gt; 
&lt;br /&gt;En cualquier caso, espero que algunas entradas las consider&amp;eacute;is interesantes u os resulten &amp;uacute;tiles. Y como no podr&amp;iacute;a ser de otra forma &amp;iexcl;sois bienvenidos a realizar comentarios y a enviarme sugerencias!.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/hola-mundo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-06T20:55:00Z</dc:date>
  </entry>
</feed>

