<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Presentación sobre Apache Tapestry | Blog Bitix</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry"><span itemprop="headline">Presentación sobre Apache Tapestry</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/software"><img title="software" alt="software" src="/assets/images/labels/software.png"/></a><a class="label" href="/label/tapestry"><img title="tapestry" alt="tapestry" src="/assets/images/labels/tapestry.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://picodotdev.github.io/blog-bitix/">Blog Bitix</a>, <a href="http://picodotdev.github.io/blog-bitix/2014/02/presentacion-sobre-apache-tapestry/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-02-14T20:05" itemprop="datePublished">Publicado el viernes, 14 de febrero de 2014 a las 20:05 UTC</span></div><div><span>
Etiquetado como
planeta-codigo, <a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, <a href="/label/software"><span itemprop="articleSection">software</span></a>, <a href="/label/tapestry"><span itemprop="articleSection">tapestry</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="float: right;"> 
 <img src="http://picodotdev.github.io/blog-bitix/images/custom/logotipos/tapestry.png" alt="Apache Tapestry" title="Apache Tapestry" /> 
</div> 
<p>El 10 de febrero tuve la oportunidad de dar una charla, la primera, sobre <a href="http://tapestry.apache.org/">Apache Tapestry</a> para el equipo de desarrolladores de la empresa en la que trabajo. Que en el equipo de desarrollo tengamos la posibilidad de vez en cuando dedicar un par de horas para juntarnos y compartir conocimiento es una buena iniciativa ya que siendo ya un equipo bastante grande de personas y con un nivel t&eacute;cnico elevado cada uno tiene un conocimiento que los dem&aacute;s pueden estar interesados en conocer al menos a nivel superficial, es motivador tener estas oportunidades.</p> 
<div style="text-align: center;"> 
 <a href="http://picodotdev.github.io/blog-bitix/images/custom/posts/11/presentacion-apache-tapestry.jpg" title="Presentaci&oacute;n sobre Apache Tapestry"><img src="http://picodotdev.github.io/blog-bitix/images/custom/posts/11/presentacion-apache-tapestry-thumb.jpg" /></a> 
</div> 
<p>Fue una charla simplemente como cultura general ya que el framework y el lenguaje que usamos como pila tecnol&oacute;gica es <a href="http://grails.org/">Grails</a> y <a href="http://groovy.codehaus.org/">Groovy</a> y eso es complicado que cambie. Otro motivo fue poder compartir el conocimiento de este framework para el desarrollo de aplicaciones y p&aacute;ginas web que a mi me gusta mucho. Si est&aacute;s suscrito al <a href="http://feeds.feedburner.com/blog-bitix/">feed de mi blog</a> ya conocer&aacute;s que de vez en cuando publico alguna entrada comentando alg&uacute;n aspecto sobre &eacute;l (tengo ya algunas preparadas y otras en mente) y si est&aacute;s suscrito desde hace unos meses conocer&aacute;s que escrib&iacute; un libro. La charla fue para comentar los &laquo;porque&raquo; alguien podr&iacute;a elegir este framework y no tanto el &laquo;como&raquo; se hacen las cosas en &eacute;l, para esto &uacute;ltimo ya esta el libro <a href="http://goo.gl/Vx8icI">PlugIn Tapestry</a>, <a href="http://elblogdepicodev.blogspot.com.es/2010/05/documentacion-sobre-apache-tapestry.html">otra documentaci&oacute;n</a> y la propia <a href="http://tapestry.apache.org/documentation.html">documentaci&oacute;n del proyecto</a>.</p> 
<p>Probablemente la charla podr&iacute;a haberla explicado mucho mejor, fue lo mejor que fui capaz. Tambi&eacute;n ya despu&eacute;s de unas horas me d&iacute; cuenta de los detalles menores pero interesantes que se me pasaron comentar, unos cuantos. Pero teniendo en cuenta que es de las primeras charlas t&eacute;cnicas que doy, en general qued&eacute; satisfecho y por lo menos me servir&aacute; de experiencia para las siguientes. Dar una charla require tanto o mas esfuerzo que crear una entrada en el blog. Requiere crear una presentaci&oacute;n, incluir en ella la informaci&oacute;n relevante que se quiere comentar seg&uacute;n el objetivo y tener en cuenta el p&uacute;blico al que va dirigida, poner la informaci&oacute;n de una forma que explique de forma coherente lo importante, tener cierta habilidad comunicativa (que creo no tengo) y ensayar la charla para ajustarla al tiempo del que se dispone y otras tantas cosas como estas. A pesar de que fue una charla de dos horas hay muchos detalles que se quedaron fuera, solo vimos la superficie de todo lo que tiene que ofrecer este framework.</p> 
<p>En la charla surgi&oacute; alguna pregunta interesante como &iquest;por que teniendo Tapestry ya m&aacute;s de 10 a&ntilde;os de vida no es un framework m&aacute;s usado? Algunos de los motivos que d&iacute; fueron que Tapestry tiene una curva de aprendizaje mayor que otros frameworks ya que cambia el modelo de desarrollo de los frameworks basados en acciones a uno basado en componentes. El modelo basado en acciones lleva us&aacute;ndose desde Struts y es ampliamente usado en diversos frameworks. Struts fu&eacute; uno de los frameworks m&aacute;s utilizados en su momento y por tanto usar otro framework basado en acciones en el que en muchos casos lo &uacute;nico que cambia en esencia es el lenguaje de programaci&oacute;n, es m&aacute;s r&aacute;pido y no require adquirir tanto conocimiento nuevo para usar uno que siga los mismos principios. Desde entonces han surgido nuevos frameworks <a href="http://grails.org/">Grails</a>, <a href="http://www.playframework.com/">Play!</a>, <a href="http://symfony.com/">Symfony</a>, <a href="https://www.djangoproject.com/">Django</a>, <a href="http://www.asp.net/mvc">ASP.NET MVC</a>, <a href="http://rubyonrails.org/">Ruby on Rails</a>, … como digo en esencia en todos ellos el principal cambio es el lenguaje de programaci&oacute;n. Otro motivo puede ser que los desarrolladores de Tapestry no tienen detr&aacute;s a una compa&ntilde;&iacute;a que les apoya finaciandoles para promover su uso y evangelizar a tiempo completo, aunque de vez en cuando lo hacen, el proyecto est&aacute; dentro de la <a href="http://www.apache.org/">fundaci&oacute;n Apache</a> y los desarrolladores viven de la consultor&iacute;a o proyectos que realizan. A pesar de tener unas caracter&iacute;sticas muy notables (IMHO), que se superan en cada nueva versi&oacute;n siguiendo la tendencia de las aplicaciones e innovando, a veces una buena soluci&oacute;n no tiene por que ser la que m&aacute;s &eacute;xito tenga o sea la m&aacute;s usada, &iquest;por que linux no es un sistema operativo m&aacute;s usado en el escritorio? Los motivos ser&aacute;n diferentes en este caso pero el resultado es que lo que unos consideran la mejor opci&oacute;n no no tiene por que ser la m&aacute;s ampliamente usada.</p> 
<p>Otra pregunta interesante que surgi&oacute; fue que parte de lo que coment&eacute; sobre Tapestry tambi&eacute;n puede realizarse con el framework en concreto con el que lo comparamos, Grails aunque podr&iacute;a ser otro. S&iacute;, probablemente estructurando las cosas de cierta forma en Grails se puede conseguir algunas cosas parecidas como reutilizaci&oacute;n de controladores, acciones y elementos visuales comunes (en el mismo proyecto, p&aacute;gina y diferentes proyectos) pero desde luego habr&iacute;a que buscar una soluci&oacute;n propia y resolver algunos problemas que ya resuelve Tapestry por nosotros como generaci&oacute;n de ids &uacute;nicos para los elementos visuales (ids de las etiquetas) de forma que no haya conflictos, inclusi&oacute;n de recursos seg&uacute;n los componentes de la p&aacute;gina, internacionalizaci&oacute;n (i18n) de assets (im&aacute;genes, plantillas), sin l&oacute;gica en las plantillas y siguiendo el modelo pull en las vistas, reutilizaci&oacute;n en diferentes proyectos con librer&iacute;as, configuraci&oacute;n distribuida para el contenedor de dependencias, detecci&oacute;n de errores de compilaci&oacute;n en las plantillas, p&aacute;gina de excepci&oacute;n informativa y para peticiones ajax, actualizaci&oacute;n de zonas de una p&aacute;gina con cero javascript, actualizaci&oacute;n de multiples zonas de una p&aacute;gina en una &uacute;nica petici&oacute;n ajax, servicios mutuamente dependientes, instrumentaci&oacute;n invisible en las plantillas, integraci&oacute;n de RequireJS en el lado del servidor y cliente, eventos y comportamiento diferente seg&uacute;n el elemento contenedor ante un mismo evento, escalabilidad …. Algunas ser&iacute;an posibles, otras quiz&aacute; no y posiblemente en las posibles tendr&iacute;amos que implementar nosotros alguna soluci&oacute;n propia, no seguir&iacute;an las indicaciones que se proporcionan en el manual de Grails y quiz&aacute; las cosas no ser&iacute;an manejables ni quedar&iacute;an de una forma que qued&aacute;semos a gusto con el c&oacute;digo. A pesar de todo la herramienta utilizada no es lo m&aacute;s importante, pero si es cierto que utilizar una u otra si puede contribuir a hacer ciertas cosas m&aacute;s de forma m&aacute;s sencilla y cuando las cosas alcanzan un volumen grande sigan siendo manejables (no haya duplicaci&oacute;n, no se produzcan muchos errores al hacer cambios, reutilizaci&oacute;n) que es cuando Tapestry en teor&iacute;a empieza a mostrar sus virtudes. Lo mismo que se puede hacer con Grails o Tapestry tambi&eacute;n se puede hacer con servlets y JSP pero probablemente acabar&iacute;amos simulando un nuevo Grails o Tapestry, mejor usar el que m&aacute;s nos facilite las tareas y uno que probablemente ser&aacute; mejor que cualquier cosa que podamos hacer nosotros adem&aacute;s de no tener que encargarnos de hacerla ni mantenerla. Grails tambi&eacute;n tienen algunas cosas destacables &laquo;built-in&raquo; que en Tapestry hay que proporcionarlas con alguna librer&iacute;a, como GORM. Si hay tantos frameworks, librer&iacute;as, etc ah&iacute; fuera probablemente sea porque hay diferentes necesidades, puntos de vista diferentes de como resolverlos, … en definitiva es cuesti&oacute;n de elegir el que m&aacute;s nos convezca por diferentes motivos y la elecci&oacute;n puede ser subjetiva.</p> 
<p>Y otra pero no menos interesante pregunta es por que tapestry se llama tapestry o por que el logo de tapestry es un unicornio, anteriormente fue similar a una T en la versi&oacute;n 3, para el nombre no tengo respuesta. Leyendo un <a href="http://mail-archives.apache.org/mod_mbox/tapestry-users/200605.mbox/%3Cop.s9k7abmko3wyor@liigo%3E">hilo en la lista de destribuci&oacute;n</a> en la que se discut&iacute;a el asunto se da algunas ideas pero no me ha quedado una clara.</p> 
<p>A continuaci&oacute;n la <a href="https://speakerdeck.com/picodotdev/plugin-tapestry">presentaci&oacute;n completa de la charla</a> que d&iacute; y que contiene de forma m&aacute;s expl&iacute;cita todo lo que est&aacute; incluido en el libro <a href="http://goo.gl/Vx8icI">PlugIn Tapestry</a>.</p> 
<script src="http://speakerdeck.com/assets/embed.js"></script> 
<p>Un par de gracias, la sensaci&oacute;n de haber aportado algo (o al menos haberlo intentado), el ruido que hicimos en twitter con el hastag <a href="https://twitter.com/search?q=tapestry5">#tapestry5</a>, unos pocos seguidores adicionales y algunos retweets incluido el del principal hacedor de Tapestry fue suficiente recompensa.</p> 
<p>Un blog desde hace ya 4 a&ntilde;os, un libro el a&ntilde;o pasado, una charla este &iquest;que ser&aacute; lo siguiente? &laquo;Non gogoa, han zangoa&raquo;.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry" st_title="Presentación sobre Apache Tapestry | Blog Bitix"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "blog-bitix";
var disqus_title = "Presentación sobre Apache Tapestry";
var disqus_url = "http://picodotdev.github.io/blog-bitix/2014/02/presentacion-sobre-apache-tapestry/";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software</a></li><li><a href="/label/tapestry/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tapestry</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 36,
      "url" : "http://www.blogstack.info/post/blogbitix/2014/02/presentacion-sobre-apache-tapestry"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "blogbitix",
      "name" : "Blog Bitix"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>