<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Jaulas de oro | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/10/jaulas-de-oro"><span itemprop="headline">Jaulas de oro</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/windows"><img title="windows" alt="windows" src="/assets/images/labels/windows.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/10/jaulas-de-oro.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-10-03T14:31" itemprop="dateModified">Actualizado el viernes, 03 de octubre de 2014 a las 14:31 UTC</span></div><div><span>
Etiquetado como
experiencias, cyanogenmod, <a href="/label/windows"><span itemprop="articleSection">windows</span></a>, gnu-linux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Normalmente cuando las ganas de escribir se hacen ya irrefrenables, las palabras suelen fluir de los dedos hasta el teclado y la pantalla con facilidad, como algo natural, que sigue su curso. Hoy, sin embargo, cuando tengo ante m&iacute; la inmensidad de una p&aacute;gina en blanco, no s&eacute; c&oacute;mo empezar. Oh, espera, si ya he comenzado... Pero dije que me retiraba del blogueo... &iquest;O eran unas 
<a href="http://www.lasombradelhelicoptero.com/2014/06/vacaciones-indefinidas.html">vacaciones indefinidas</a>? &iquest;Qu&eacute; decir ahora? &iquest;C&oacute;mo vendo este en&eacute;simo cambio de parecer?
<br />
<br />Espera, tranquilo, haz una pausa, respira. Es tu blog personal, no tienes que convencer a nadie m&aacute;s que a ti mismo. Casi lo hab&iacute;a olvidado. Pues hala, convencido, vamos a continuar.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-Kfe9DpNdVDk/VC6uahPC6YI/AAAAAAAAEs4/Urx6p0EWKow/s1600/LinuxVsWindows.png"><img src="http://1.bp.blogspot.com/-Kfe9DpNdVDk/VC6uahPC6YI/AAAAAAAAEs4/Urx6p0EWKow/s1600/LinuxVsWindows.png" height="310" width="400" /></a>
</div>
<br />
<a></a>
<br />Os cuento hoy mi historia de resignaci&oacute;n veraniega. Otra m&aacute;s, a&ntilde;adir&iacute;a. Sab&eacute;is ya de sobra cu&aacute;ndo y por qu&eacute; ca&iacute; presa de la comodidad y la facilidad que da un sistema operativo propietario, uno que te lo entrega todo masticado a costa de pagar un doble precio: por un lado el dinero que cuesta y por otro el tener la seguridad de que tus datos son vendidos, reutilizados y tratados cual mercanc&iacute;a por varias empresas de renombre. M&aacute;s adelante os explico c&oacute;mo volv&iacute; a tener conciencia de esto y el porqu&eacute; no me apetec&iacute;a seguir tap&aacute;ndome la nariz solo a cambio de... nada, en realidad.
<br />
<br />Tras abrir la caja de Pandora linuxera en mi art&iacute;culo de despedida comenc&eacute; a hacer uso del sistema operativo propietario que mi distribuidor inform&aacute;tico local me hab&iacute;a instalado en el equipo de &quot;aquella manera&quot;. Pronto descubr&iacute; que el tiempo le hab&iacute;a afectado en muy mala forma a Windows 7, y era momento de probar la novedosa versi&oacute;n 8.1. El c&oacute;mo consegu&iacute; probarla lo dejo a vuestra imaginaci&oacute;n. No me siento orgulloso de ello, ciertamente, y &eacute;se es otro de los motivos para volver a GNU/Linux.
<br />
<br />
<b>Usando Windows 8.1</b>
<br />En honor a la verdad, y esto es algo innegociable en mi forma de ser, tengo que admitir que la &uacute;ltima versi&oacute;n de Windows constituye un buen sistema operativo. Por citar una virtud, aparte de las ya conocidas de tener acceso a la pr&aacute;ctica totalidad de los programas, nos sirvan para algo o no (pero, &iquest;y lo bien que queda?), dir&iacute;a que se apaga muy r&aacute;pido... si no fuera porque es una verdad a medias. La realidad es que hiberna en lugar de apagarse, lo que deja la partici&oacute;n NTFS en un estado de inestabilidad permanente que provoca errores a la hora de realizar el montaje desde GNU/Linux. Esto tiene soluci&oacute;n, por cierto, desde el &quot;Panel de control&quot;, pero no es algo que nos ocupe hoy.
<br />
<br />Retomando el tono serio, es cierto que s&iacute;, que es un buen sistema. Ha mejorado mucho desde versiones pret&eacute;ritas, lo admito. Adem&aacute;s de resultar m&aacute;s fluido que sus predecesores, pude reencontrarme con una antigua afici&oacute;n: los videojuegos. Disfrut&eacute; durante el verano de &quot;
<a href="https://es.wikipedia.org/wiki/The_Walking_Dead_%28videojuego%29">The walking dead</a>&quot;, de Telltale Games, una especie de aventura gr&aacute;fica muy conseguida, en la cual el peso de las decisiones que vamos tomando se nota sobre los hombros de un modo fant&aacute;stico y a la vez turbador. Muy recomendable para los amantes del g&eacute;nero y a un precio bastante asequible en la tienda de la compa&ntilde;&iacute;a (en Steam es un poco m&aacute;s caro). Fin de la cu&ntilde;a publicitaria.
<br />
<br />Resumiendo mi experiencia: me abandon&eacute; a Windows de un modo absoluto. Outlook y su calendario, junto con Onedrive, reemplazaron a ownCloud, tanto en mi equipo como en mi m&oacute;vil. Google tom&oacute; el relevo de DuckDuckGo. Cero dificultades, todo comodidad. Vamos ahora con el precio a pagar.
<br />
<br />
<b>El correo de Amazon</b>
<br />Una tarde del este a&ntilde;o no tan c&aacute;lido verano, me acord&eacute; de una sugerencia de un libro que hab&iacute;a recibido unos meses atr&aacute;s. Ni corto ni perezoso la introduje en Google y r&aacute;pidamente ten&iacute;a toda la informaci&oacute;n disponible ante m&iacute;. Al final, por razones que no vienen al caso, desestim&eacute; la lectura del libro y me dediqu&eacute; a otros menesteres.
<br />
<br />A la ma&ntilde;ana siguiente, puntual cual lechero de los de anta&ntilde;o, ten&iacute;a en la magn&iacute;fica bandeja de entrada de mi correo Outlook un mensaje de la tienda de libros de Amazon con recomendaciones para comprar, siendo la primera, oh maravilla, el libro sobre el que buscaba informaci&oacute;n la tarde anterior en Google. Enseguida me surgieron preguntas con respuestas inconvenientes, como por qu&eacute; Amazon conoce mi correo Outlook de reciente creaci&oacute;n, por ejemplo. Y por qu&eacute; Google cede los datos de mi b&uacute;squeda a dicha tienda, l&oacute;gicamente a cambio de dinero. Y por qu&eacute; cojones (con perd&oacute;n) tengo que aguantar que me vengan a vender libros a mi correo electr&oacute;nico. S&iacute;, lamento la expresi&oacute;n, pero sirva para reforzar el tremendo cabreo que ten&iacute;a en su momento.
<br />
<br />Esta fue la raz&oacute;n n&uacute;mero uno para replantearme la idoneidad de la herramienta que estaba empleando para poder usar mi ordenador. Incluso la de mi m&oacute;vil, ya de paso, pues desde hac&iacute;a varios d&iacute;as ven&iacute;a notando una actividad inusual de intercambio de datos en el tel&eacute;fono que no parec&iacute;a obedecer a algo leg&iacute;timo. Todo ello con los servicios de Google corriendo en segundo plano... Buen momento para replantearse la instalaci&oacute;n de 
<a href="http://www.lasombradelhelicoptero.com/2014/04/instalar-cyanogenmod-11-en-galaxy-s3.html">Cyanogenmod</a>.
<br />
<br />
<b>Piratas del Caribe</b>
<br />Los que me hab&eacute;is le&iacute;do con asiduidad sabr&eacute;is que tengo un ni&ntilde;o de 7 a&ntilde;os. Como rama dichosa que al &aacute;rbol sale, siente bastante inter&eacute;s por la tecnolog&iacute;a en general y los videojuegos en particular. En concreto, desde que anunciaran la &uacute;ltima versi&oacute;n de un conocido simulador de f&uacute;tbol en la tele me pregunta si no ser&iacute;a muy caro. En un primer momento vienen a mi mente tres palabras: &quot;The Pirate Bay&quot;. Pero claro, luego hay que reflexionar: &iquest;qu&eacute; educaci&oacute;n quieres darle a tu hijo? Est&aacute; en una edad en la que comienza a discernir con claridad el bien del mal, lo correcto de lo incorrecto, lo moralmente aceptable de lo que no lo es tanto.
<b> </b>S&eacute; de buena tinta que el software, en demasiadas ocasiones, es exageradamente caro para lo que ofrece. Pero tambi&eacute;n tengo buenos amigos que desarrollan programas como modo de ganarse la vida. Descargar y usar software pirata no es &eacute;ticamente aceptable, aunque sean creaciones de enormes compa&ntilde;&iacute;as norteamericanas.
<br />
<br />Y esa es la raz&oacute;n n&uacute;mero dos. Quiero que mi hijo sepa que cuando uso algo lo hago con todo el derecho a usarlo. Lo que compro, porque lo he pagado. Y lo que la comunidad del software libre me ofrece desinteresadamente, porque disfruto us&aacute;ndolo y compartiendo mis experiencias con los dem&aacute;s.
<br />
<br />
<table>
 <tbody>
  <tr>
   <td><a href="http://1.bp.blogspot.com/-QNQ_yXJbdgo/VC6y4NjoSYI/AAAAAAAAEtE/UlerXKMo0ek/s1600/open-source_piracy.png"><img src="http://1.bp.blogspot.com/-QNQ_yXJbdgo/VC6y4NjoSYI/AAAAAAAAEtE/UlerXKMo0ek/s1600/open-source_piracy.png" height="222" width="400" /></a></td>
  </tr>
  <tr>
   <td>Imagen de <a href="http://www.pillateunlinux.com/pirateria-y-software-libre-piracy-and-free-software/">P&iacute;llate un Linux</a></td>
  </tr>
 </tbody>
</table>
<br />As&iacute; que en &eacute;sas estamos. Ya no hay rastro de sistemas adquiridos de aviesas maneras en mi ordenador. Tan solo queda Ubuntu (libre de Amazon, claro) y una partici&oacute;n de pruebas a la que no s&eacute; si volver&eacute; a darle uso. Ya iremos viendo. En mi m&oacute;vil, Cyanogenmod 11 ha regresado con renovados br&iacute;os y sin problemas de bater&iacute;a (los hubo, pero la soluci&oacute;n a los mismos la dejo para otro art&iacute;culo). En mi port&aacute;til, un Windows 7 leg&iacute;timo que va m&aacute;s lento que el caballo del malo (4 a&ntilde;os sin reinstalar, todo un r&eacute;cord, pero vaya como se arrastra el pobre sistema) con un Xubuntu 12.04 que apenas uso.
<br />
<br />Tengo dos motivos para estar muy contento: por una parte han regresado las ganas de escribir en mi tiempo libre. Y los que han sido inoculados con esta enfermedad saben que solo se cura dando rienda suelta a lo que te pasa por la cabeza. Cuando uno tiene un blog, ese es el mejor lugar para hacerlo. Claro que, tampoco s&eacute; cu&aacute;nto durar&aacute;n, pero de momento ah&iacute; est&aacute;n. Y, por otro lado, por haber abierto la jaula de oro y piedras preciosas, que te da mucha comodidad, mucho instalar y usar, etc&eacute;tera. Pero hay un precio, uno que se puede estar dispuesto a pagar o no. Yo, de nuevo, no lo estoy. Se acabaron las vacaciones.
<br />
<br />Salud, amig@s.</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro" st_title="Jaulas de oro | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/windows/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta windows</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 979,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/10/jaulas-de-oro"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>