<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Resolviendo dudas acerca del servidor virtual | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual"><span itemprop="headline">Resolviendo dudas acerca del servidor virtual</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/resolviendo-dudas-acerca-del-servidor-virtual/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-05-05T13:53" itemprop="dateModified">Actualizado el lunes, 05 de mayo de 2014 a las 13:53 UTC</span></div><div><span>
Etiquetado como
virtual, servidor, servidor-web</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div>
 <p>Desde que publique los art&iacute;culos en los cuales mostraba como crear un <strong>servidor</strong> web en una maquina <strong>virtual</strong> han sido varios los usuarios que han contactado conmigo para resolver algunas <strong>dudas</strong> al respecto. Algunos han dejado sus dudas en forma de comentarios en las entradas relacionadas y otros lo han hecho por email, por lo cual he decidido publicar este articulo en el cual hago una recopilaci&oacute;n de esas preguntas y que va a servir para que cuando un usuario me haga una consulta acerca del servidor yo le pueda remitir a este post y as&iacute; no tener que escribir varias veces lo mismo, es porque soy un vago y de esta forma las respuestas estar&aacute;n ya escritas aqu&iacute; ;D. Conforme pase el tiempo, si alguna de las preguntas que me hagan no esta aqu&iacute; respondida ir&eacute; ampliando este articulo.</p>
 <p>Voy a empezar por explicar el objetivo de este <strong>servidor</strong> web. All&aacute; por los inicios de 2013 hice un curso de dise&ntilde;o web en el cual aprend&iacute; HTML, CSS, JQUERY y Photoshop. En dicho curso aprend&iacute; mucho y me engancho el dise&ntilde;o web, pero cuando hacemos una pagina hay que tener muchas cosas en cuenta, y una de las mas importantes es que dicha pagina web se vea correctamente en los navegadores mas usados. Para comprobar que una pagina web se vea bien en los distintos navegadores la mejor forma de hacerlo es subir dicha web a un servidor y visitarla desde Chrome, Firefox, Internet Explorer y Safari, entre otros. Para probar una web en un servidor tenemos varias opciones:</p>
 <ul>
  <li>Podemos contratar un hosting y un nombre de dominio y subir las web ah&iacute;, pero eso cuesta dinero, m&iacute;nimo unos 30 euros al a&ntilde;o, no es mucho pero si lo tenemos gratis mejor &iquest;no?</li>
  <li>Podemos tambi&eacute;n crear un servidor LAMP, WAMP o XAMP, pero por experiencia se que esos servidores dan problemas, sobre todo al tratar el PHP.</li>
  <li>La ultima opci&oacute;n es crearnos un <strong>servidor</strong> web en una maquina <strong>virtual</strong>, que es lo que yo he hecho y que aprend&iacute; a hacerlo en el curso que hice, para mi la mejor opci&oacute;n sin duda.</li>
 </ul>
 <p>Por lo cual ese es el objetivo del servidor web que he mostrado como crear. El proceso que llevo a cabo para crearlo tiene como objetivo tener lo mas parecido a un hosting de pago en nuestro propio ordenador sin coste alguno. En cuanto a funcionalidad no va a haber ninguna diferencia entre el servidor web <strong>virtual</strong> y un hosting de pago, es decir, vamos a poder realizar lo siguiente en los dos casos:</p>
 <ul>
  <li>Vamos a poder alojar paginas web, tantas como queramos, cada una en su directorio.</li>
  <li>Podremos instalar WordPress, Joomla u otros CMS.</li>
  <li>Podremos subir y bajar archivos por FTP.</li>
 </ul>
 <p>La &uacute;nica diferencia entre contratar un hosting de pago y usar el servidor web virtual va a ser que el hosting de pago tiene hechos unos ajustes de seguridad que no tiene el servidor web virtual creado por mi. La raz&oacute;n por la cual no he aplicado ning&uacute;n ajuste de seguridad es porque el servidor web virtual solamente lo uso para probar paginas web hechas por mi o hacer modificaciones en temas de WordPress. Hay que tener en cuenta que tal como esta hecho el servidor web virtual no hay acceso desde fuera de la red, es decir, si creamos el servidor en nuestra casa no se puede acceder a el desde Internet, solamente desde los dispositivos que est&eacute;n conectados al router que tengamos en casa.</p>
 <p>Supongamos que queremos usar este servidor web para alojar una pagina web y ponerla accesible desde Internet como si estuviese en un hosting de pago. Bien, para ello tendr&iacute;amos que contratar un nombre de dominio en una empresa de pago o bien usar un servicio como www.noip.com, ademas de “tocar” la configuraci&oacute;n de nuestro router. Pero para usar esta maquina virtual como un hosting real tendr&iacute;amos que tener varias cosas en cuenta:</p>
 <ul>
  <li>Si queremos alojar una web en esta maquina virtual para ahorrarnos dinero puede pasar que consigamos precisamente lo contrario. Hay que tener en cuenta que para que la web este accesible las 24 horas del d&iacute;a y los 365 d&iacute;as del a&ntilde;o, nuestro ordenador tendr&aacute; que estar encendido siempre, si lo apagamos o cerramos la maquina virtual la web no podr&aacute; ser visitada. No se cuanto consume un ordenador, pero si hacemos cuentas de lo que nos cuesta en electricidad tenerlo encendido durante un a&ntilde;o entero y lo que nos cuesta un hosting, podr&iacute;a ser que perdamos dinero alojando la web en nuestro PC, por lo menos en cuanto a electricidad se refiere.</li>
  <li>Si tenemos alg&uacute;n problema de hardware tendremos que asumir nosotros el coste de la reparaci&oacute;n, en cambio si tenemos la web alojada en un hosting de pago, el mantenimiento no supone nada para nosotros ya que en el precio va incluido que la empresa se hace cargo de todo eso. Es mas, algunas empresas garantizan un 99,9% de uptime del servidor, esto significa que nos garantizan que el servidor que aloja nuestra web estar&aacute; activo el 99,9% del tiempo al cabo de a&ntilde;o y, si este porcentaje es mas bajo a final de a&ntilde;o podemos reclamar una compensaci&oacute;n econ&oacute;mica.</li>
  <li>Crear un servidor web en una maquina virtual es sencillo, lo podemos hacer en un par de horas empezando desde cero, pero el mantenimiento es mas complicado y nos puede dar muchos quebraderos de cabeza, sobre todo el tema de la seguridad. Para empezar habr&iacute;a que hacer los ajustes de seguridad necesarios al servidor web, para ello hay que saber hacerlos y eso requiere conocimientos y lleva tiempo, y hay que aplicar lo mismo para el mantenimiento posterior. En caso de no tener los conocimientos necesarios para llevar el tema de la seguridad de un servidor podemos encontrarnos con que la web se pase mas tiempo inactiva por problemas de seguridad al cabo del a&ntilde;o que funcionando. Ademas tenemos que hacer ajustes de seguridad en el servidor Apache, en MySQL, en PHP, en FTP y en PHPMyadmin, como he mencionado anteriormente si no tenemos los conocimientos necesarios podemos tener muchos dolores de cabeza.</li>
 </ul>
 <p>En el siguiente punto quiero hacer especial hincapi&eacute; ya que es un tema un poco mas complicado y que es muy importante para una pagina web y es el tema de la conexi&oacute;n a Internet. Para que lo entend&aacute;is correctamente os voy a poner un ejemplo con este blog. Si vosotros acced&eacute;is a la pagina inicial, a www.elblogdeliher.com, y hac&eacute;is click con el bot&oacute;n derecho del rat&oacute;n en un lugar de la pagina en la que no haya nada y pinch&aacute;is en la opci&oacute;n “Guardar como” se guarda la web inicial, con todo su c&oacute;digo HTML, CSS y la im&aacute;genes ademas del Javascript, es decir, todo lo necesario para poder verla en vuestro ordenador sin tener conexi&oacute;n a Internet. Yo he hecho eso y el tama&ntilde;o de la pagina inicial es aproximadamente 2 MB, esto puede parecer muy poco pero os explico como interpretar este tama&ntilde;o.</p>
 <p>Yo vivo en Espa&ntilde;a y tengo una conexi&oacute;n a Internet contratada con una empresa que me da 10 MB de velocidad. Hay empresas que dan mas, pero la velocidad de que nos venden no es real, yo nunca he descargado archivos a mas de 2MB de velocidad y pocas veces he llegado a 1,5 MB. Esa velocidad que nos venden, 10MB, es la velocidad de bajada, es decir, la velocidad a la que nos descargamos informaci&oacute;n desde Internet. Cuando visitamos una web nos estamos descargando informaci&oacute;n, en el caso de los usuarios que acceden a la pagina principal de este blog se descargan los dos 2MB de tama&ntilde;o que tiene, por poner un ejemplo. Pero cuando nos dicen que contratamos 10 MB de velocidad hay que mirar la letra peque&ntilde;a para saber la velocidad de subida, que es la mas importante a la hora de alojar una pagina web en nuestro servidor y que suele ser un 10% de la velocidad de bajada. En mi caso al tener 10Mb de velocidad de bajada tengo 1 MB de velocidad de subida, que ademas se reduce y se queda aproximadamente en un 15%, es decir yo no puedo subir informaci&oacute;n a Internet a mas de 150 KB por segundo, o lo que es lo mismo, 0,15 MB por segundo. Esta es la norma general aplicable a todas las conexiones de Internet en el mercado para el hogar.</p>
 <p>Ahora vamos a suponer que tengo alojado mi blog en mi servidor web virtual, y un usuario accede a la pagina principal, la que pesa 2 MB, ese usuario tardar&iacute;a aproximadamente entre 13 y 20 segundos en ver la pagina web completa lo cual significa que abandonara la pagina antes de que se cargue del todo, esta comprobado que es as&iacute; en diferentes estudios de SEO, yo he hecho eso muchas veces y seguro que vosotros tambi&eacute;n. Para calcular los segundos solo hay que dividir los 2MB que pesa la web entre la velocidad de subida que tenemos en nuestra conexi&oacute;n y obtendremos el resultado. Y tardara este tiempo con un solo usuario, pensad que pasar&iacute;a si 10 usuarios a la vez se conectasen a la pagina web, serian 20MB, ya que cada uno tiene que recibir los 2MB de la pagina, entre 0,15 MB de velocidad, por lo tanto la pagina web no se cargar&iacute;a completa en todos los ordenadores de las distintas visitas hasta pasados un m&iacute;nimo de 130 segundos, es decir, 2 minutos y 10 segundos en el mejor de los casos. Esto supondr&iacute;a que todos se marchar&iacute;an de la web seguro. Para solucionar este problema de velocidad tendr&iacute;amos que contratar una conexi&oacute;n para servidores, seguramente todas las grandes compa&ntilde;&iacute;as lo tendr&aacute;n, pero sera bastante caro, por lo cual tendremos que gastar mas dinero.</p>
 <p>Otra pregunta que me han hecho es si la serie de tutoriales en las cuales mostraba como crear este servidor sirven tambi&eacute;n para crear un VPS, es decir un servidor virtual personal. No he contratado nunca un VPS, por lo cual no lo he podido comprobar, pero en una ocasi&oacute;n lo estuve mirando bastante y le&iacute; mucha informaci&oacute;n al respecto y podr&iacute;a asegurar al 99% que si, pero el tema de la seguridad y el mantenimiento correr&iacute;a de nuestra cuenta. Hay muchas empresas de hosting que ofrecen VPS vac&iacute;os para instalar el sistema operativo y convertirlo en servidor, tambi&eacute;n hay muchas que ofrecen el servidor creado, pero hay que tener mucho cuidado con las empresas de hosting. Muchas nos ofrecen, yo lo he visto, VPS administrados por menos de 10 euros al mes, pero al leer la letra peque&ntilde;a podemos ver que ofrecen 2 horas al mes de administraci&oacute;n y a partir de ese tiempo cobran a 20 euros la hora extra, o bien dentro de lo que llaman administrado solo incluyen actualizaciones de software, lo cual podemos hacerlo nosotros mismos con un solo comando v&iacute;a SSH. Contratar un VPS realmente administrado nos va a costar m&iacute;nimo unos 40 euros al mes en una empresa decente y eso todav&iacute;a es barato.</p>
 <p>Tambi&eacute;n me han preguntado si se puede instalar el servidor web virtual en una partici&oacute;n aparte del sistema operativo que tengan instalado. Se puede hacer eso, pero si enciendes el ordenador y elijes iniciar con la partici&oacute;n en la que no esta el servidor, es como si estuviese apagado, por lo cual la pagina web que tengas alojada en el no se podr&aacute; visitar.</p>
 <p>Otra pregunta que me han hecho es que son las Guest Additions y para que sirven. Las GA, por explicarlo de alguna forma, es un CD con drivers para que el sistema operativo que tengamos instalado en la maquina virtual funcione mejor y tenga funcionalidades extra. Al instalar las GA la maquina virtual funcionara mas fluida, los gr&aacute;ficos ser&aacute;n mejores y podremos usar directorios compartidos o las conexiones USB dentro de ella.</p>
 <p>Bueno, por ahora voy a dejar este articulo as&iacute;, si recibo nuevas preguntas o dudas las ir&eacute; explicando aqu&iacute;. Espero haberme explicado bien y que no me haya olvidado de nada. Un saludo.</p>
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual" st_title="Resolviendo dudas acerca del servidor virtual | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 558,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/05/resolviendo-dudas-acerca-del-servidor-virtual"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>