<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Ubuntu 13.10: una versión muy buena | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena"><span itemprop="headline">Ubuntu 13.10: una versión muy buena</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/ubuntu"><img title="ubuntu" alt="ubuntu" src="/assets/images/labels/ubuntu.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/11/ubuntu-1310-una-version-muy-buena.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-11-11T15:09" itemprop="dateModified">Actualizado el lunes, 11 de noviembre de 2013 a las 15:09 UTC</span></div><div><span>
Etiquetado como
revision, unity, <a href="/label/ubuntu"><span itemprop="articleSection">ubuntu</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Transcurrido un tiempo prudencial desde su lanzamiento y una vez vencida la tremenda pereza que me da volver a revisar lo tantas veces revisado, all&aacute; vamos con una nueva versi&oacute;n de Ubuntu, la distribuci&oacute;n que a nadie deja indiferente. Siguiendo con la nomenclatura habitual que emplea Canonical, es el turno de la letra s, habiendo elegido Saucy Salamander, algo as&iacute; como la atrevida salamandra, como nombre de guerra. Lo primero que cabe recalcar es que esta versi&oacute;n es el paso &uacute;ltimo antes de la publicaci&oacute;n de una nueva versi&oacute;n de soporte extendido, prevista para abril de 2014, y que como tal &uacute;nicamente brinda actualizaciones durante 9 meses.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-KeMrV0zhn0E/UoC7PeMmHMI/AAAAAAAAEEQ/IbX_Denf4lw/s1600/saucy.jpg"><img height="320" src="http://1.bp.blogspot.com/-KeMrV0zhn0E/UoC7PeMmHMI/AAAAAAAAEEQ/IbX_Denf4lw/s320/saucy.jpg" width="271" /></a>
</div>
<br />
<br />
<a></a>Igualmente quisiera destacar, antes de enredarnos en los entresijos del &uacute;ltimo lanzamiento de Ubuntu, que me considero de alg&uacute;n modo admirador de las versiones LTS, por lo que suponen de estabilidad respecto al resto de lanzamientos de Canonical, y porque creo que dos a&ntilde;os es un per&iacute;odo de tiempo razonable para mantener un sistema operativo instalado, disfrutar de &eacute;l&nbsp; y no tener que preocuparse por una eventual ruptura del mismo durante una actualizaci&oacute;n. S&iacute;, s&eacute; que esta &uacute;ltima frase no casa muy bien con un 
<a href="http://www.lasombradelhelicoptero.com/2013/06/el-fanboy.html">fanboy de Chakra</a>, pero el tiempo va pasando tan deprisa que uno se va agarrando a ritmos m&aacute;s tranquilos. Ese es el motivo de que siga manteniendo una partici&oacute;n con 
<a href="http://www.lasombradelhelicoptero.com/2012/04/ubuntu-1204-cumpliendo-con-las.html">Ubuntu Precise</a>, actualmente por su versi&oacute;n 12.04.3, que funciona cual reloj suizo.
<br />
<br />Como advertencia final previa a la revisi&oacute;n, algo que ya he comentado en otras ocasiones, aqu&iacute; no se va a tratar sobre temas que trasciendan la idoneidad de Ubuntu como sistema operativo para usuarios con pocos conocimientos previos de Inform&aacute;tica. Con ello quiero decir que no entrar&eacute; en el debate de Mir contra Wayland, de KDE contra Canonical, de Ubuntu contra el mundo GNU/Linux, ni voy a valorar a 
<a href="https://es.wikipedia.org/wiki/Mark_Shuttleworth">Mark Shuttleworth</a>, sus decisiones y las implicaciones &eacute;ticas de las mismas, o si su plan es dominar el mundo a lo 
<a href="http://simpsons.wikia.com/wiki/Hank_Scorpio">Hank Scorpio</a>... No, nada de eso se tocar&aacute; en este art&iacute;culo. Siento desilusionar a aquellos que buscan la confrontaci&oacute;n en cada menci&oacute;n de Ubuntu que se hace en la red, pero ya hace tiempo que prefiero centrarme en lo que une a la comunidad GNU/Linux en lugar de en lo que la divide. Es lo que hay...
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />&iquest;Qu&eacute; voy a contar? La instalaci&oacute;n de Ubuntu 13.10 es casi calcada a la de anteriores versiones, con la excepci&oacute;n de que ahora se permite al usuario elegir si desea conectarse a su cuenta de Ubuntu One, o crear una en caso de que no la tenga. Insistir&eacute; en que se trata de algo opcional, por lo que se puede continuar sin hacer ninguna de las dos cosas. El proceso completo toma 20 minutos, incluyendo la descarga de las &uacute;ltimas actualizaciones y de los &quot;codecs&quot; multimedia. Es un tiempo muy bueno para lo que Ubuntu nos tiene acostumbrados, supongo que la fiebre inicial de descarga de la distro ha pasado ya, casi un mes despu&eacute;s del lanzamiento, eliminando la saturaci&oacute;n en los servidores. A&uacute;n as&iacute; sigue siendo tremenda la diferencia entre descargar desde la r&eacute;plica en Espa&ntilde;a (lenta hasta la extenuaci&oacute;n) y hacerlo desde cualquier otro lugar. No me explico el porqu&eacute;, pero as&iacute; ha sido siempre mi experiencia.
<br />
<b> </b>
<br />Tras finalizar, se nos indica que debemos reiniciar, algo que no suceder&aacute; si no pulsamos la tecla &quot;Enter&quot;. Recuerdo que en anteriores versiones se instaba al usuario a hacer esto, ser&iacute;a buena cosa continuar haci&eacute;ndolo, sobre todo pensando en ese tipo de persona que no sabe qu&eacute; hacer cuando el equipo parece no responder, como es el caso. Grub reconoce todos los sistemas y, una vez iniciado el nuevo Ubuntu, digamos que nos toparemos con la apariencia habitual, marca de la casa, predominando los tonos morados y marrones. En resumidas cuentas, el Ubuntu de toda la vida. Si bien se han descargado las pertinentes actualizaciones, &eacute;stas no terminan de instalarse hasta que as&iacute; se lo indicamos al entrar por primera vez al escritorio. Cero problemas.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Js-y-U3XxpU/UoC8RP0KpGI/AAAAAAAAEEc/IG0kjwi-HUY/s1600/Captura+de+pantalla+de+2013-11-07+11:12:25.png"><img height="320" src="http://4.bp.blogspot.com/-Js-y-U3XxpU/UoC8RP0KpGI/AAAAAAAAEEc/IG0kjwi-HUY/s400/Captura+de+pantalla+de+2013-11-07+11:12:25.png" width="400" /></a>
</div>
<br />Respecto a los programas que nos encontraremos tampoco hay novedad en el frente. Tras la instalaciones de las mencionadas actualizaciones tendremos Firefox 25, Libreoffice 4.1.2, Rhythmbox 2.99.1... insisto, lo habitual de la distro, aderezado con el kernel 3.11.0, uno de los &uacute;ltimos disponibles.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-1KqVuStr0-Y/UoC9A3OGKWI/AAAAAAAAEEk/gfis1jogj1Y/s1600/Captura+de+pantalla+de+2013-11-07+11:13:37.png"><img height="320" src="http://2.bp.blogspot.com/-1KqVuStr0-Y/UoC9A3OGKWI/AAAAAAAAEEk/gfis1jogj1Y/s400/Captura+de+pantalla+de+2013-11-07+11:13:37.png" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />Espectacular mejor&iacute;a en el tiempo de apagado de esta Saucy Salamander. Nada menos que 3 segundos, cronometrados. Realmente incre&iacute;ble. El tiempo de inicio, por el contrario, ha aumentado ligeramente (27 segundos frente a los 20 de la 
<a href="http://www.lasombradelhelicoptero.com/2013/04/ubuntu-1304-progresa-adecuadamente.html">versi&oacute;n anterior</a>), pero sigue entrando dentro de los par&aacute;metros que personalmente considero aceptables, teniendo en cuenta el equipo en el que nos encontramos. Como tambi&eacute;n viene siendo habitual, para poder modificar el Grub y sus par&aacute;metros vamos a precisar un programa externo, siendo mi recomendaci&oacute;n el 
<a href="https://launchpad.net/grub-customizer">Grub Customizer</a> de Daniel Richter.
<br />
<br />
<b>Gesti&oacute;n de software</b>
<br />El Centro de Software de Ubuntu, que en sus inicios era tremendamente pesado y lento, ha mejorado una barbaridad. Destacar&iacute;a la facilidad con la que una usuario sin apenas conocimientos de paqueter&iacute;a y forma de instalar programas en GNU/Linux podr&iacute;a lograr descargar y ejecutar cualquier cosa que se encuentre en los repositorios oficiales. Gracias a la funci&oacute;n de b&uacute;squeda del Dash, en tres sencillos pasos se tiene la aplicaci&oacute;n deseada en la barra lateral de Unity.
<br />
<br />
<div style="clear: both; text-align: center;"></div>
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Ohrp0GbHZAg/UoC-ze-WLeI/AAAAAAAAEEw/5mhiEXTczRg/s1600/Captura+de+pantalla+de+2013-11-07+11:27:35.png"><img height="320" src="http://4.bp.blogspot.com/-Ohrp0GbHZAg/UoC-ze-WLeI/AAAAAAAAEEw/5mhiEXTczRg/s400/Captura+de+pantalla+de+2013-11-07+11:27:35.png" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-BvUejlyv-mE/UoC--zRdL4I/AAAAAAAAEE4/zyzgjb3Ak7E/s1600/Captura+de+pantalla+de+2013-11-07+11:30:07.png"><img height="320" src="http://1.bp.blogspot.com/-BvUejlyv-mE/UoC--zRdL4I/AAAAAAAAEE4/zyzgjb3Ak7E/s400/Captura+de+pantalla+de+2013-11-07+11:30:07.png" width="400" /></a>
</div>
<b> </b>
<br />
<br />
<b>Reconocimiento de hardware</b>
<br />El que cabe esperar de Ubuntu. La &uacute;nica novedad viene dada por mi parte, al poder incluir en este an&aacute;lisis una nueva pieza de hardware, en concreto una impresora: la HP Laserjet 1018, una impresora l&aacute;ser monocromo que ha ca&iacute;do en mis manos tras una historia que no viene a cuento y que reemplaza para ciertas impresiones a mi obsoleta Epson Stylus Color 685.
<br />
<b> </b>
<br />El caso es que la instalaci&oacute;n de la nueva impresora no result&oacute; tan simple como en Ubuntu Precise, donde me bast&oacute; conectarla para que se abriese una terminal, se descargasen los controladores desde los servidores de HP y listo, a imprimir. Con Saucy esto no ocurri&oacute; as&iacute;, aunque la impresora es reconocida y se puede a&ntilde;adir desde el m&oacute;dulo &quot;Impresoras&quot;, no realiza su funci&oacute;n en principio. Intent&eacute; ejecutar la utilidad hp-setup, pero tampoco logr&eacute; que la cosa marchase.
<br />
<br />La soluci&oacute;n pasa por descargar los &uacute;ltimos controladores para la impresora. Abrimos terminal con CTRL+ALT+T y escribimos:
<br />
<br />wget http://prdownloads.sourceforge.net/hplip/hplip-3.13.11.run
<br />
<br />Ejecutando dicho script se desinstala la versi&oacute;n anterior, al parecer incompatible con Ubuntu Saucy, y se instala la nueva. Tras el preceptivo reinicio... voil&aacute;. Impresora funcionando.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-KFVVv1HI8rs/UoC_EhqcuhI/AAAAAAAAEFA/hLdRDn2Lx0U/s1600/Captura+de+pantalla+de+2013-11-07+11:49:34.png"><img height="320" src="http://4.bp.blogspot.com/-KFVVv1HI8rs/UoC_EhqcuhI/AAAAAAAAEFA/hLdRDn2Lx0U/s400/Captura+de+pantalla+de+2013-11-07+11:49:34.png" width="400" /></a>
</div>
<br />Todo lo dem&aacute;s, impresora Epson, esc&aacute;ner, webcam, tarjeta Ethernet y wifi no ofreci&oacute; dificultad alguna.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-J7M1SwGxG1Y/UoC_LLOUpdI/AAAAAAAAEFI/hP-RakNT1JM/s1600/Captura+de+pantalla+de+2013-11-07+11:54:28.png"><img height="320" src="http://4.bp.blogspot.com/-J7M1SwGxG1Y/UoC_LLOUpdI/AAAAAAAAEFI/hP-RakNT1JM/s400/Captura+de+pantalla+de+2013-11-07+11:54:28.png" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Pues como siempre, esto es, absoluta conexi&oacute;n con el resto de mis dispositivos sin fisuras de ning&uacute;n tipo. Buena velocidad en las transferencias mediante Samba, &quot;streaming&quot; de v&iacute;deo incluido, y reconocimiento de mi disco duro externo, mis pendrives y mi tarjeta SD.
<br />
<b></b>
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />Seguimos para bingo. Otra de las se&ntilde;as de identidad de Ubuntu contin&uacute;a inalterable versi&oacute;n tras versi&oacute;n, siendo capaz el sistema de reproducir cada tipo de archivo que guardo en el disco. El &uacute;nico que requiere un paso adicional, bien sencillo por otra parte, es el archivo comprimido en rar, pero el propio sistema conduce al usuario a la instalaci&oacute;n inmediata y la posterior descompresi&oacute;n.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-QW9uLD_2ZVU/UoC_UScTRvI/AAAAAAAAEFQ/8gSldSqoHqo/s1600/Captura+de+pantalla+de+2013-11-07+12:04:19.png"><img height="320" src="http://2.bp.blogspot.com/-QW9uLD_2ZVU/UoC_UScTRvI/AAAAAAAAEFQ/8gSldSqoHqo/s400/Captura+de+pantalla+de+2013-11-07+12:04:19.png" width="400" /></a>
</div>
<br />
<b> </b>
<br />
<b>Estabilidad</b>
<br />En otras ocasiones tal&oacute;n de Aquiles, con Saucy Salamander se nota que nos estamos acercando a la pr&oacute;xima LTS de Ubuntu. Mucho m&aacute;s estable en sus primeros d&iacute;as de vida que las anteriores, tan solo he de lamentar un par de errores en aplicaciones, concretamente en el HUD y en indicator-power, ambas tras sendos reinicios. Por lo dem&aacute;s, ni cuelgues del servidor gr&aacute;fico ni congelaciones de Unity. En este sentido me confieso sorprendido, pero insisto en que el objetivo de estas versiones &quot;entre LTS&quot; se ha conseguido.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-Gmsnr92Rhtk/UoC_bQd7v2I/AAAAAAAAEFY/qO03dfUxeQI/s1600/Captura+de+pantalla+de+2013-11-07+12:02:33.png"><img height="320" src="http://2.bp.blogspot.com/-Gmsnr92Rhtk/UoC_bQd7v2I/AAAAAAAAEFY/qO03dfUxeQI/s400/Captura+de+pantalla+de+2013-11-07+12:02:33.png" width="400" /></a>
</div>
<br />
<b>Fluidez</b>
<br />Si llevamos tiempo en GNU/Linux sabemos de sobra ya que Ubuntu no es un dechado de virtudes en cuanto a requerimientos m&iacute;nimos del equipo. Es conocido y aceptado, por unos m&aacute;s que por otros. En mi equipo, recalco, se comporta absolutamente fluido y sin sensaci&oacute;n de pesadez. Nada que envidiar a entornos mucho m&aacute;s ligeros en principio. Esto no va a ser as&iacute; si se instala en un equipo m&aacute;s antiguo, para esos menesteres hay otras distribuciones m&aacute;s adecuadas y hay que ser consciente de ello antes de empezar a soltar barbaridades sobre lo lento y pesado que es Unity. Es mi opini&oacute;n personal, claro est&aacute;.
<br />
<b> </b>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />Poco que destacar en este apartado. Suspende a RAM y entra en modo de ahorro de energ&iacute;a sin m&aacute;s. Para hibernar, tambi&eacute;n como suele ser habitual, hemos de abrir una terminal&nbsp; y escribir:
<br />
<b> </b>
<br />sudo pm-hibernate
<br />
<br />Funciona perfecto, manteniendo abiertas las aplicaciones al volver a encender el equipo.
<br />
<br />
<b>Personalizaci&oacute;n</b>
<br />El entorno de escritorio Unity es, por definici&oacute;n, poco personalizable, al menos sin esa gran aplicaci&oacute;n que es &quot;Ajustes de Unity&quot;. Una vez instalada es sumamente sencillo adecuar la apariencia a nuestros gustos personales. En cuanto a programas que suelo emplear, no tuve problemas en encontrar ninguno de ellos. Instal&eacute; Variety, My-weather-indicator, Clementine y Spotify, todos ellos correctos en su funcionamiento.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-ys6TXoUUg9c/UoC_kZ6ZbSI/AAAAAAAAEFg/QehDnBn9v74/s1600/Captura+de+pantalla+de+2013-11-07+12:12:47.png"><img height="320" src="http://4.bp.blogspot.com/-ys6TXoUUg9c/UoC_kZ6ZbSI/AAAAAAAAEFg/QehDnBn9v74/s400/Captura+de+pantalla+de+2013-11-07+12:12:47.png" width="400" /></a>
</div>
<br />
<b> </b>
<br />Ya hace bastante que no utilizo los controladores propietarios de AMD en ninguna distro que instalo, salvo para lanzar la bater&iacute;a de pruebas de Phoronix, al seguir siendo indispensables para el empleo de aceleraci&oacute;n 3D. En el caso de Saucy, la instalaci&oacute;n de Catalyst no ofreci&oacute; resistencia, basta iniciar &quot;Software y actualizaciones&quot;, donde encontraremos &quot;Controladores adicionales&quot; en forma de pesta&ntilde;a.
<br />
<br />Lo que s&iacute; me sigue resultando molesto es el hecho de que Ubuntu d&eacute; por sentado que el usuario desea realizar b&uacute;squedas en Amazon o enviar informaci&oacute;n a Canonical sobre qu&eacute; teclea en el Dash. No me chupo el dedo, ya soy mayorcito, y hasta cierto punto comprendo las necesidades que la empresa pueda tener de rentabilizar de alg&uacute;n modo su &quot;producto&quot;. Pero es evidente que este tema encaja muy mal dentro del mundo del 
<a href="http://es.wikipedia.org/wiki/Software_libre_y_de_c%C3%B3digo_abierto">FOSS</a> y es por esto que genera la controversia que genera. Una opci&oacute;n para deshabilitarlo durante la instalaci&oacute;n estar&iacute;a incluso mejor que la alternativa existente (en el apartado &quot;Privacidad&quot; del men&uacute;). Pero entonces, muy probablemente, la multinacional que patrocina esto pagar&iacute;a mucho menos...
<br />
<br />
<b>Pruebas de rendimiento</b>
<br />Los resultados que arroja Ubuntu Saucy Salamander en los cinco tests de Phoronix a los que la somet&iacute; me resultan un tanto sorprendentes, al menos cuando los comparo con los obtenidos en mi partici&oacute;n con Precise Pangolin. Y es que la versi&oacute;n 13.10 que nos ocupa solamente resulta vencedora en la prueba de codificaci&oacute;n de audio y en el banco de pruebas de Python. Por mi parte reconozco que esperaba una mejora general, sobre todo teniendo en cuenta la gran diferencia de tiempo entre la aparici&oacute;n de una y otra, especialmente en cuanto al kernel de Linux. Pero es posible que, bien el parcheado sucesivo a la LTS (vamos por 12.04.3) o bien el aumento en los requerimientos m&iacute;nimos tengan la culpa de que el Pangolin se comporte mejor que la Salamandra.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-W5e6Ui86pww/UoC_yJ841JI/AAAAAAAAEFo/CvbBWcbmPXQ/s1600/Captura+de+pantalla+de+2013-11-08+09:53:27.png"><img height="320" src="http://4.bp.blogspot.com/-W5e6Ui86pww/UoC_yJ841JI/AAAAAAAAEFo/CvbBWcbmPXQ/s400/Captura+de+pantalla+de+2013-11-08+09:53:27.png" width="400" /></a>
</div>
<br />
<b> </b>
<br />Pese a todo ello, insisto en que el sistema se nota fluido, incluso m&aacute;s en Saucy si es que es posible apreciar una diferencia tan sutil. De igual manera se pueden se&ntilde;alar ciertas mejoras, como la perfecta integraci&oacute;n de las barras de men&uacute; en el panel superior, incluso para aplicaciones Qt como Clementine, cosa que no suced&iacute;a ni sucede en Precise. La fuente tipogr&aacute;fica da la impresi&oacute;n de ser m&aacute;s fina, m&aacute;s clara, pero al igual que comentaba antes se trata de apreciaciones muy dif&iacute;ciles de hacer, tan subjetivas que igual no son ciertas y hay que tomarlas con precauci&oacute;n. Pero esto es un an&aacute;lisis personal, que aunque intento que sea lo m&aacute;s objetivo posible, nunca podr&aacute; despojarse de eso, de la persona que lo realiza.
<br />
<br />Y esa persona, quien escribe estas l&iacute;neas, encuentra la experiencia de uso de Ubuntu Saucy muy satisfactoria. Las mejoras que incorpora no me parecen suficientes, una vez m&aacute;s, para dar el salto desde la confortable y segura Ubuntu Precise Pangonlin, pero s&eacute; que hay muchos usuarios cuya &quot;versionitis&quot; les impide ver esto. Para todos ellos existe esta Salamandra. No me bajo del burro, insisto en que el mejor Ubuntu se encuentra en las LTS, sobre todo transcurrido alg&uacute;n tiempo desde su lanzamiento. Lo estoy experimentando actualmente, usando una versi&oacute;n robusta y que funciona muy bien, que cubre de sobra todas mis necesidades excepto una: la sensaci&oacute;n de pertenencia a una comunidad, con posibilidad de aportar, aspecto por el que nunca fui capaz de abandonar 
<a href="http://www.lasombradelhelicoptero.com/2013/09/chakra-fritz-ya-esta-aqui.html">Chakra</a>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-nK2B71s0T2k/UoDAFhaQIRI/AAAAAAAAEFw/APQjp_4KWns/s1600/Captura+de+pantalla+de+2013-11-08+10:25:17.png"><img height="320" src="http://1.bp.blogspot.com/-nK2B71s0T2k/UoDAFhaQIRI/AAAAAAAAEFw/APQjp_4KWns/s400/Captura+de+pantalla+de+2013-11-08+10:25:17.png" width="400" /></a>
</div>
<br />Pero mi preferencia por las LTS no puede impedir que alabe a una versi&oacute;n 13.10 muy conseguida y que se encuentra solo un pelda&ntilde;o por debajo, como corresponde por otra parte, a lo que cabe esperar de las versiones de soporte extendido. Agoreros aparte, solo puedo desear que en abril de 2014 vea la luz otra excelente versi&oacute;n ubuntera, tras dos a&ntilde;os de probaturas con el Quetzal, el Ringtail y la Salamandra. Esto est&aacute; montado as&iacute; por alguna raz&oacute;n desde que apareci&oacute; la distro de Canonical y as&iacute; contin&uacute;a por ahora. Un saludo a todos.
<br />
<br />
<b>LO MEJOR</b>
<br />
<ul>
 <li>Versiones bastante actualizadas de los programas y paquetes</li>
 <li>Sistema fluido y que se siente ligero pese al entorno Unity</li>
 <li>Muy f&aacute;cil de usar para usuarios noveles </li>
</ul>
<b>LO PEOR</b>
<br />
<ul>
 <li>Peque&ntilde;os fallos en algunos programas</li>
 <li>Tiempo de soporte muy limitado</li>
 <li>El empe&ntilde;o en mantener las b&uacute;squedas en Amazon por defecto </li>
</ul>
<br />
<ul></ul>
<div style="text-align: center;">
 <b>FICHA T&Eacute;CNICA</b>
</div>
<div style="text-align: center;">
 Distribuci&oacute;n: Ubuntu 13.10 Saucy Salamander
</div>
<div style="text-align: center;">
 Entorno de escritorio: Unity 7.1.2
</div>
<div style="text-align: center;">
 Kernel: 3.11.0-13
</div>
<div style="text-align: center;">
 Xorg: 1.14.3
</div>
<div style="text-align: center;">
 Driver gr&aacute;fico: fglrx 13.10.10
</div>
<div style="text-align: center;">
 OpenGL: 4.2.12337
</div>
<div style="text-align: center;">
 GCC: 4.8
</div>
<div style="text-align: center;">
 <br />
</div>
<div style="text-align: center;">
 <br />
</div>
<table>
 <tbody>
  <tr>
   <th>UBUNTU 13.10</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>9,80</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>9,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>8,00</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>8,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>2.982,00</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>22.541,78</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>8,38</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,82</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>421,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>0,36</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>9,58</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena" st_title="Ubuntu 13.10: una versión muy buena | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/ubuntu/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta ubuntu</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 326,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/11/ubuntu-13-1-una-version-muy-buena"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>