<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Bienvenidos a Internet, a wonderful place | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place"><span itemprop="headline">Bienvenidos a Internet, a wonderful place</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/bienvenidos-a-internet-a-wonderful-place/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-05-09T14:28" itemprop="dateModified">Actualizado el viernes, 09 de mayo de 2014 a las 14:28 UTC</span></div><div><span>
Etiquetado como
opinion, internet</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div>
 <p>Aunque el titulo de este articulo pueda sugerir que os quiero dar la bienvenida a <strong>Internet</strong> y hablaros sobre el, el objetivo principal es hablar de nosotros, los usuarios de Internet y sobre como lo usamos.</p>
 <p>En este momento tengo 36 a&ntilde;os y empece en esto de los ordenadores con 14. Por aquel entonces tener Internet en casa era algo que estaba al alcance de muy pocos, pero despu&eacute;s de unos a&ntilde;os apareci&oacute; la famosa tarifa plana de Terra, si sois de mi quinta o parecido seguro que sab&eacute;is de los que os hablo. Fue la primera tarifa plana de Internet, no era realmente una tarifa plana al uso, ya que pod&iacute;amos navegar tanto como quisi&eacute;semos pero dentro de un horario, desde las 6 de la tarde hasta las 8 de la ma&ntilde;ana del d&iacute;a siguiente y los fines de semana completos. Mi ordenador de entonces tenia uno de los viejos modems de 56K y cuando quer&iacute;amos descargar algo era un logro que la velocidad superase los 4 KB por segundo, para los que no hay&aacute;is vivido esa &eacute;poca hoy en d&iacute;a una conexi&oacute;n normal es de unos 10 MB, es decir, 10.000 KB por segundo, hay una diferencia notable, &iquest;no?. Desde entonces <strong>Internet</strong> ha cambiado mucho, y evolucionado mas todav&iacute;a. Tenemos acceso a una cantidad ingente de informaci&oacute;n, no podr&iacute;amos hacernos una idea real de la informaci&oacute;n que tenemos a unos pocos clicks de rat&oacute;n.</p>
 <p>En este articulo no pretendo repasar la historia de Internet, ni os voy a hablar de como eran antes las paginas web. Tampoco es el objetivo principal meter miedo a nadie con algunas de las cosas que os voy a comentar. Simplemente quiero expresar mi opini&oacute;n y dar alg&uacute;n consejo sobre como usar Internet y que valor darle.</p>
 <p>Ahora soy padre de dos ni&ntilde;as, una de 5 y otra de 7 a&ntilde;os, las dos usan el ordenador port&aacute;til que tenemos en el sal&oacute;n con total libertad, por cierto con Ubuntu, pero el ordenador no dejamos que salga del sal&oacute;n, hemos cre&iacute;do conveniente que este ah&iacute; ya que de esta forma siempre podremos ven en todo momento lo que est&aacute;n haciendo. Tambi&eacute;n tengo una sobrina de 11 a&ntilde;os que lo usa cuando viene a casa. Con la edad de mi sobrina el tema de las redes sociales empieza a sobrevolar el ambiente y es entonces cuando te planteas determinadas cosas. Un d&iacute;a un amigo me dijo que quer&iacute;a que le instalase Ubuntu en el ordenador que tiene su hija de 7 a&ntilde;os en su habitaci&oacute;n y me comento que quer&iacute;a un programa de los denominados “ni&ntilde;era” para estar mas seguro. Estuve hablando con el un largo rato, d&aacute;ndole mi opini&oacute;n y consejo acerca de la seguridad en <strong>Internet</strong> para los ni&ntilde;os y los no tan ni&ntilde;os y de las redes sociales.</p>
 <p>En mi caso, me considero un usuario un poco avanzado de Internet, seguramente sea por mis ganas de aprender todo lo relacionado con los ordenadores y la web y cuando hablas con personas que son usuarios mas de andar por casa te das cuenta realmente que de que muchas personas no son realmente conscientes de lo que significa Internet y de como funciona.</p>
 <p>Que quede claro que no estoy en contra de las redes sociales, aunque tampoco soy un fan&aacute;tico de ellas. Creo que hay que saber bien que uso darles y no ser demasiado confiado, solo lo justo. Cuando digo esto es porque creo que hay que tener en cuenta los siguientes puntos a la hora de usar alguna red social:</p>
 <ul>
  <li>A no ser que conozcamos f&iacute;sicamente a la persona que esta al otro lado, nunca dar informaci&oacute;n personal, y si la conocemos piensa si esa informaci&oacute;n se la dar&iacute;as si tuvieras delante a esa persona.</li>
  <li>Por supuesto no mandar im&aacute;genes ni v&iacute;deos nuestras que pueda ser comprometidas, sobran los casos sobre traiciones con material fotogr&aacute;fico.</li>
 </ul>
 <p>Aqu&iacute; me gustar&iacute;a comentar algo respecto a las fotos que puedan ser comprometedoras, tenemos que pensar que cuando enviamos una foto desde nuestro ordenador a otro usuario de Facebook, por poner un ejemplo, esa foto no va directamente de un ordenador a otro, esa foto se queda en un servidor en <strong>Internet</strong>, y el usuario al que se la mandamos accede a ella desde su ordenador. Pero queda un rastro, ademas de que para llegar de un ordenador a otro no sabemos el camino que lleva, es decir, por cuanto ordenadores pasa. Hay que ser conscientes de que cuando enviamos esa foto no la mandamos al otro usuario, si no que la mandamos a <strong>Internet</strong>, con lo que ello conlleva.</p>
 <p>Esto hay muchas personas que no lo saben y son muchos los casos que han aparecido de gente que han visto como im&aacute;genes suyas han sido publicadas en Internet o compartidas con otros usuarios sin saberlo ni quererlo. Solo hay que buscar un poco por Internet para encontrar muchos casos de este tipo.</p>
 <p>Con esto llego al tema tambi&eacute;n de los programas ni&ntilde;era, sinceramente no creo que sirvan, la mayor&iacute;a solo sirven para vetar el acceso a paginas web con contenido no apto para menores de edad, pero hoy en d&iacute;a no creo que eso suponga un peligro demasiado alto, ya que un ni&ntilde;o de 12 a&ntilde;os que ve una web porno, no creo que tenga problemas por ello, ni se quede traumatizado. Seria mejor que no la viese pero eso es otro menester. Veo mucho mas peligro en las redes sociales y creo que para enfocar bien este tema es mas importante informarse primero los padres para luego poder informar a nuestros hijos y decirles las cosas claras y sencillas, la informaci&oacute;n es tan importante como la comunicaci&oacute;n. Hay que explicar a los ni&ntilde;os como funcionan dichas redes sociales y decirles lo que pueden hacer y lo que no deben hacer, para que tengas unas pautas a seguir.</p>
 <p>No me considero un paranoico de la seguridad, pero si un padre que se preocupa de sus hijas y que pretende darles los conocimientos suficientes para poder usar Internet de una forma segura y que sean realmente conscientes de lo que hacen, seguro que todos los padres queremos eso, &iquest;no?. En alguna ocasi&oacute;n he le&iacute;do noticias de personas que han creado perfiles falsos en las redes sociales para intentar contactar con j&oacute;venes con no muy buenas intenciones, y algunos casos han acabado mal, no me gustar&iacute;a vivir una situaci&oacute;n de ese tipo.</p>
 <p>Como he dicho antes no pretendo asustar a nadie, pero si dar mi opini&oacute;n como padre para que los usuarios que usan muy a la ligera las redes sociales o que dejan que sus hijos lo hagan, hagan una pausa y piensen que un ni&ntilde;o de 10 a&ntilde;os que se mete en una red social sin saber como es ni los peligros que puede tener puede, espero que no, darnos un susto. Lo mas importante es informar y comunicarse con nuestros hijos sobre ello y ser muy claros.</p>
 <p>Espero que los que lean esto, si tienen hijos hagan lo correcto, un saludo.</p>
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place" st_title="Bienvenidos a Internet, a wonderful place | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 548,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/05/bienvenidos-a-internet-a-wonderful-place"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>