<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>5 opciones de hosting para aplicaciones Java | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java"><span itemprop="headline">5 opciones de hosting para aplicaciones Java</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/tecnologia"><img title="tecnologia" alt="tecnologia" src="/assets/images/labels/tecnologia.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2012/02/5-opciones-de-hosting-para-aplicaciones.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-08-27T03:05" itemprop="dateModified">Actualizado el martes, 27 de agosto de 2013 a las 03:05 UTC</span></div><div><span>
Etiquetado como
planeta-codigo, <a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, planeta-linux, <a href="/label/tecnologia"><span itemprop="articleSection">tecnologia</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">La tecnolog&iacute;a avanza y hoy en d&iacute;a tenemos nuevas opciones para hospedar las aplicaciones de tal forma que est&eacute;n las 24 horas de los 365 d&iacute;as del a&ntilde;o (o 366) disponibles para ofrecer sus servicios. Veamos algunas de las que hemos tenido hasta el momento con algunas de sus caracter&iacute;sticas.
<br />
<br />
<strong>Servidor propio</strong>
<br />Disponer de un servidor propio tiene varias ventajas como que tenemos total control sobre la m&aacute;quina y en la que podremos instalar todo lo que necesitemos sin ninguna limitaci&oacute;n, sin embargo, esta ventaja tambi&eacute;n puede ser una desventaja ya que tendremos que tener los conocimientos y tiempo para administrar la m&aacute;quina. Otra desventaja es que deberemos solventar los fallos de hardware que se produzcan como una rotura de un disco duro, un sobrecalentamiento de la placa base, memoria, procesador o router lo que puede afectar a la disponibilidad de la aplicaci&oacute;n. Adem&aacute;s, tendremos que disponer de un sitio adecuado para alojar la m&aacute;quina y de los costes que conlleva tenerla encendida en todo el momento que no hay que despreciar. Tambi&eacute;n tenemos que tener en cuenta que si necesitamos escalar la aplicaci&oacute;n tendremos m&aacute;s dificultades que otras opciones ya que tal vez tengamos que adquirir nuevo hardware y haya que adaptar la aplicaci&oacute;n.
<br />
<br />En definitiva esta opci&oacute;n nos obliga no solo a centrarnos en nuestra aplicaci&oacute;n sino tambi&eacute;n en la infraestructura donde se despliega y en su administraci&oacute;n. Sin embargo, hay que decir que una gran ventaja es que nuestros datos est&aacute;n bajo nuestro control y no en segundas o terceras partes.
<br />
<br />A pesar de todas sus desventajas esta opci&oacute;n puede ser muy interesante para un uso personal. Como por ejemplo disponer de un servidor para descargas, compartir archivos u ofrecer servicios de red a los equipos de nuestra casa. Hay diferentes plataformas sobre las que podemos implementar nuestro propio servidor, algunas de las m&aacute;s conocidas en estos momentos son las placas 
<a href="http://pandaboard.org/">Pandaboard</a>, SheevaPlug, BeagleBoard, 
<a href="http://trimslice.com/">TimSlice</a> o las 
<strike>
 inminentes
</strike>&nbsp;
<a href="http://www.raspberrypi.org/">Raspberry Pi</a>&nbsp;(&iexcl;que cuestan 35$!). Todas ellas tienen en com&uacute;n que son un ordenador completo que no ocupan mucho m&aacute;s que un disco duro de 2.5&quot; y est&aacute;n basadas en microprocesadores ARM con lo que tienen un consumo muy reducido que notaremos en la factura de la luz (consumen entre 2W y 9W, &iexcl;un ordenador de sobremesa consume entre 150W y 300W! por lo que el coste de las placas se amortiza con el tiempo). Al ser ordenadores completos y de prop&oacute;sito general podremos darle otros usos como centro multimedia para reproducir pel&iacute;culas, v&iacute;deos o fotos en la televisi&oacute;n ya que algunas placas tienen una salida HDMI.
<br />
<br />
<strong>Proveedores de hosting</strong>
<br />Si no queremos administrar el hardware ni tampoco el software y nos queremos olvidar de los fallos del mismo podemos hacer uso de alguna de las opciones que ofrecen los proveedores de hosting. Sin embargo, con estas opciones no tendremos posibilidad de elegir la plataforma con la que construir nuestra aplicaci&oacute;n ya que la mayor&iacute;a solo ofrece bases de datos MySQL, la plataforma ASP o ASP.NET o PHP y tal vez no en la versi&oacute;n que queramos. Tradicionalmente los proveedores de hosting que ofrec&iacute;an la plataforma Java han sido muy pocos con lo que los programadores de Java tendremos que buscar otras opciones. A no ser que dispongamos de un servidor dedicado nuestra aplicaci&oacute;n competir&aacute; con las otras aplicaciones por los recursos del servidor lo que puede afectar a la capacidad de nuestra aplicaci&oacute;n. En caso de que optemos por un servidor dedicado tendremos el problema de la escalabilidad si la aplicaci&oacute;n lo demanda.
<br />
<br />Algunos de los proveedores m&aacute;s conocidos son 
<a href="http://www.arsys.es/">Arsys</a> y 
<a href="http://www.piensasolutions.com/">Piensasolutions</a>.
<br />
<br />Actualmente la tendencia en diferentes &aacute;mbitos est&aacute; en la 
<a href="http://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube">computaci&oacute;n en la nube</a> y en esta tendencia el hospedaje de las aplicaciones se ofrecen como servicio. Hay diferentes opciones entre las que poder elegir y con diversas caracter&iacute;sticas que deberemos evaluar seg&uacute;n las necesidades.&nbsp;Veamos&nbsp;algunas de las m&aacute;s conocidas.
<br />
<br />
<strong>Amazon EC2</strong>
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Amazon EC2" height="83" src="http://3.bp.blogspot.com/-GCg6XtYkmeY/T0jQDG5PEWI/AAAAAAAABDs/O6biempJzDA/s200/amazon-ws.png" title="Amazon EC2" width="200" />
</div>
<a href="http://aws.amazon.com/es/ec2/">Amazon EC2</a> ofrece su infraestructura como servicio (IaaS) en la que nuestra aplicaci&oacute;n estar&aacute; hospedada en sus servidores. En esta opci&oacute;n tendremos un gran control sobre el software que instalamos en el servidor ya que en gran medida lo que la diferencia de un servidor propio es que nos conectamos al servidor de forma remota para administrarlo, si el servidor propio lo&nbsp;administr&aacute;semos&nbsp;de forma remota ni eso.
<br />
<br />Al igual que otras opciones de la nube tiene la ventaja de que en caso de que nuestra aplicaci&oacute;n escale podemos adquirir mas recursos de c&oacute;mputo, como capacidad de procesamiento, memoria o almacenamiento en disco. En realidad Amazon no dispone una m&aacute;quina f&iacute;sica para cada servidor de sus usuarios sino que da una representaci&oacute;n l&oacute;gica de un servidor, por esto motivo, si necesitemos disponer de una nueva m&aacute;quina podremos disponer de ella en pocos minutos y la podremos aprovisionar r&aacute;pidamente con im&aacute;genes de software (AMI) 
<a href="http://aws.amazon.com/amis/Linux?browse=1">buscando una que se adecue a nuestras necesidades</a>.&nbsp;Aunque necesitemos m&aacute;s tiempo de configuraci&oacute;n que en las opciones de Google App Engine y Jelastic.
<br />
<br />Se puede probar durante un a&ntilde;o gratis en una instancia micro. Aqu&iacute; pueden consultarse los 
<a href="http://aws.amazon.com/es/ec2/pricing/">precios de Amazon EC2</a>&nbsp;y&nbsp;aqu&iacute;&nbsp;los 
<a href="http://aws.amazon.com/es/ec2/instance-types/">tipos y caracter&iacute;sticas de las instancias</a>. A la hora de pagar hay que preseleccionar un tipo de instancia por lo que necesitaremos evaluar nuestras necesidades por lo alto y probablemente estemos pagando por capacidad que luego no aprovechamos.
<br />
<br />Amazon tambi&eacute;n proporciona una plataforma PaaS, AWS Elastic Beanstalk, sino queremos ser responsables de administrar a bajo nivel las m&aacute;quinas. Beanstalk nos permite centrarnos en el desarrollo de la aplicaci&oacute;n en vez de la administraci&oacute;n de la infraestructura.
<br />
<br />
<strong>Google App Engine (GAE)</strong>
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Google App Engine" src="http://3.bp.blogspot.com/-mtHTRzkeHM0/TBezuYpe1NI/AAAAAAAAAaA/jFQfyCMtPHc/s1600/appengine.gif" title="Google App Engine" />
</div>La 
<a href="http://code.google.com/intl/es-ES/appengine/">soluci&oacute;n de Google para el &laquo;cloud computing&raquo;</a> ofrece una plataforma como servicio (PaaS) para las aplicaciones con una serie de API que deber&aacute;n usar para conseguir ciertas funcionalidades, como persistencia. Tiene como ventaja que no tenemos que preocuparnos de administrar un servidor y todas las herramientas para hacerlas funcionar entre si, solo nos preocuparmos por nuestra aplicaci&oacute;n. Tiene como desventaja que deberemos adaptar nuestra aplicaci&oacute;n a las API que nos ofrece GAE y por tanto estaremos encadenados a su plataforma. Tambi&eacute;n estaremos limitados a utilizar Python o Java por el momento.
<br />
<br />Dispone de 
<a href="http://code.google.com/intl/es-ES/appengine/docs/quotas.html">cuotas</a> parte de las cuales pueden usarse de forma gratuita y aqu&iacute; los 
<a href="http://code.google.com/intl/es-ES/appengine/docs/billing.html">precios de los recursos consumidos</a>.
<br />
<br />
<strong>Jelastic</strong>
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Jelastic" src="http://4.bp.blogspot.com/-ST8DxwYF4y8/T0jQo_jhp6I/AAAAAAAABD0/lqzIl3HlPHU/s1600/jelastic.png" title="Jelastic" />
</div>Una opci&oacute;n m&aacute;s reciente para &uacute;nicamente la platforma Java, por el momento, es 
<a href="http://jelastic.com/">Jelastic</a>. Se trata de una PaaS sin la desventaja de tener que administrar un servidor como en Amazon y sin la desventaja de estar encadenados a ciertas API como en el caso de Google App Engine de tal modo que si queremos cambiar de proveedor no tendremos que reimplementar la aplicaci&oacute;n. Nos ofrece herramientas est&aacute;ndares sobre las que de desarrollar la aplicaci&oacute;n como son nginx como servidor web, apache tomcat 6/7, jetty o glashfish como contenedores de aplicaciones, Maria DB, MySQL o PostgreSQL como bases de datos relacionales y MongoDB o CouchDB como bases de datos no-sql y el JDK 6 o 7.
<br />
<br />Esta opci&oacute;n permite centrarse en el desarrollo de la aplicaci&oacute;n y posiblemente sea la opci&oacute;n m&aacute;s adecuada para un equipo de developers puro que no dispone de sysadmins. La aplicaci&oacute;n se puede tener en funcionamiento en minutos (en vez de horas como en Amazon EC2) ya que todos los elementos de la infraestructura ya est&aacute;n configurados para funcionar entre si. Dado que no hay que aprender nuevas API como en el caso de GAE permite aprovechar los conocimientos que todo desarrollador Java ya tiene.
<br />
<br />La escalabilidad y el coste se mide en cloudlets. Un cloudlet se corresponde con 128 MiB de memoria y 200 Mhz de c&oacute;mputo y tiene un precio de 0,016 €/hora (para el proveedor 
<a href="http://www.dogado.de/">dogado</a>).&nbsp;A&uacute;n en estado beta puede probarse de forma gratuita.&nbsp;La aplicaci&oacute;n puede escalar de forma transparente de forma vertical hasta un m&aacute;ximo de 16 cloudlets y en horizontal hasta un m&aacute;ximo de 4 m&aacute;quinas.
<br />
<br />
<b>OpenShift</b>
<br />
<a href="https://openshift.redhat.com/">OpenShift</a>&nbsp;(de la mano de RedHat) es una opci&oacute;n similar a Jelastic, es un PaaS, pero soporta diferentes tecnolog&iacute;as adem&aacute;s de Java como PHP, Ruby, Node.js y Python. Tambi&eacute;n diferentes bases de datos como MySql, PostgreSql y MongoDB. Puede ser probada de forma gratuita con un l&iacute;mite de 3 gears, donde cada gear se corresponde con 512 MiB y 1 GiB de espacio en disco. Otra opci&oacute;n similar es 
<a href="https://www.appfog.com/">AppFog</a> que tambi&eacute;n tiene una capa gratuita.
<br />
<br />Otras opciones son&nbsp;
<a href="https://www.appfog.com/">AppFog</a>&nbsp;(esta es muy recomendable),&nbsp;
<a href="http://www.cloudfoundry.com/">Cloud Foundry</a>&nbsp;(VMWare),&nbsp;
<a href="http://www.heroku.com/">Heroku</a>, 
<a href="http://www.windowsazure.com/es-es/">Azure</a> (Microsoft)&nbsp;y&nbsp;
<a href="http://cloud.google.com/products/compute-engine.html">Google Compute Engine</a> (Google Cloud Platform).
<br />
<br />Como se ve las opciones de hosting o alojamiento no son pocas cada una con varias caracter&iacute;sticas, precios y formas de cobro diferentes.
<br />
<br />Referencia:
<br />
<a href="http://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube">http://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube</a>
<br />
<a href="http://archlinuxarm.org/">http://archlinuxarm.org/</a>
<br />
<a href="http://www.raspberrypi.org/">http://www.raspberrypi.org/</a>
<br />
<a href="http://pandaboard.org/">http://pandaboard.org/</a>
<br />
<a href="http://www.danielclemente.com/consumo/">http://www.danielclemente.com/consumo/</a>
<br />
<a href="http://www.arsys.es/">http://www.arsys.es/</a>
<br />
<a href="http://www.piensasolutions.com/">http://www.piensasolutions.com/</a>
<br />
<a href="http://aws.amazon.com/es/ec2/">http://aws.amazon.com/es/ec2/</a>
<br />
<a href="http://code.google.com/intl/es-ES/appengine/">http://code.google.com/intl/es-ES/appengine/</a>
<br />
<a href="http://cloud.google.com/">http://cloud.google.com/</a>
<br />
<a href="http://jelastic.com/">http://jelastic.com/</a>
<br />
<a href="https://www.appfog.com/">https://www.appfog.com</a>
<br />
<a href="https://openshift.redhat.com/">https://openshift.redhat.com</a>
<br />
<a href="http://www.windowsazure.com/es-es/">http://www.windowsazure.com/es-es/</a>
<br />
<a href="http://blog.jelastic.com/2012/02/09/jelastic-versus-heroku/">http://blog.jelastic.com/2012/02/09/jelastic-versus-heroku/</a></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java" st_title="5 opciones de hosting para aplicaciones Java | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "5 opciones de hosting para aplicaciones Java";
var disqus_url = "http://elblogdepicodev.blogspot.com/2012/02/5-opciones-de-hosting-para-aplicaciones.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/tecnologia/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tecnologia</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 115,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2012/02/5-opciones-de-hosting-para-aplicaciones-java"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>