<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Formas de organizar el código | Koalite</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/koalite/2014/10/formas-de-organizar-el-codigo"><span itemprop="headline">Formas de organizar el código</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Juan María Hernández</span> en la bitácora <a href="http://blog.koalite.com/">Koalite</a>, <a href="http://feedproxy.google.com/~r/KoalitesBlog/~3/4qsxLQ_HJ9c/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-10-20T05:06" itemprop="datePublished">Publicado el lunes, 20 de octubre de 2014 a las 05:06 UTC</span></div><div><span>
Etiquetado como
software-development, development</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Excepto las pr&aacute;cticas de primero de carrera y algunos scripts muy simples, cualquier aplicaci&oacute;n acaba constando de un mont&oacute;n de ficheros que necesitamos organizar de alguna manera en carpetas para poder manejarlos sin volvernos locos.</p> 
<p>Existen muchas formas de organizar el c&oacute;digo y en ellas influye mucho el gusto de cada uno o las convenciones aplicadas por cada equipo de desarrollo, pero eso no quita que tambi&eacute;n haya formas m&aacute;s o menos est&aacute;ndar, cada una de ellas centrada en mejorar determinados aspectos. </p> 
<p>En este post vamos a ver dos filosof&iacute;as distintas a la hora de organizar el c&oacute;digo y veremos qu&eacute; nos puede aportar cada una.</p> 
<h3>Organizaci&oacute;n por roles tecnol&oacute;gicos</h3> 
<p>La organizaci&oacute;n por roles es una de las m&aacute;s extendidas actualmente en el desarrollo de software. Probablemente uno de los proyectos que m&aacute;s hizo por este tipo de organizaci&oacute;n fue Ruby on Rails con su convenci&oacute;n sobre configuraci&oacute;n basada en la ubicaci&oacute;n f&iacute;sica en disco de sus modelos, vistas y controladores, y que luego ha sido copiada por otros frameworks como ASP.NET MVC.</p> 
<p>Esta organizaci&oacute;n se basa en agrupar los ficheros en base al rol tecnol&oacute;gico que desempe&ntilde;a en el sistema. De esta forma, si en la capa de presentaci&oacute;n estamos aplicando un patr&oacute;n MVC, tendremos carpetas con Models, Views y Controllers o si tenemos un modelo de dominio estilo DDD, tendremos carpetas con Entities, Repositories, Factories.</p> 
<p>Algo parecido a esto:</p> 
<p><img src="http://blog.koalite.com/wp-content/uploads/folder-per-role.png" alt="organizaci&oacute;n de c&oacute;digo por roles" width="195" height="323" /></p> 
<p>La organizaci&oacute;n por roles tecnol&oacute;gicos <strong>fomenta una forma de pensar homog&eacute;nea</strong> y centrada en aspectos t&eacute;cnicos. Al definir tanto los roles y hacerlos tan expl&iacute;citos con las carpetas independientes, sirve para remarcar mucho la arquitectura del sistema y eso nos lleva a encajar las nuevas funcionalidades dentro de esa arquitectura.</p> 
<p>La principal ventaja de esto es que el dise&ntilde;o del sistema tiende a mantenerse muy homog&eacute;neo y la estructura de carpetas act&uacute;a como gu&iacute;a al implementar nuevas funcionalidades.</p> 
<p>Si quieres montar una nueva funcionalidad para gestionar clientes potenciales en tu aplicaci&oacute;n web, te crear&aacute;s la entidad cliente potencial en la carpeta Entities, el repositorio en la carpeta Repositories, el controlador en Controllers, etc.</p> 
<p>Es una buena opci&oacute;n cuando se est&aacute; trabajando con equipos de desarrollo grandes en los que hay m&aacute;s rotaci&oacute;n de personal, porque marca unas pautas muy claras de c&oacute;mo hacer las cosas y el resultado final resulta m&aacute;s predecible.</p> 
<p>Precisamente esta homogeneizaci&oacute;n se puede convertir en uno de los inconvenientes de esta forma de organizar el c&oacute;digo, porque lleva a intentar encajar todas las funcionalidades del sistema en una serie de roles que, a veces, no son necesarios o no son necesariamente la mejor forma de implementar una funcionalidad concreta.</p> 
<p>Es algo parecido a lo que ocurre con los dise&ntilde;os de N capas tradicionales, en los cuales puedes acabar creando capas que no aportan ning&uacute;n valor s&oacute;lo para mantener el dise&ntilde;o uniforme.</p> 
<p>Adem&aacute;s, al organizar el c&oacute;digo por roles, tendemos a pensar s&oacute;lo en t&eacute;rminos de esos roles. Hay ocasiones en que la mejor forma de implementar algo es utilizando una clase o una funci&oacute;n que no encaja en ninguno de los roles, pero como la estructura de carpetas s&oacute;lo nos habla de controladores, vistas y modelos, acabaremos implement&aacute;ndolo como una de esas cosas. Es frecuente encontrar proyectos en los que todo es un <em>NoSeQu&eacute;Controller</em>, <em>NoSeQu&eacute;View</em> o <em>NoSeQu&eacute;Model</em>.</p> 
<p>Otro problema (menor, si est&aacute;s usando un IDE moderno con un sistema de navegaci&oacute;n potente), es que el c&oacute;digo necesario para comprender una funcionalidad queda repartido en muchas carpetas y es dif&iacute;cil saber realmente cu&aacute;nto c&oacute;digo est&aacute; relacionado con una funcionalidad concreta.</p> 
<h3>Organizaci&oacute;n por funcionalidades</h3> 
<p>La organizaci&oacute;n por funcionalidades (<em>features</em>) se basa en primar el aspecto funcional sobre el t&eacute;cnico a la hora de decidir d&oacute;nde colocar cada fichero.</p> 
<p>En lugar de agrupar los ficheros por el rol que tienen (Controlador, Repository, ViewModel, Directive…), los agrupamos en base a la funcionalidad que implementan.</p> 
<p>M&aacute;s o menos as&iacute;:</p> 
<p><img src="http://blog.koalite.com/wp-content/uploads/folder-per-feature.png" alt="Organizaci&oacute;n de c&oacute;digo por funcionalidad" width="188" height="245" /></p> 
<p>Por ejemplo, en una aplicaci&oacute;n web MVC que tiene una parte para gestionar clientes podr&iacute;amos tener una carpeta <code>customers</code> que incluyese el modelo, la vista, el controlador y el resto de cosas que necesitemos.</p> 
<p>Llevado al extremo, en cada carpeta tendr&iacute;amos un <em>slice</em> vertical completo de la aplicaci&oacute;n, desde el UI hasta la persistencia, pero normalmente no se llega a tanto, y podemos tener una carpeta <code>customers</code> con el c&oacute;digo javascript y html de la nuestra aplicaci&oacute;n SPA hecha con angularjs, y en alguna otra parte otra carpeta <code>customers</code> con el c&oacute;digo C# de un proyecto WebAPI, con su controlador, servicios para cargar datos, etc.</p> 
<p>Si la organizaci&oacute;n basada en roles ten&iacute;a cierto parecido con las arquitecturas N capas, podr&iacute;amos decir que la organizaci&oacute;n basada en funcionalidades se asemeja m&aacute;s (salvando las enormes distancias) al concepto de microservicios que est&aacute; tan de moda ahora, porque fomenta el minimizar las dependencias entre unas carpetas y otras para tener funcionalidades lo m&aacute;s cohesivas e independientes posibles.</p> 
<p>Esta forma de organizar el c&oacute;digo evita los inconvenientes de la organizaci&oacute;n por roles. Con ella todo el c&oacute;digo relativo a una funcionalidad est&aacute; f&iacute;sicamente cerca, ayudando a saber mejor qu&eacute; c&oacute;digo est&aacute; ligado a esa funcionalidad y a navegar por &eacute;l. </p> 
<p>Adem&aacute;s facilita la navegaci&oacute;n por la aplicaci&oacute;n a un nivel m&aacute;s alto. Cuando ves carpetas llamadas Customers, Orders o Catalogue, es m&aacute;s f&aacute;cil hacerse a la idea de qu&eacute; hace la aplicaci&oacute;n que si ves carpetas llamadas Controllers, Views y Models.</p> 
<p>A la hora de implementar nuevas funcionalidades ayuda a considerarlas de forma independiente, por lo que resulta m&aacute;s sencillo “separarse” del dise&ntilde;o general y utilizar dise&ntilde;os m&aacute;s optimizados para cada funcionalidad concreta sin necesidad de ajustarnos a unos roles marcados previamente.</p> 
<p>Esa libertad para implementar nuevas funcionalidades se convierte en un arma de doble filo si est&aacute;s trabajando con gente que no es capaz de dise&ntilde;ar con un m&iacute;nimo de sentido com&uacute;n, puesto que resulta m&aacute;s complicado fomentar el uso de buenas pr&aacute;cticas pr&aacute;cticas estandarizadas de dise&ntilde;o.</p> 
<h3>Mezclando ambas alternativas</h3> 
<p>Hasta ahora hemos visto dos formas de organizar el c&oacute;digo que parten de ideas distintas y priorizan objetivos diferentes, pero no hace falta ser muy listo para darse cuenta de que en realidad estamos hablando de dos ejes distintos, roles t&eacute;cnicos y funcionalidades, y que en el fondo son dos conceptos ortogonales, por lo que podemos mezclarlos a nuesto antojo.</p> 
<p>De hecho, lo normal es que cuando una aplicaci&oacute;n se hace realmente compleja (cientos de ficheros) se acaben mezclado de una forma u otra.</p> 
<p>Si se ha empezado organizando por roles t&eacute;cnicos, llega un momento en que tener 400 controladores de AngularJS en una sola carpeta se hace inmanejable y se acaba separ&aacute;ndolos en distintas carpetas dentro de la carpeta controllers.</p> 
<p>Igualmente, si cada funcionalidad de una aplicaci&oacute;n con AngularJS acaba teniendo 3 directivas, 2 filtros, 4 controllers y 5 vistas, es razonable que terminemos particionando m&aacute;s los ficheros, ya sea mediante carpetas o alguna convenci&oacute;n de nombres en los propios ficheros.</p> 
<h3>Conclusiones</h3> 
<p>La manera de organizar el c&oacute;digo no s&oacute;lo influye en d&oacute;nde colocamos cada fichero, sino que tambi&eacute;n puede condicionarnos a la hora de dise&ntilde;ar el sistema o de implementar nuevas funcionalidades. </p> 
<p>Si priorizamos el aspecto t&eacute;cnico organizando el c&oacute;digo por roles, conseguiremos sistemas m&aacute;s homog&eacute;neos, con un c&oacute;digo m&aacute;s est&aacute;ndarizado entre unas partes y otras de la aplicaci&oacute;n, pero tambi&eacute;n nos puede hacer sentir una p&eacute;rdida de libertad al implementar nuevas funcionalidades por intentar encajarlas en una estructura preestablecida.</p> 
<p>Personalmente, hoy en d&iacute;a prefiero inclinarme hacia el lado de la organizaci&oacute;n por funcionalidad, incluso aunque luego el 80% de las funcionalidades tengan la misma estructura (y, por tanto, encajar&iacute;an bien en una organizaci&oacute;n por roles). Pese a que esto requiere pensar m&aacute;s para decidir c&oacute;mo implementar cada funcionalidad, a cambio permite pensar con m&aacute;s libertad en la forma de implementarla, y en mi opini&oacute;n eso merece la pena.</p> 
<p>No hay posts relacionados.</p>
<img src="http://feeds.feedburner.com/~r/KoalitesBlog/~4/4qsxLQ_HJ9c" height="1" width="1" alt="" /></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo" st_title="Formas de organizar el código | Koalite"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1034,
      "url" : "http://www.blogstack.info/post/koalite/2014/10/formas-de-organizar-el-codigo"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "koalite",
      "name" : "Koalite"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>