<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion"><span itemprop="headline">Apache Tapestry 5.3 publicado (Notas de publicación)</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/programacion"><img title="programacion" alt="programacion" src="/assets/images/labels/programacion.png"/></a><a class="label" href="/label/java"><img title="java" alt="java" src="/assets/images/labels/java.png"/></a><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/tapestry"><img title="tapestry" alt="tapestry" src="/assets/images/labels/tapestry.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2011/11/apache-tapestry-53-publicado.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2011-11-30T14:20" itemprop="dateModified">Actualizado el miércoles, 30 de noviembre de 2011 a las 14:20 UTC</span></div><div><span>
Etiquetado como
planeta-codigo, <a href="/label/programacion"><span itemprop="articleSection">programacion</span></a>, planeta-arch-linux, planeta-linux, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, <a href="/label/tapestry"><span itemprop="articleSection">tapestry</span></a>, <a href="/label/java"><span itemprop="articleSection">java</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Java" height="200" src="http://2.bp.blogspot.com/-hC2-QuC33AU/TBeztET3lAI/AAAAAAAAAZ8/EzZnNZw5do0/s200/java.png" title="Java" width="107" />
</div>La versi&oacute;n 5.3 de del framework 
<a href="http://tapestry.apache.org/">Apache Tapestry</a> para el desarrollo de aplicaciones web din&aacute;micas en Java ha sido publicada y as&iacute; 
<a href="http://mail-archives.apache.org/mod_mbox/tapestry-users/201111.mbox/%3CCACd-vsNnhX-zTTfM=-KNZCDsMeOgmzOE7TqeOC5-F44wpB-Mwg@mail.gmail.com%3E">ha sido anunciada en la lista de correo</a>. Contin&uacute;a con la l&iacute;nea de las series 5.x e incorpora muchas novedades, mejoras y correcciones de errores, casi 350 peticiones han sido resueltas. Varias de estas nuevas caracter&iacute;sticas se suman a algunos&nbsp;
<a href="http://elblogdepicodev.blogspot.com/2011/08/motivos-para-elegir-apache-tapestry.html">Motivos para elegir el framework Apache Tapestry</a>. Las lista de novedades es la siguiente:
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Apache Tapestry" height="132" src="http://4.bp.blogspot.com/-OGvCbjBk0zU/TOq7Y6w6wfI/AAAAAAAAAiU/Pfuzt5kkDBQ/s320/tapestry.png" title="Apache Tapestry" width="320" />
</div>
<br />
<b>Documentaci&oacute;n</b>
<br />La ya buena documentaci&oacute;n que exist&iacute;a ha sido mejorada y ampliada con nuevas secciones. As&iacute; tenemos&nbsp;
<a href="http://tapestry.apache.org/tapestry-tutorial.html">un tutotial</a>&nbsp;con el que los usuarios que est&eacute;n empezando les resulte m&aacute;s f&aacute;cil la tarea, incluye las herramientas a utilizar, las dependencias, como emepezar una aplicaci&oacute;n r&aacute;pidamente utilizando el archetype de maven y un par de ejemplos sencillos para empezar a hacer algo asi como usar Tapestry con Hibernate. Tambi&eacute;n se ha a&ntilde;adido&nbsp;
<a href="http://tapestry.apache.org/cookbook.html">una secci&oacute;n de recetas</a>&nbsp;sobre como hacer cosas habituales en muchas aplicaciones. Tambi&eacute;n se ha a&ntilde;adido una secci&oacute;n de preguntas frecuentes y unas p&aacute;ginas de consulta para caracter&iacute;sticas de uso habitual (
<a href="http://tapestry.apache.org/application-module-class-cheat-sheet.html">Application Module Class Cheat Sheet</a>,&nbsp;
<a href="http://tapestry.apache.org/component-cheat-sheet.html">Component Cheat Sheet</a>).
<br />
<br />
<br />
<b>Alertas</b>
<br />Tapestry ahora tiene un mecanismo central para manejar las alertas de usuario. Esto incluye el servicio 
<a href="http://tapestry.apache.org/5.3/apidocs/org/apache/tapestry5/alerts/AlertManager.html">AlertManager</a> y el componente 
<a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/corelib/components/Alerts.html">Alerts</a>. Simplmente a&ntilde;ade el componente Alerts a tu layout estandar y Tapestry se encarga del resto. Las alertas se pueden a&ntilde;adir tanto en las peticiones tradicionales como en las peticiones Ajax y pueden ser transitorias (se muestran durante unos segundos), normales o fijas (se mantienen entre peticiones hasta que el usuario las elimina expresamente haciendo clic). Las alertas pueden ser de tres severidades: info, advertencia (warn) y error. La apariencia puede ser personalizada sobreescribiendo las reglas CSS de Tapestry.
<br />
<br />
<b>Salida de comentarios</b>
<br />Ahora es posible que Tapestry emita comentarios de salida. Esto son comentarios (como &lt;!--BEGIN Index:loop (context:Index.tml, line 15)--&gt;) que ayudan a depurar las etiquetas de salida en la parte del cliente. Esto se habilita para todas las peticiones que usen el s&iacute;mbolo de configuraci&oacute;n &laquo;tapestry.component-render-tracing-enabled&raquo; y pueden ser a&ntilde;adidas a cualquier petici&oacute;n a&ntilde;adiendo el par&aacute;metro &laquo;t:component-trace=true&raquo; a la URL. Esto aumenta significativamente el tama&ntilde;o de las etiquetas de salida pero puede ser muy &uacute;til con layouts compejos para determinar que componente es el responsable de cada porci&oacute;n de la p&aacute;gina.
<br />
<br />
<b>Contribuciones de servicio adaptables</b>
<br />Al hacer contribuciones a un servicio ahora no se est&aacute; limitado a contribuir un valor que sea asignable al tipo asociado con la configuraci&oacute;n. Objetos de cualquier tipo pueden ser contribuidos y el servicio TypeCoercer ser&aacute; usado para transformar el valor al tipo de la configuraci&oacute;n (
<a href="http://tapestry.apache.org/typecoercer-service.html">Ver documentaci&oacute;n TypeCoercer</a>).
<br />
<br />
<b>Mejoras en la depuraci&oacute;n de componentes</b>
<br />Dada la forma en como Tapestry instrumentaba las p&aacute;ginas y componentes usar un depurador ha sido dificultoso con las clases de p&aacute;ginas y componentes, cualquier campo mutable muestra su valor por defecto en el depurador independientemente de que haya sido escrito en el campo o le&iacute;do de &eacute;l. En el modo desarrollo de Tapestry 5.3 los valores ocultos leen de y escriben a esos campos en los propios campos (esto tambi&eacute;n ha sido corregido en la rama de mantenimiento 5.2.5). Este ocultamiento no ocurre en el modo producci&oacute;n para evitar potenciales p&eacute;rdidas de memorias.
<br />
<br />
<b>Recarga deshabilitada en producci&oacute;n</b>
<br />Desde ahora no se buscan cambios en los archivos de clases, plantillas o cat&aacute;logos de mensajes en el modo producci&oacute;n. Es asumido que las aplicaciones Tapestry son empaquetadas en archivos WAR en producci&oacute;n y que cambiar el archivo WAR causa que el contenedor de servlet redespliegue la aplicaci&oacute;n entera. Este cambio mejora el rendimiento y reduce el consumo de memoria en las aplicaciones.
<br />
<br />
<b>JavaDoc Tapestry</b>
<br />Tapestry ahora incluye una nueva librer&iacute;a , tapestry-javadoc, que reemplaza el antiguo componente de informes basado en Maven. Simplemente poniendo una anotaci&oacute;n @tapestrydoc en el 
<a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/corelib/components/package-summary.html">JavaDoc de los componentes Tapestry</a> generar&aacute; la documentaci&oacute;n completa como parte del JavaDoc... no mas cambios entre el JavaDoc y el informe del componente generado por Maven y no mas dependencia en Maven para la documentaci&oacute;n de los componentes. Los estilos del 
<a href="http://tapestry.apache.org/5.3/apidocs/">JavaDoc</a> han sido adaptados a los colores del proyecto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-H277tUo_jOw/Ts0qHsCKLBI/AAAAAAAABAs/IDm5LLTZ4nQ/s1600/tapestry-javadoc.png"><img height="200" src="http://4.bp.blogspot.com/-H277tUo_jOw/Ts0qHsCKLBI/AAAAAAAABAs/IDm5LLTZ4nQ/s200/tapestry-javadoc.png" width="114" /></a>
 <a href="http://2.bp.blogspot.com/-Mn62jtTkAB4/Ts0qCaBq4vI/AAAAAAAABAk/04mAj47ofY0/s1600/component-tapestry-javadoc.png"><img height="200" src="http://2.bp.blogspot.com/-Mn62jtTkAB4/Ts0qCaBq4vI/AAAAAAAABAk/04mAj47ofY0/s200/component-tapestry-javadoc.png" width="65" /></a>
</div>
<br />
<b>Template skinning</b>
<br />Tapestry a&ntilde;ade la posibilidad de personalizar y/o tematizar (&laquo;skin and/or theme&raquo;) las p&aacute;ginas o componentes. Es una extensi&oacute;n de como Tapestry gestiona las p&aacute;ginas por locale pero a&ntilde;ade ejes definidos por aplicaci&oacute;n adem&aacute;s de reglas para encontrar recursos. Ver 
<a href="http://tapestry.apache.org/5.3/apidocs/org/apache/tapestry5/services/pageload/ComponentResourceSelector.html">ComponentResourceSelector</a> y 
<a href="http://tapestry.apache.org/5.3/apidocs/org/apache/tapestry5/services/pageload/ComponentRequestSelectorAnalyzer.html">ComponentRequestSelectorAnalyzer</a>.
<br />
<br />Tambi&eacute;n hay un nuevo componente 
<a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/corelib/components/Dynamic.html">Dynamic</a> el cual usa una plantilla externa (no una plantilla de Tapestry) que puede ser seleccionada en tiempo de ejecuci&oacute;n.
<br />
<br />Mediante esta funcionalidad ahora la plantilla que se aplica para una p&aacute;gina o componentes no solo vendr&aacute; determinado por el locale de la aplicaci&oacute;n sino que podremos introducir m&aacute;s variables en la elecci&oacute;n. Una de ellas podr&iacute;a ser el tipo de cliente, como por ejemplo un dispositivo m&oacute;vil del que hace la petici&oacute;n u otros criterios para asi mostrar contenido m&aacute;s adaptado o personalizado.
<br />
<br />En el siguiente enlace de puede ver una demostraci&oacute;n de como aplicar la funcionalidad 
<a href="http://blog.tapestry5.de/index.php/2011/06/24/template-skinning/">Template Skinning</a>.
<br />
<br />
<b>Evento de formulario cancelado</b>
<br />Los componentes de formulario ahora reconocen cuando el formulario de la parte cliente fue cancelado. Un nuevo evento &laquo;cancelled&raquo; es disparado al principio del proceso de env&iacute;o lo cual permite a la p&aacute;gina saltar todas las actualizaciones y validaciones en el servidor cuando sea lo deseado.
<br />
<br />
<b>Restricciones implicitas en OrderedConfiguration</b>
<br />Al usar OrderedConfiguration.add() sin restricciones Tapestry ahora implicitamente ordenar&aacute; el elmento a&ntilde;adido despu&eacute;s del elemento a&ntilde;adido anteriormente dentro del mismo m&eacute;todo. En versiones anteriores esos elementos eran a&ntilde;adidos sin restricciones. Esto hace m&aacute;s f&aacute;cil contribuir un grupo de elementos relacionados con un orden implicito.
<br />
<br />
<b>Nuevas validaciones de las clases de componente</b>
<br />Tapestry incluye nuevas validaciones de clases de componente para ayudar a reducir algunos errores comunes. Ahora comprueba que los componentes referenciados por un manejador de eventos concuerde con un componente definido en la plantilla... esto identifica r&aacute;pidamente errores tipogr&aacute;ficos en los nombres de m&eacute;todos. Esto es, si la firma de un manejador de evento es &laquo;onFormularioRegistroSubmit()&raquo; se comprueba que exista en la plantilla un componente de id &laquo;FormularioRegistro&raquo;. Esta comprobaci&oacute;n puede ser deshabilitada con un s&iacute;mbolo de configuraci&oacute;n de tal modo que aplicaciones 5.2 existentes que tengan este tipo de errores todav&iacute;a puedan funcionar (esto es, tendr&aacute; manejadores de eventos muertos que nunca ser&aacute;n invocados).
<br />
<br />
<b>Carpeta de aplicaci&oacute;n</b>
<br />Tapestry ahora puede ser configurado para ejecutarse dentro de una carpeta, lo cual puede ser &uacute;til cuando se ejecuta dentro de una aplicaci&oacute;n web que contiene otros servlets y filtros como una forma de prevenir conflictos. En vez de ejecutarse en la raiz del contexto de la aplicaci&oacute;n.
<br />
<br />
<b>Mejorado el arquetipo de inicio r&aacute;pido</b>
<br />El arquetipo de Maven ha sido actualizado y ahora muestra varias nuevas funcionalidades de uso com&uacute;n. Adem&aacute;s a&ntilde;ade soporte para 
<a href="http://www.gradle.org/">Gradle</a> (
<a href="http://tapestryjava.blogspot.com/2011/10/tapestry-53-maven-archetype.html">Referencia</a>). La forma de usarlo desde la linea de comandos es:
<br />
<br />
<div>
 <pre>$MAVEN_HOME/bin/mvn archetype:generate -DarchetypeCatalog=http://tapestry.apache.org/</pre>
</div>
<br />
<b>P&aacute;ginas blancas</b>
<br />La nueva anotaci&oacute;n @WhitelistAccessOnly marca una p&aacute;gina como accesible solo por una lista blanca de clientes. Las reglas para la lista son extensibles. La regla por defecto de la lista blanca es que sea accedida desde 127.0.0.1. Usa esta anotaci&oacute;n en p&aacute;ginas que pueden exponer datos sensibles como paneles informativos incorporados.
<br />
<br />
<b>Cat&aacute;logo de p&aacute;gina</b>
<br />Las aplicacicones Tapestry incluyen una p&aacute;gina PageCatalog la cual lista todas las p&aacute;ginas cargadas de la aplicaci&oacute;n con detalles acerca de su tiempo de construcci&oacute;n y n&uacute;mero de componentes. La p&aacute;gina requiere acceso en la lista blanca (ver en comentario anterior). Muestra alguna informaci&oacute;n que solo est&aacute; disponible en el modo desarrollo. PageCatalog puede ser usada para cargar todas la p&aacute;ginas de la aplicaci&oacute;n lo cual es &uacute;til para localizar problemas en las p&aacute;ginas... y es especialmente &uacute;til al aumentar de una versi&oacute;n anterior de Tapestry.
<br />
<br />Otra p&aacute;gina de la que podemos obtener informaci&oacute;n acerca de los servicios de la aplicaci&oacute;n es ServiceStatus donde podremos ver el estado de los mismos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-_DOvl0lANlE/Ts0sPpUCfiI/AAAAAAAABA0/IfFcG-M289g/s1600/PageCatalog.png"><img height="166" src="http://2.bp.blogspot.com/-_DOvl0lANlE/Ts0sPpUCfiI/AAAAAAAABA0/IfFcG-M289g/s200/PageCatalog.png" width="200" /></a>
 <a href="http://2.bp.blogspot.com/-PBU_7vStIxQ/Ts0sU-L_wxI/AAAAAAAABA8/48UDM6gxsm8/s1600/ServiceStatus.png"><img height="200" src="http://2.bp.blogspot.com/-PBU_7vStIxQ/Ts0sU-L_wxI/AAAAAAAABA8/48UDM6gxsm8/s200/ServiceStatus.png" width="84" /></a>
</div>
<br />
<br />
<b><br /></b>
<br />
<b>Logging en la parte ciente JavaScript</b>
<br />La consola en la parte cliente Blackbird ha sido eliminada. En su lugar est&aacute;n los mensajes de la consola flotante combinada con el logging a la consola de Firebug o WebKit. Tapestry no captura m&aacute;s las excepciones de JavaScript de inicializaci&oacute;n de modo que pueden ser informadas apropiadamente en la consola nativa. Estos cambios deber&iacute;an hacer la depuraci&oacute;n de JavaScript en el lado cliente mucho m&aacute;s f&aacute;cil.
<br />
<br />El informe de error es una de las cosas buenas de Tapestry. Con esta nueva versi&oacute;n esta caracter&iacute;stica se ha extendido a las peticiones Ajax con lo que cuando se produzca una excepci&oacute;n en el servidor se nos mostrar&aacute; un informe en una ventana emergente con un contenido similar a las excepciones de las peticiones normales. En este 
<a href="http://tapestryjava.blogspot.com/2011/08/tapestry-53-ajax-exception-reporting.html">screencast</a> se puede ver en funcionamiento.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-g2lol_68KUc/Ts0vSnfVFRI/AAAAAAAABBs/dL3sVJKqovM/s1600/exception-report.png"><img height="200" src="http://1.bp.blogspot.com/-g2lol_68KUc/Ts0vSnfVFRI/AAAAAAAABBs/dL3sVJKqovM/s200/exception-report.png" width="25" /></a>
</div>
<br />Otra lista de novedades no mencionadas en la notas de lanzamiento oficial:
<br />
<br />
<b>Nuevos componentes</b>
<br />Se han a&ntilde;adido unos cuantos nuevos componentes al los ya 
<a href="http://tapestry.apache.org/component-reference.html">presentes en el core</a>. Estos son:
<br />
<ul>
 <li><a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/kaptcha/components/KaptchaImage.html">KaptchaImage</a> / <a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/kaptcha/components/KaptchaField.html">KaptchaField</a>: Permite evitar el spam en los formularios.</li>
 <li><a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/corelib/components/Tree.html">Tree</a>: componente &aacute;bol que pemite mostrar informaci&oacute;n jer&aacute;rquica con nodos expandibles, contraibles y seleccionables. Es personalizable y basado en Ajax.</li>
 <li><a href="http://tapestry.apache.org/current/apidocs/org/apache/tapestry5/corelib/components/Checklist.html">Checklist</a>: componente de selecci&oacute;n multiple consistente en diferentes checkbox.</li>
</ul>
<b><br /></b>
<br />
<b><br /></b>
<br />
<b>Nueva capa de abstracci&oacute;n JavaScript</b>
<br />En estos momentos Tapestry est&aacute; atado a Prototype y Scriptaculous por compatibilidad con anteriores versiones (aunque se puede utilizar perfectamente junto con otros frameworks javascript como jQuery). En un futuro la nueva capa capa de abstracci&oacute;n permitir&aacute; usar cualquier librer&iacute;a JavaScript. La transici&oacute;n se completar&aacute; en la versi&oacute;n 5.4.
<br />
<br />
<b>Soporte Ajax mejorado</b>
<br />La clase MiltiZoneUpdate ha sido marcada como obsoleta en favor del servicio AjaxResponseRenderer. Esta nueva clase permite actualizar una zona con el contenido de Block, Component u otro objeto capaz de ser convertido a RenderCommand. Permite adem&aacute;s importar una librer&iacute;a JavaScript como parte de la respuesta Ajax y a&ntilde;adir una llamada a una funci&oacute;n en el lado del cliente, &uacute;til y a veces necesario para procesar la petici&oacute;n Ajax correctamente.
<br />
<br />
<b>Integraci&oacute;n con JSR 330 (Dependency Injection for Java)</b>
<br />Empezando desde Tapestry 5.3 es posible usar las anotaciones que define la especificaci&oacute;n JSR-330 en la capa de servicios de tal modo que no dependan de Tapestry.
<br />
<br />
<b>Integraci&oacute;n JPA2</b>
<br />Integraci&oacute;n nativa con JPA2 proporcionando compatibilidad hacia atr&aacute;s en futuras versiones y posibilidad de usar m&uacute;ltiples unidades de persistencia en la misma aplicaci&oacute;n. Permite configurar JPA sin necesidad de XML.
<br />
<br />
<b>Herramienta construcci&oacute;n, Gradle</b>
<br />Tapestry ha pasado de utilizar Maven a usar Gradle como herramienta de contrucci&oacute;n y compilaci&oacute;n para el propio proyecto. Gradle aporta nuevas funcionalidades, simplifica otras y evita algunos de los aspectos menos deseables de Maven.
<br />
<br />
<b>Actualizaci&oacute;n Jumpstart</b>
<br />Actualizada la aplicaci&oacute;n de referencia 
<a href="http://draft.blogger.com/jumpstart.doublenegative.com.au/jumpstart/">Jumpstart</a> a la versi&oacute;n 5.3 con numerosos ejemplos que muestran funcionalidades, y con la posibilidad de ver el c&oacute;digo fuente de esos ejemplos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-AbUNzcQIghE/Ts0tofI3_LI/AAAAAAAABBE/wAldUiiMq9A/s1600/JumpStart.png"><img height="182" src="http://3.bp.blogspot.com/-AbUNzcQIghE/Ts0tofI3_LI/AAAAAAAABBE/wAldUiiMq9A/s200/JumpStart.png" width="200" /></a>
</div>
<br />
<b>Otras</b>
<br />
<ul>
 <li>Incorporaci&oacute;n de <a href="http://documentcloud.github.com/underscore/">Underscore.js</a> que a&ntilde;ade programaci&oacute;n funcional a JavaScript (en modo no conflicto).</li>
 <li>Coercion de String-a-Enum sin necesidad de hacer una contribuci&oacute;n en el contenedor IOC.</li>
 <li>Compresi&oacute;n JavaScript y CSS a trav&eacute;s de de la librer&iacute;a <a href="http://developer.yahoo.com/yui/compressor/">YUICompressor library</a>.</li>
 <li>M&aacute;s r&aacute;pido y m&aacute;s eficiente en uso de memoria.</li>
</ul>
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-xCDcX0ielNc/Ts0uApTAeLI/AAAAAAAABBc/Y66Y5mg0qM0/s1600/no-whitespace-compress.png"><img height="108" src="http://3.bp.blogspot.com/-xCDcX0ielNc/Ts0uApTAeLI/AAAAAAAABBc/Y66Y5mg0qM0/s200/no-whitespace-compress.png" width="200" /></a>
 <a href="http://3.bp.blogspot.com/-Wkn0Ui5-MJo/Ts0uB8JA0yI/AAAAAAAABBk/IX_hDZB89vI/s1600/whitespace-compress.png"><img height="108" src="http://3.bp.blogspot.com/-Wkn0Ui5-MJo/Ts0uB8JA0yI/AAAAAAAABBk/IX_hDZB89vI/s200/whitespace-compress.png" width="200" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-p1wALjPx-gI/Ts0t9-FbqvI/AAAAAAAABBU/PV8F85Vb22I/s1600/no-css-minification.png"><img height="108" src="http://2.bp.blogspot.com/-p1wALjPx-gI/Ts0t9-FbqvI/AAAAAAAABBU/PV8F85Vb22I/s200/no-css-minification.png" width="200" /></a>
 <a href="http://1.bp.blogspot.com/-pP8rK8cF7fE/Ts0t85TtwWI/AAAAAAAABBM/cXRdw_XWX8w/s1600/css-minification.png"><img height="108" src="http://1.bp.blogspot.com/-pP8rK8cF7fE/Ts0t85TtwWI/AAAAAAAABBM/cXRdw_XWX8w/s200/css-minification.png" width="200" /></a>
</div>
<br />
<br />
<b>Cambios disruptivos</b>
<br />
<ul>
 <li>Tapestry depende ahora del Servlet API versi&oacute;n 2.5 con lo que la versi&oacute;n m&iacute;nima para ejecutarlo ahora ser&aacute; Tomcat 6.0+.</li>
 <li>Actualizado Prototype a la versi&oacute;n 1.7.</li>
 <li>Las plantillas sin son tratadas como si tuvieran el doctype de HTML5 () pudiendose usar entidades como &copy; o &amp;nbsp; sin ver errores de parseo de anteriores versiones.</li>
</ul>Algunas interfaces y APIS en Tapstry 5.3 ser&aacute;n eliminadas en Tapestry 5.4 o posteriores. Estas incluyen:
<br />
<ul>
 <li>Entorno RenderSupport (reemplazada con el entorno JavaScriptSupport).</li>
 <li>El objeto MultiZoneUpdate, reemplazada con AjaxResponseRenderer.</li>
 <li>El servicio ClassFactory y la interfaz ClassFab (reemplazada con el servicio PlasticProxyFactory y la interfaz PlasticClass).</li>
 <li>La funcionalidad &quot;suppress redirects&quot;, que permit&iacute;a a los eventos de los componentes responder directamente con HTML, como en Tapestry 4.</li>
</ul>Salvo que se usen 
<a href="https://issues.apache.org/jira/browse/TAP5-1432">caracter&iacute;sticas marcadas como obsoletas en Tapestry 5.2</a> en la nueva versi&oacute;n la actualizaci&oacute;n no requerir&aacute; m&aacute;s que 
<a href="http://tapestry.apache.org/2011/10/31/tapestry-53-release-candidate.html">actualizar a las nuevas dependencias</a>.
<br />
<br />Y una lista larga de correcci&oacute;n de errores y mejoras. La lista completa est&aacute; en las 
<a href="http://tapestry.apache.org/release-notes-53.html">notas de publicaci&oacute;n de tapestry 5.3 oficiales</a>&nbsp;y aqu&iacute; 
<a href="http://blog.tapestry5.de/index.php/2011/08/22/tapestry-5-3-preview/">una lista de novedades en ingl&eacute;s</a>.
<br />
<br />Referencia:
<br />
<a href="http://tapestry.apache.org/index.html">http://tapestry.apache.org/index.html</a>
<br />
<a href="http://tapestry.apache.org/download.html">http://tapestry.apache.org/download.html</a>
<br />
<a href="http://elblogdepicodev.blogspot.com/2010/05/documentacion-sobre-apache-tapestry.html">Documentaci&oacute;n sobre Apache Tapestry</a>
<br />
<a href="http://elblogdepicodev.blogspot.com/2011/08/motivos-para-elegir-apache-tapestry.html">Motivos para elegir el framework Apache Tapestry</a></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion" st_title="Apache Tapestry 5.3 publicado (Notas de publicación) | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Apache Tapestry 5.3 publicado (Notas de publicación)";
var disqus_url = "http://elblogdepicodev.blogspot.com/2011/11/apache-tapestry-53-publicado.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/programacion/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta programacion</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li><li><a href="/label/tapestry/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tapestry</a></li><li><a href="/label/java/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta java</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 126,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2011/11/apache-tapestry-5-3-publicado-notas-de-publicacion"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>