<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Mi guía para elección de portátil nuevo | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo"><span itemprop="headline">Mi guía para elección de portátil nuevo</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software"><img title="software" alt="software" src="/assets/images/labels/software.png"/></a><a class="label" href="/label/tecnologia"><img title="tecnologia" alt="tecnologia" src="/assets/images/labels/tecnologia.png"/></a><a class="label" href="/label/microsoft"><img title="microsoft" alt="microsoft" src="/assets/images/labels/microsoft.png"/></a><a class="label" href="/label/hardware"><img title="hardware" alt="hardware" src="/assets/images/labels/hardware.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2012/12/mi-guia-para-eleccion-de-portatil-nuevo.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2012-12-15T00:10" itemprop="dateModified">Actualizado el sábado, 15 de diciembre de 2012 a las 00:10 UTC</span></div><div><span>
Etiquetado como
<a href="/label/software"><span itemprop="articleSection">software</span></a>, <a href="/label/microsoft"><span itemprop="articleSection">microsoft</span></a>, <a href="/label/tecnologia"><span itemprop="articleSection">tecnologia</span></a>, <a href="/label/desempaquetado"><span itemprop="articleSection">desempaquetado</span></a>, <a href="/label/hardware"><span itemprop="articleSection">hardware</span></a>, otros, <a href="/label/apple"><span itemprop="articleSection">apple</span></a>, gnulinux</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" />
</div>
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Intel" height="131" src="http://3.bp.blogspot.com/-YsNoDxaK4SY/ULH_Z2yBd5I/AAAAAAAABpI/d6WIftJMvvc/s200/intel.png" title="Intel" width="200" />
</div>Despu&eacute;s de muchos meses buscando y comparando (no se cuantos meses exactamente pero m&aacute;s de 18 seguro) finalmente me decid&iacute; por un ordenador que pas&oacute; mi exigente criterio (o puede que me cansase de esperar), ya llevando unos d&iacute;as con &eacute;l ha sido una buena elecci&oacute;n aunque algunos detalles no me gustan del todo pero es lo mejor que he encontrado y no quer&iacute;a esperar mucho m&aacute;s ya. En esta entrada comentar&eacute; mi experiencia y consejos que quiz&aacute; le ayuden a otra gente en su elecci&oacute;n de port&aacute;til si est&aacute; buscando uno. En las siguientes entradas har&eacute; el 
<a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html">desempaquetado</a> y el 
<a href="http://elblogdepicodev.blogspot.com.es/2012/12/analisis-software-y-bios-sony-vaio-e-14p.html">an&aacute;lisis del equipo funcionando</a>.
<br />
<br />
<b>Primeros pasos</b>
<br />Antes de empezar ni siquiera a buscar un port&aacute;til es tener una idea del presupuesto, que marca/o que no marca se quiere, tama&ntilde;o, caracter&iacute;sticas que consideramos indispensables que tenga, uso que le vamos a dar y necesidades o modelos de lo que buscamos, con esto empieza la selecci&oacute;n y discriminaci&oacute;n de entre todas las posibilidades que tenemos. En el mundo del PC tantas que pueden llegar a abrumar y dificultar la elecci&oacute;n por eso recomendable tener unos par&aacute;metros prefijados, luego podremos flexibilizarlos. En Apple y los Mac es m&aacute;s sencillo, hay menos modelos, la mayor&iacute;a de gama alta para lo que considerar&iacute;amos en los PC y tambi&eacute;n a precios que a parecidas caracter&iacute;sticas son notablemente mucho m&aacute;s caros y est&aacute;n inflados, todo sea dicho. Un Mac no quer&iacute;a ya que son caros y adem&aacute;s pretend&iacute;a instalar Arch Linux en &eacute;l, as&iacute; que para esto consideraba que mejor un PC.
<br />
<br />
<b>B&uacute;squeda de opciones y selecci&oacute;n</b>
<br />En mi caso estaba buscando un port&aacute;til que pudiese configurar ya que todos los modelos que encontraba en las tiendas o no ten&iacute;an la cantidad de memoria m&iacute;nima que quer&iacute;a, la pantalla no ten&iacute;a la resoluci&oacute;n m&iacute;nima que quer&iacute;a o no ten&iacute;a la tarjeta gr&aacute;fica que quer&iacute;a o el microprocesador no era el que quer&iacute;a. Mis requisitos me limitaban bastante la b&uacute;squeda (esta es una de las razones por las que he tardando tanto tiempo en decidirme por uno), as&iacute; que pr&aacute;cticamente ten&iacute;a como opci&oacute;n pedirlo a un fabricante por internet y en la que pudiese configurar los aspectos anteriores seg&uacute;n mi criterio. En el trabajo tengo un Sony Vaio C de unos dos a&ntilde;os de antiguedad y la verdad es que estoy bastante contento con &eacute;l as&iacute; que para mi Sony era una de las primeras opciones ya que adem&aacute;s cumpl&iacute;a con mi necesidad de poder pedirlo por internet y poder configurarlo, al menos el microprocesador, la cantidad de memoria, la capacidad del disco duro, la gr&aacute;fica y la resoluci&oacute;n de pantalla, con esto para mi era m&aacute;s que suficiente. Otra remota opci&oacute;n era un Dell pero teniendo la experiencia del anterior Dell XPS 1530M y comparando ambas marcas he de decir que me quedo con los Sony por bastante diferencia y eso que el Dell XPS era de gama alta, el Sony por el que me he decidido me ha salido casi 250€ m&aacute;s barato de lo que me sali&oacute; el Dell en su momento y los acabados me gustan m&aacute;s.
<br />
<br />
<b>Caracter&iacute;sticas</b>
<br />Resumiendo las caracter&iacute;sticas b&aacute;sicas que buscaba eran:
<br />
<ul>
 <li><b>Memoria</b>: 8 GiB m&iacute;nimo (que tiempos aquellos de 1996 cuando Windows 95 funcionaba con 8 M&iacute;B, ahora tenemos ordenadores con &iexcl;1000 veces m&aacute;s memoria!, se ha multiplicado por esta cantidad en &iexcl;16 a&ntilde;os!), suelo virtualizar y la memoria es una de las cosas m&aacute;s necesarias para ello. La cantidad de memoria suele ser una de las caracter&iacute;sticas por la que los equipos se quedan viejos y empiezan a ir lentos al usar m&aacute;s el disco duro, en estos momentos no es cara, as&iacute; que, caballo grande.</li>
 <li><b>Resoluci&oacute;n de pantalla</b>: no tengo monitor externo y suelo programar, as&iacute; que para trabajar de forma c&oacute;moda 1600x900 m&iacute;nimo para un tama&ntilde;o de 14&quot; o 1366x768 para uno de 13&quot; o 11&quot;. Adem&aacute;s ya ten&iacute;a probado con el port&aacute;til del trabajo de 14&quot; una resoluci&oacute;n 1600x900 y encantado. Este era un punto al que le daba mucha importancia y peso en mi decisi&oacute;n.</li>
 <li><b>Tama&ntilde;o pantalla</b>: mi l&iacute;mite eran las 14&quot;, m&aacute;s me parecen muy grandes para ser transportados, ya 14&quot; me parece grande as&iacute; que no descartaba alg&uacute;n modelo m&aacute;s peque&ntilde;o de 11&quot; o 13&quot; que para transportarlos c&oacute;modamente son mucho mejores.</li>
 <li><b>Tarjeta gr&aacute;fica</b>: ya que pretendo instalar Linux principalmente buscaba que tuviese una Intel, no tendr&aacute; las gr&aacute;ficas m&aacute;s potentes pero creo que tiene el mejor soporte para Linux en sus controladores open source y es una empresa que apoya, participa y colabora bastante en el mundo del software libre por ello me cae bien a pesar de su pr&aacute;cticamente monopolio en microprocesadores para port&aacute;tiles, Nvidia tambi&eacute;n tiene buen soporte y rendimiento en Linux pero sus controladores son cerrados (lo siento Nvidia pero tu no eras opci&oacute;n, cuando apoyes el c&oacute;digo abierto al menos no digo ya el software libre, la siguiente vez tal vez me decida por una de las tuyas). En el port&aacute;til de trabajo tengo una AMD/ATI bastante rid&iacute;cula de la serie 51xx y ning&uacute;n problema con sus controladores open soure y rendimiento pero en port&aacute;tiles hay pocos que vengan con una gr&aacute;fica de esta marca. Tampoco pretendo jugar a juegos y si lo hago el rendimiento de una Intel me es m&aacute;s que suficiente, no hay que desmerecerla tampoco si se quiere para jugar ocasionalmente y si no se es muy exigente con la calidad es m&aacute;s que suficiente. Otra cosa que no quer&iacute;a era un port&aacute;til con una gr&aacute;fica h&iacute;brida, ya que una intel me es suficiente y no iba a sacarle partido a la dedicada pero sobre todo porque en Linux esto me da que todav&iacute;a no tiene buen soporte y pudiera ser una fuente de problemas. Una Intel HD 4000 de los ahora nuevos Ivy Bridge cumple todo lo que ped&iacute;a.</li>
 <li><b>Microprocesador</b>: Intel o AMD me daba igual cualquier cosa me iba a servir en este aspecto pero finalmente la gr&aacute;fica Intel de los Ivy Bridge y dado que es pr&aacute;cticamente imposible encontrar un port&aacute;til con microprocesador AMD en ning&uacute;n sitio ya sea en tienda o por internet, Intel era casi la &uacute;nica cosa por la que optar. La &uacute;nica opci&oacute;n de encontrar un AMD era en los netbook de algunos modelos que vienen con un <a href="http://www.cpu-world.com/CPUs/Bobcat/AMD-E%20Series%20E2-1800.html">AMD E-1800</a> y no descartaba del todo esta opci&oacute;n pero ten&iacute;a dudas de si la potencia de estos micros era suficiente para realizar mis tareas.</li>
 <li><b>Disco duro</b>: esta opci&oacute;n no me importaba mucho, ni en capacidad ni en rpm, pero la comento porque algunos port&aacute;tiles denominados ultrabooks vienen con un disco SSD que act&uacute;a de cache combinado con disco normal para el almacenamiento. No quer&iacute;a esta opci&oacute;n porque en windows funcionar&aacute; perfectamente pero en Linux nuevamente puede ser una fuente de problemas, no estaba seguro, as&iacute; que por ejemplo los port&aacute;tiles de la <a href="http://www.sony.es/customise/portatil-vaio-t">gama T de Sony</a> quedaban descartados a pesar de que alguna cosa de ellos me gustaba otras como esta no.</li>
</ul>
<div>
 <b>Candidatos</b>
</div>
<div>
 Con estas caracter&iacute;sticas que buscaba estos eran los equipos candidatos que he ido seleccionando a lo largo de todos estos meses:
</div>
<div>
 <ul>
  <li><a href="http://www.asus.es/Eee/Eee_PC/Eee_PC_1225B/">Asus 1225B</a>: netbook de 11&quot; de resoluci&oacute;n 1366x768 con microprocesador AMD E-450 y 4GiB de memoria. Precio de 350€ en tienda bastante interesante.&nbsp;Quiz&aacute; con un rendimiento no suficiente para lo que buscaba.</li>
  <li><a href="http://www.acer.es/ac/es/ES/content/model/NX.M3AEB.001">Acer Aspire V5-171</a>: tambi&eacute;n netbook de 11&quot; de resoluci&oacute;n 1366x768 con microprocesador mucho m&aacute;s potente que el AMD anterior, i3 2367M a 1,4 GHz, Intel HD 3000 y 4Gib. Precio 500€ en tienda. La gr&aacute;fica y el procesador Sandy Bridge habiendo salido ya los Ivy Bridge no me decid&iacute;a por el, pero era una muy buena opci&oacute;n, en la <a href="http://www.acer.de/">p&aacute;gina alemana</a>&nbsp;tiene disponible el modelo que viene con un Ivy Bridge pero no se si finalmente llegar&aacute; a Espa&ntilde;a. Comentar que en alg&uacute;n an&aacute;lisis no le pon&iacute;an buena nota a la calidad de pantalla y el calor que desprend&iacute;a.</li>
  <li><a href="http://www.asus.es/Notebooks/Superior_Mobility/ASUS_ZENBOOK_UX31A">Asus Zendbook UX31A</a>: De los pocos que he visto en tienda con resoluci&oacute;n de 1600x900 en formato de 13&quot;. Sin embargo, tiene algunas limitaciones importantes como que la memoria est&aacute; soldada en la placa base y no puede ser ampliada, vienen con 4GiB y punto. Al venir con SSD es algo caro, sobre los 1000€ para el modelo con SSD de 128GiB (no suficiente para mi) y 1200€ el de 256GiB (se me va de precio).</li>
  <li><a href="http://www.sony.es/customise/portatil-vaio-t">Sony Vaio gama T</a>: al llevar el calificativo de untrabook e incluir un SSD combinado con un disco duro y tener resoluci&oacute;n de 1366x768 como m&aacute;ximo lo descartaba. Aunque me gustaba por el microprocesador que se les puede configurar, el&nbsp;<a href="http://ark.intel.com/products/65707">Intel&reg; CoreTM i5-3317U</a>,&nbsp;que tiene las instrucciones de virtualizaci&oacute;n VT-d adem&aacute;s de VT-x.</li>
  <li><a href="http://www.sony.es/customise/portatil-vaio-e">Sony Vaio E</a>: la gama que m&aacute;s se ajustaba a lo que andaba buscando, configuraci&oacute;n, modelo de 14&quot; con posibilidad de resoluci&oacute;n 1600x900, memoria configurable a 8 GiB y (creo) que ampliable hasta 16 GiB, sin tarjeta gr&aacute;fica h&iacute;brida y una Intel HD 4000, con micros Ivy Bridge, sin disco duro h&iacute;brido, posibilidad de elegir color negro. No creo que lo vaya a usar mucho pero por si acaso que venga ya con Windows 8 y no me hagan pagar 15€ por actualizarlo a W8 cuando deber&iacute;a venir ya con ello de serie como en algunos otros casos. Precio desde 649€ sin confugurar, con las caracter&iacute;sticas que yo buscaba&nbsp;de 839€,&nbsp;precio final y en casa.</li>
 </ul>
 <div>
  <b>Caracter&iacute;sticas t&eacute;cnicas proporcionadas por Sony</b>
  <br />Ahora empezar&eacute; a hacerle el trabajo sucio a Sony y que deber&iacute;a hacer mejor ella misma si quiere vender m&aacute;s, ellos en su p&aacute;gina me parece que &laquo;venden&raquo; muy mal su producto (Apple me parece que lo hace mucho mejor, cuida m&aacute;s su web y la informaci&oacute;n que da &iquest;ello contribuir&aacute; al &eacute;xito que est&aacute; teniendo estos &uacute;ltimos a&ntilde;os? Seguro que en parte) pero esa es asunto para otra historia. Lo siguiente son algunas cosas que me hubiese gustado conocer antes de comprar uno de sus port&aacute;tiles.
  <br />
  <br />Por todo lo dicho anteriormente la opci&oacute;n que eleg&iacute; fue el Sony Vaio E 14P (SVE14A25E) con los siguientes elementos:
 </div>
</div>
<div>
 <ul>
  <li><a href="http://ark.intel.com/products/67355/Intel-Core-i5-3210M-Processor-3M-Cache-up-to-3_10-GHz-rPGA">Intel&reg;Core(TM)i5-3210M,2.5GHz</a></li>
  <li>Windows 8 (porque no hay posibilidad de no elegirlo &gt;:|)</li>
  <li>Gris plomo (el port&aacute;til es completamente negro, cuerpo y pantalla y los detalles dorados de las teclas no son muy significativos y no se notan mucho)</li>
  <li>Sin pantalla t&aacute;ctil (aunque ahora se le puede elegir como opci&oacute;n cuando lo ped&iacute; no)</li>
  <li>LED 35,5 cm, 1600x900 + webcam (1,3 megap&iacute;xeles)</li>
  <li>Intel&reg; HD Graphics 4000 (sin memoria dedicada, est&aacute; compartida con el sistema)</li>
  <li>500 GB Serial ATA (5400 rpm) de la marca Hitachi con interfaz Sata 2 a 3 Gb/s, aunque el sistema soporta Sata 3 a 6 Gb/s para un disco duro mec&aacute;nico Sata 2 es m&aacute;s que suficiente.</li>
  <li>8 GiB 1600 MHz DDR3 SDRAM (tengo dudas de la m&aacute;xima memoria que admite el equipo, en la p&aacute;gina de EEUU estos modelos se pueden configurar con 16 GiB as&iacute; que supongo que ser&aacute; esa)</li>
  <li>Grabadora de DVD</li>
 </ul>
</div>
<div>
 <b>Detalle de las caracter&iacute;sticas ampliadas</b>
 <br />En la p&aacute;gina de Sony la verdad es que dan bastante poca informaci&oacute;n adicional de las caracter&iacute;sticas t&eacute;cnicas de este modelo por ejemplo entre las cosas que no dicen son:
</div>
<div>
 <ul>
  <li>Que viene con una <a href="http://www.ami.com/Products/BIOSandEFIFirmware/Aptio/">BIOS UEFI AMI Aptio</a> que creo es requisito (lo de que sea UEFI) para todos los port&aacute;tiles que vengan con Windows 8 preinstalado, es decir, que ser&aacute; norma a partir de ahora. Solo es posible entrar en la BIOS o iniciar el sistema desde una memoria USB o DVD estando el port&aacute;til apagado y pulsado el bot&oacute;n ASSIST.</li>
  <li>Que el disco duro es <a href="http://es.wikipedia.org/wiki/Serial_ATA">SATA</a> 3 a 6 Gbps, era de suponer que era esto ya que es lo &uacute;ltimo en estos momentos, pero no lo dicen por ning&uacute;n lado solo dicen que es SATA.</li>
  <li>Creo que los puertos USB 3 son dos y no uno como dicen ellos, es decir tiene dos USB 2 en el lado derecho y otros dos USB 3 en el lado izquierdo.</li>
  <li>Que el disco duro es de 7mm de altura, no se si se le podr&aacute; instalar un disco de 9.5mm, me da que no. Esto hay que tenerlo en cuenta si se tiene intenci&oacute;n de sustituir por un SSD por ejemplo. Lo bueno es que muchos SSD ya est&aacute;n viniendo en formato 7mm y parece que va a ser la norma.</li>
  <li>No tiene bot&oacute;n f&iacute;sico para desconectar la WIFI por lo que siempre estar&aacute; activa, la &uacute;nica manera de desactivarla ser&aacute; por software.</li>
  <li>La foto del teclado que muestran en la p&aacute;gina espa&ntilde;ola no se corresponde con la realidad del teclado querty espa&ntilde;ol, la tecla return no es igual y es m&aacute;s grande en la realidad.</li>
  <li>No dicen si la <a href="http://es.wikipedia.org/wiki/Secure_Digital">tarjeta SD</a> soporta SDXC, pero seg&uacute;n la informaci&oacute;n de <a href="http://www.hwinfo.com/">HWINFO</a> lo soporta.</li>
  <li>No dicen la capacidad de la bater&iacute;a, que es de 5300mAh/59Wh.</li>
  <li>Sonido y red&nbsp;gigabit&nbsp;ethernet proporcionado por Realtek y tarjeta SD por Ricoh, ref wifi Intel Centrino Wireless-N 2230 BGN.</li>
  <li>Que tiene un sensor de luz ambiental con el que se regula autom&aacute;ticamente el brillo de la pantalla y se enciende o apaga el teclado retroiluminado</li>
 </ul>
 <div>
  Nota: estas son los detalles del equipo que me han enviado a mi, quiz&aacute; &nbsp;a lo largo del tiempo o dependiendo de la serie&nbsp;quiz&aacute;&nbsp;var&iacute;e alguna cosa ligeramente.
  <br />
  <br />Cosas que para el usuario normal no le dicen mucho ni le importa no conocerlo pero que quiz&aacute; al usuario avanzado le interese conocer como es mi caso.
  <br />
  <br />
  <b>Recomendaciones al hacer el pago mediante tarjeta de cr&eacute;dito/d&eacute;bito</b>
  <br />El equipo lo compre a trav&eacute;s de la p&aacute;gina de 
  <a href="http://www.sony.es/">Sony espa&ntilde;a</a>,&nbsp;no hay que tenerle miedo ha hacer compras a trav&eacute;s de internet, eso si, teniendo en cuenta una serie de precauciones como hacer la compra desde un equipo que estemos seguros que est&aacute; libre de virus (cuidado los usuarios de Windows que no toman precauciones con lo que instalan y ejecutan en su equipo y navegan con Internet Explorer) ya que vamos a necesitar teclear todo lo necesario para pagar con una tarjeta de cr&eacute;dito: el n&uacute;mero de nuestra tarjeta, su c&oacute;digo de seguridad y la fecha de caducidad, con eso basta para hacer una compra. Otra cosa recomendable es no pagar con los datos de nuestra tarjeta f&iacute;sica sino mediante una tarjeta virtual. Muchas entidades permiten crear tarjetas virtuales a partir de nuestra tarjeta f&iacute;sica, los datos que nos proporcionar&aacute; la entidad bancaria para la tarjeta virtual son &uacute;nicos para hacer una compra pudiendo limitar la cantidad m&aacute;xima aceptada como cargo y asign&aacute;ndole una fecha de caducidad menor que la f&iacute;sica. Por supuesto, el cargo se har&aacute; exactamente igual que si lo hubi&eacute;semos hecho con nuestra tarjeta f&iacute;sica. Suele ser gratuito hacer una tarjeta virtual y tiene las ventajas anteriores en cuanto a seguridad.
  <br />
  <br />
  <b>&Uacute;ltimos comentarios</b>
  <br />Finalmente, dir&eacute; que en Europa parece que para Sony somos tratados como clientes de segunda (otras empresas seguro que nos hacen lo mismo) respecto a los estadounidenses ya que en la p&aacute;gina norteamericana est&aacute; m&aacute;s cuidada, se puede configurar los port&aacute;tiles con m&aacute;s memoria (16 GiB), el port&aacute;til viene con mucho mejores discos duros de serie (750 GiB), en alg&uacute;n momento he visto tambi&eacute;n que se pueden configurar con mejores microprocesadores y todo ello a mejor precio, el mismo equipo que he comprado pero con 16 GiB y 750 GiB de disco duro a 7200 rpm sale mucho m&aacute;s barato,&nbsp;$789.99 frente a 839€ y hay que tener en cuenta que el d&oacute;lar se cotiza significativamente m&aacute;s bajo (al momento de escribir esto 1 euro son 1,30 d&oacute;lares). Ser&aacute; por alguna raz&oacute;n log&iacute;stica, t&eacute;cnica o simplemente que nos nos toman tan en consideraci&oacute;n pero deber&iacute;an mejorarlo, la competencia quiz&aacute; lo haga.
 </div>
</div>
<div>
 <br />
</div>
<div>
 Pues eso va a ser todo por el momento, como esta entrada se me ha alargado mucho dejar&eacute; el desempaquetado y&nbsp;el an&aacute;lisis de este modelo de Sony para la siguiente entrada. Como muestra un par de fotos:
 <br />
 <br />
 <div style="clear: both; text-align: center;">
  <a href="http://4.bp.blogspot.com/-RwRTl2jGSZw/ULILQvphKJI/AAAAAAAABqM/M9ZLVFexeHg/s1600/IMG_162544.jpg"><img height="179" src="http://4.bp.blogspot.com/-RwRTl2jGSZw/ULILQvphKJI/AAAAAAAABqM/M9ZLVFexeHg/s200/IMG_162544.jpg" width="200" /></a>
  <a href="http://2.bp.blogspot.com/-TVCKhCpoHF8/ULILR26yFbI/AAAAAAAABqU/lgX4fqcmggE/s1600/IMG_163140.jpg"><img height="143" src="http://2.bp.blogspot.com/-TVCKhCpoHF8/ULILR26yFbI/AAAAAAAABqU/lgX4fqcmggE/s200/IMG_163140.jpg" width="200" /></a>
 </div>
 <br />Referencia:
 <br />
 <a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html">Desempaquetado Sony Vaio E 14P (SVE14A2C5E)</a>
 <br />
 <a href="http://elblogdepicodev.blogspot.com.es/2012/12/analisis-software-y-bios-sony-vaio-e-14p.html">An&aacute;lisis software y BIOS Sony Vaio E 14P</a>
 <br />
 <a href="http://www.sony.es/">Sony</a>
 <br />
 <a href="http://www.acer.es/">Acer</a>
 <br />
 <a href="http://www.dell.es/">Dell</a>
 <br />
 <a href="http://www.intel.es/">Intel</a>
 <br />
 <a href="http://www.amd.com/es">AMD</a>
 <br />
 <a href="http://www.nvidia.es/">Nvidia</a>
</div></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" st_title="Mi guía para elección de portátil nuevo | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Mi guía para elección de portátil nuevo";
var disqus_url = "http://elblogdepicodev.blogspot.com/2012/12/mi-guia-para-eleccion-de-portatil-nuevo.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/software/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software</a></li><li><a href="/label/microsoft/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta microsoft</a></li><li><a href="/label/tecnologia/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta tecnologia</a></li><li><a href="/label/desempaquetado/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta desempaquetado</a></li><li><a href="/label/hardware/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta hardware</a></li><li><a href="/label/apple/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta apple</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 76,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>