<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Mis experiencias y recomendaciones con los ordenadores | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores"><span itemprop="headline">Mis experiencias y recomendaciones con los ordenadores</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/mis-experiencias-y-recomendaciones-con-los-ordenadores/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-06-12T16:34" itemprop="dateModified">Actualizado el jueves, 12 de junio de 2014 a las 16:34 UTC</span></div><div><span>
Etiquetado como
opinion</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Estos &uacute;ltimos d&iacute;as he estado de cambio en mis equipos. Concretamente he comprado un port&aacute;til Dell con un procesador i5. He contado un poco mi experiencia compr&aacute;ndolo y he recibido alg&uacute;n comentario y alg&uacute;n email pidiendo consejo, debido a esto he decidido escribir este articulo en el cual voy a contar mi experiencia con los distintos ordenadores que he tenido, tambi&eacute;n voy a hacer una serie de recomendaciones respecto al equipo que un usuario necesita cuando se plantea comprar un PC y hablare de marcas de port&aacute;tiles seg&uacute;n los equipos que he tenido.</p>
<p>Antes de empezar me gustar&iacute;a decir algo, esto no es una gu&iacute;a, solo es mi experiencia y es lo que yo aconsejo a todo aquel que me pregunta que ordenador se tiene que comprar, pero quiero recalcar que es solo mi opini&oacute;n, nada mas.</p>
<p>Lo primero que hay que pensar a la hora de comprar un ordenador es para que lo vamos a usar. Para saber que tipo de usuario eres voy a enumerar 4 grupos o tipos de usuario posibles:</p>
<ol>
 <li>Usuarios sin conocimientos de inform&aacute;tica y que solo quieren un ordenador para hacer tareas sencillas como navegar por Internet, usar el Facebook, descargar pel&iacute;culas y m&uacute;sica, ver fotos y mandar emails. Hay mas tareas sencillas, no voy a describirlas todas, pero si no sabes mucho de inform&aacute;tica y no tienes inter&eacute;s por saber, seguramente pertenezcas a este grupo, lo voy a llamar “Grupo 1″.</li>
 <li>El siguiente grupo es el de los usuarios que usan el ordenador como plataforma de juegos y que les gusta usar los &uacute;ltimos juegos del mercado. Lo llamare el “Grupo 2″.</li>
 <li>Este grupo re&uacute;ne a todos aquellos usuarios que saben de inform&aacute;tica y ademas les gusta aprender mas cada d&iacute;a. Les gusta o apasiona cosas como la programaci&oacute;n, el dise&ntilde;o web, los sistemas operativos y trastear con los ordenador en general. Este sera el “grupo 3″.</li>
 <li>El ultimo grupo es el de los profesionales, en el 95% de los casos esos usuarios no necesitaran leer este articulo por que saben perfectamente lo que necesitan. Este es el “grupo 4″.</li>
</ol>
<p>Esta agrupaci&oacute;n que he hecho es muy general y hay usuarios que pueden pertenecer a mas de uno de estos grupos pero a mi me sirve para saber el ordenador que una persona puede necesitar para que no se gaste mas dinero del necesario, y mas en los tiempos que corren.</p>
<p>Si perteneces al grupo 1 mi recomendaci&oacute;n es un port&aacute;til con un procesador de doble n&uacute;cleo, 2 GB de RAM y unas 500 GB de disco duro. Pod&eacute;is comprar un ordenador mejor, pero es malgastar el dinero ya que haciendo las tareas que he descrito anteriormente vais a desperdiciar las caracter&iacute;sticas o recursos del ordenador. Quiz&aacute;s podr&iacute;a ser conveniente ponerle 4 Gb de RAM, pero se puede comprar con 2 y luego ampliarlo si es necesario. Ordenadores de este tipo hay muchos en Ebay y se pueden comprar por&nbsp;unos 150 euros de segunda mano. Entrare en mas detalles sobre las marcas, pero por experiencia las dos mejores son Dell y Lenovo y una de las peores HP. Si os plante&aacute;is comprar un ordenador de segunda mano en Ebay hay que mirar las ventas del vendedor, las opiniones de los usuarios que le han comprado productos y si el vendedor ofrece garant&iacute;a. Tambi&eacute;n esta bien el tema de la bater&iacute;a por una cuesti&oacute;n de independencia, puede que el ordenador tenga, pero en Aliexpress se pueden comprar por unos 25 o 30 euros y duran unas 4 horas, lo digo por experiencia, ya que he comprado en varias ocasiones en dicha pagina.</p>
<p>Si perteneces al grupo 2 entonces deber&iacute;as pensar en un ordenador de sobremesa, son mas potentes y f&aacute;ciles de ampliar o cambiar componentes. Hay que tener en cuenta que si quieres estar al d&iacute;a con los &uacute;ltimos juegos seguramente le tengas que hacer alg&uacute;n cambio o ampliaci&oacute;n cada 2 a&ntilde;os mas o menos. Hoy en d&iacute;a, a fecha de la redacci&oacute;n de este articulo, a una persona que usa el ordenador para jugar yo le recomendar&iacute;a un i7 de cuarta generaci&oacute;n, con 8GB de RAM (que sea en un solo banco, es decir, que no que pongan en el ordenador 2 memorias de 4GB, al ser una de 8 queda un banco libre y se puede ampliar el d&iacute;a de ma&ntilde;ana), recomendar&iacute;a un disco SSD para el sistema operativo y los juegos y otro SATA III para datos personales de al menos 1TB. Tambi&eacute;n es necesario una tarjeta gr&aacute;fica decente, por lo menos una Nvidia con 2GB de RAM.</p>
<p>Si perteneces al grupo 3 entonces creo que seria necesario un i3 o un i5 si vas a usar maquinas virtuales. La memoria RAM deber&iacute;a ser de 4GB m&iacute;nimo, hay que tener en cuenta lo dicho anteriormente con respecto a la RAM y la posibilidad de ampliarla. El disco duro seria suficiente con 500GB.</p>
<p>El grupo 4 seguramente no lee este articulo y sabe que ordenador necesita :D, por lo cual no voy a entrar en detalles.</p>
<p>Ahora os voy a hacer unas recomendaciones en funci&oacute;n de las marcas. Yo he tenido port&aacute;tiles de las siguiente marcas ordenadas de mejor a peor:</p>
<ul>
 <li>Lenovo</li>
 <li>Dell</li>
 <li>Toshiba</li>
 <li>Acer</li>
 <li>Sony VAIO</li>
</ul>
<p>Lenovo y Dell los meter&iacute;a en el mismo saco, he tenido varios que he comprado en Ebay de segunda mano, he ido cambiando de uno a otro mejorando las caracter&iacute;sticas hasta llegar al ultimo Dell que tengo ahora y que espero que me dure mucho tiempo. Aqu&iacute; quiero puntualizar que siempre que he comprado un Dell o Lenovo son de las series profesionales, son ordenadores que no se pueden comprar en Mediamarkt, pertenecen a empresas de renting de ordenadores. El ultimo Lenovo que tuve era un T400, ese modelo cuando salio hace unos 4 o 5 a&ntilde;os costaba unos 1900 euros. Y tengo que decir que los Lenovo son otro mundo, si tienen hasta desag&uuml;e, si hab&eacute;is le&iacute;do bien, desag&uuml;e, si se te cae liquido encima del teclado no se estropean, se cuela y sale por debajo. Los Dell tambi&eacute;n son parecidos a los Lenovo, aunque tengo preferencia por Lenovo. Estos ordenadores se pueden comprar por Ebay por unos 200 euros, el ultimo Dell que he comprado me ha costado 230 euros, gastos de env&iacute;o incluidos y tiene un a&ntilde;o de garant&iacute;a. Tiene un procesador i5 con 6GB de RAM y pantalla LED, ademas venia con un disco de 1TB y lo he cambiado para ponerle un SSD de 120 GB.</p>
<p>&nbsp;</p>
<p><a href="http://elblogdeliher.com/wp-content/uploads/2014/06/1273652028.jpeg"><img src="http://elblogdeliher.com/wp-content/uploads/2014/06/1273652028.jpeg" alt="Latitude E6510 notebook featured on white and gallery gray background." width="400" height="285" /></a></p>
<p>&nbsp;</p>
<p>Otra marca que me gusta mucho es Toshiba, el anterior al que tengo ahora era de esta marca y estuve muy contento con el, pero su procesador no me daba lo suficiente. De la marca Acer fue mi primer port&aacute;til, hace ya unos 15 a&ntilde;os y era una roca, no se cuantas veces se me pudo caer y no se rompi&oacute;. Lo he tenido guardado en un armario, pero hace unas dos semanas lo vend&iacute; para desguace ya que necesitaba financiaci&oacute;n para el Dell que me he comprado, estuve muy contento con el tiempo que le tuve.</p>
<p>Por ultimo tengo un VAIO que esta en el sal&oacute;n, lo usan mis dos hijas y mi mujer, ellas pertenecen al grupo 1 y usan ese ordenador sin problemas. Tiene un procesador de doble n&uacute;cleo a 1,6, tiene 2GB de RAM y un disco duro de 80 GB, esta encendido 24 horas al d&iacute;a y 365 d&iacute;as al a&ntilde;o, casi nunca lo apagamos y no supone ning&uacute;n tipo de limitaci&oacute;n para ellas, tiene Ubuntu 12.04 y va bien.</p>
<p>Con todo esto llegamos al punto en el que podemos tener una base para saber que tipo de ordenador podemos necesitar y no desperdiciar el dinero, si ten&eacute;is alguna duda o quer&eacute;is ayuda mas precisa dejad un comentario y os ayudare, un saludo.</p>
<p>&nbsp;</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores" st_title="Mis experiencias y recomendaciones con los ordenadores | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 610,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2014/06/mis-experiencias-y-recomendaciones-con-los-ordenadores"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>