<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia"><span itemprop="headline">Linux Mint 16 Petra: 7 meses de excelencia</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/12/linux-mint-16-petra-7-meses-de.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-12-03T15:24" itemprop="dateModified">Actualizado el martes, 03 de diciembre de 2013 a las 15:24 UTC</span></div><div><span>
Etiquetado como
revision, linux-mint, cinnamon</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Despu&eacute;s de una gran versi&oacute;n de 
<a href="http://www.lasombradelhelicoptero.com/2013/11/ubuntu-1310-una-version-muy-buena.html">Ubuntu</a> suele venir otra de Linux Mint que no le va a la zaga. Es la l&oacute;gica consecuencia de que &eacute;sta se base en aqu&eacute;lla. Pero como no siempre se cumple lo que en un principio parece obvio, tras acometer el an&aacute;lisis de la distro de Canonical hoy le toca el turno al reciente lanzamiento del equipo liderado por Clem Lefebvre. He usado Linux Mint en distintas etapas de mi vida linuxera, se podr&iacute;a decir que fue la distribuci&oacute;n con la cual empec&eacute; a descubrir que hay todo un mundo m&aacute;s all&aacute; de Ubuntu, digamos que fue la que dispar&oacute; al distrohopper que hay en m&iacute;. No le guardo rencor, pese a todo, m&aacute;s bien al contrario...
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-K31dR4pwb-E/Up3zCEEcGvI/AAAAAAAAEGc/onUsQmLh3oE/s1600/Petra.png"><img height="257" src="http://3.bp.blogspot.com/-K31dR4pwb-E/Up3zCEEcGvI/AAAAAAAAEGc/onUsQmLh3oE/s320/Petra.png" width="320" /></a>
</div>
<br />
<br />
<a></a>Recuerdo con un cari&ntilde;o especial aquellas primeras versiones (para m&iacute; lo fueron, aunque la andadura de Mint se remonta a Ada, en agosto de 2006) con nombre de mujer: Elyssa, Felicia, Gloria, Helena... Muy buenos sistemas, con sus problemas de detecci&oacute;n de hardware inherentes a la &eacute;poca en que nos encontr&aacute;bamos y que hoy, en su gran mayor&iacute;a, han pasado a la historia. A lo largo de todos estos a&ntilde;os el equipo de Mint ha ido poniendo su esfuerzo y dedicaci&oacute;n al servicio de la comunidad GNU/Linux para mejorar en lo posible las respectivas versiones de Ubuntu, puliendo los pocos bordes rugosos que &eacute;stas pudieran tener. Elevando la ya de por s&iacute; excelente Debian al cubo, por as&iacute; decirlo. Y con su decimosexta intentona, lo digo con la boca bien grande, lo han conseguido. Vamos a detenernos en un an&aacute;lisis pormenorizado de un sistema ideal para iniciarse en el ecosistema de Tux que, por desgracia, nace como un gigante con pies de barro debido al rid&iacute;culo tiempo de soporte que tiene. La versi&oacute;n escogida, por su relevancia y su modernidad, ten&iacute;a que ser la de Cinnamon.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />No hay nada nuevo que destacar en el instalador de Linux Mint Petra: es el mismo de siempre, con el aspecto de siempre y, claro est&aacute;, la fiabilidad y rapidez de siempre. En 8 minutos ten&iacute;a el sistema instalado en una de mis particiones de prueba, habiendo detectado Grub tanto a Ubuntu Precise como a 
<a href="http://www.lasombradelhelicoptero.com/2013/09/chakra-fritz-ya-esta-aqui.html">Chakra Fritz</a>. Tras el primer inicio se me advierte de la existencia de 92 paquetes para actualizar. Al contrario que en otras distribuciones todo el escritorio se encuentra en nuestro idioma, sin extra&ntilde;as mezclas de ning&uacute;n tipo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-j5EvwDp9zz0/Up3zSZqqf_I/AAAAAAAAEGo/icVAAEpjzvg/s1600/Captura+de+pantalla+de+2013-12-02+12%253A04%253A12.png"><img height="320" src="http://4.bp.blogspot.com/-j5EvwDp9zz0/Up3zSZqqf_I/AAAAAAAAEGo/icVAAEpjzvg/s400/Captura+de+pantalla+de+2013-12-02+12%253A04%253A12.png" width="400" /></a>
</div>
<br />
<b></b>Procedo a actualizar y a reiniciar, de nuevo sin incidencias. Ante m&iacute; contemplo el mismo &quot;artwork&quot; marca de la casa, que se mueve con fluidez en el nuevo Cinnamon 2.0 ocupando unos escasos 292 Mb de RAM. Para mi regocijo han desaparecido todas los peque&ntilde;os detalles que se me hac&iacute;an molestos en Cinnamon, en su mayor&iacute;a artefactos gr&aacute;ficos, falta de agilidad en la ejecuci&oacute;n de alguna aplicaci&oacute;n o inconsistencias en la barra de tareas. Despu&eacute;s de lanzar varias versiones, por fin tengo la sensaci&oacute;n de que me encuentro ante un entorno de escritorio completo y original, que no parece ya un parche encima de Gnome 3 y que incorpora interesantes novedades como un esquema de sonido para acciones comunes (subir o bajar el volumen o insertar un pendrive), nuevos efectos de escritorio que hacen que ya no se eche de menos al vetusto Compiz, o un m&oacute;dulo de control de las esquinas activas del escritorio, entre otras cosas.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-o0tlq5BEhUM/Up3zrK0QXTI/AAAAAAAAEGs/7AA2tlva6-8/s1600/Captura+de+pantalla+de+2013-12-02+11:48:54.png"><img height="320" src="http://3.bp.blogspot.com/-o0tlq5BEhUM/Up3zrK0QXTI/AAAAAAAAEGs/7AA2tlva6-8/s400/Captura+de+pantalla+de+2013-12-02+11:48:54.png" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;"></div>Sobre la reiteraci&oacute;n en el uso del mismo tema de escritorio e iconos no voy a volver a incidir. Es algo secundario si se tiene en cuenta que la mayor&iacute;a de usuarios proceden a cambiarlo cuando no les gusta, y me imagino que para la pr&oacute;xima versi&oacute;n de soporte extendido (LTS) los desarrolladores se plantear&aacute;n la introducci&oacute;n de novedades.
<br />
<br />
<b>Arranque y apagado</b>
<br />Tiempos de inicio y finalizaci&oacute;n pr&aacute;cticamente calcados a los de Ubuntu Saucy, lo que es algo muy bueno dada la rapidez con que ambas acciones se ejecutan en la distro de Canonical. Como tantos otros sistemas, s&aacute;lvese Chakra y quien pueda, adolece de alguna forma de cambiar el aspecto y dem&aacute;s par&aacute;metros del men&uacute; de arranque, con lo que en caso de precisarlo o desearlo tendremos que recurrir al consabido Grub customizer.
<br />
<b> </b>
<br />
<b>Software</b>
<br />Tampoco hay grandes novedades en el apartado de programas incluidos con Mint Petra. Para ser exactos, ni grandes ni peque&ntilde;as, a excepci&oacute;n de las nuevas versiones de las cl&aacute;sicas aplicaciones que trae la distribuci&oacute;n. Contaremos con Firefox 25, Libreoffice 4.1.2.3, VLC 2.0.8, Gimp 2.8, Banshee 2.6.1 o Nemo 2.0.8. El manejo de actualizaciones contin&uacute;a siendo uno de los puntos fuertes, a pesar de la 
<a href="http://www.muylinux.com/2013/11/18/malas-practicas-seguridad-linux-mint">pol&eacute;mica suscitada</a> por ciertas informaciones que apuntaban a una presunta vulnerabilidad en la forma de tratar estas cuestiones, acusaciones vertidas por Canonical que, a tenor de las contestaciones recibidas, no han sido demostradas. En cualquier caso, basta marcar los niveles de seguridad 4 y 5 en el gestor de actualizaciones si uno est&aacute; preocupado por el asunto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-pz9y84PSnik/Up3zzhub0hI/AAAAAAAAEG0/mMiM7_lYoXc/s1600/Captura+de+pantalla+de+2013-12-02+12:21:22.png"><img height="320" src="http://2.bp.blogspot.com/-pz9y84PSnik/Up3zzhub0hI/AAAAAAAAEG0/mMiM7_lYoXc/s400/Captura+de+pantalla+de+2013-12-02+12:21:22.png" width="400" /></a>
</div>
<br />
<b>Reconocimiento de hardware</b>
<br />Experiencia casi id&eacute;ntica a la vivida con Ubuntu Saucy Salamander, esto es, alg&uacute;n problemilla para echar a andar a mi impresora HP Laserjet 1018 y cero inconvenientes en el resto de perif&eacute;ricos que rodean mi equipo. El problema lo solvent&eacute; tras iniciar el programa hp-setup desde la terminal, si bien dicha aplicaci&oacute;n termina de forma inquietante con un mensaje en letras rojas que indica que no se pudo descargar el controlador necesario. Pues no hay que hacer caso a dicho mensaje apocal&iacute;ptico, al menos en mi caso no hubo que hacer m&aacute;s para que la impresora funcionase.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-kzbAwjc81Xg/Up3z5o95V8I/AAAAAAAAEG8/E4EEzgHoe0I/s1600/Captura+de+pantalla+de+2013-12-02+12:39:20.png"><img height="320" src="http://3.bp.blogspot.com/-kzbAwjc81Xg/Up3z5o95V8I/AAAAAAAAEG8/E4EEzgHoe0I/s400/Captura+de+pantalla+de+2013-12-02+12:39:20.png" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />Perfecta conexi&oacute;n del sistema con el port&aacute;til, pudiendo ver archivos de v&iacute;deo en &quot;streaming&quot; directo v&iacute;a wifi. Los dispositivos conectados son reconocidos y se permite el acceso a todos los archivos sin restricci&oacute;n alguna.
<br />
<br />
<b>Experiencia &quot;out of the box&quot;</b>
<br />Realmente excelente. La sensaci&oacute;n de &quot;instalar y listo&quot; es plena en esta distribuci&oacute;n, lo que la convierte sencillamente en la ideal para no iniciados. S&iacute;, ya s&eacute; que Ubuntu ofrece algo muy parecido, pero con Cinnamon permanece el paradigma de escritorio cl&aacute;sico, por lo que alguien que venga de Windows pr&aacute;cticamente no notar&aacute; el cambio, en sus connotaciones negativas claro, que para bien s&iacute; que lo va a notar en las muchas virtudes que los que llevamos a&ntilde;os con GNU/Linux ya de sobra conocemos. Resumiendo: todo funciona, todo se reproduce y no hace falta instalar nada. No se puede pedir m&aacute;s.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-C1TCW3STVEc/Up30CXqlfFI/AAAAAAAAEHE/NGiuKmMFLck/s1600/Captura+de+pantalla+de+2013-12-02+12:49:40.png"><img height="320" src="http://2.bp.blogspot.com/-C1TCW3STVEc/Up30CXqlfFI/AAAAAAAAEHE/NGiuKmMFLck/s400/Captura+de+pantalla+de+2013-12-02+12:49:40.png" width="400" /></a>
</div>
<br />
<b>Estabilidad</b>
<br />Si cogemos Ubuntu Saucy y eliminamos los cada vez m&aacute;s escasos mensajes de error al cerrar alguna aplicaci&oacute;n obtenemos... un sistema tan estable como el mejor 
<a href="http://www.lasombradelhelicoptero.com/2013/05/debian-7-wheezy-una-autentica-roca.html">Debian</a>. Nada m&aacute;s que a&ntilde;adir.
<br />
<br />
<b>Fluidez y desempe&ntilde;o del sistema</b>
<br />La sensaci&oacute;n de &quot;atrancarse&quot; que notaba en ocasiones cuando usaba versiones anteriores de Cinnamon ha desaparecido por entero. El escritorio se siente muy fluido y ligero, apenas ocupa 300 Mb de RAM de inicio y la experiencia de uso es una gozada.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-mzNzbe9tKUE/Up30J-pc4kI/AAAAAAAAEHM/NH2z1Y8Oi_Q/s1600/Captura+de+pantalla+de+2013-12-02+12:07:59.png"><img height="320" src="http://2.bp.blogspot.com/-mzNzbe9tKUE/Up30J-pc4kI/AAAAAAAAEHM/NH2z1Y8Oi_Q/s400/Captura+de+pantalla+de+2013-12-02+12:07:59.png" width="400" /></a>
</div>
<br />
<b>Gesti&oacute;n de energ&iacute;a</b>
<br />La pantalla entra en modo de reposo cuando debe y la suspensi&oacute;n funciona perfectamente. Los problemas acontecidos en la hibernaci&oacute;n, que me imposibilitaban retornar al entorno gr&aacute;fico tras encender el equipo, resultaron ser responsabilidad del controlador libre de ATI/AMD, pues tras la instalaci&oacute;n de Catalyst desaparecieron por completo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Aqw2stONcbI/Up30WD0todI/AAAAAAAAEHU/2w4OIA3-mrs/s1600/Captura+de+pantalla+de+2013-12-02+13:38:27.png"><img height="320" src="http://4.bp.blogspot.com/-Aqw2stONcbI/Up30WD0todI/AAAAAAAAEHU/2w4OIA3-mrs/s400/Captura+de+pantalla+de+2013-12-02+13:38:27.png" width="400" /></a>
</div>
<br />
<b>Personalizaci&oacute;n</b>
<br />Con el paso de las versiones Cinnamon va incorporando m&aacute;s y m&aacute;s a&ntilde;adiduras que lo complementan, en forma de extensiones, applets y desklets. No soy muy amigo de los dos &uacute;ltimos, pero he de decir que instal&eacute; cosas como el reloj de escritorio o el parte meteorol&oacute;gico sin m&aacute;s complicaci&oacute;n. En cuanto a las extensiones, Cinnamon ya incluye las m&aacute;s usadas de serie, de modo que tan solo tuve que ocuparme de instalar la meteorolog&iacute;a para la barra de tareas y el bot&oacute;n de apagado, que me gusta tenerlo a la derecha del reloj. Recuerdo que, en especial la extensi&oacute;n meteorol&oacute;gica fallaba m&aacute;s que una escopeta de feria, cosa que ahora no sucede. Trabajo bien hecho.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-rmsSkaVDezA/Up30dOrPVoI/AAAAAAAAEHc/GjJh9JxHMDs/s1600/Captura+de+pantalla+de+2013-12-02+13:16:15.png"><img height="320" src="http://3.bp.blogspot.com/-rmsSkaVDezA/Up30dOrPVoI/AAAAAAAAEHc/GjJh9JxHMDs/s400/Captura+de+pantalla+de+2013-12-02+13:16:15.png" width="400" /></a>
</div>
<br />En lo referente a programas, tuve la oportunidad de comprobar el buen funcionamiento y f&aacute;cil instalaci&oacute;n (PPA mediante) de Spotify y Variety. Los controladores propietarios de ATI/AMD, vulgo Catalyst, se pueden descargar e instalar desde la entrada &quot;Controladores adicionales&quot; del men&uacute; principal de Cinnamon.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-stNge2JBh2w/Up30j4fyKzI/AAAAAAAAEHk/FtY5RUM-UnY/s1600/Captura+de+pantalla+de+2013-12-02+13:35:13.png"><img height="320" src="http://2.bp.blogspot.com/-stNge2JBh2w/Up30j4fyKzI/AAAAAAAAEHk/FtY5RUM-UnY/s400/Captura+de+pantalla+de+2013-12-02+13:35:13.png" width="400" /></a>
</div>
<br />
<b>Pruebas de rendimiento</b>
<br />Puesto que pr&aacute;cticamente incorpora el mismo kernel, de la serie 3.11.0, que Ubuntu Saucy, era de esperar que los resultados fueran parejos a los logrados con la distro de Canonical. Mint empeora ligeramente en dos de las pruebas y mejora en otras tantas a Ubuntu. La quinta de ellas, el test Apache, no pude realizarla debido a divergencias en las versiones que la Phoronix Test Suite pretende descargar y las disponibles a d&iacute;a de hoy en los servidores de Apache. Pero, visto el patr&oacute;n de resultados cosechado, cabe esperar que se asemeje al de la distro en que se basa, con lo que se indica el mismo valor. En cualquier caso no tiene un peso excesivo, m&aacute;s bien m&iacute;nimo, en la obtenci&oacute;n de la fant&aacute;stica nota que otorgamos a esta versi&oacute;n de Linux Mint.
<br />
<b> </b>
<br />Una nota, la m&aacute;xima posible, que es la primera vez en m&aacute;s de dos a&ntilde;os de andadura de este blog que se la concedemos a una distribuci&oacute;n. Desde sus inicios, LSDH se ha caracterizado por centrar sus an&aacute;lisis en un p&uacute;blico concreto, el que a mi juicio precisa de m&aacute;s informaci&oacute;n y ayuda, que no es otro que el que se inicia en el conocimiento y uso de GNU/Linux. Este es el motivo de que nuestra plantilla de calificaciones d&eacute; la m&aacute;xima importancia a unos aspectos y no a otros. Teniendo en cuenta estas premisas, a nadie deber&iacute;a extra&ntilde;ar que Linux Mint Petra, siendo como es una de las distribuciones m&aacute;s populares y enfocadas a este tipo de usuarios, alcance el 
<i>cum laude</i>.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-BhoTcCkOi7E/Up30zr5IO8I/AAAAAAAAEHs/6GT8nokgR4I/s1600/Captura+de+pantalla+de+2013-12-02+13:10:27.png"><img height="320" src="http://2.bp.blogspot.com/-BhoTcCkOi7E/Up30zr5IO8I/AAAAAAAAEHs/6GT8nokgR4I/s400/Captura+de+pantalla+de+2013-12-02+13:10:27.png" width="400" /></a>
</div>
<br />Pero pensar que esto es &uacute;nicamente m&eacute;rito de Lefebvre y su equipo ser&iacute;a quedarnos cortos en nuestra apreciaci&oacute;n. Lo cierto es que GNU/Linux, en su conjunto, ha avanzado de un modo tan impresionante en todos los &aacute;mbitos en un per&iacute;odo de tiempo tan relativamente corto que tenemos, hoy por hoy, un sistema fant&aacute;stico en su base, que aderezado con algunos toques personales (cada distro da los suyos) viene a resultar en esto que presenta el equipo de Linux Mint. Un sistema robusto, f&aacute;cil de usar, gratuito y de una calidad suprema. Y esto se ha conseguido gracias a Debian, a Ubuntu, a Linux Mint y a todos los que colaboramos en lo posible con nuestros granitos de arena particulares. Estamos de enhorabuena.
<br />
<br />L&aacute;stima que esta maravilla de sistema operativo peque de inconsistencia en el aspecto relativo al tiempo de soporte ofrecido, que finaliza en julio de 2014. Se podr&aacute; arg&uuml;ir que para eso existen las versiones de soporte extendido (Maya, en el caso de Linux Mint, que extiende el suyo hasta 2017). Pero no es de Maya de quien estamos hablando hoy, sino de Petra, y esta &uacute;ltima tiene un ciclo de vida a todas luces muy corto, que sin embargo no ensombrece la gran experiencia ofrecida. Para finalizar, me dirijo a los posibles usuarios de otros sistemas que est&eacute;n pensando en saltar a GNU/Linux: dejen de darle vueltas. Linux Mint 16 Petra es el sistema perfecto para empezar... y hasta para acabar. Un saludo a todos.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-E2DhdWHeA-o/Up30-Jq6SnI/AAAAAAAAEH0/kE40qKepr6s/s1600/Captura+de+pantalla+de+2013-12-02+13:32:13.png"><img height="320" src="http://1.bp.blogspot.com/-E2DhdWHeA-o/Up30-Jq6SnI/AAAAAAAAEH0/kE40qKepr6s/s400/Captura+de+pantalla+de+2013-12-02+13:32:13.png" width="400" /></a>
</div>
<br />
<b>LO MEJOR</b>
<br />
<ul>
 <li>Versi&oacute;n muy mejorada de Cinnamon</li>
 <li>Gran cantidad de programas disponibles</li>
 <li>La sencillez de uso</li>
</ul>
<br />
<b>LO PEOR</b>
<br />
<ul>
 <li><b>&nbsp;</b>Sin duda alguna, el tiempo de soporte<b> </b></li>
</ul>
<ul></ul>
<div style="text-align: center;">
 <br />
 <b>FICHA T&Eacute;CNICA</b>
</div>
<div style="text-align: center;">
 Distribuci&oacute;n: Linux Mint 16 Petra
</div>
<div style="text-align: center;">
 Entorno de escritorio: Cinnamon 2.0.14
</div>
<div style="text-align: center;">
 Kernel: 3.11.0-12
</div>
<div style="text-align: center;">
 Xorg: 1.14.3
</div>
<div style="text-align: center;">
 Driver gr&aacute;fico: fglrx 13.10.10
</div>
<div style="text-align: center;">
 OpenGL: 4.2.12337
</div>
<div style="text-align: center;">
 GCC: 4.8
</div>
<div style="text-align: center;">
 <br />
</div>
<div style="text-align: center;">
 <br />
</div>
<table>
 <tbody>
  <tr>
   <th>LINUX MINT PETRA</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>8,75</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>9,50</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10,00</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>8,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.013,00</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>22.541,78</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>8,37</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,60</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>424,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>0,37</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>10,00</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia" st_title="Linux Mint 16 Petra: 7 meses de excelencia | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 324,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/12/linux-mint-16-petra-7-meses-de-excelencia"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>