<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion"><span itemprop="headline">Linux Mint 17.1 Rebecca: triste regresión</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/12/linux-mint-171-rebecca-triste-regresion.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-12-11T15:22" itemprop="dateModified">Actualizado el jueves, 11 de diciembre de 2014 a las 15:22 UTC</span></div><div><span>
Etiquetado como
revision, linux-mint, cinnamon</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Menuda racha llevamos con los an&aacute;lisis del blog, con lo feliz que a un servidor le hace revisar una distribuci&oacute;n GNU/Linux casi perfecta, que poder recomendar a diestro y siniestro. Como, por ejemplo, oh tremenda iron&iacute;a, un par de versiones anteriores a esta Linux Mint Rebecca. Recuerdo lo bien que iba Petra, sin errores, con un rendimiento digno de reconocimiento, aunque algo escasa de soporte... Pues no hay manera, se&ntilde;or@s, y lo reconozco con pesar: las dichosas regresiones en GNU/Linux me tienen frito. Nuevas funcionalidades, algunas muy vistosas desde el punto de vista est&eacute;tico, otras que a&ntilde;aden facilidad para el usuario, que llaman poderosamente la atenci&oacute;n en las nuevas versiones lanzadas de ciertas distribuciones. Todo ello, lamentablemente, se queda en agua de borrajas cuando nos encontramos, como es el caso que hoy nos ocupa, con un grave fallo que echa a perder toda la experiencia.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-kGJyFE1oxfo/Tte0OonfsaI/AAAAAAAAAR0/LeeGYW67fmY/s1600/mint_logo.png"><img src="http://3.bp.blogspot.com/-kGJyFE1oxfo/Tte0OonfsaI/AAAAAAAAAR0/LeeGYW67fmY/s1600/mint_logo.png" height="320" width="320" /></a>
</div>
<br />
<br />
<a></a>Y es que Cinnamon siempre me pareci&oacute; una gran idea, al principio con sus problemas l&oacute;gicos, pero que poco a poco se fue transformando en un escritorio de una utilidad estimable, en especial para aquellos que no consegu&iacute;an adaptarse a los nuevos paradigmas de trabajo que introdujeron Gnome 3 y Unity. 
<a href="http://www.lasombradelhelicoptero.com/2013/04/linux-mint-debian-edition.html">Distintas</a> 
<a href="http://www.lasombradelhelicoptero.com/2013/06/linux-mint-15-olivia-canela-en-rama.html">versiones</a> de Linux Mint me hicieron reconciliarme con el entorno de escritorio, muy fall&oacute;n y lento en mi equipo en sus comienzos, para concluir con la puntuaci&oacute;n perfecta para 
<a href="http://www.lasombradelhelicoptero.com/2013/12/linux-mint-16-petra-7-meses-de.html">Petra</a>, que en su d&iacute;a todos celebramos. Veamos por qu&eacute; motivo hoy no estamos de fiesta.
<br />
<br />
<b>Instalaci&oacute;n</b>
<br />Aqu&iacute; hay poco que comentar, en tanto en cuanto Mint contin&uacute;a con la apariencia y la funcionalidad de siempre. O, para ser m&aacute;s exactos, la l&iacute;nea de &quot;artwork&quot; iniciada en Linux Mint 10 Julia, que vaya si ha llovido desde entonces. El mismo fondo de pantalla, el mismo tema de escritorio (con alguna variaci&oacute;n menor), el viejo y amigable Mint que todos conocemos, para concretar. En las fuentes tipogr&aacute;ficas s&iacute; se aprecia alguna diferencia, con el uso de Noto, y un gran renderizado a la par. Bastante por encima de la mayor&iacute;a de distribuciones que conozco, en este sentido. El grub sigue sin estar tematizado, algo que no debiera ser demasiado trabajoso y aportar&iacute;a un plus de calidad al ya de por s&iacute; bien cuidado aspecto general.
<br />
<b> </b>
<br />Algo que s&iacute; se ha hecho con la pantalla de &quot;login&quot;, que nos muestra una sucesi&oacute;n de bellos fondos de pantalla paisaj&iacute;sticos muy de agradecer. Un detalle de los desarrolladores para con el usuario, como tambi&eacute;n lo supone el hecho de que se recuerde la contrase&ntilde;a de la red wifi introducida en la sesi&oacute;n &quot;live&quot;, de manera que tras el primer reinicio al nuevo sistema no es necesario volverla a introducir. Son las peque&ntilde;as cosas que hacen de Mint una distro puntera en cuanto a facilidad de uso y apariencia.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-33nCnTvgn5M/VImM0i_R9nI/AAAAAAAAFXs/Tx4MlqZUr-Y/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B17%3A48%3A36.png"><img src="http://3.bp.blogspot.com/-33nCnTvgn5M/VImM0i_R9nI/AAAAAAAAFXs/Tx4MlqZUr-Y/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B17%3A48%3A36.png" height="320" width="400" /></a>
</div>
<br />El cl&aacute;sico escudo de la bandeja del sistema nos muestra, como de costumbre, las actualizaciones disponibles ordenadas por niveles de seguridad. Algo que tambi&eacute;n es &uacute;nico en esta distro, donde se grad&uacute;an del 1 al 5 dependiendo de cuan peligrosas puedan resultar para la estabilidad de nuestro sistema. Como ya ocurr&iacute;a en la &uacute;ltima versi&oacute;n, que no llegamos a analizar en este blog, podemos ver todos los niveles, aunque el 4 y 5 (dbus ser&iacute;a un ejemplo del primer caso, y el kernel del segundo) aparecen deshabilitados por defecto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-2z85LPiaX6M/VImM631PK2I/AAAAAAAAFX0/8_V7iVuqIvU/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A01%3A55.png"><img src="http://2.bp.blogspot.com/-2z85LPiaX6M/VImM631PK2I/AAAAAAAAFX0/8_V7iVuqIvU/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A01%3A55.png" height="320" width="400" /></a>
</div>
<br />Tras la actualizaci&oacute;n de rigor y el consiguiente reinicio, no hay problemas ni errores que lamentar. Eso s&iacute;, merece la pena perder algo de tiempo entrando al m&oacute;dulo de &quot;Idiomas&quot; de la configuraci&oacute;n general del sistema y eliminando la gran mayor&iacute;a de los 43 (s&iacute;, le&eacute;is bien, cuarenta y tres) instalados. Con el ingl&eacute;s de los &quot;states&quot; y el castellano, a m&iacute; me vale. De igual manera recomiendo entrar en &quot;Or&iacute;genes del software&quot;, donde podemos elegir el mejor espejo como repositorio principal con una facilidad pasmosa, al ordenarse todos los disponibles seg&uacute;n el tiempo de respuesta (un ping, supongo).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-5rJe3trM2cw/VImOE6odzBI/AAAAAAAAFYM/J6kUW3kEOPc/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A10%3A27.png"><img src="http://1.bp.blogspot.com/-5rJe3trM2cw/VImOE6odzBI/AAAAAAAAFYM/J6kUW3kEOPc/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A10%3A27.png" height="320" width="400" /></a>
</div>
<div style="clear: both; text-align: center;"></div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-9EBInZNsuvc/VImNYOpCiII/AAAAAAAAFYE/DZ9bQC0Bpjo/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A13%3A27.png"><img src="http://2.bp.blogspot.com/-9EBInZNsuvc/VImNYOpCiII/AAAAAAAAFYE/DZ9bQC0Bpjo/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A13%3A27.png" height="320" width="400" /></a>
</div>
<br />
<b>Arranque y apagado</b>
<br />Si queremos modificar el grub de un modo gr&aacute;fico tendremos que instalar un programa adicional, como es el caso del Grub-customizer, mediante PPA. Los tiempos de inicio y apagado del sistema son m&aacute;s que correctos: 41 segundos para entrar y 6 para salir.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-bR5XsxoZ-kQ/VImOcN6TNKI/AAAAAAAAFYU/f-o2-5EqcJQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A19%3A33.png"><img src="http://2.bp.blogspot.com/-bR5XsxoZ-kQ/VImOcN6TNKI/AAAAAAAAFYU/f-o2-5EqcJQ/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-08%2B18%3A19%3A33.png" height="320" width="400" /></a>
</div>
<br />
<b>Software</b>
<br />MintInstall se encarga de facilitarnos la instalaci&oacute;n de programas, siendo una utilidad que, en general, se maneja con m&aacute;s fluidez y es m&aacute;s simple que su equivalente para Ubuntu, distribuci&oacute;n en la que Linux Mint se basa desde sus comienzos. De serie contamos con Firefox como navegador, VLC y V&iacute;deos para multimedia, Banshee para m&uacute;sica, Gimp para retoques gr&aacute;ficos y Libreoffice como &quot;suite&quot; ofim&aacute;tica.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-PjiVEq0XQNo/VImO2_QC9rI/AAAAAAAAFYc/_zSJtzJYD2s/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A27%3A06.png"><img src="http://1.bp.blogspot.com/-PjiVEq0XQNo/VImO2_QC9rI/AAAAAAAAFYc/_zSJtzJYD2s/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A27%3A06.png" height="320" width="400" /></a>
</div>
<br />
<b>Reconocimiento de hardware</b>
<br />M&aacute;s o menos lo habitual para mi equipo: un ratillo para configurar la impresora y todo perfecto para la webcam, el esc&aacute;ner y la tarjeta de red inal&aacute;mbrica. La instalaci&oacute;n de los controladores propietarios de AMD se puede hacer sin temores gracias a la inclusi&oacute;n de un m&oacute;dulo &quot;Administrador de controladores&quot; que nos facilita, una vez m&aacute;s como es norma, el trabajo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-YhcRzEuDGSU/VImPDV61DFI/AAAAAAAAFYk/jipfnJN_5q8/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B16%3A13%3A48.png"><img src="http://3.bp.blogspot.com/-YhcRzEuDGSU/VImPDV61DFI/AAAAAAAAFYk/jipfnJN_5q8/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B16%3A13%3A48.png" height="320" width="400" /></a>
</div>
<br />La impresora, desde el punto de vista del usuario novel, puede suponer alg&uacute;n problema si se opta por instalarla desde el m&oacute;dulo incluido en el men&uacute; de Mint. Dicho m&oacute;dulo instala el controlador libre foo2zjs, que anta&ntilde;o iba bien, pero que en la actualidad no provoca el resultado deseado, esto es, que la impresora funcione. Por ello recomiendo usar directamente la utilidad &quot;hp-setup&quot;, incluida en el paquete &quot;hplip-gui&quot;, f&aacute;cilmente instalable desde el centro de software.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-IWarqXoxd1k/VImPK9QR8YI/AAAAAAAAFYs/Nvbv_7wOE8M/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A34%3A35.png"><img src="http://1.bp.blogspot.com/-IWarqXoxd1k/VImPK9QR8YI/AAAAAAAAFYs/Nvbv_7wOE8M/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A34%3A35.png" height="320" width="400" /></a>
</div>
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-moxyE9RdP9g/VImPjo91G6I/AAAAAAAAFY8/zO_llNh-HDU/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A42%3A45.png"><img src="http://1.bp.blogspot.com/-moxyE9RdP9g/VImPjo91G6I/AAAAAAAAFY8/zO_llNh-HDU/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B16%3A42%3A45.png" height="320" width="400" /></a>
</div>
<br />
<b>Conectividad</b>
<br />En distintos comentarios de otras revisiones pasadas he observado a alg&uacute;n que otro lector extra&ntilde;ado de mis problemas con Samba. Yo insisto en mi postura: sol&iacute;a ir bien con casi todas las distribuciones y ahora no funciona en ninguna. Que s&iacute;, que puedo perder el tiempo en configuraciones y dem&aacute;s... pero no me apetece volver a eso. No entiendo el porqu&eacute; de esta regresi&oacute;n y adem&aacute;s, al llover sobre mojado, incluso me llega a molestar. Abst&eacute;nganse los talibanes del &quot;colabora y lo arreglas t&uacute;&quot;, pues no soy programador. En resumen: seguimos igual, &quot;no Samba, no party&quot;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-MtEcPS0ZeVM/VImPYLswfYI/AAAAAAAAFY0/AF6ZFxAoiNE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B17%3A25%3A44.png"><img src="http://3.bp.blogspot.com/-MtEcPS0ZeVM/VImPYLswfYI/AAAAAAAAFY0/AF6ZFxAoiNE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B17%3A25%3A44.png" height="320" width="400" /></a>
</div>
<br />Los dispositivos externos se conectan y son reconocidos. Los tiempos de lectura y escritura son buenos, similares a los de Ubuntu salvo en &quot;pendrive&quot;, bastante m&aacute;s lento. Si el dispositivo introducido contiene archivos multimedia, se lanza un importador, lo que supone otro paso m&aacute;s en pos de la facilidad de uso. Detalle a detalle se crea una gran impresi&oacute;n general que, por desgracia, acaba de un plumazo como veremos pronto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-n30yJmgwq0Y/VImQE38JO5I/AAAAAAAAFZM/i1tmlMziZiI/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B18%3A38%3A04.png"><img src="http://2.bp.blogspot.com/-n30yJmgwq0Y/VImQE38JO5I/AAAAAAAAFZM/i1tmlMziZiI/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B18%3A38%3A04.png" height="320" width="400" /></a>
</div>
<br />
<b>Experiencia de uso</b>
<br />Linux Mint es casi inigualable en este aspecto. Incluye de serie todos los &quot;codecs&quot; y utilidades necesarias para cualquier tarea que precise un usuario medio. A tal punto llega que hasta se pueden reproducir archivos de v&iacute;deo digital puro (.dv), con el programa V&iacute;deos, algo que no he logrado en ninguna otra distribuci&oacute;n. Simplemente, perfecto.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-9aUIfaexCTw/VImP2ELcwDI/AAAAAAAAFZE/PPA6bU5U1a0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B13%3A51%3A21.png"><img src="http://1.bp.blogspot.com/-9aUIfaexCTw/VImP2ELcwDI/AAAAAAAAFZE/PPA6bU5U1a0/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B13%3A51%3A21.png" height="320" width="400" /></a>
</div>
<br />
<b>Estabilidad</b>
<br />Cuando ide&eacute; el sistema de puntuaciones que sostiene el blog ten&iacute;a dos cosas en mente: premiar la facilidad de uso para noveles en GNU/Linux y la estabilidad por encima de todo. Por este motivo, cualquier error de dicha &iacute;ndole es fuertemente castigado en la nota final. Y esto, como os tem&iacute;ais, es lo que ocurre aqu&iacute;.
<br />
<b> </b>
<br />El fallo en cuesti&oacute;n no es de gravedad extrema, pues el sistema no se congela. Pero, de cuando en cuando y de un modo totalmente aleatorio, me encuentro con que Cinnamon no inicia ninguna ventana de modo tradicional. Esto es, ni mediante iconos de la barra de tareas ni usando el men&uacute;. Digamos que quiero abrir Firefox, pulso el icono, aparece el cursor de espera y... eso es todo. Tal como aparece, desaparece. Lo mismo con la terminal, con Nemo, con cualquier cosa.
<br />
<br />Para a&ntilde;adir misterio al tema (o no, depende de los conocimientos de cada cual), si ejecuto un atajo de teclado, s&iacute; que se abre. Lo comprob&eacute; con la terminal, a la que pude acceder con CTRL + ALT + T, pudiendo observar un mont&oacute;n de l&iacute;neas de &quot;permiso denegado&quot;, como muestra la imagen.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-NSTtJLHRreM/VImXYNWEHkI/AAAAAAAAFZc/Wy-JQa-wdWg/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B18%3A13%3A38.png"><img src="http://3.bp.blogspot.com/-NSTtJLHRreM/VImXYNWEHkI/AAAAAAAAFZc/Wy-JQa-wdWg/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B18%3A13%3A38.png" height="320" width="400" /></a>
</div>
<br />Esto, como digo, ocurre sin m&aacute;s. No parece obedecer a algo concreto, solamente sucede y el &uacute;nico modo de devolver el sistema a la normalidad es reiniciando el equipo, pues el &quot;Reiniciar Cinnamon&quot; de la barra de tareas no lo arregla. Y si trato de reiniciar sesi&oacute;n, una inquietante ventana con el mensaje &quot;Su sesi&oacute;n ha durado menos de 10 segundos&quot; me devuelve una y otra vez a lo mismo. Frustrante como poco, se puede decir que este fallo arruina lo que hasta entonces era una gran experiencia de uso. Una l&aacute;stima.
<br />
<br />
<b>Fluidez</b>
<br />Exceptuando lo visto en el p&aacute;rrafo anterior, todo lo dem&aacute;s va muy bien, y ello incluye un sistema que responde con rapidez y fluidez al uso.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-aGuqCwjGXok/VImXqVLlY7I/AAAAAAAAFZk/zBCTKqiZrrE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B18%3A57%3A19.png"><img src="http://1.bp.blogspot.com/-aGuqCwjGXok/VImXqVLlY7I/AAAAAAAAFZk/zBCTKqiZrrE/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-09%2B18%3A57%3A19.png" height="320" width="400" /></a>
</div>
<br />
<b>Gesti&oacute;n de la energ&iacute;a</b>
<br />M&aacute;s de lo mismo, en raci&oacute;n doble: ni suspensi&oacute;n ni hibernaci&oacute;n. Como siempre, Catalyst en el punto de mira. &iquest;Por qu&eacute;, AMD, por qu&eacute; este castigo? Qu&eacute; cruz...
<br />
<b> </b>
<br />
<b>Rendimiento del sistema</b>
<br />Teniendo en cuenta que la base de Linux Mint es Ubuntu, uno esperar&iacute;a resultados parejos entre ambas distribuciones. Y as&iacute; es, en la mayor&iacute;a de apartados, destacando Mint en lo negativo con el test de codificaci&oacute;n de audio (casi 5 segundos m&aacute;s que Ubuntu, resultado comprobado), as&iacute; como el ya mencionado desfase de copia en el &quot;pendrive&quot;. Igualmente, Mint tambi&eacute;n rinde peor en el &quot;benchmark&quot; gr&aacute;fico Unigine Valley, con 20 puntos menos de valoraci&oacute;n.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-iPp5vfbslmg/VImXywPgGkI/AAAAAAAAFZs/fLVSWsu1K7o/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B18%3A05%3A52.png"><img src="http://1.bp.blogspot.com/-iPp5vfbslmg/VImXywPgGkI/AAAAAAAAFZs/fLVSWsu1K7o/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B18%3A05%3A52.png" height="320" width="400" /></a>
</div>
<br />
<b>Las regresiones, una a una</b>
<br />Llegado este punto se me ocurre que ser&iacute;a buena idea comparar la &quot;perfecci&oacute;n&quot; de Linux Mint Petra en mi equipo con las molestas regresiones encontradas en Rebecca. Veamos, pues:
<br />
<b> </b>
<br />
<b></b>- Arranque y apagado m&aacute;s lentos que en Petra. Esto es anecd&oacute;tico, al ser una diferencia muy peque&ntilde;a y carente de importancia.
<br />
<br />- La impresora no funciona con foo2zjs, el controlador libre. En Petra opt&eacute; por instalar directamente el privativo, de modo que no se puede probar la regresi&oacute;n, pero es cierto que en versiones anteriores s&iacute; que he podido constatar que funcionaba.
<br />
<br />- Samba ya no conecta &quot;de serie&quot;. En Petra s&iacute; lo hac&iacute;a.
<br />
<br />- Estabilidad del escritorio. El Cinnamon de Petra no me plante&oacute; problemas. En Rebecca, ya hemos comentado el desaguisado.
<br />
<br />- Gesti&oacute;n de energ&iacute;a. En Petra pod&iacute;a suspender e hibernar el equipo. Nada de esto es posible en Rebecca.
<br />
<br />Recapitulando que es gerundio. &iquest;Cu&aacute;ndo podremos librarnos en GNU/Linux de estas molestas y continuas regresiones? La insistente sensaci&oacute;n de que estamos usando una &quot;beta&quot;, &iquest;se acabar&aacute; alg&uacute;n d&iacute;a? &iquest;Por qu&eacute; existe esa necesidad, casi patol&oacute;gica, en desarrolladores y usuarios de seguir sacando versiones nuevas sin parar cuando todav&iacute;a no se han perfeccionado las antiguas? &iquest;Merece la pena introducir funcionalidades nuevas cuando se arruina la experiencia de uso estable de anteriores sistemas?
<br />
<br />Son muchas preguntas de golpe, lo reconozco. Y la respuesta a muchas de ellas no es simple en absoluto. Como nos conocemos (algunos, que nadie se me vaya a enfadar), este art&iacute;culo no pretende arrojar improperios contra GNU/Linux, solo es una revisi&oacute;n m&aacute;s. El problema es que esperaba encontrar continuidad a la maravilla que supuso Linux Mint 16 Petra, cuyo soporte ya expir&oacute;, por cierto. Y en su lugar, me encuentro con que tengo que reiniciar el sistema cada dos por tres, no puedo poner el equipo en modo suspensi&oacute;n, no puedo usar el controlador libre de la impresora, tengo que hacer labor detectivesca para conectarme a mi port&aacute;til sobre por qu&eacute; Samba no quiere funcionar...
<br />
<br />Tenemos, por lo tanto, un sistema con una excepcional facilidad de uso de cara al usuario con pocos conocimientos, con herramientas que mejoran las incluidas en otras distribuciones, y un cuidado aspecto. Todo ello se va por el desag&uuml;e por culpa de errores groseros que no estaban presentes, en su mayor&iacute;a, en anteriores versiones. &iquest;Qu&eacute; necesidad hay de esto?
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-4OT94pLA8zw/VImX6elxWOI/AAAAAAAAFZ0/E2MSBf7I8Lo/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B19%3A58%3A57.png"><img src="http://4.bp.blogspot.com/-4OT94pLA8zw/VImX6elxWOI/AAAAAAAAFZ0/E2MSBf7I8Lo/s1600/Captura%2Bde%2Bpantalla%2Bde%2B2014-12-10%2B19%3A58%3A57.png" height="320" width="400" /></a>
</div>
<br />La respuesta, como os dec&iacute;a, quiz&aacute;s no sea sencilla. O tal vez s&iacute;: seguir con lo que conocemos y sabemos que va bien, por antiguo que pueda parecernos. 
<a href="http://www.lasombradelhelicoptero.com/2012/05/linux-mint-13-maya-larga-vida-mate.html">Linux Mint 13 Maya</a>, por ejemplo, todav&iacute;a tiene soporte a d&iacute;a de hoy. Y no ha pasado tanto tiempo desde que vio la luz, en realidad. Sostiene Clem Lefebvre, a la saz&oacute;n &quot;alma m&aacute;ter&quot; de esta distribuci&oacute;n, que si algo funciona, &iquest;para qu&eacute; cambiarlo? Creo que ha de tener raz&oacute;n, visto lo visto, pues con cada revisi&oacute;n que acometo las cosas parecen torcerse en uno o en otro sentido. En lo estrictamente referido a Linux Mint, puesto que Petra no tiene ya soporte, os recomiendo encarecidamente que os qued&eacute;is con Qiana. Por desgracia no puedo atestiguar que vaya tan bien como su predecesora, pues no la prob&eacute; en su momento, pero cada uno es conocedor de su equipo y bien podr&aacute; sacar conclusiones.
<br />
<br />El resto de la cuesti&oacute;n, con sus inquietantes preguntas, tal vez sea motivo para un debate sosegado. Os invito a ello.
<br />
<br />Salud 
<br />
<br />
<table>
 <tbody>
  <tr>
   <th>Linux Mint Rebecca</th>
   <th>LSDH</th>
  </tr>
  <tr>
   <td>Instalaci&oacute;n</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Arranque y apagado</td>
   <td>7,50</td>
  </tr>
  <tr>
   <td>Software</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Hardware</td>
   <td>8,13</td>
  </tr>
  <tr>
   <td>Conectividad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Out of the box</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Estabilidad</td>
   <td>5</td>
  </tr>
  <tr>
   <td>Fluidez</td>
   <td>10</td>
  </tr>
  <tr>
   <td>Gesti&oacute;n de energ&iacute;a</td>
   <td>3,33</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Pybench</td>
   <td>3.039</td>
  </tr>
  <tr>
   <td>Apache</td>
   <td>23.380,51</td>
  </tr>
  <tr>
   <td>Encode-flac</td>
   <td>13,21</td>
  </tr>
  <tr>
   <td>Unpack-linux</td>
   <td>17,98</td>
  </tr>
  <tr>
   <td>Unigine Valley</td>
   <td>454</td>
  </tr>
  <tr>
   <td>Browsermark FF</td>
   <td>2.832</td>
  </tr>
  <tr>
   <td>Browsermark GC</td>
   <td>3.966</td>
  </tr>
  <tr>
   <td>Transf. pendrive</td>
   <td>4,18</td>
  </tr>
  <tr>
   <td>Transf. disco USB</td>
   <td>1,08</td>
  </tr>
  <tr>
   <td>Transf. SD-card</td>
   <td>4,57</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por rendimiento</td>
   <td>-0,55</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>Correcci&oacute;n por errores</td>
   <td>0,00</td>
  </tr>
  <tr>
   <td></td>
   <td></td>
  </tr>
  <tr>
   <td>CALIFICACI&Oacute;N</td>
   <td>6,85</td>
  </tr>
 </tbody>
</table></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion" st_title="Linux Mint 17.1 Rebecca: triste regresión | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1210,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/12/linux-mint-17-1-rebecca-triste-regresion"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>