<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas"><span itemprop="headline">Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas)</span></a></h2></header><div class="row labels"><div class="col-md-12"><a class="label" href="/label/software-libre"><img title="software-libre" alt="software-libre" src="/assets/images/labels/software-libre.png"/></a><a class="label" href="/label/arch-linux"><img title="arch-linux" alt="arch-linux" src="/assets/images/labels/arch-linux.png"/></a><a class="label" href="/label/php"><img title="php" alt="php" src="/assets/images/labels/php.png"/></a><a class="label" href="/label/raspberrypi"><img title="raspberrypi" alt="raspberrypi" src="/assets/images/labels/raspberrypi.png"/></a></div></div><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">pico.dev</span> en la bitácora <a href="http://elblogdepicodev.blogspot.com.es/">El blog de pico.dev</a>, <a href="http://elblogdepicodev.blogspot.com/2012/06/guia-instalacion-raspberry-pi-con-arch_22.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-03-23T23:43" itemprop="dateModified">Actualizado el sábado, 23 de marzo de 2013 a las 23:43 UTC</span></div><div><span>
Etiquetado como
<a href="/label/raspberrypi"><span itemprop="articleSection">raspberrypi</span></a>, planeta-codigo, planeta-arch-linux, planeta-linux, <a href="/label/arch-linux"><span itemprop="articleSection">arch-linux</span></a>, <a href="/label/software-libre"><span itemprop="articleSection">software-libre</span></a>, gnulinux, <a href="/label/php"><span itemprop="articleSection">php</span></a></span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><div style="clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Raspberry Pi" src="http://2.bp.blogspot.com/-xGGLQL8UfII/T7azF5bgY2I/AAAAAAAABHg/CEVqX-iC4-g/s1600/raspberrypi.jpg" title="Raspberry Pi" />
</div>Nota: la &uacute;ltima actualizaci&oacute;n de esta gu&iacute;a fue el 19-01-2013. Al ser Arch Linux una distribuci&oacute;n rolling release puede que cuando la leas algunas cosas hayan cambiado aunque la mayor&iacute;a seguir&aacute;n siendo como esta escrito a continuaci&oacute;n.
<br />
<br />Despu&eacute;s de la instalaci&oacute;n base de Arch Linux ARM para la Raspberry Pi a partir de la 
<a href="http://elblogdepicodev.blogspot.com.es/2012/06/guia-instalacion-raspberry-pi-con-arch.html">Gu&iacute;a instalaci&oacute;n Raspberry Pi con Arch Linux ARM (Parte I, instalaci&oacute;n base)</a> toca a&ntilde;adirle los programas que nos proporcionar&aacute;n la funcionalidad que queramos. Desde luego la capacidad de la Raspberry es limitada y no podremos instalarle todo lo que deseemos, principalmente por la cantidad de memoria que tiene (256 MiB), por la velocidad de lectura desde la tarjeta SDHC que en determinados momentos es el mayor limitante not&aacute;ndose que se ahoga y porque el procesador no tiene la capacidad ni se puede comparar con un Intel o AMD de los que podemos encontrar estos d&iacute;as. Por ello, la Raspberry no ser&aacute; un sustituto de nuestro ordenador de escritorio o port&aacute;til aunque dicho esto hay ciertas tareas que puede cumplir a la perfecci&oacute;n con capacidad m&aacute;s que suficiente.
<br />
<div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;">
 <img alt="Arch Linux ARM" height="88" src="http://2.bp.blogspot.com/-Or91_hYDlQk/T9K1chcDVMI/AAAAAAAABOk/d1ORSB16KRY/s400/archlinuxarm.png" title="Arch Linux ARM" width="400" />
</div>
<br />Si necesitamos algo m&aacute;s potente podemos optar por una 
<a href="http://www.solid-run.com/products/cubox">CuBox</a> o una 
<a href="http://pandaboard.org/">Pandaboard ES</a>&nbsp;que ambas tienen 1 GiB de memoria y un procesador dual core algo m&aacute;s potente que el de la Raspberry, desde luego ambas funcionar&aacute;n bastante mejor al ejecutar un entorno gr&aacute;fico aunque probablemente tampoco sean sustitutos para reemplazar nuestro ordenador de escritorio. El punto fuerte de la Raspberry comparadas con la CuBox o la Pandaboard es su precio, de unos 45€ con gastos de env&iacute;o a Espa&ntilde;a, contra 99€ y 182$ sin gastos de env&iacute;o&nbsp;respectivamente.
<br />
<br />Volviendo a la gu&iacute;a, seguidamente explicar&eacute; algunas de las tareas para las que s&iacute; podemos usar la Raspberry.
<br />
<br />
<h4> Programas y servicios</h4>Las siguientes 
<a href="http://archlinuxarm.org/support/guides/applications">aplicaciones de muestra</a>&nbsp;son solo una idea de lo que podemos instalar. Adem&aacute;s de las anteriores o mencionando algunas de ellas una lista no exhaustiva podr&iacute;a ser la siguiente:
<br />
<ul>
 <li>Asignar direcci&oacute;n IP fija</li>
 <li>P2P torrent (transmision-cli)</li>
 <li>ftp (vsftp)</li>
 <li>Servidor web (lighttpd)</li>
 <li>firewall (ufw)</li>
 <li>PHP</li>
 <li>Git</li>
 <li>Sistemas de archivos NTFS, FAT</li>
 <li>Sonido (cmus)</li>
 <li>SSH (certificados)</li>
 <li>SSH y screen</li>
</ul>Otras: 
<br />
<ul>
 <li>email (mutt)</li>
 <li>m&uacute;sica (cmus)</li>
</ul>Veremos algunas de estas a continuaci&oacute;n y la configuraci&oacute;n del router que tendremos que hacer. Si quieres instalar todo lo que se comenta en esta qu&iacute;a puedes hacerlo con:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-1.sh"></script>
<br />
<h4> Asignar direcci&oacute;n IP fija</h4>De la lista anterior de aplicaciones algunas de ellas son programas que actuan de servidor. Dado que para conectarnos a un servidor necesitamos conocer la direcci&oacute;n IP en la que se encuentra deberemos asignar a la Raspberry una direcci&oacute;n IP fija en vez de dejar al DHCP del router que le asigne una y que pueda cambiar entre diferentes sesiones, reinicios o al cabo de un tiempo. Para tener una direcci&oacute;n IP fija deberemos crear un servicio de systemd que al iniciarse el sistema se le asigne la que deseamos. Para asignar la direcci&oacute;n IP est&aacute;tica debemos crear el archivo /etc/conf.d/network de configuraci&oacute;n donde indicaremos varias propiedades de la red entre ellas la direcci&oacute;n IP:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=network"></script> Y el archivo del servicio de systemd /etc/systemd/system/network.service que se ejecutar&aacute; cuando se inicie el sistema y realizar&aacute; las operaciones necesarias para configurar la red:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=network.service"></script> En address pondremos la direcci&oacute;n IP que queramos dentro de nuestra red y fuera del rango de direcciones IP que asigna el router. Finalmente debemos habilitar e iniciar el servicio network que acabamos de crear.
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-13.sh"></script> 
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-oCbN-bW6jZA/T9vqScxrZUI/AAAAAAAABRM/QDj9QuKUS7s/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-2.png"><img height="156" src="http://2.bp.blogspot.com/-oCbN-bW6jZA/T9vqScxrZUI/AAAAAAAABRM/QDj9QuKUS7s/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-2.png" width="200" /></a>
</div>Tambi&eacute;n deberemos modificar los archivos /etc/dhcpcd.conf y /etc/resolv.conf para que los nombres de los dominios se resuelvan a sus direcciones IP, si al hacer &laquo;ping www.google.es&raquo; obtenemos un mensaje como &laquo;ping: unknown host www.google.es&raquo; es que nos falta modificar alguno de estos archivos, poniendo la direcci&oacute;n IP de nuestro router probablemente nos sea suficiente sino podemos usar un 
<a href="https://developers.google.com/speed/public-dns/docs/using">servidor de nombre en internet como los que ofrece google</a>:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=dhcpcd.conf"></script>
<script src="https://gist.github.com/4573882.js?file=resolv.conf"></script> 
<br />
<br />
<h4> P2P torrent</h4>tranmision es uno de los programas m&aacute;s populares para realizar descargas P2P mediante torrent. Aparte de a trav&eacute;s de la interfaz gr&aacute;fica puede ser usado desde la linea de comandos y como esto nos es necesario para la Raspberry ser&aacute; el que veremos a continuaci&oacute;n. Empezaremos instalando su paquete transmission-cli.
<br />
<br />Para poder ejecutarlo como demonio y con un usuario espec&iacute;fico debemos seguir los pasos indicados en la 
<a href="https://wiki.archlinux.org/index.php/Transmission#Run_as_a_daemon">wiki de arch linux sobre transmission</a> para el caso de usar systemd.
<br />
<br />Siguiendo los pasos de la wiki deberemos hacer las siguientes cosas:
<br />
<ul>
 <li>Modificar los archivos&nbsp;/usr/lib/systemd/system/transmission.service y&nbsp;/usr/lib/tmpfiles.d/transmission.conf con el usuario con el que queramos que se ejecute transmission.</li>
 <li>Copiarlos en cada caso a un subdirectorio de /etc.</li>
 <li>Modificar el propietario y grupo del directorio /run/transmission seg&uacute;n el usuario que vaya a iniciar el servicio configurado en transmission.service y transmission.conf.</li>
 <li>Iniciar el servicio con&nbsp;transmission-daemon y pararlo para que se cree el archivo de configuraci&oacute;n.</li>
 <li>Editarlo para activar la interfaz rpc y el directorio de descargas.</li>
 <li>Iniciar el servicio con tranmission a trav&eacute;s de systemd.</li>
</ul>El directorio de descargas incompletas (incomplete-dir), el usuario (rpc-username) y password (rpc-password) para la interfaz remota web (la password la indicaremos en texto plano una vez iniciemos transmision &eacute;l detectar&aacute; que est&aacute; en texto plano y crear&aacute; un hash de ella para mayor seguridad), si deseamos autenticaci&oacute;n en la interfaz remota (rpc-authentication-required) y si queremos un directorio donde transmission buscar&aacute; archivos torrents para iniciar descargas de forma autom&aacute;tica cuando encuentre uno (watch-dir,&nbsp;watch-dir-enabled). En&nbsp;rpc-whitelist deberemos indicar la red local a la que estamos conectados, por ejemplo, 192.168.2.*.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-Vml46nNtMjQ/T9vqvhkaW1I/AAAAAAAABRs/NGPE2X1h4JA/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-6.png"><img height="108" src="http://2.bp.blogspot.com/-Vml46nNtMjQ/T9vqvhkaW1I/AAAAAAAABRs/NGPE2X1h4JA/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-6.png" width="200" /></a>
</div>
<br />Una vez realizados estos pasos podemos iniciar el demonio de transmission y acceder a su interfaz web con el navegador de nuestro ordenador de escritorio o portatil en la direcci&oacute;n http://[ip-raspberrypi]:9091.
<br />
<br />Mediante esta interfaz web podremos modificar algunas propiedades adicionales como los limites de velocidad tanto de bajada como de subida incluso en un horario determinado. Finalmente, mediante esta interfaz web nos aseguraremos en la pesta&ntilde;a Preferences &gt; Network de que tenemos el puerto usado por transmission en estado abierto y accesible desde internet, esto nos ser&aacute; necesario para descargar al m&aacute;ximo de velocidad que dispongamos. Si no lo tenemos tendremos que modificar la configuraci&oacute;n del router (lo veremos m&aacute;s adelante en la configuraci&oacute;n del router).
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://3.bp.blogspot.com/-z941Z8f8D2A/T9vqw-8CcPI/AAAAAAAABRw/k14cDIJ3zcQ/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-7.png"><img height="154" src="http://3.bp.blogspot.com/-z941Z8f8D2A/T9vqw-8CcPI/AAAAAAAABRw/k14cDIJ3zcQ/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-7.png" width="200" /></a>
 <a href="http://2.bp.blogspot.com/-KeC1QZF4zrw/T9vqxt7LOhI/AAAAAAAABR4/U6yx2uXk57Q/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-8.png"><img height="154" src="http://2.bp.blogspot.com/-KeC1QZF4zrw/T9vqxt7LOhI/AAAAAAAABR4/U6yx2uXk57Q/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-8.png" width="200" /></a>
</div>
<br />
<h4> FTP</h4>FTP (File Transfer Protocol) es un protocolo para la trasnferencia de archivos entre dos m&aacute;quinas y puede que nos sea de utilidad para mover archivos entre el sistema que usemos y la raspberry. Por ejemplo, si queremos copiar los archivos descargados por transmission a nuestra m&aacute;quina podemos extraer la tarjeta de memoria de la raspberry insertarla en nuestro equipo y copiar los archivos, otra forma es instalar un servidor ftp en la raspberry y realizar el copiado mediante el protocolo FTP. La primera opci&oacute;n es m&aacute;s r&aacute;pida (a 10 MiB/s) pero la segunda es m&aacute;s c&oacute;moda (a 2 MiB/s con una tarjeta clase 10) ya que no tendremos que apagar la raspberry y mover la tarjeta SD de un sistema a otro. Tambi&eacute;n nos puede ser &uacute;til si queremos dejar en la Raspberry un archivo php.
<br />
<br />Si optamos por la segunda opci&oacute;n podemos utilizar Very Secure FTP que ocupa muy poco y no tiene ninguna dependencia, su paquete es vsftd:
<br />
<br />Una vez instalado debemos habilitar el servicio e iniciarlo:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-2.sh"></script> 
<br />Editamos tambi&eacute;n el archivo de configuraci&oacute;n /etc/vsftpd.conf, hay un mont&oacute;n de propiedades pero las b&aacute;sicas que nos interesar&aacute; modificar son&nbsp;anonymous_enable para permitir o no autenticaci&oacute;n an&oacute;nima, local_enable para permitir iniciar sesi&oacute;n con los usuarios de la raspberry y write_enable para permitir realizar operaciones de escritura como subir o eliminar archivos.
<br />
<br />Ya en el ordenador con el que trabajemos deberemos instalar un cliente FTP para realizar las transferencias desde y a la raspberry, podemos utilizar uno de los m&aacute;s conocidos, filezilla.
<br />
<br />Para conectarnos en el sitio indicaremos como protocolo SFTP, modo de acceso normal y el nombre de usuario y password de un usuario de la raspberry.
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-tDaxB5kl7do/T9vrU2VrBNI/AAAAAAAABSU/NlwjuwmGZ8Y/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-9.png"><img height="139" src="http://2.bp.blogspot.com/-tDaxB5kl7do/T9vrU2VrBNI/AAAAAAAABSU/NlwjuwmGZ8Y/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-9.png" width="200" /></a>
 <a href="http://1.bp.blogspot.com/-a4hS1K5XIww/T-WlKX-B8hI/AAAAAAAABTs/ap4l3KulUuI/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-10.png"><img height="154" src="http://1.bp.blogspot.com/-a4hS1K5XIww/T-WlKX-B8hI/AAAAAAAABTs/ap4l3KulUuI/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-10.png" width="200" /></a>
</div>
<br />
<a href="http://welcome.filezilla-project.org/welcome?type=client&amp;category=documentation_basic&amp;version=3.5.3">http://welcome.filezilla-project.org/welcome?type=client&amp;category=documentation_basic&amp;version=3.5.3</a>
<br />
<a href="http://welcome.filezilla-project.org/welcome?type=client&amp;category=documentation_network&amp;version=3.5.3">http://welcome.filezilla-project.org/welcome?type=client&amp;category=documentation_network&amp;version=3.5.3</a>
<br />
<a href="http://wiki.filezilla-project.org/Documentation">http://wiki.filezilla-project.org/Documentation</a>
<br />
<br />
<h4> Servidor web</h4>Aunque la raspberry sea peque&ntilde;a y no parezca muy indicada para actuar como servidor tiene alg&uacute;n punto que la hace especialmente adecuado para ello como es que tiene un consumo muy bajo, rid&iacute;culo (3 watios) para un servidor mucho m&aacute;s potente (200 watios o m&aacute;s), ocupa tambi&eacute;n un espacio rid&iacute;culo en comparaci&oacute;n con un servidor m&aacute;s potente, tampoco necesita una refrigeraci&oacute;n especial. Al menos para un uso personal o un entorno para un equipo de desarrollo puede ser m&aacute;s que suficiente.
<br />
<br />Una muy buena opci&oacute;n es lighttpd, es un servidor de nueva generaci&oacute;n de los llamados ligeros que le est&aacute;n ganando terreno a apache, con trasnferencias as&iacute;ncronas, que ocupa apenas 1 MiB, con muy pocas dependencias. Su paquete es lighttpd. El document root por defecto est&aacute; en /srv/http donde han de estar alojados los archivos que va a servir.
<br />
<br />Me gusta m&aacute;s cherokee, no porque sea mejor ni peor sino porque es un proyecto liderado por un espa&ntilde;ol, 
<a href="http://www.alobbs.com/">&Aacute;lvaro L&oacute;pez Ortega</a>,&nbsp;cosa rara por estos sitios, sin embargo, en la raspberry su consola de administraci&oacute;n tiene un funcionamiento pobre llegando a no ser usable, esto unido a que sus archivos de configuraci&oacute;n son bastante cr&iacute;pticos para editarlos con un editor de texto la opci&oacute;n que recomiendo es lighttpd. Otra opci&oacute;n ser&iacute;a nginx.
<br />
<br />Al igual que con vsftpd debemos habilitar el servicio e iniciarlo.
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-3.sh"></script>
<br />
<br />
<h4> Acceso desde internet con FreeDNS</h4>Llegados a este punto podemos disponer de un servidor web sin embargo para que sea accesible desde internet necesitamos a&uacute;n un pieza fundamental en el funcionamiento de la web, un nombre de dominio nos proporcionar&aacute; un identificador para nuestro servidor que no cambiar&aacute; con el tiempo aunque la IP p&uacute;blica de nuestro router que nuestro proveedor de servicios de internet (ISP) nos asigna lo haga.
<br />
<br />Un opci&oacute;n gratuita es utilizar FeeDSN que nos permitir&aacute; obtener un subdominio de ciertos dominios p&uacute;blicos como mooo.com. Necesitaremos crearnos una cuenta en FreeDNS y crear un subdominio. Una vez lo tengamos se nos presenta el problema de como actualizar en FreeDNS nuestra IP p&uacute;blica cada vez que nuestro ISP nos de una distinta. Para ello una opci&oacute;n sencilla es crearnos un script que con cron se ejecute cada cierto tiempo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-P7dF_LenoUY/T9vrmHE4yWI/AAAAAAAABSc/lPWXvY2Ka3Y/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-12.png"><img height="191" src="http://2.bp.blogspot.com/-P7dF_LenoUY/T9vrmHE4yWI/AAAAAAAABSc/lPWXvY2Ka3Y/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-12.png" width="200" /></a>
</div>
<br />Primeramente necesitaremos una serie de utilidades que est&aacute;n contenidas en el paquete dnsutils.
<br />
<br />Luego el script con un contenido similar al siguiente cambiando el API_KEY que nos asigne FreeDNS para el dominio:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=freedns_update.sh"></script> 
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-YumotGS8OIE/T9vrnLZ0IwI/AAAAAAAABSg/JpEIY4HH4vw/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-13.png"><img height="128" src="http://2.bp.blogspot.com/-YumotGS8OIE/T9vrnLZ0IwI/AAAAAAAABSg/JpEIY4HH4vw/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-13.png" width="200" /></a>
</div>
<br />Le cambiamos de permisos al archivo y a&ntilde;adimos la expresi&oacute;n cron con crontab:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-5.sh"></script> A&ntilde;adiendo el siguiente contenido para ejecutar el script cada 5 minutos:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=crontab"></script> 
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-OhP_RFT7gFk/T9vrntwzn_I/AAAAAAAABSo/0L97GxaGltQ/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-14.png"><img height="127" src="http://4.bp.blogspot.com/-OhP_RFT7gFk/T9vrntwzn_I/AAAAAAAABSo/0L97GxaGltQ/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-14.png" width="200" /></a>
</div>En el archivo /var/log/crond.log podemos ver las ejecuciones y resultados del script.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-Pc7WixodfWI/T9vroQ29jTI/AAAAAAAABSs/4hmhrcNffvc/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-15.png"><img height="49" src="http://4.bp.blogspot.com/-Pc7WixodfWI/T9vroQ29jTI/AAAAAAAABSs/4hmhrcNffvc/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-15.png" width="200" /></a>
</div>
<a href="http://freedns.afraid.org/dynamic/index.php">http://freedns.afraid.org/dynamic/index.php</a>
<br />
<a href="https://wiki.archlinux.org/index.php/Cron">https://wiki.archlinux.org/index.php/Cron</a>
<br />
<br />
<h4> Configuraci&oacute;n router</h4>Para hacer que nuestra RPi sea accesible desde internet tendremos que modificar alguna configuraci&oacute;n del router como abrir puertos para que el router redirija el tr&aacute;fico que le llega a un puerto a una determinada direccion IP y puerto de nuestra red. Esto nos ser&aacute; &uacute;til principalmente para el caso del servidor web (puerto 80), de transmission (puerto 51413) u otro servidor que queramos que sea accessible desde internet.
<br />
<br />Como comentaba en la asignaci&oacute;n de IP est&aacute;tica primero comprobaremos el rango de direcciones IP que asigna el servidor DHCP del router y que la direcci&oacute;n IP est&aacute;tica que hemos asignado a la RPi est&aacute; fuera de ese rango.
<br />
<br />Posteriormente abrimos los puertos, las opciones ser&aacute;n diferentes para cada modelo de router pero similares.
<br />
<br />
<h4> Firewall</h4>A pesar de que el router ya har&aacute; de firewall podemos utilizar ufw en la propia RPi. 
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-6.sh"></script> 
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-xJhQaSkchcY/T9vtBAcwenI/AAAAAAAABS8/hcXSn1XScUo/s1600/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-17.png"><img height="133" src="http://4.bp.blogspot.com/-xJhQaSkchcY/T9vtBAcwenI/AAAAAAAABS8/hcXSn1XScUo/s200/gu%C3%ADa-instalaci%C3%B3n-archlinux-raspberrypi-p2-17.png" width="200" /></a>
</div>
<br />
<h4> Sistemas de archivos NTFS, FAT</h4>Puede que necesitemos instalar el soporte para acceder a sistemas de archivos con formato NTFS (que es el utilizado por windows) o FAT. Tan solo necesitaremos instalar los siguientes paquetes ntfs-3g, ntfsprogs y dosfstools.
<br />
<br />Para realizar el montaje manualmente ejecutaremos el siguiente comando, donde /mnt es la carpeta donde queremos montar el sistema de archivos de la partici&oacute;n de un disco o memoria USB externos:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-7.sh"></script> Si queremos que este montaje se realice de forma autom&aacute;tica nada m&aacute;s conectar el cable USB a la RPi instalaremos el paquete udev-automount, que realizar&aacute; el montaje en la carpeta /media.
<br />
<br />
<h4> PHP</h4>Para instalar PHP basta con instalar los paquetes php php-cgi. Para comprobar que se han instalado correctamente podemos ejecutar:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-8.sh"></script>Ahora nos quedar&iacute;a integrar el soporte en el servidor web para que sea capaz de procesar los archivos php. La configuraci&oacute;n var&iacute;a en cada servidor web. Aqu&iacute; explicare como configurarlo con ligthttpd. Para ello deberemos editar el archivo /etc/lighttpd/lighttpd.conf e incluir al final las siguientes lineas:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=lighttpd.conf"></script> Ahora deberemos crear el archivo /etc/lighttpd/fastcgi.conf (y el directorio donde est&aacute;) e incluir en &eacute;l el siguiente contenido:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=fastcgi.conf"></script> 
<br />
<h4>Sonido</h4>Primero a&ntilde;adimos nuestro usuario al grupo de audio para reproducir sonidos, cargamos el m&oacute;dulo del sonido y reproducimos un sonido de prueba:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-9.sh"></script> Si no queremos cargar el m&oacute;dulo manualmente cada vez que queramos reproducir sonido se puede cargar el m&oacute;dulo autom&aacute;ticamente cuando se inicie la Raspberry Pi con:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-10.sh"></script> Y a&ntilde;adiendo a ese archivo el m&oacute;dulo que queremos cargar (snd-bcm2835).
<br />
<br />Habiendo cargado el m&oacute;dulo snd_bcm2835 con 
<a href="https://wiki.archlinux.org/index.php/Cmus">cmus</a> podemos reproducir mp3, ogg entre otros formatos instalando varios paquetes que son: alsa-firmware alsa-lib alsa-plugins alsa-utils cmus pulseaudio libmad libvorbis.
<br />
<br />Una cosa que tenemos que tener en cuenta es la salida por la que se emitir&aacute; el sonido, por la salida HDMI o por el jack 3.5mm, si no o&iacute;mos ning&uacute;n sonido puede que necesitemos cambiar la salida a la que estemos utilizando: Podemos hacerlo con:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-11.sh"></script> Despu&eacute;s de instalar los paquetes anteriores puede que necesitemos reiniciar. Podemos probar el sonido con aplay.
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-12.sh"></script> Y despu&eacute;s cmus:
<br />
<br />
<script src="https://gist.github.com/4573882.js?file=script-14.sh"></script> Si est&aacute;s interesado en escuchar m&uacute;sica con la Raspberry puedes consultar la entrada 
<a href="http://elblogdepicodev.blogspot.com.es/2013/01/4-formas-de-escuchar-musica-internet.html">4 formas de escuchar m&uacute;sica a trav&eacute;s de internet</a>&nbsp;en la que se indican varias maneras de hacerlo.
<br />
<br />
<h4>SSH con certificados</h4>El usar SSH puede resultar inc&oacute;modo ya que hay que estar constantemente introduciendo la clave, para evitarlo en otra entrada explicar&eacute; 
<a href="http://elblogdepicodev.blogspot.com.es/2013/01/autenticacion-ssh-con-clave-privada-y.html">como usar SSH con una clave p&uacute;blica y privada para realizar la autenticaci&oacute;n</a> ya que es algo que seguramente sea igual para la RPi o para cualquier otro sistema.
<br />
<br />La Raspberry con llos siguientes programas nos puede ofrecer muchas funcionalidades pero tampoco hay que esperar una capacidad igual al de un ordenador de escritorio. En las pruebas que he realizado la velocidad de transferencia que he conseguido desde la tarjeta SD y desde un disco duro externo conectado por USB a la RPi ha sido de tan solo &iexcl;2 MiB/s!.
<br />
<br />
<h4>Utilidad de screen</h4>Si la conexi&oacute;n ssh se cierra todos los programas que se iniciaron en ella se terminan con lo que si estabamos reproduciendo m&uacute;scica con cmus, cmus se terminar&aacute; y dejaremos de escuchar m&uacute;sica. Para evitarlo 
<a href="http://elblogdepicodev.blogspot.com.es/2013/01/dejar-procesos-vivos-de-conexion-ssh.html">podemos usar screen</a>.
<br />
<br />Referencia:
<br />
<a href="http://elblogdepicodev.blogspot.com.es/2012/05/raspberry-pi-desempaquetado-unboxing.html">Raspberry Pi, desempaquetado (&laquo;unboxing&raquo;)</a>
<br />
<a href="http://elblogdepicodev.blogspot.com.es/2012/06/guia-instalacion-raspberry-pi-con-arch.html">Raspberry Pi, Gu&iacute;a instalaci&oacute;n (Parte I) Instalaci&oacute;n base</a>
<br />
<a href="http://elblogdepicodev.blogspot.com.es/2013/01/dejar-procesos-vivos-de-conexion-ssh.html">Dejar procesos vivos de conexi&oacute;n SSH con screen</a></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas" st_title="Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas) | El blog de pico.dev"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><section><a id="comments"></a><h1>Comentar</h1><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = "elblogdepicodev";
var disqus_title = "Guía instalación Raspberry Pi con Arch Linux ARM (Parte II, programas)";
var disqus_url = "http://elblogdepicodev.blogspot.com/2012/06/guia-instalacion-raspberry-pi-con-arch_22.html";
</script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a class="dsq-brlink" href="http://disqus.com">comments powered by <span class="logo-disqus">Disqus</span></a></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>¡Suscríbete!</h3><ul class="list-unstyled"><li><a href="/label/raspberrypi/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta raspberrypi</a></li><li><a href="/label/arch-linux/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta arch-linux</a></li><li><a href="/label/software-libre/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta software-libre</a></li><li><a href="/label/php/feed.atom.xml"><span class="fa fa-rss"></span> Fuente de la etiqueta php</a></li></ul></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 99,
      "url" : "http://www.blogstack.info/post/elblogdepicodev/2012/06/guia-instalacion-raspberry-pi-con-arch-linux-arm-parte-ii-programas"
    }
  ],
  "app/disqus",
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdepicodev",
      "name" : "El blog de pico.dev"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>