<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Linux no es dificil, por mi amigo Victor | El blog de Liher</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor"><span itemprop="headline">Linux no es dificil, por mi amigo Victor</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Liher</span> en la bitácora <a href="http://elblogdeliher.com/">El blog de Liher</a>, <a href="http://elblogdeliher.com/linux-no-es-dificil-por-mi-amigo-victor/"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2015-01-17T13:21" itemprop="dateModified">Actualizado el sábado, 17 de enero de 2015 a las 13:21 UTC</span></div><div><span>
Etiquetado como
opinion</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name"><p>Este articulo no lo he escrito yo, lo ha hecho Victor Lopez una amigo y asiduo visitante de este blog, me pidi&oacute; el favor de poder publicarlo en mi blog y tengo que decir que el favor no se lo hago yo a el si no el a mi, desde aqu&iacute; <strong>much&iacute;simas gracias por el articulo</strong>, que me ha gustado mucho y con el cual coincido en muchos puntos, si no en todos. Tambi&eacute;n quiero pedirte disculpas Victor por la tardanza, lo recib&iacute; hace mas de un mes pero &uacute;ltimamente no he tenido muchas ganas de ponerme delante del ordenador, pero como se suele decir, nunca es tarde si la dicha es buena, y en este caso lo es por que merece mucho la pena el articulo.</p>
<p><em>“En esta ocasi&oacute;n quiero divulgar una opini&oacute;n y experiencia personal acerca del aprendizaje de la inform&aacute;tica para el usuario medio y la llamada curva de aprendizaje de GNU/Linux. Cuando estudiaba en el instituto y eleg&iacute; la opci&oacute;n de Dibujo T&eacute;cnico y Art&iacute;stico en perjuicio de la asignatura de Inform&aacute;tica, no alcanzaba a ver el horizonte que se preve&iacute;a para &eacute;sta &uacute;ltima. Mientras mis compis aprend&iacute;an Basic y la impresi&oacute;n de sus nombres en impresora matricial, yo me peleaba con un profesor senil y poco justo para la evaluaci&oacute;n ( ense&ntilde;aba yo esta materia a algunos de mis compa&ntilde;eros que aprobaban notablemente y a m&iacute; me suspend&iacute;a). As&iacute; que mi decisi&oacute;n no fue acertada, sabiendo lo que me gusta la inform&aacute;tica y Linux (tambi&eacute;n la cagu&eacute; con la Religi&oacute;n y la&nbsp;&Eacute;tica).</em></p>
<p>&nbsp;</p>
<p><a href="http://elblogdeliher.com/wp-content/uploads/2015/01/aprender-linux.jpg"><img src="http://elblogdeliher.com/wp-content/uploads/2015/01/aprender-linux.jpg" alt="aprender-linux" width="256" height="256" /></a></p>
<p>&nbsp;</p>
<p><em>Para cuando tuve la primera ocasi&oacute;n memorable al frente de un ordenador personal ajeno, era Windows ’95 el que marcaba el tempo de los Pcs. Pero fue fugaz y apenas interactu&eacute; con este sistema operativo. No tuve mi primer ordenador hasta el siglo XXI ( a&ntilde;o 2001), cuando en un par&oacute;n laboral decid&iacute; que deb&iacute;a instruirme en la inform&aacute;tica empresarial y de oficina, al comprender que el futuro laboral que ten&iacute;a ante m&iacute; pod&iacute;a exigir conocimientos de esta &iacute;ndole, previsi&oacute;n que se cumpli&oacute; m&aacute;s tarde en diferentes trabajos hasta la fecha. No sab&iacute;a apenas manejar el rat&oacute;n y hasta el legendario Netscape Navigator entre otros programas (requiescant in pacem) me era una tarea ardua. Entre las disciplinas a aprender – WindowsNT, HTML 1.0, ASP, PSP, Javascript, Java (este, imposible) – se encontraba Linux, eso s&iacute;, como Administrador de Sistemas y tirando de consola m&aacute;s que de interfaz gr&aacute;fico. Sin embargo, mientras recib&iacute;amos instrucci&oacute;n y yo la desaguaba como si mi capacidad de comprensi&oacute;n fuera un tap&oacute;n con un boquete en medio en un lavabo de manos, nos facilitaron un par de compact discs, uno de Windows NT edici&oacute;n para “parados” y un Red Hat ( si no me equivoco, Red Hat 5 con un sombrero de ala ancha). Tuve que aprender por consola a formatear y particionar ( nada dif&iacute;cil si eres guiado) el disco duro con fdisk en un diskette para instalar tanto copias de Windows “facilitadas” por manos caritativas como para la instalaci&oacute;n de la primera distro que me top&eacute;. </em></p>
<p><em>Por entonces, mi primer PC montaba un Windows Milenium, &iexcl;vaya casta&ntilde;a que me metieron! Se bloqueaba a cada instante y no dud&eacute; ni un momento en formatear el ordenador para instalar Windows 2000 profesional y RedHat. Me pareci&oacute; muy extra&ntilde;o la advertencia “instalad primero Windows 98, luego Windows 2000 y finalmente Linux (como todo amante de la inform&aacute;tica, no me qued&eacute; en una sola distribuci&oacute;n linux). Linux lo ve&iacute;a todo, Windows 2000 &uacute;nicamente era capaz de detectar los sistemas Microsoft como W’98, y W’98 s&oacute;lo se ve&iacute;a a s&iacute; mismo”. As&iacute; que me pareci&oacute; que exist&iacute;a una jerarqu&iacute;a en funci&oacute;n de la capacidad y operatividad de los diferentes sistemas. Uno todopoderoso y superior que era capaz de manejar el resto. S&oacute;lo escuchaba elogios para las distribuciones linux en estabilidad y robustez en manejo de sistemas y servidores y un incipiente pero a&uacute;n espartano interfaz gr&aacute;fico. S&oacute;lo gracias a los esfuerzos de comunidades y foros pod&iacute;a encontrar aplicaciones y tutoriales que me permitieran usar los entornos linux cuando se truncaba algo. Y tambi&eacute;n gracias a ellos, diversidad y libertad de elecci&oacute;n. De este modo compart&iacute; la curva de aprendizaje de la inform&aacute;tica b&aacute;sica para un usuario de a pie, de esos de “&iquest;d&oacute;nde se arranca el ordenador?”, tanto en entorno Windows como en GNU/Linux. Y pude comprobar que no era m&aacute;s dif&iacute;cil una que la otra, pero me permiti&oacute; aprender al un&iacute;sono dos entornos con similitudes gr&aacute;ficas y funcionales a los niveles m&aacute;s b&aacute;sicos, algo as&iacute; como al ni&ntilde;o peque&ntilde;o que aprende con mayor facilidad dos idiomas en su crecimiento y que de ning&uacute;n modo igual podr&iacute;a hacer en su juventud o senectud. Y no pod&iacute;a comprender c&oacute;mo un sistema presuntamente inferior en capacidades pod&iacute;a superar en popularidad y crecimiento a otro si la meta final era difundir una herramienta de m&uacute;ltiple uso y de fiabilidad remarcada. Ah, claro, los intereses financieros en un mercado de &aacute;mbito global pod&iacute;an producir unos dividendos muy mucho much&iacute;simo jugosos. Si por entonces Bill Gates hubiera invertido un buen porcentaje de sus beneficios en aquello que le hab&iacute;a hecho inmensamente rico, habr&iacute;a pagado su deuda moral con aquello que fue origen de su extremada opulencia. Pero el camino del monopolio fue m&aacute;s poderoso y cuando oigo o leo el importe de sus donaciones para las buenas causas, se me divide el coraz&oacute;n al enjuiciar su conducta – un t&iacute;o muy bueno y muy &aacute;varo. Est&aacute; claro que las donaciones a la medicina curativa y a los condones de grafeno est&aacute; por encima de todo nuestros intereses mediocres, eso sin discusi&oacute;n ninguna. Pero me pregunto por qu&eacute; no cedi&oacute; algo en favor del software libre.</em></p>
<p><em>Y ya me iba por los cerros de &Uacute;beda, todo esto arriba mencionado s&oacute;lo para constatar la supremac&iacute;a de los entornos Windows en la inform&aacute;tica actual, que es a lo que voy. Ahora algunos (o muchos) de nosotros que deseamos difundir las virtudes de las distribuciones y software libres y gratis encontramos obst&aacute;culos, cada vez menos, para la expansi&oacute;n en Pcs de amigos y familiares reticentes (&iexcl;hombre, instala linux, que es mejor!) y aquestos, acostumbrados al entorno de los de Redmond y reacios al m&iacute;nimo cambio de interfaz o de men&uacute; herramientas. Para muestra, Windows 8.0. Ni a m&iacute; me gust&oacute; Windows 7 tras haber tenido que usar XP durante unos a&ntilde;os, pero debo reconocer que el primero supera y mejora al segundo. Como le&iacute; por ah&iacute; en un bloguero o forero, Microsoft da una de cal y otra de arena en su procesi&oacute;n incesante de Windows. Es este quiz&aacute; lo que disgusta el usuario base, que le cambien un color o una fuente y no encuentre con la misma facilidad y celeridad lo que anda buscando en su escritorio o en los men&uacute;s ( o men&uacute;es, si tambi&eacute;n escribo jabal&iacute;es). Nada m&aacute;s entrar en modo seguro en Windows nos alarmamos s&oacute;lo cuando la resoluci&oacute;n ha cambiado a 800*600. </em></p>
<p><em> Creo, y s&oacute;lo es una mera suposici&oacute;n, que los usuarios no desean cambios que frustran su sencillez, no quieren retos superiores a los cotidianos en esta materia y s&oacute;lo buscan unos cambios est&eacute;ticos en sus interfaces de Messenger o nuevos emoticones. Mientras, y s&oacute;lo es otra reflexi&oacute;n, dejan pasar por delante herramientas de trabajo iguales o mejores y superiores y definitivamente m&aacute;s econ&oacute;micas. Creo que aprender linux no es otra cosa que una curva de desaprendizaje mental a lo acostumbrado para volver a aprender lo mismo con una mente m&aacute;s abierta. No creo que sea tan dif&iacute;cil aprender a conducir un coche con cambio semiautom&aacute;tico tras uno con transmisi&oacute;n manual, pero si nos dan a elegir, volvemos a comprar uno con el cambio manual. Rogando clemencia por el uso quiz&aacute; impropio de s&iacute;miles que me permitan explicar algunos conceptos o ideas, capitulo este ensayo entroncado en mi afirmaci&oacute;n esencial; Linux no es dif&iacute;cil de aprender.”</em></p>
<p>Como ya he dicho anteriormente me ha gustado mucho y quiero agradecerte el que me lo mandases para que pudiera publicarlo en mi blog, <strong>muchas gracias Victor</strong>.</p>
<p>Lo que te paso a ti con el profesor de Dibujo me paso a mi con el de C++, tambi&eacute;n falle en la decisi&oacute;n de elegir entre Religi&oacute;n y &Eacute;tica, en la caso los alumnos que hac&iacute;an &Eacute;tica como asignatura acababan muchos d&iacute;as en el aula de ordenadores, lo cual me fastidiaba mucho.</p>
<p>Un saludo.</p></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor" st_title="Linux no es dificil, por mi amigo Victor | El blog de Liher"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 1343,
      "url" : "http://www.blogstack.info/post/elblogdeliher/2015/01/linux-no-es-dificil-por-mi-amigo-victor"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "elblogdeliher",
      "name" : "El blog de Liher"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      },
      "ad" : {
        "adClient" : "ca-pub-5967896416715365",
        "adSlot" : "6843955321"
      }
    }
  ]
]); });</script></body></html>