<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux"><span itemprop="headline">Persiguiendo un sueño: la diversidad en GNU/Linux</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2013/09/persiguiendo-un-sueno-la-diversidad-en.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2013-09-16T13:57" itemprop="dateModified">Actualizado el lunes, 16 de septiembre de 2013 a las 13:57 UTC</span></div><div><span>
Etiquetado como
solusos, distro-hopping</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">No son pocas las ocasiones en que leemos a lo largo y ancho de la blogosfera opiniones encontradas acerca de lo que algunos llaman fragmentaci&oacute;n, con la consiguiente reprimenda y rechinar de dientes de quienes detestan la palabrita de marras. Se han abierto con demasiada frecuencia encendidos debates, apasionadas diatribas tanto en un sentido como en otro, por parte de quienes defienden la libertad creativa y el esp&iacute;ritu altruista y comunitario que lleva a algunos desarrolladores a emprender el camino por su cuenta, frente a los que esgrimen lo equivocado de esta idea, argumentando que se trata del principal causante del supuesto estancamiento de GNU/Linux como sistema de uso masivo.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-CxT5xXcbJ1s/UjbUsbH8crI/AAAAAAAAD-w/EvGHLzwrYac/s1600/Linux+logos.jpg"><img height="266" src="http://1.bp.blogspot.com/-CxT5xXcbJ1s/UjbUsbH8crI/AAAAAAAAD-w/EvGHLzwrYac/s320/Linux+logos.jpg" width="320" /></a>
</div>
<br />
<br />
<a></a>Por mi parte, si es que me he posicionado alguna vez, y como enemigo que soy de los extremismos, he defendido una postura intermedia. Diversidad s&iacute;, pero con matices, sin crear distribuciones que &uacute;nicamente aportan fondos de pantalla distintos a los de aquella en la que se basan. Tal vez me equivoco, no lo s&eacute;, por aquello de la imposibilidad de vallar el campo, pues dentro de la bendita libertad que existe en GNU/Linux, &iquest;qui&eacute;n soy yo para decirle a alguien que no cree su &quot;distro-wallpaper&quot;?
<br />
<br />Al hilo de estas reflexiones me encuentro esta ma&ntilde;ana con un comentario en Google + de 
<a href="https://plus.google.com/u/0/107691710289083956125/posts">Ikey Doherty</a>, desarrollador casi en solitario de 
<a href="http://solusos.com/">SolusOS</a>, quien a tenor del tono de su discurso empieza a estar cansado de que le digan qu&eacute; puede y qu&eacute; no puede hacer, si debe continuar su aventura o debe unirse a otros, si SolusOS es un intento est&eacute;ril que deber&iacute;a quedarse en aportar Consort para que otras distribuciones lo incluyan entre la n&oacute;mina de escritorios como alternativa al tantas veces denostado Gnome 3. Pues s&iacute;, Ikey se ha cansado y utiliza la popular red social para desahogarse y expresar su postura sobre el tema. Como me parece una deliciosa lectura, os la sirvo traducida:
<br />
<br />
<blockquote>
 Empiezo a estar algo confundido acerca de la actitud que se est&aacute; tomando sobre la diversidad en el software libre hoy d&iacute;a. Hab&iacute;a una &eacute;poca en que la gente se mostraba entusiasmada ante la oportunidad de probar &quot;cosas nuevas&quot; sin raz&oacute;n, por puro inter&eacute;s pueril.
</blockquote>
<br />
<blockquote>
 En la actualidad uno debe justificarse sobre cada peque&ntilde;o programa que hace (aunque se trate de una pieza de c&oacute;digo de 20 l&iacute;neas, test.py, para pruebas). Tengo que admitir que esto me desconcierta bastante. Llevo algunos a&ntilde;os ya en este &quot;juego de las distros&quot; y en muchas ocasiones he visto art&iacute;culos o posts (en foros, g+, etc) que predicen la defunci&oacute;n inminente de todos y cada uno de los proyectos en los que he trabajado o con los que he contribuido.
</blockquote>
<br />
<blockquote>
 Me he dado cuenta de que no estoy solo. Volviendo la vista atr&aacute;s hacia mis primeros d&iacute;as construyendo distros (LMDE, por ejemplo) uno recuerda un punto de vista completamente distinto. LMDE era &quot;algo excitante&quot; y mucha gente se congratulaba de su aparici&oacute;n. Es la misma reacci&oacute;n que (inicialmente) se dio cuando present&eacute; SolusOS 1 al mundo.
</blockquote>
<br />
<blockquote>
 Entonces, &iquest;qu&eacute; ha cambiado? &iquest;Acaso las distros y proyectos de software libre se han vuelto impopulares de repente? No precisamente. Incluso en mi experiencia particular, cuando recibo preguntas sobre SolusOS 2, veo comentarios de gente que en principio apoyaron a LMDE y SolusOS 1, que parecen ahora tirarse a la calle en manifestaci&oacute;n, a menudo (demasiado a menudo) gritando cosas como &quot;&iquest;Por qu&eacute;? &iquest;Por qu&eacute; no te unes a todas esas distros para crear una SuperFant&aacute;stica Fedebiantu, para que todos podamos beneficiarnos de esos programadores que realmente no est&aacute;n haciendo aquello que adoran?&quot;
</blockquote>
<br />
<blockquote>
 &nbsp;Y entonces lo veo. No es que los usuarios hayan cambiado en absoluto, son los medios en Internet. Echando la vista unos a&ntilde;os atr&aacute;s ten&iacute;amos las mismas fuentes de informaci&oacute;n sobre distros de Linux (y proyectos de software libre en general) donde la gente sol&iacute;a encontrar desde cambios apasionantes hasta utilidades aleatorias, totalmente absurdas y sin sentido.
</blockquote>
<br />
<blockquote>
 Lo que en realidad ha cambiado es c&oacute;mo la gente usa servicios como Blogger, Google+, etc. Unos pocos elegidos se volvieron populares demostrando, al principio, una mente abierta. Despu&eacute;s de alg&uacute;n tiempo, algunos de estos blogs (o incluso feeds de G+) se volvieron completamente venenosos, clamando contra todo. Tras unos cuantos a&ntilde;os de proliferaci&oacute;n de ese tipo de art&iacute;culos, hoy d&iacute;a es una &quot;Cosa Totalmente Terrible&quot; iniciar un proyecto en solitario. De igual modo es una &quot;Idea Absurdamente Est&uacute;pida&quot; ser independiente.
</blockquote>
<br />
<blockquote>
 Pues bien, puede que yo sea un completo idiota, pero cualquiera que repase la historia del software libre, y de Linux, se dar&aacute; cuenta de inmediato que muchos grandes proyectos se tomaron como &quot;Locuras En Principio&quot;, y fueron creados por un &quot;Ej&eacute;rcito De Un Solo Hombre&quot;.
</blockquote>
<br />
<blockquote>
 De modo que, resumiendo, no soy yo el que en realidad est&aacute; haciendo nada diferente, o dividiendo nada. S&iacute;, estoy creando una distro a mi manera, pero lo estoy haciendo con exactamente la misma idea que aquellos que me precedieron. Y a&uacute;n ando por aqu&iacute;, y eso es SolusOS. Tal vez todos tengamos que recapacitar un poco y decidir qu&eacute; pensamos realmente del software libre, y quiz&aacute;s no permitir que unas ideas err&oacute;neas lanzadas por unos pocos blogs envenenados afecten a nuestra propia percepci&oacute;n de las cosas. Recordemos, incluso aunque un proyecto termine siendo p&uacute;blico, nueve de cada diez veces ese proyecto se inicia por razones totalmente ego&iacute;stas. El desarrollador ten&iacute;a sus razones para desarrollar &quot;Lo Que Sea&quot;, as&iacute; que tal vez no fuese una idea tan est&uacute;pida. Lo que hay que preguntarse es &iquest;por qu&eacute;/c&oacute;mo esa idea era &uacute;til para ese desarrollador, y por qu&eacute; la gente sigue realmente ese proyecto? Eso nos dir&aacute; qu&eacute; tiene de bueno y podremos decidir a partir de ah&iacute; (sin la influencia de blogs, posts, etc) si merece la pena. Los desarrolladores no est&aacute;n creando ese software para ti, pero han decidido que quieren compartir su trabajo con el mundo, si es que el mundo est&aacute; un poco interesado al menos (Si no es as&iacute;, no se ha perdido nada. Los desarrolladores solo est&aacute;n persiguiendo su sue&ntilde;o :) )
</blockquote>
<br />Ten&eacute;is la reflexi&oacute;n original, libre de mi imperfecta traducci&oacute;n (no me dedico a eso, aunque siempre ser&aacute; mejor que el traductor de la &quot;gran G&quot;, pido perd&oacute;n de antemano), en 
<a href="https://plus.google.com/u/0/107691710289083956125/posts">este enlace</a>. Merece la pena tomar una buena bocanada de aire, al menos yo la he tomado, tras su lectura y el modo tan apasionado en que Ikey Doherty defiende su idea. Que, a fin de cuentas, es la misma idea de libertad y hacer lo que le gusta, adem&aacute;s de compartirlo con el mundo GRATIS, que muchos de los que leemos blogs como este tenemos. No me doy por aludido cuando se refiere a que hay mucha gente &quot;envenenada&quot; por ciertos blogs que atacan continuamente la diversidad de GNU/Linux, como comentaba antes si algo he apoyado ha sido cierta moderaci&oacute;n en la creaci&oacute;n de distribuciones. Nunca he ido m&aacute;s all&aacute;. Tampoco me veo en disposici&oacute;n de defender &quot;una distro para gobernarlos a todos&quot;, sobre todo teniendo en cuenta que soy usuario de una distribuci&oacute;n minoritaria que poca gente utiliza.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://1.bp.blogspot.com/-ByYNiigTCv4/UjbVXrvyMRI/AAAAAAAAD-4/NFX6e7M5df8/s1600/instant%C3%A1nea2.png"><img height="250" src="http://1.bp.blogspot.com/-ByYNiigTCv4/UjbVXrvyMRI/AAAAAAAAD-4/NFX6e7M5df8/s400/instant%C3%A1nea2.png" width="400" /></a>
</div>
<br />Aun as&iacute;, la parrafada de Ikey me ha hecho pensar y creo que tiene toda la raz&oacute;n. Defendamos la libertad por encima de todo, a nadie da&ntilde;a el que un programador quiera realizar su sue&ntilde;o, su propia distribuci&oacute;n a su manera y sin injerencias de nadie m&aacute;s. Sigamos defendiendo nuestra libertad para usarla o no, ignorarla o no, criticarla - en esta parte creo que Ikey falla en su razonamiento un poco, solo un poco - o no. Pero no esgrimamos la &quot;dichosa fragmentaci&oacute;n&quot; como la causa de todos los males en GNU/Linux, no es ese el enemigo, si es que hay alguno. Como no es el uso masivo de nuestro sistema preferido el objetivo marcado. Nunca lo ha sido y, a poco que uno conozca como funciona el mundo, nunca lo ser&aacute;.</span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux" st_title="Persiguiendo un sueño: la diversidad en GNU/Linux | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 335,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2013/09/persiguiendo-un-sueno-la-diversidad-en-gnu-linux"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>