<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2014-05-08T18:46:03Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2014-05-08T18:46:03Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Desempaquetado («unboxing») de Amazon Kindle Touch</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/08/desempaquetado-$003c$003cunboxing$003e$003e-de-amazon-kindle-touch" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2014-03-08T02:16:36Z</updated>
    <published>2012-08-17T17:45:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Amazon.es" src="http://1.bp.blogspot.com/-QJe4DImXPi4/UC6CCivlqNI/AAAAAAAABZk/Fvpzvav9D8Y/s1600/amazon-es.png" title="Amazon.es" /&gt; 
&lt;/div&gt;Desde hace unos meses el lector de libros electr&amp;oacute;nicos de Amazon Kindle Touch ya est&amp;aacute; disponible para la compra desde la p&amp;aacute;gina espa&amp;ntilde;ola de 
&lt;a href="http://www.amazon.es/?_encoding=UTF8&amp;amp;camp=3626&amp;amp;creative=24790&amp;amp;linkCode=ur2&amp;amp;tag=blobit-21"&gt;Amazon&lt;/a&gt; 
&lt;img src="http://ir-es.amazon-adsystem.com/e/ir?t=blobit-21&amp;amp;l=ur2&amp;amp;o=30" width="1" height="1" alt="" style="border:none !important; margin:0px !important;" /&gt;. Una de mis dudas cuando compr&amp;eacute; el Kindle Touch era como era la experiecia de lectura, como convertir libros en formato pdf o formato ebook epub/mobi/doc a los nativos del libro electr&amp;oacute;nico, como quedaban esas conversiones y si en una p&amp;aacute;gina entraba el mismo texto que en un libro tradicional. Otra de mis dudas era como se leer&amp;iacute;an los pdfs de libros t&amp;eacute;cnicos, cambiando la orientaci&amp;oacute;n de lectura a horizontal se dejan leer bastante bien aunque hay que hacer varios pasos de p&amp;aacute;gina en el kindle para leer una p&amp;aacute;gina del libro. Para mi, la experierincia es lo suficientemente buena como para haber merecido la compra a pesar de tener algunos contras.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/08/desempaquetado-$003c$003cunboxing$003e$003e-de-amazon-kindle-touch"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-08-17T17:45:00Z</dc:date>
  </entry>
  <entry>
    <title>Karmacracy y como integrarlo en Blogger</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger" />
    <category term="planeta-codigo" />
    <category term="blogger" />
    <category term="planeta-linux" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-11-22T21:25:02Z</updated>
    <published>2012-03-29T19:18:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Karmacracy" height="106" src="http://3.bp.blogspot.com/-ZRqkujvZc0g/T3Sw_BV4nuI/AAAAAAAABFc/ZM9R9VsOpLw/s320/karmacracy.png" title="Karmacracy" width="320" /&gt; 
&lt;/div&gt;Hoy en d&amp;iacute;a los que tienen un medio en el cual publican contenido ya se un blog, un peri&amp;oacute;dico, agregador de noticias, foro u otra forma saben que a&amp;ntilde;adir una barra de botones para que los usuarios puedan compartirlo es una buena idea ya que son los propios usuarios, a los que les parece interesante el contenido tanto como para compartirlo en alguna de sus redes sociales, los que ayudan a difundirlo. Esto es bueno para los medios ya que ayuda a atraer m&amp;aacute;s visitas hacia ese contenido pero hasta el momento para los usuarios el hecho de compartirlo no tiene ning&amp;uacute;n aliciente adicional, lo m&amp;aacute;s, formar parte de un n&amp;uacute;mero de usuarios que han compartido anteriormente. 
&lt;br /&gt; 
&lt;br /&gt;Si hab&amp;eacute;is visitado este blog alguna otra vez tal vez os hay&amp;aacute;is dado cuenta que debajo de cada entrada y de los tradicionales botones que ofrece blogger para compartir ha aparecido un bloque a trav&amp;eacute;s del cual tambi&amp;eacute;n se puede compartir las entradas de una forma muy sencilla y en un par de clics en tus redes sociales como twitter, facebook o linkedin. Este bloque es proporcionado por&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/03/karmacracy-y-como-integrarlo-en-blogger"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-03-29T19:18:00Z</dc:date>
  </entry>
  <entry>
    <title>Hemeroteca #1</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1" />
    <category term="hemeroteca" />
    <category term="raspberrypi" />
    <category term="planeta-codigo" />
    <category term="programacion" />
    <category term="blogger" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="otros" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <category term="tapestry" />
    <category term="java" />
    <category term="minix" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-07-07T01:16:10Z</updated>
    <published>2012-06-29T16:43:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img src="http://1.bp.blogspot.com/-cK1PH5pzXNc/TdKfToeduKI/AAAAAAAAApw/axtoypLaDfU/s1600/El+blog+de+picodev+%2528watermark%2529.png" /&gt; 
&lt;/div&gt;Ya han pasado seis meses de este 2012 y seguro que muchos estamos ya pensando en coger vacaciones dentro de poco. En esta entrada recopilar&amp;eacute; para que han dado estos seis meses en El blog de pico.dev. Si te interesan entradas como estas y a&amp;uacute;n no lo has hecho suscr&amp;iacute;bete al feed de mi blog, tengo una buena cantidad de entradas esperando a ser escritas y que ir&amp;eacute; publicando a raz&amp;oacute;n de una por semana si dispongo del tiempo y el &amp;aacute;nimo para escribirlas. 
&lt;br /&gt; 
&lt;br /&gt;En estos seis meses he escrito estas 23 entradas agrupadas por tem&amp;aacute;tica: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Varios&lt;/b&gt; 
&lt;br /&gt;Como menci&amp;oacute;n especial integr&amp;eacute; el widget de karmacracy que puede verse al final de cada entrada mediante el cual cualquier usuario puede compartir la entradas de este blog en sus redes sociales como facebook, twitter o linkedin de una forma r&amp;aacute;pida y sencilla obteniendo a cambio un lugar en el widget para los usuarios que m&amp;aacute;s clics atraigan.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/06/hemeroteca-1"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-06-29T16:43:00Z</dc:date>
  </entry>
  <entry>
    <title>Arte usando texto ASCII con FIGlet</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/12/arte-usando-texto-ascii-con-figlet" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="otros" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-12-21T21:19:03Z</updated>
    <published>2011-12-17T19:08:00Z</published>
    <content type="html">&lt;p&gt;Seguramente hayas visto en algunos sitios una figura o texto formado por caracteres ASCII, probablemente no hayan sido creadas a mano con la inspiraci&amp;oacute;n de un artista, hay herramientas incluso usables desde la web que permiten generarlas. 
&lt;a href="http://www.figlet.org/"&gt;FIGlet&lt;/a&gt; es una de ellas que permite crear una figura ASCII a partir de un texto. Su instalci&amp;oacute;n en Arch Linux es tan simple como instalar el paquete figlet con: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;pre&gt;$ yaourt -S figlet&lt;/pre&gt; 
&lt;/div&gt; 
&lt;br /&gt;En la propia p&amp;aacute;gina de figlet podemos encontrar enlaces a varios conjuntos de fuentes a aplicar al texto que queramos generar. Tambi&amp;eacute;n podemos ver 
&lt;a href="http://www.figlet.org/fontdb.cgi"&gt;algunos ejemplos&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt;FIGlet tiene 
&lt;a href="http://www.figlet.org/figlet-man.html"&gt;m&amp;aacute;s opciones&lt;/a&gt; pero la m&amp;aacute;s habitual tal vez sea indicar la fuente a usar y el mensaje del que queremos su representaci&amp;oacute;n en arte ASCII. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div&gt; 
 &lt;pre&gt;$ figlet -w 200 &amp;quot;El blog de pico.dev&amp;quot;&lt;/pre&gt;
&lt;/div&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/12/arte-usando-texto-ascii-con-figlet"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-12-17T19:08:00Z</dc:date>
  </entry>
  <entry>
    <title>Mi guía para elección de portátil nuevo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" />
    <category term="software" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="hardware" />
    <category term="otros" />
    <category term="apple" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-12-14T19:10:23Z</updated>
    <published>2012-12-01T11:49:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Intel" height="131" src="http://3.bp.blogspot.com/-YsNoDxaK4SY/ULH_Z2yBd5I/AAAAAAAABpI/d6WIftJMvvc/s200/intel.png" title="Intel" width="200" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de muchos meses buscando y comparando (no se cuantos meses exactamente pero m&amp;aacute;s de 18 seguro) finalmente me decid&amp;iacute; por un ordenador que pas&amp;oacute; mi exigente criterio (o puede que me cansase de esperar), ya llevando unos d&amp;iacute;as con &amp;eacute;l ha sido una buena elecci&amp;oacute;n aunque algunos detalles no me gustan del todo pero es lo mejor que he encontrado y no quer&amp;iacute;a esperar mucho m&amp;aacute;s ya. En esta entrada comentar&amp;eacute; mi experiencia y consejos que quiz&amp;aacute; le ayuden a otra gente en su elecci&amp;oacute;n de port&amp;aacute;til si est&amp;aacute; buscando uno. En las siguientes entradas har&amp;eacute; el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html"&gt;desempaquetado&lt;/a&gt; y el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/analisis-software-y-bios-sony-vaio-e-14p.html"&gt;an&amp;aacute;lisis del equipo funcionando&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Primeros pasos&lt;/b&gt; 
&lt;br /&gt;Antes de empezar ni siquiera a buscar un port&amp;aacute;til es tener una idea del presupuesto, que marca/o que no marca se quiere, tama&amp;ntilde;o, caracter&amp;iacute;sticas que consideramos indispensables que tenga, uso que le vamos a dar y necesidades o modelos de lo que buscamos, con esto empieza la selecci&amp;oacute;n y discriminaci&amp;oacute;n de entre todas las posibilidades que tenemos. En el mundo del PC tantas que pueden llegar a abrumar y dificultar la elecci&amp;oacute;n por eso recomendable tener unos par&amp;aacute;metros prefijados, luego podremos flexibilizarlos. En Apple y los Mac es m&amp;aacute;s sencillo, hay menos modelos, la mayor&amp;iacute;a de gama alta para lo que considerar&amp;iacute;amos en los PC y tambi&amp;eacute;n a precios que a parecidas caracter&amp;iacute;sticas son notablemente mucho m&amp;aacute;s caros y est&amp;aacute;n inflados, todo sea dicho. Un Mac no quer&amp;iacute;a ya que son caros y adem&amp;aacute;s pretend&amp;iacute;a instalar Arch Linux en &amp;eacute;l, as&amp;iacute; que para esto consideraba que mejor un PC.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-01T11:49:00Z</dc:date>
  </entry>
  <entry>
    <title>Convertir imágenes entre formatos y cambiar tamaño con ImageMagick</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/11/convertir-imagenes-entre-formatos-y-cambiar-tamano-con-imagemagick" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="otros" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-11-04T11:09:03Z</updated>
    <published>2012-11-03T11:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="ImageMagick" src="http://2.bp.blogspot.com/-oBOYIuNQ8Ag/TdKe2PmTVaI/AAAAAAAAApo/IMhGLxDGhww/s1600/imagemagick.png" title="ImageMagick" /&gt; 
&lt;/div&gt;Algunas personas que trabajan con muchas im&amp;aacute;genes seguramente se han encontrado en la situaci&amp;oacute;n de querer convertir im&amp;aacute;genes de un formato a otros o cambiarles de tama&amp;ntilde;o de forma masiva. Hacerlo de forma manual es un trabajo aburrido y repetitivo adem&amp;aacute;s de consumir mucho tiempo que ser&amp;aacute; mayor o menor dependiendo de la cantidad de im&amp;aacute;genes a tratar. En esta situaci&amp;oacute;n 
&lt;a href="http://www.imagemagick.org/"&gt;ImageMagick&lt;/a&gt;&amp;nbsp;y unos pocos comandos en la terminal de Linux nos pueden ahorrar una buena cantidad de tiempo adem&amp;aacute;s de evitar posibles errores al hacer las cosas manualmente. Para convertir im&amp;aacute;genes de un formato a otro podremos hacerlo con: 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;script src="https://gist.github.com/4007119.js?file=convert1.sh"&gt;&lt;/script&gt; Esto convierte todas las im&amp;aacute;genes de extensi&amp;oacute;n png del directorio actual a im&amp;aacute;genes en formato jpg cambi&amp;aacute;ndoles adem&amp;aacute;s a los nombres de los archivos la extensi&amp;oacute;n de &amp;laquo;.png&amp;raquo; a &amp;laquo;*.jpg&amp;raquo;. Tambi&amp;eacute;n podr&amp;iacute;amos cambiar el tama&amp;ntilde;o de las imagenes a una determinada anchura m&amp;aacute;xima o a una altura m&amp;aacute;xima de forma masiva con:&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/11/convertir-imagenes-entre-formatos-y-cambiar-tamano-con-imagemagick"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-11-03T11:46:00Z</dc:date>
  </entry>
  <entry>
    <title>Guía instalación CyanogenMod</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod" />
    <category term="android" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="gnulinux" />
    <category term="google" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-05-26T19:33:04Z</updated>
    <published>2012-05-25T17:10:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
  &lt;img alt="Android" src="http://3.bp.blogspot.com/-SWH4vcj_XSA/T7-4U4INTbI/AAAAAAAABKg/zi-b2AOtzPw/s1600/android.png" title="Android" /&gt; 
 &lt;/div&gt; 
&lt;/div&gt;Uno de los defectos que tienen los m&amp;oacute;viles android es que los fabricantes y las operadores si ofrecen actualizaciones a nuevas versiones de android lo hacen tarde y en algunos casos ni eso con lo que al cabo de una a&amp;ntilde;o ya no tienes la &amp;uacute;ltima versi&amp;oacute;n de andoid en un m&amp;oacute;vil que por hardware ser&amp;iacute;a perfectamente capaz. Esto causa uno de los problemas en android, fragmentaci&amp;oacute;n en el ecosistema, dificultando el desarrollo de las aplicaciones y obligando a soportar un mayor n&amp;uacute;mero de versiones andoid en vez de unas pocas. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt;&lt;/div&gt; 
&lt;div style="clear: right; display: inline !important; float: right; margin-bottom: 1em; margin-left: 1em; text-align: center;"&gt; 
 &lt;img alt="CyanogenMod" height="68" src="http://1.bp.blogspot.com/-7_FkslK58nc/T7-zjoLu-GI/AAAAAAAABKQ/ls-xqbPKu7A/s320/cyanogenmod.png" title="CyanogenMod" width="320" /&gt; 
&lt;/div&gt;A raiz de este problema han ido surgiendo varias roms como 
&lt;a href="http://www.cyanogenmod.com/"&gt;CyanogenMod&lt;/a&gt; o 
&lt;a href="http://en.miui.com/"&gt;MIUI&lt;/a&gt;&amp;nbsp;que proporcionan versiones de android m&amp;aacute;s actualizadas y modificadas partiendo del c&amp;oacute;digo original proporcionado por google. CyanogenMod es una de las roms m&amp;aacute;s longevas, que soporta mayor n&amp;uacute;mero de dispositivos y de las m&amp;aacute;s estables. Adem&amp;aacute;s del motivo anterior de tener una versi&amp;oacute;n m&amp;aacute;s actualizada de android, CyanogenMod puede solucionar algunos defectos que tiene el android original del tel&amp;eacute;fono. En mi caso el tel&amp;eacute;fono ven&amp;iacute;a con froyo (2.2) y CyanogenMod me ha permitido disponer de gingerbread (2.3) adem&amp;aacute;s de corregir algunos problemas como poder desactivar la respuesta h&amp;aacute;ptica (vibraci&amp;oacute;n) de los botones y de los bloqueos que se produc&amp;iacute;an en algunas ocasiones al activar y desactivar la radio. Adem&amp;aacute;s CyanogenMod tiene muchas m&amp;aacute;s opciones de personalizaci&amp;oacute;n que las originales de android.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/05/guia-instalacion-cyanogenmod"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-05-25T17:10:00Z</dc:date>
  </entry>
  <entry>
    <title>Enlaces de la semana 8 de 2010</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-8-de-2010" />
    <category term="hemeroteca" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2010-02-28T10:21:00Z</published>
    <content type="html">&lt;p&gt;&lt;a href="http://www.javahispano.org/contenidos/es/los_25_errores_de_programacion_mas_comunes/?utm_source=feed&amp;amp;utm_medium=feed&amp;amp;utm_campaign=feed"&gt;Los 25 errores de programaci&amp;oacute;n m&amp;aacute;s comunes&lt;/a&gt; de javaHispano 
&lt;br /&gt; 
&lt;a href="http://softlibre.barrapunto.com/article.pl?sid=10/02/27/0030255&amp;amp;from=rss"&gt;Liferay abandonar&amp;aacute; la licencia MIT y se pasar&amp;aacute; a LGPL en la versi&amp;oacute;n 6&lt;/a&gt; de Barrapunto 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/muylinux/%7E3/zhWXRuRYZEM/"&gt;Bienvenido, kernel 2.6.33&lt;/a&gt; de MuyLinux 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/diegocg/%7E3/sBrqhthD4rk/lo-que-trae-linux-2633.html"&gt;Lo que trae Linux 2.6.33&lt;/a&gt; de D'Oh! 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/diegocg/%7E3/bqRT4HCkYy8/flash-google-vp8-y-el-futuro-del-video.html"&gt;Flash, Google, VP8, y el futuro del v&amp;iacute;deo de Internet&lt;/a&gt; de D'Oh! 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/diegocg/%7E3/Y6qRITaIC4E/oracle-pierde-la-oportunidad-de-liberar.html"&gt;Oracle pierde la oportunidad de liberar completamente Solaris&lt;/a&gt; de D'Oh! 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/Phoronix/%7E3/BYmLBF1NMOA/vr.php"&gt;GNOME Shell 2.29 Brings A Lot Of Improvements&lt;/a&gt; de Phoronix 
&lt;br /&gt; 
&lt;a href="http://seilo.geekyogre.com/?p=1097"&gt;Seif Lotfy: Nautilus + Zeitgeist&lt;/a&gt; de PlanetUbuntu 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/Phoronix/%7E3/FT7OR9-WCK0/vr.php"&gt;An Update On The Boot &amp;amp; Power Performance In Ubuntu 10.04&lt;/a&gt; de Phoronix&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-8-de-2010"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-28T10:21:00Z</dc:date>
  </entry>
  <entry>
    <title>Enlaces de la semana 9 de 2010</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/03/enlaces-de-la-semana-9-de-2010" />
    <category term="hemeroteca" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2010-03-07T18:06:00Z</published>
    <content type="html">&lt;p&gt;&lt;a href="http://www.javahispano.org/contenidos/es/traduccion_a_espanol_del_tutorial_basico_de_hibernate/?utm_source=feed&amp;amp;utm_medium=feed&amp;amp;utm_campaign=feed"&gt;Traduccion a espa&amp;ntilde;ol del tutorial basico de Hibernate&lt;/a&gt;&amp;nbsp;de javaHispano 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/~r/muylinux/~3/yiCdPj7CtiY/"&gt;Primeros temas para GNOME Shell&lt;/a&gt;&amp;nbsp;de MuyLinux 
&lt;br /&gt; 
&lt;a href="http://www.dosideas.com/noticias/28-coaching/849-compartimos-el-conocimiento.html"&gt;&amp;iquest;Compartimos el conocimiento?&lt;/a&gt;&amp;nbsp;de Dos Ideas 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/~r/Phoronix/~3/i0kmIP4o70Q/vr.php"&gt;Version 1.98 Of GRUB2 Boot Loader Released&lt;/a&gt;&amp;nbsp;de Phoronix 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/~r/Phoronix/~3/ok5BGsUQTUY/vr.php"&gt;Mesa 7.8 Branched For Release This Month&lt;/a&gt; de Phoronix 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/~r/Phoronix/~3/BChkMgcdvRY/vr.php"&gt;A Tour Of The Phoronix Office&lt;/a&gt;&amp;nbsp;de Phoronix 
&lt;br /&gt; 
&lt;a href="http://www.puntogeek.com/2010/03/05/%c2%bfporque-la-gente-elige-chrome%20target="&gt;&amp;iquest;Por qu&amp;eacute; la gente elige Chrome?&lt;/a&gt; de Punto Geek 
&lt;br /&gt; 
&lt;a href="http://es.globedia.com/linux-continua-aceptacion-masiva"&gt;&amp;iquest;Porqu&amp;eacute; Linux contin&amp;uacute;a sin aceptaci&amp;oacute;n masiva?&lt;/a&gt; de Globedia&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/03/enlaces-de-la-semana-9-de-2010"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-03-07T18:06:00Z</dc:date>
  </entry>
  <entry>
    <title>Enlaces de la semana 7 de 2010</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-7-de-2010" />
    <category term="hemeroteca" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2010-02-21T17:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;a href="http://bitacoras.com/anotaciones/la-vida-y-evolucion-del-internet-explorer-6/8634542"&gt;La vida y evoluci&amp;oacute;n del Internet Explorer 6&lt;/a&gt; de Bitacoras.com 
&lt;br /&gt; 
&lt;a href="http://www.dosideas.com/noticias/desarrollo-de-software/834-ique-es-el-codigo-testeable.html"&gt;&amp;iquest;Qu&amp;eacute; es el c&amp;oacute;digo testeable?&lt;/a&gt; de Dos Ideas 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/muylinux/%7E3/O4rF7UJfIGc/"&gt;Activa la detecci&amp;oacute;n de sintaxis en nano&lt;/a&gt; de MuyLinux 
&lt;br /&gt; 
&lt;a href="http://www.fedora-es.com/node/10022"&gt;Wicd: el gestor de redes alternativo a Network Manager&lt;/a&gt; de fedora-es 
&lt;br /&gt; 
&lt;a href="http://feedproxy.google.com/%7Er/muylinux/%7E3/wHzgMyCGY1A/"&gt;El fin del ‘distrohopping’&lt;/a&gt; de MuyLinux 
&lt;br /&gt; 
&lt;a href="http://www.visualbeta.es/15881/software-libre/gnumeric-110/"&gt;Gnumeric 1.10&lt;/a&gt; de Visual Beta 
&lt;br /&gt; 
&lt;a href="http://www.genbeta.com/actualidad/ubuntu-no-vestira-human-en-su-nueva-version"&gt;Ubuntu no vestir&amp;aacute; Human en su nueva versi&amp;oacute;n&lt;/a&gt; de Genbeta 
&lt;br /&gt; 
&lt;a href="http://piensa-binario.blogspot.com/2010/02/80-cosas-que-probablemente-no-sepas.html"&gt;80 cosas que probablemente no sepas sobre Linux y Microsoft&lt;/a&gt; de Piensa en Binario&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-7-de-2010"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-21T17:46:00Z</dc:date>
  </entry>
  <entry>
    <title>Enlaces de la semana 6 del 2010</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-6-del-2010" />
    <category term="hemeroteca" />
    <category term="otros" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2010-02-14T13:16:00Z</published>
    <content type="html">&lt;p&gt;Este es la primera entrada de la serie &amp;laquo;Enlaces de la semana&amp;raquo; donde ir&amp;eacute; compartiendo aquellos enlaces a entradas de blogs o noticias que he le&amp;iacute;do y m&amp;aacute;s me han gustado durante la semana y que quiz&amp;aacute; a vosotros tambi&amp;eacute;n os gusten. 
&lt;br /&gt; 
&lt;br /&gt;No tienen ning&amp;uacute;n orden en concreto y su tem&amp;aacute;tica est&amp;aacute; mezclada. Sin m&amp;aacute;s aqu&amp;iacute; los ten&amp;eacute;is. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;a href="http://www.variablenotfound.com/2010/02/30-leyes-eponimas-relacionadas-con-el.html"&gt;30 Leyes ep&amp;oacute;nimas relacionadas con el desarrollo de software (I)&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.variablenotfound.com/2010/02/30-leyes-eponimas-relacionadas-con-el_07.html"&gt;30 Leyes ep&amp;oacute;nimas relacionadas con el desarrollo de software (II)&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.variablenotfound.com/2010/02/30-leyes-eponimas-relacionadas-con-el_8707.html"&gt;30 Leyes ep&amp;oacute;nimas relacionadas con el desarrollo de software (y III)&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.muylinux.com/2010/02/11/trailer-promocional-de-vlc-humr/"&gt;Tr&amp;aacute;iler promocional de VLC [Humor]&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.javahispano.org/contenidos/es/javahispano_podcast__073__programacion_con_gwt_google_web_toolkit/?utm_source=feed&amp;amp;utm_medium=feed&amp;amp;utm_campaign=feed"&gt;JavaHispano Podcast - 073 - Programaci&amp;oacute;n con GWT&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.muylinux.com/2010/02/10/algunas-novedades-en-gnome-shell/"&gt;Algunas novedades en GNOME-Shell&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://iyanmv.com/2010/02/10/cubo-de-ubuntu-mode-cheat-on/"&gt;Cubo de Ubuntu (Cheat Cube) &lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://proyectofedora.org/mexico/2010/02/12/fedora-cheat-cube/"&gt;Cubo de Fedora (Cheat Cube)&lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.dosideas.com/liderazgo/823-cultivar-equipos-no-ideas.html"&gt;Cultivar equipos, no ideas &lt;/a&gt; 
&lt;br /&gt; 
&lt;a href="http://www.hombrepac.com.ar/software-libre/apagar-el-lcd-o-monitor-en-linux/"&gt;Apagar el LCD o monitor en Linux&lt;/a&gt;&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/enlaces-de-la-semana-6-del-2010"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-14T13:16:00Z</dc:date>
  </entry>
  <entry>
    <title>Calendario Arch Linux 2012</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/01/calendario-arch-linux-2012" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="planeta-linux" />
    <category term="arch-linux" />
    <category term="otros" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2012-01-01T14:19:00Z</published>
    <content type="html">&lt;p&gt;Empieza un nuevo a&amp;ntilde;o y una de las cosas que primero hacemos es ver y obtener un calendario para poner encima de nuestra mesa. Hace unos d&amp;iacute;as vi un 
&lt;a href="http://paraisolinux.com/2-calendarios-de-ubuntu-para-imprimir-del-2012/?utm_source=feedburner&amp;amp;utm_medium=feed&amp;amp;utm_campaign=Feed%3A+paraisoLinux+%28Paraiso+Linux%29"&gt;calendario tematizado con Ubuntu&lt;/a&gt;. En un rato que he sacado he tenido tiempo de crear uno basado en Arch Linux y traducido al espa&amp;ntilde;ol. As&amp;iacute; que aqu&amp;iacute; lo ten&amp;eacute;is listo y esperando para imprimir, construirlo y ponerlo encima de vuestra mesa. En el paquete ten&amp;eacute;is la versi&amp;oacute;n SVG, PNG y PDF (200 KiB) lo pod&amp;eacute;is 
&lt;a href="https://docs.google.com/open?id=0B4yquUFv3csrNmJjMDQ5ODYtYzk4Yi00MGM4LWE1MDItMmJiNzI2OGZhZmY5"&gt;obtener mediante este enlace&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://4.bp.blogspot.com/-lHmvpG811Xw/TwBqehbFy-I/AAAAAAAABCo/sxILVMr3dug/s1600/arch+linux+calendar+%25282012%2529.png"&gt;&lt;img alt="Calendario Arch Linux 2012" height="400" src="http://4.bp.blogspot.com/-lHmvpG811Xw/TwBqehbFy-I/AAAAAAAABCo/sxILVMr3dug/s400/arch+linux+calendar+%25282012%2529.png" title="Calendario Arch Linux 2012" width="308" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;br /&gt; 
&lt;br /&gt;Si le coge&amp;iacute;s gusto a 
&lt;strike&gt;
  la papiroflexia 
&lt;/strike&gt;&amp;nbsp;los modelos de papel tal vez os interese obtener este 
&lt;a href="http://elblogdepicodev.blogspot.com/2010/03/arch-linux-cheat-cube.html"&gt;Cheat Cube tamb&amp;eacute;n para nuestra distribuci&amp;oacute;n&lt;/a&gt;. Ahora Tux y el cheat cube van a tener un nuevo compa&amp;ntilde;ero :). En cuanto pueda imprimirlo le saco unas fotos. 
&lt;br /&gt; 
&lt;br /&gt;&amp;iexcl;Que empec&amp;eacute;is bien el a&amp;ntilde;o!&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/01/calendario-arch-linux-2012"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-01-01T14:19:00Z</dc:date>
  </entry>
  <entry>
    <title>Un día en la Euskal Encounter 19</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19" />
    <category term="ubuntu" />
    <category term="planeta-arch-linux" />
    <category term="software-privativo" />
    <category term="planeta-linux" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T16:16:22Z</updated>
    <published>2011-07-24T09:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Euskal encounter 19" src="http://1.bp.blogspot.com/-XcMwHk7AABo/TiqxFNgHm7I/AAAAAAAAA50/Ot6_eSvAkEA/s1600/euskal-encounter.png" title="Euskal encounter 19" /&gt; 
&lt;/div&gt;En estos d&amp;iacute;as se est&amp;aacute; celebrando, del 22 al 25 de julio, la&amp;nbsp; 
&lt;a href="http://www.euskal.org/"&gt;Euskal Encounter&lt;/a&gt;, uno de los enventos inform&amp;aacute;ticos m&amp;aacute;s importantes de Euskadi, del estado de Espa&amp;ntilde;a y seg&amp;uacute;n algunos uno de los mejores de parte de Europa. As&amp;iacute; desde hace ya 19 ediciones, con en estos d&amp;iacute;as exactamente 4096 puestos para los asistentes que disponen de una conexi&amp;oacute;n de 20 Gb por segundo ofrecida por la mano de Euskaltel y HP. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s1600/DSCN0130.JPG"&gt;&lt;img height="150" src="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s200/DSCN0130.JPG" width="200" /&gt;&lt;/a&gt; 
 &lt;a href="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s1600/DSCN0100.JPG"&gt;&lt;img height="150" src="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s200/DSCN0100.JPG" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;br /&gt; 
&lt;/div&gt;A pesar de que se organiza en Barakaldo, al alcance de metro de ciudad en la que vivo y escasos minutos, hasta este a&amp;ntilde;o no hab&amp;iacute;a asistido a ninguna. Ten&amp;iacute;a muchas ganas de ir y vivir en primera persona lo que ah&amp;iacute; acontec&amp;iacute;a al menos por un d&amp;iacute;a, este a&amp;ntilde;o no lo quer&amp;iacute;a dejar pasar y as&amp;iacute; ha sido. Como repaso de lo que ha dado el d&amp;iacute;a (y parte de la noche) os escribo esta entrada.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-07-24T09:46:00Z</dc:date>
  </entry>
</feed>

