<!DOCTYPE html><html data-debug-enabled="true" data-locale="es_ES" xmlns="http://www.w3.org/1999/xhtml"><head><meta content="Apache Tapestry Framework (version 5.4-beta-16)" name="generator"/><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/><meta pagina="Post"/><title>Desmontando a shadow | La sombra del helicóptero</title><!-- Resources --><link type="text/css" rel="stylesheet" href="//fonts.googleapis.com/css?family=Open+Sans:400,700"/><link type="text/css" rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css"/><link title="Portada" type="application/atom+xml" rel="alternate" href="/feed.atom.xml"/><link type="image/png" rel="icon" href="/assets/images/favicon.png"/><meta content="Post" name="tapestry-page-name"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/bootstrap/css/bootstrap.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/exception-frame.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tapestry-console.css"/><link type="text/css" rel="stylesheet" href="/assets/tapestry5/tree.css"/><link type="text/css" rel="stylesheet" href="/assets/css/core.css"/></head><body data-page-initialized="false"><script type="text/javascript">document.write("<div class=\"pageloading-mask\"><div></div></div>");</script><header><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-4"><h1><a class="blogstack" href="/"><span class="glyphicon glyphicon-th"></span> Blog <span class="stack">Stack</span></a></h1></div><div class="col-xs-12 col-sm-12 col-md-6"><nav role="navigation"><ul class="list-unstyled list-inline"><li><a class="header" href="/">Inicio</a></li><li><a class="header" href="/archive">Archivo</a></li><li><a class="header" href="/faq">Preguntas frecuentes</a></li><li><a class="header" href="/faq#aggregate">¿Quieres agregar tu bitácora?</a></li></ul></nav></div><div class="col-xs-6 col-sm-6 col-md-2"><a title="Fuente RSS, ¡suscríbete a BS!" alt="Fuente RSS" class="header" href="/feed.atom.xml"><span class="header icon entypo"></span></a><a title="Twitter, ¡sigue a BS!" alt="Twitter" class="header" href="http://twitter.com/blogstackinfo"><span class="header icon entypo-social"></span></a></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><h4>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</h4></div></div></div><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="imagen-cabecera"><div class="imagen"><div class="col-xs-12 col-sm-12 col-md-12" id="billboard"></div></div></div></div></div></div></header><div class="container-fluid content"><div class="row"><div class="col-xs-12 col-sm-12 col-md-8 content"><article itemtype="http://schema.org/BlogPosting" itemscope=""><a id="content"></a><header><h2><a href="/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow"><span itemprop="headline">Desmontando a shadow</span></a></h2></header><section class="post-data"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div><span>Escrito por <span itemprop="author">Enrique Bravo</span> en la bitácora <a href="http://www.lasombradelhelicoptero.com">La sombra del helicóptero</a>, <a href="http://www.lasombradelhelicoptero.com/2014/03/desmontando-shadow.html"><span itemprop="sameAs">artículo original</span></a></span></div><div><span datetime="2014-03-05T20:14" itemprop="dateModified">Actualizado el miércoles, 05 de marzo de 2014 a las 20:14 UTC</span></div><div><span>
Etiquetado como
se-acabo-lo-que-se-daba</span></div></div></div></section><div class="text-justify post-content"><div class="share-this only-twitter"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><span itemprop="name">Hace m&aacute;s de un mes que practico el viejo arte de la postergaci&oacute;n, del cual soy todo un maestro - modestia aparte - gracias a la experiencia. Lo he estado aplicando, en esta ocasi&oacute;n, a la inevitable escritura de este art&iacute;culo de despedida. Es duro regentar un blog, sea cual sea su tem&aacute;tica, todos los que lo hacen o lo han hecho en el pasado saben bien a lo que me refiero. Pero no se puede mantener una situaci&oacute;n no deseada por mucho tiempo, cuando est&aacute; en tus propias manos ponerle fin. Y no me parece justo dejar de publicar sin m&aacute;s, pues ha sido &eacute;ste un blog que ha contado con una peque&ntilde;a pero fiel audiencia m&aacute;s o menos fija, la cual no merece una despedida as&iacute;.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-lh6xUaAq10o/UxRv9TxDR6I/AAAAAAAAEMA/ulX3MElSzek/s1600/cerrado.jpg"><img src="http://2.bp.blogspot.com/-lh6xUaAq10o/UxRv9TxDR6I/AAAAAAAAEMA/ulX3MElSzek/s1600/cerrado.jpg" height="252" width="400" /></a>
</div>
<br />
<br />
<a></a>Podr&iacute;a argumentar muchas razones para dejarlo, pero ser&iacute;a algo redundante, un compendio de 
<a href="http://www.lasombradelhelicoptero.com/2013/07/al-final-de-la-espiral.html">razones</a> 
<a href="http://www.lasombradelhelicoptero.com/2014/01/pesadilla-antes-de-navidad.html">pasadas</a>, hartazgo del ecosistema GNU/Linux y crecientes dificultades en lo que aquellos que pasamos demasiado tiempo ante el monitor venimos en llamar, ir&oacute;nicamente, &quot;la vida real&quot;. Son malos tiempos para la gente de a pie en Espa&ntilde;a. Y lo van a seguir siendo, en vista de que esa misma gente desea, a tenor de encuestas electorales y dem&aacute;s, que nada cambie. Quien suscribe no es una excepci&oacute;n, un enfermero con un contrato a tiempo parcial que a duras penas llega a fin de mes, con condiciones laborales que rozan ya lo denunciable, con gerifaltes que cobran sumas inveros&iacute;miles en concepto de &quot;productividad&quot; mientras dotan a sus hospitales de materiales de &iacute;nfima calidad... Algo que ser&iacute;a para descojonarse si no fuese tan lamentable. Todo ello en una comunidad aut&oacute;noma donde dicen que gobierna la izquierda. Perm&iacute;tanme que lo dude.
<br />
<br />Pero bueno, &iquest;qui&eacute;n no tiene problemas de esta &iacute;ndole hoy d&iacute;a? Tampoco quisiera culpar a la &quot;crisis&quot; (no es una crisis, es una estafa y lo sab&eacute;is) de mi falta de motivaci&oacute;n para seguir escribiendo en este espacio. Ya hace m&aacute;s de un mes que me alej&eacute; definitivamente de GNU/Linux. Fue mi elecci&oacute;n, y no tiene por qu&eacute; ser la vuestra. Con esto quiero decir que no quisiera que se interpretara mi regreso a sistemas operativos de pago como un indicativo de que los sistemas libres no sirven. Mucho se ha escrito ya en este blog y en otros sobre el tema, que se reduce b&aacute;sicamente a una frase lapidaria: &quot;usa lo que mejor te funcione en cada momento&quot;.
<br />
<br />En la actualidad, con un equipo relativamente moderno, Windows 7 no es una mala elecci&oacute;n. Al fin y al cabo he usado sistemas de esta empresa desde los a&ntilde;os noventa, jam&aacute;s tuve que formatear por culpa de un virus y jam&aacute;s instalo ni instalar&eacute; nada usando el &quot;siguiente, siguiente, siguiente&quot; sin tan siquiera leer las condiciones y lo que se instala. Es muy cierto que el mayor problema de seguridad inform&aacute;tica se halla entre el monitor y la silla. Si os parece, por terminar la vida de este blog con el rigor y la objetividad que siempre he ido buscando, podemos enumerar una serie de ventajas e inconvenientes que mi decisi&oacute;n del pasado enero (s&iacute;, llevo m&aacute;s de un mes sin usar GNU/Linux ya...) trae consigo.
<br />
<br />
<b>Ventajas de usar Windows 7 en lugar de GNU/Linux</b>
<br />
<br />- Funcionan todos los puertos USB. Aunque no lo cre&aacute;is, pues nunca hice menci&oacute;n de ello en mis revisiones al tratarse de un problema generalizado y no achacable a ninguna distro en particular, el funcionamiento de los puertos USB de mi equipo ha sido siempre err&aacute;tico. El introducir un dispositivo era lo m&aacute;s parecido a una loter&iacute;a: a veces lo reconoc&iacute;a, a veces, no. A veces lo reconoc&iacute;a a la primera, pero tras desmontarlo ya no hab&iacute;a forma de que funcionase otra vez hasta reiniciar. Este problema se segu&iacute;a reproduciendo tras la instalaci&oacute;n de Windows, pero una vez actualizados los controladores de la placa base Gigabyte, desaparecieron para siempre.
<br />
<br />- Programas actualizados, sistema estable. He dicho adi&oacute;s a la eterna diatriba entre sistema s&oacute;lido y &quot;rolling release&quot;. Windows se va actualizando y los programas tambi&eacute;n, no hay inconvenientes derivados de incompatibilidad entre versiones de las librer&iacute;as. Esta es la mayor ventaja, en mi opini&oacute;n, pues siempre me fastidi&oacute; sobremanera tener que elegir entre una cosa y la otra en GNU/Linux.
<br />
<br />- Todo, o casi todo, est&aacute; hecho para Windows. Esos porcentajes de implantaci&oacute;n en el mercado, que sabemos que no se ajustan exactamente a la realidad, que aseguran que el sistema de Microsoft domina por apabullante mayor&iacute;a provocan, de manera irremediable, que todo est&eacute; montado para funcionar bajo Windows. Y vaya si se nota, estoy descubriendo funcionalidades en algunos programas que ni sab&iacute;a que exist&iacute;an. Mal que nos pese, a d&iacute;a de hoy, siguen faltando cosas en las versiones de determinado software para GNU/Linux.
<br />
<br />- Controladores gr&aacute;ficos decentes. No hay color, y mira que me duele reconocerlo, entre la fluidez con que se manejan los controladores de mi APU AMD/ATI en Windows y en GNU/Linux. Apartado especial merece la navegaci&oacute;n: en p&aacute;ginas que se atascaban, sobre todo las de alto contenido en Flash, ahora hago &quot;scrolling&quot; con una suavidad y rapidez que ya no recordaba. Uno de los m&aacute;s fieles lectores del blog, antes 
<a href="http://indixer.com/">INDX </a>y ahora Juan Mart&iacute;nez, preguntaba en cierta ocasi&oacute;n por qu&eacute; no pod&iacute;a hacer &quot;scrolling&quot; de m&aacute;s l&iacute;neas con la rueda del rat&oacute;n en GNU/Linux. En lo tocante a los navegadores, desde luego, la diferencia es abismal. Hasta en el &quot;innombrable&quot; IE... El tema del renderizado de fuentes no estoy seguro si tambi&eacute;n tiene que ver con esto, pero se nota tambi&eacute;n una tremenda diferencia en positivo.
<br />
<br />- Windows ha mejorado mucho. Esta es mi opini&oacute;n, la de alguien que ha usado el sistema de Microsoft desde su versi&oacute;n 3.1 pero apenas hab&iacute;a trasteado en serio con la versi&oacute;n 7. De la nueva, la de la interfaz Metro, no voy a hablar porque no la he probado. Me han sorprendido cosas para bien, como el Reproductor de Windows Media, capaz ya de &quot;ripear&quot; un CD musical a MP3 y grabarlo sin necesidad de caros programas de terceros. Quiero creer que la competencia que ha supuesto GNU/Linux ha llevado a esta empresa a ponerse las pilas... aunque nunca lo reconocer&iacute;an, eso es seguro.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://4.bp.blogspot.com/-0d-OtAdA-Yo/UxRxTF2H4LI/AAAAAAAAEMM/G1gdoQvRZ-c/s1600/Captura+de+pantalla+2014-03-03+13.09.01.png"><img src="http://4.bp.blogspot.com/-0d-OtAdA-Yo/UxRxTF2H4LI/AAAAAAAAEMM/G1gdoQvRZ-c/s1600/Captura+de+pantalla+2014-03-03+13.09.01.png" height="320" width="400" /></a>
</div>
<br />
<b>Desventajas de usar Windows 7 en lugar de GNU/Linux</b>
<br />
<br />- El coste. Es el handicap principal, eso est&aacute; claro. En mi caso dispon&iacute;a de la licencia OEM, regalo de la tienda donde compr&eacute; el equipo, pero de lo contrario solo quedar&iacute;a recurrir al pirateo consentido (Microsoft gana m&aacute;s de lo que pierde haciendo la vista gorda en este asunto) o quedarse con sistemas gratuitos, aceptando sus limitaciones y disfrutando sus ventajas. Si he estado as&iacute; siete a&ntilde;os, es que tampoco se est&aacute; tan mal.
<br />
<br />- La creciente lentitud. Ahora mismo no se nota, pero todos los que hemos usado Windows sabemos que el sistema se va enlenteciendo por d&iacute;as. En mi caso no es tan grave la cosa, porque ya digo que soy cuidadoso con lo que instalo y lo que ejecuto. Espero y deseo que tambi&eacute;n haya mejorado en este aspecto. La soluci&oacute;n &uacute;ltima a este problema suele ser la reinstalaci&oacute;n, algo que no puedo considerar como negativo, a tenor de que la cifra de sistemas GNU/Linux instaladas en este equipo en los &uacute;ltimos a&ntilde;os, de haberla contabilizado, ser&iacute;a para asustar a cualquiera.
<br />
<br />- Virus y spyware variado. Quien no posea los conocimientos para manejar con seguridad un ordenador con Windows 7 har&iacute;a bien en pasarse a GNU/Linux. Hay todo un mundo de amenazas ah&iacute; fuera. Vuelvo a reiterar que no es mi caso, siempre examino todo antes de ejecutarlo, y el Avast en versi&oacute;n gratuita es m&aacute;s que suficiente para mis necesidades. Consume recursos, eso s&iacute;, si bien en este aspecto tambi&eacute;n se ha avanzado bastante y no noto lentitud alguna en la navegaci&oacute;n o en el desempe&ntilde;o del sistema. Al menos, por el momento.
<br />
<br />- Mi esc&aacute;ner ya no tiene soporte. Supongo que el ingeniero de Epson que dise&ntilde;&oacute; en su d&iacute;a el esc&aacute;ner Perfection 640U ser&iacute;a despedido, pues las empresas actuales no conciben que un aparato electr&oacute;nico pueda durar tanto. El susodicho data del a&ntilde;o 2001 y sigue funcionando como el primer d&iacute;a... Ahora bien, la obsolescencia programada tiene un gran aliado en Windows, pues no existen controladores oficiales para las nuevas versiones del sistema operativo, aquellas posteriores a XP. Si se desea seguir utilizando el esc&aacute;ner hay que recurrir, como la propia Epson &quot;amablemente&quot; te indica en su web, a controladores de terceros que, oh sorpresa, cobran por ellos y no poco. Pretenden los se&ntilde;ores de 
<a href="https://en.wikipedia.org/wiki/VueScan">Hamrick </a>que pagues unos cuarenta d&oacute;lares anuales por usar sus controladores sin marca de agua. Por desgracia para ellos existen los &quot;Live CD&quot; de GNU/Linux por si en alguna ocasi&oacute;n necesito escanear algo. Y ojo, no me malinterpreteis, veo bien que alguien se gane la vida programando, pero me parece que una empresa que 
<a href="http://www.snowhenge.net/pblog/article/Why_is_Vuescan_struggling">factura 3 millones de d&oacute;lares al a&ntilde;o</a> por ofrecer algo que se puede obtener gratis est&aacute;, tal vez, pretendiendo demasiado al cobrar un 50 por ciento del valor de un aparato nuevo solamente por los controladores de otro aparato con 15 a&ntilde;os de antig&uuml;edad.
<br />
<br />
<div style="clear: both; text-align: center;">
 <a href="http://2.bp.blogspot.com/-576AYxurgfk/UZTo23hK5QI/AAAAAAAADvE/ARveEioxfdc/s1600/Captura+de+pantalla+de+2013-05-12+18%253A26%253A59.png"><img src="http://2.bp.blogspot.com/-576AYxurgfk/UZTo23hK5QI/AAAAAAAADvE/ARveEioxfdc/s1600/Captura+de+pantalla+de+2013-05-12+18%253A26%253A59.png" height="250" width="400" /></a>
</div>
<br />Y eso es todo, no encuentro m&aacute;s diferencias notables para el uso que hago del equipo a d&iacute;a de hoy. Tal vez los juegos, pero los pocos t&iacute;tulos gratuitos que utilizo apenas dan para establecer conclusiones. Siguen faltando juegos &quot;triple A&quot; en GNU/Linux, supongo que en un futuro...
<br />
<br />&quot;En un futuro&quot;. Es la frase por antonomasia desde que comenzara a usar GNU/Linux all&aacute; por 2007. Se ha avanzado mucho, una barbaridad para ser justos, pero se sigue retrocediendo. Se retrocede con cada regresi&oacute;n en el kernel (&quot;esto o aquello me ha dejado de funcionar con la nueva actualizaci&oacute;n, ayuda por favor&quot;), con cada nuevo desarrollador que decide hacer la guerra por su cuenta sin aunar esfuerzos (&quot;y venga nuevas distribuciones, nuevos escritorios, que no pare la fiesta&quot;) y tambi&eacute;n, 
<i>mea culpa</i>, con cada usuario que decide abandonar el barco, sea cual sea el motivo.
<br />
<br />No espero que lo entend&aacute;is, incluso espero vuestras reprimendas (los insultos ser&aacute;n objeto de moderaci&oacute;n, como siempre, no vamos a perder la costumbre por ser este el &uacute;ltimo art&iacute;culo) pero lo que espero, sobre todo, es que plasm&eacute;is, por &uacute;ltima vez, vuestras experiencias personales y pensamientos sobre el tema. Creo que la vida de &quot;La Sombra del Helic&oacute;ptero&quot; ha sido plena, fruct&iacute;fera para ambas partes, pues he disfrutado escribiendo sobre GNU/Linux y tambi&eacute;n espero que haya servido a su vez para ayudar a muchas personas que llegaron aqu&iacute; buscando respuestas sobre lo que el sistema del ping&uuml;ino les pod&iacute;a ofrecer. Si mis escritos les motivaron para hacer un cambio que les result&oacute; provechoso, me doy por satisfecho. Y aqu&iacute; seguir&aacute;n los art&iacute;culos para su consulta, mientras disponga de los euros que cuesta renovar el dominio, algo que, al paso que vamos, no estoy seguro de por cuanto tiempo ser&aacute; posible.
<br />
<br />A todos los integrantes de esta peque&ntilde;a comunidad, os deseo que alcanc&eacute;is vuestros objetivos personales y mucho &eacute;xito en todo aquello que emprend&aacute;is. Seguid usando lo que mejor se adapte a vuestras necesidades en todo momento. Y una menci&oacute;n especial para aquellos colegas afectados por el distro hopping, mi m&aacute;s temido enemigo y compa&ntilde;ero en estos a&ntilde;os: paraos por un momento a pensar en lo que hac&eacute;is y en por qu&eacute; lo hac&eacute;is, es un consejo de enfermo y de enfermero a la vez. En la vida hay mucho m&aacute;s que los sistemas operativos. Estos son &uacute;nicamente medios para ayudarnos a conseguir hacer la vida m&aacute;s sencilla. En vuestras manos est&aacute; usarlos como tales o seguir dando vueltas en la rueda infinita.
<br />
<br />
<b>Un fuerte abrazo a todos y hasta siempre.</b></span></div><section><a id="share"></a><h1>Compartir</h1><div class="share-this"><span displayText="Tweet" class="st_twitter_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span><span displayText="Facebook" class="st_facebook_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span><span displayText="Google +" class="st_googleplus_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span><span displayText="LinkedIn" class="st_linkedin_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span><span displayText="Meneame" class="st_meneame_vcount" st_url="http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow" st_title="Desmontando a shadow | La sombra del helicóptero"></span></div><script src="http://w.sharethis.com/button/buttons.js" type="text/javascript"></script><script type="text/javascript">stLight.options({publisher: "ur-3b2014fd-82e-9968-7e00-5ee51fb88bb2", doNotHash: true, doNotCopy: true, hashAddressBar: false});</script><div id="widget"></div></section><hr/></article></div><div class="col-xs-12 col-sm-12 col-md-4"><aside><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigRectangle"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section><h3>Redes sociales</h3><p>¿Te gusta Blog Stack? ¡Compártelo!</p><div class="social-networks"><!-- Facebook --><div class="social-network"><div data-share="true" data-show-faces="false" data-action="like" data-width="310" data-layout="box_count" data-href="http://www.blogstack.info/" class="fb-like"></div></div><!-- Google+ --><div class="social-network"><div class="g-plusone" data-href="http://www.blogstack.info/" data-size="tall"></div></div></div></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts"></section></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div id="bigSkycraper"></div></div></div><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><section id="lastPosts_0"></section></div></div></aside></div></div></div><footer><div class="container-fluid"><div class="row"><div class="col-xs-12 col-sm-12 col-md-12"><div class="footer"><a href="/">Blog Stack</a> por <a href="https://twitter.com/picodotdev/">pico.dev</a> está publicado bajo la licencia de software libre <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU Affero General Public</a> en <a href="https://github.com/picodotdev/blog-stack">GitHub <span class="entypo-social"></span></a>.<br/>
El contenido agregado conserva la licencia de su bitácora.<br/>
«Powered by» <a href="https://github.com/picodotdev/blogstack">Blog Stack</a>, <a href="http://tapestry.apache.org/">Apache Tapestry</a>, <a href="https://www.openshift.com/">OpenShift</a>, <a href="https://pages.github.com/">GitHub Pages</a>, <a href="http://www.oracle.com/es/technologies/java/overview/index.html">Java</a> y más software libre o de código abierto, inspirado en <a href="http://octopress.org/">Octopress</a>.<br/><span class="copyleft">©</span> pico.dev 2015
</div></div></div></div></footer><div id="fb-root"></div><script type="text/javascript">var require = {
  "waitSeconds" : 300,
  "shim" : {
    "t5/core/typeahead" : [
      "jquery"
    ],
    "bootstrap/affix" : [
      "bootstrap/transition"
    ],
    "bootstrap/alert" : [
      "bootstrap/transition"
    ],
    "bootstrap/modal" : [
      "bootstrap/transition"
    ],
    "bootstrap/tab" : [
      "bootstrap/transition"
    ],
    "bootstrap/transition" : [
      "jquery"
    ],
    "bootstrap/button" : [
      "bootstrap/transition"
    ],
    "bootstrap/scrollspy" : [
      "bootstrap/transition"
    ],
    "bootstrap/collapse" : [
      "bootstrap/transition"
    ],
    "bootstrap/dropdown" : [
      "bootstrap/transition"
    ],
    "bootstrap/tooltip" : [
      "bootstrap/transition"
    ],
    "bootstrap/carousel" : [
      "bootstrap/transition"
    ],
    "bootstrap/popover" : [
      "bootstrap/tooltip"
    ]
  },
  "baseUrl" : "/modules"
};
</script><script src="/assets/tapestry5/require.js" type="text/javascript"></script><script src="/assets/tapestry5/underscore-1.5.2.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/prototype.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/scriptaculous.js" type="text/javascript"></script><script src="/assets/tapestry5/scriptaculous_1_9_0/effects.js" type="text/javascript"></script><script src="/assets/tapestry5/t53-compatibility.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery.js" type="text/javascript"></script><script src="/assets/tapestry5/jquery-noconflict.js" type="text/javascript"></script><script type="text/javascript">require(["t5/core/pageinit"], function(pi) { pi([], [
  "app/analytics",
  [
    "app/karmacracy:init",
    {
      "selector" : "#widget",
      "id" : 319,
      "url" : "http://www.blogstack.info/post/lasombradelhelicoptero/2014/03/desmontando-a-shadow"
    }
  ],
  "app/facebook",
  "app/googleplus",
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts",
      "source" : "lasombradelhelicoptero",
      "name" : "La sombra del helicóptero"
    }
  ],
  [
    "app/lastPosts:init",
    {
      "id" : "lastPosts_0",
      "source" : "blogstack",
      "name" : "Blog Stack"
    }
  ],
  [
    "app/adsensem:init",
    {
      "blogstack" : {
        "adClient" : "ca-pub-3533636310991304",
        "adSlot" : "1397019380"
      }
    }
  ]
]); });</script></body></html>