<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom" xmlns:dc="http://purl.org/dc/elements/1.1/">
  <title>Blog Stack</title>
  <link rel="alternate" href="http://www.blogstack.info" />
  <subtitle>Un poco más que un agregador/planeta de bitácoras sobre programación, desarrollo, software libre, gnu/linux, tecnología, ...</subtitle>
  <updated>2015-01-12T00:13:13Z</updated>
  <dc:creator>Blog Stack</dc:creator>
  <dc:date>2015-01-12T00:13:13Z</dc:date>
  <dc:language>es</dc:language>
  <entry>
    <title>Desempaquetado Sony Vaio E 14P (SVE14)</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/desempaquetado-sony-vaio-e-14p-sve14" />
    <category term="software" />
    <category term="software-privativo" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="arch-linux" />
    <category term="hardware" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2013-01-27T03:00:05Z</updated>
    <published>2012-12-06T15:02:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de comentar la 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/mi-guia-para-eleccion-de-portatil-nuevo.html"&gt;gu&amp;iacute;a que segu&amp;iacute; para elegir un port&amp;aacute;til nuevo&lt;/a&gt;, cuales eran las caracter&amp;iacute;sticas que buscaba, cual fue el modelo que eleg&amp;iacute; finalmente (que es el comentado en esta entrada) y cuales algunas&amp;nbsp;caracter&amp;iacute;sticas&amp;nbsp;que ni siquiera el fabricante comenta ahora voy poner la galer&amp;iacute;a de fotos y reportaje con el desempaquetado o &amp;laquo;unboxing&amp;raquo; del modelo Sony Vaio E 14P&amp;nbsp;(SVE14A2C5E) en acabado color gris plomo con algunos detalles que en pocas reviews y a an&amp;aacute;lisis se ven en detalle o ni siquiera se comentan. 
&lt;br /&gt; 
&lt;br /&gt;Dejar&amp;eacute; para la siguiente entrada otra de las cosas que tampoco es habitual ver en los an&amp;aacute;lisis: la parte del software con el que viene instalado como es la BIOS (que es UEFI), los programas 
&lt;strike&gt;
  crapware 
&lt;/strike&gt; preinstalados con Windows, la informaci&amp;oacute;n del sistema con&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/desempaquetado-sony-vaio-e-14p-sve14"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-06T15:02:00Z</dc:date>
  </entry>
  <entry>
    <title>Mi guía para elección de portátil nuevo</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo" />
    <category term="software" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="desempaquetado" />
    <category term="hardware" />
    <category term="otros" />
    <category term="apple" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-12-15T00:10:23Z</updated>
    <published>2012-12-01T16:49:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Sony" src="http://4.bp.blogspot.com/-950mEwCo2ik/ULElzrzUEeI/AAAAAAAABoE/d7aj7fZwIPA/s1600/sony.png" title="Sony" /&gt; 
&lt;/div&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Intel" height="131" src="http://3.bp.blogspot.com/-YsNoDxaK4SY/ULH_Z2yBd5I/AAAAAAAABpI/d6WIftJMvvc/s200/intel.png" title="Intel" width="200" /&gt; 
&lt;/div&gt;Despu&amp;eacute;s de muchos meses buscando y comparando (no se cuantos meses exactamente pero m&amp;aacute;s de 18 seguro) finalmente me decid&amp;iacute; por un ordenador que pas&amp;oacute; mi exigente criterio (o puede que me cansase de esperar), ya llevando unos d&amp;iacute;as con &amp;eacute;l ha sido una buena elecci&amp;oacute;n aunque algunos detalles no me gustan del todo pero es lo mejor que he encontrado y no quer&amp;iacute;a esperar mucho m&amp;aacute;s ya. En esta entrada comentar&amp;eacute; mi experiencia y consejos que quiz&amp;aacute; le ayuden a otra gente en su elecci&amp;oacute;n de port&amp;aacute;til si est&amp;aacute; buscando uno. En las siguientes entradas har&amp;eacute; el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/desempaquetado-sony-vaio-e-14p.html"&gt;desempaquetado&lt;/a&gt; y el 
&lt;a href="http://elblogdepicodev.blogspot.com.es/2012/12/analisis-software-y-bios-sony-vaio-e-14p.html"&gt;an&amp;aacute;lisis del equipo funcionando&lt;/a&gt;. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;b&gt;Primeros pasos&lt;/b&gt; 
&lt;br /&gt;Antes de empezar ni siquiera a buscar un port&amp;aacute;til es tener una idea del presupuesto, que marca/o que no marca se quiere, tama&amp;ntilde;o, caracter&amp;iacute;sticas que consideramos indispensables que tenga, uso que le vamos a dar y necesidades o modelos de lo que buscamos, con esto empieza la selecci&amp;oacute;n y discriminaci&amp;oacute;n de entre todas las posibilidades que tenemos. En el mundo del PC tantas que pueden llegar a abrumar y dificultar la elecci&amp;oacute;n por eso recomendable tener unos par&amp;aacute;metros prefijados, luego podremos flexibilizarlos. En Apple y los Mac es m&amp;aacute;s sencillo, hay menos modelos, la mayor&amp;iacute;a de gama alta para lo que considerar&amp;iacute;amos en los PC y tambi&amp;eacute;n a precios que a parecidas caracter&amp;iacute;sticas son notablemente mucho m&amp;aacute;s caros y est&amp;aacute;n inflados, todo sea dicho. Un Mac no quer&amp;iacute;a ya que son caros y adem&amp;aacute;s pretend&amp;iacute;a instalar Arch Linux en &amp;eacute;l, as&amp;iacute; que para esto consideraba que mejor un PC.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2012/12/mi-guia-para-eleccion-de-portatil-nuevo"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2012-12-01T16:49:00Z</dc:date>
  </entry>
  <entry>
    <title>Como sería si Microsoft, Apple y Linux...</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux" />
    <category term="planeta-codigo" />
    <category term="planeta-arch-linux" />
    <category term="software-privativo" />
    <category term="planeta-linux" />
    <category term="microsoft" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-10-03T01:23:13Z</updated>
    <published>2011-12-09T23:41:00Z</published>
    <content type="html">&lt;p&gt;&amp;iquest;Como ser&amp;iacute;a si Microsoft, Apple y Linux se decicasen a la industria automovil&amp;iacute;stica y vendiesen motores y coches conociendo sus pol&amp;iacute;ticas y formas de comercializar su software y productos? 
&lt;br /&gt; 
&lt;br /&gt;set small_troll_mode=on 
&lt;br /&gt; 
&lt;br /&gt;Empecemos por 
&lt;b&gt;Microsoft&lt;/b&gt; 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Microsoft" height="75" src="http://1.bp.blogspot.com/-XdqPJUzoXGQ/TuJcYIW8UkI/AAAAAAAABB8/nw_ryoLf4NY/s320/microsoft.png" title="Microsoft" width="320" /&gt; 
&lt;/div&gt;Algunos modelos de sus motores son conocidos y recordados por provocar fallos en el coche que son instalados [1], algunos no m&amp;aacute;s molestos como que las ruedas se desinchan de vez en cuando o el aire acondicionado no funciona a veces si a la vez tienes puesta la radio y algunos graves como que el motor se apaga de repente o deja de frenar cuando lo necesitas que provocan peque&amp;ntilde;os accidentes y peque&amp;ntilde;as perdidas de memoria en el conductor a los que se les queda la cara de un tono azulado despu&amp;eacute;s de los hechos por el susto.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/12/como-seria-si-microsoft-apple-y-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-12-09T23:41:00Z</dc:date>
  </entry>
  <entry>
    <title>Un día en la Euskal Encounter 19</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19" />
    <category term="ubuntu" />
    <category term="planeta-arch-linux" />
    <category term="software-privativo" />
    <category term="planeta-linux" />
    <category term="microsoft" />
    <category term="tecnologia" />
    <category term="otros" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2012-01-21T21:16:22Z</updated>
    <published>2011-07-24T13:46:00Z</published>
    <content type="html">&lt;p&gt;&lt;div style="clear: right; float: right; margin-bottom: 1em; margin-left: 1em;"&gt; 
 &lt;img alt="Euskal encounter 19" src="http://1.bp.blogspot.com/-XcMwHk7AABo/TiqxFNgHm7I/AAAAAAAAA50/Ot6_eSvAkEA/s1600/euskal-encounter.png" title="Euskal encounter 19" /&gt; 
&lt;/div&gt;En estos d&amp;iacute;as se est&amp;aacute; celebrando, del 22 al 25 de julio, la&amp;nbsp; 
&lt;a href="http://www.euskal.org/"&gt;Euskal Encounter&lt;/a&gt;, uno de los enventos inform&amp;aacute;ticos m&amp;aacute;s importantes de Euskadi, del estado de Espa&amp;ntilde;a y seg&amp;uacute;n algunos uno de los mejores de parte de Europa. As&amp;iacute; desde hace ya 19 ediciones, con en estos d&amp;iacute;as exactamente 4096 puestos para los asistentes que disponen de una conexi&amp;oacute;n de 20 Gb por segundo ofrecida por la mano de Euskaltel y HP. 
&lt;br /&gt; 
&lt;br /&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;a href="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s1600/DSCN0130.JPG"&gt;&lt;img height="150" src="http://3.bp.blogspot.com/-l99Z53pT6aQ/Tiq05lW8FXI/AAAAAAAAA6E/Olu9LltUxY4/s200/DSCN0130.JPG" width="200" /&gt;&lt;/a&gt; 
 &lt;a href="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s1600/DSCN0100.JPG"&gt;&lt;img height="150" src="http://1.bp.blogspot.com/-SKInSG7mKf8/Tiq6WvHVMhI/AAAAAAAAA8c/c0fNIcXlILE/s200/DSCN0100.JPG" width="200" /&gt;&lt;/a&gt; 
&lt;/div&gt; 
&lt;div style="clear: both; text-align: center;"&gt; 
 &lt;br /&gt; 
&lt;/div&gt;A pesar de que se organiza en Barakaldo, al alcance de metro de ciudad en la que vivo y escasos minutos, hasta este a&amp;ntilde;o no hab&amp;iacute;a asistido a ninguna. Ten&amp;iacute;a muchas ganas de ir y vivir en primera persona lo que ah&amp;iacute; acontec&amp;iacute;a al menos por un d&amp;iacute;a, este a&amp;ntilde;o no lo quer&amp;iacute;a dejar pasar y as&amp;iacute; ha sido. Como repaso de lo que ha dado el d&amp;iacute;a (y parte de la noche) os escribo esta entrada.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2011/07/un-dia-en-la-euskal-encounter-19"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2011-07-24T13:46:00Z</dc:date>
  </entry>
  <entry>
    <title>De Windows a Arch Linux</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/03/de-windows-a-arch-linux" />
    <category term="ubuntu" />
    <category term="microsoft" />
    <category term="arch-linux" />
    <category term="apple" />
    <category term="software-libre" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-12-10T00:54:47Z</updated>
    <published>2010-03-09T00:50:00Z</published>
    <content type="html">&lt;p&gt;Como mucha gente me inici&amp;eacute; en la inform&amp;aacute;tica all&amp;aacute; por la &amp;eacute;poca del MS-DOS y Windows 3.11 en la escuela e instituto pero no tuve mi primer ordenador hasta que sali&amp;oacute; el Windows 95 con un Pentium a 120 Mhz y con tan s&amp;oacute;lo &amp;iexcl;8 megas! de RAM. Posteriormente, seg&amp;uacute;n sal&amp;iacute;an nuevas versiones de Windows fu&amp;iacute; us&amp;aacute;ndolas... Windows NT, Windows Me (epic fail!), Windows 2000, Windows XP... hasta que sustitu&amp;iacute; mi anterior PC de escritorio, un Athlon XP 1800+ con 512 megas, en el 2008 por mi actual port&amp;aacute;til, un Dell XPS M1530 y que venia con Windows Vista. 
&lt;br /&gt; 
&lt;br /&gt;Anteriormente, ya hab&amp;iacute;a probado varias distribuciones Linux... alguna versi&amp;oacute;n de Mandrake cuando estaba en la Universidad y Fedora Core (cuando a&amp;uacute;n se llamaba asi), sin embargo, no duraban mucho tiempo en el disco duro ni los llegu&amp;eacute; a usar habitualmente debido a que no consegu&amp;iacute;a configurar todo para que funcionase correctamente&amp;nbsp;o simplemente por los juegos&amp;nbsp;con lo que acababa volviendo al Windows del momento. Como dec&amp;iacute;a, esto fu&amp;eacute; asi hasta que compr&amp;eacute; mi actual port&amp;aacute;til.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/03/de-windows-a-arch-linux"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-03-09T00:50:00Z</dc:date>
  </entry>
  <entry>
    <title>Alternativas a programas propietarios para sustituirlos por programas libres</title>
    <link rel="alternate" href="http://www.blogstack.info/post/elblogdepicodev/2010/02/alternativas-a-programas-propietarios-para-sustituirlos-por-programas-libres" />
    <category term="software-privativo" />
    <category term="microsoft" />
    <category term="apple" />
    <category term="software-libre" />
    <category term="gnulinux" />
    <author>
      <name>pico.dev</name>
    </author>
    <updated>2011-12-10T00:51:50Z</updated>
    <published>2010-02-17T23:24:00Z</published>
    <content type="html">&lt;p&gt;El 
&lt;a href="http://es.wikipedia.org/wiki/Software_libre"&gt;software libre&lt;/a&gt; (SL) a veces es confundido como sin&amp;oacute;nimo de 
&lt;a href="http://es.wikipedia.org/wiki/GNU/Linux"&gt;GNU/Linux&lt;/a&gt; y no es cierto, quiz&amp;aacute; sea debido a que en GNU/Linux el SL est&amp;aacute; mucho m&amp;aacute;s presente (tambi&amp;eacute;n el SL se confunde con gratis, y aunque en muchos casos es as&amp;iacute; tampoco es cierto pero esto es asunto para otra entrada). El SL es un concepto que no est&amp;aacute; asociado a determinado sistema operativo, sea este libre o no. De hecho, hay un mont&amp;oacute;n de SL disponible para 
&lt;a href="http://es.wikipedia.org/wiki/Software_propietario"&gt;sistemas operativos privativos&lt;/a&gt;, como os supondr&amp;eacute;is me estoy refiriendo a Windows y Mac OS X, tanto que para cada programa privativo que tengamos en nuestro ordenador podemos encontrar uno o varios equivalentes con una licencia de software libre, con una funcionalidad similar y tan capaces como los no libres. 
&lt;br /&gt; 
&lt;br /&gt;De eso va esta entrada, de hacer una peque&amp;ntilde;a lista de programas propietarios que quiz&amp;aacute; tengamos en el sistema que usamos con sus equivalentes libres. Pulsa en el enlace de cada programa para ver sus alternativas libres.&lt;/p&gt;&lt;p&gt;&lt;a href="http://www.blogstack.info/post/elblogdepicodev/2010/02/alternativas-a-programas-propietarios-para-sustituirlos-por-programas-libres"&gt;continuar leyendo &amp;gt;&amp;gt;&lt;/a&gt;&lt;/p&gt;</content>
    <dc:creator>pico.dev</dc:creator>
    <dc:date>2010-02-17T23:24:00Z</dc:date>
  </entry>
</feed>

